{"vcmId": "1e33d488-b99a-4213-ab2d-d061d6fdad59", "url": "http://www.foxnews.com/transcript/2017/03/13/analyzing-president-trump-first-50-days.html", "title": "Analyzing President Trump's first 50 days", "description": "Kellyanne Conway weighs in on wiretapping claims and healthcare on 'The O'Reilly Factor'", "date": "2017-03-13T11:49:49Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" March 10, 2017. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nERIC BOLLING, FOX NEWS HOST: Hi, I am Eric Bolling and for Bill O'Reilly. Thanks for watching this special edition of THE FACTOR, \"The Trump Agenda,\" let's get straight to our top story.\nPresident Trump's first 50 days, it has been a whirlwind start for the administration, to say the least, and with us now, counselor to the President, Kellyanne Conway.\nSo, Kellyanne, let's start with some of the depressing thing of the week, was the ObamaCare bill, the rollout, what's going on, where do you see it, where does the President see it?\nKELLYANNE CONWAY, COUNSELOR TO PRESIDENT TRUMP: The President is very confident that he is repeal and replace ObamaCare the way he promised during the campaign. And I love the fact that this is the first major legislative action while he's been president, most has been executive in nature. And we really see Donald Trump the negotiator, the decision-maker, the dealmaker, the great listener, he's been receiving different members of Congress and senators into the Oval Office, into the White House.\nHe's also been working the phones with them, Vice President Pence is on the help pretty much every day. Secretary Price, so it's been a full court press, but it's also really a House and Senate bill. So, we know it is going to come out in three-pronged, we want people to know that it will be a much improved, getting rid of this mandate, penalties, et cetera, contained the cost.\nBOLLING: I think the big question is, is he willing to negotiate with the freedom caucus? Clearly the House need the freedom caucus to get that bill through the House and then on to the Senate. Will he negotiate? Paul Ryan seems to be fairly rigid on, this is it, take it or leave it.\nCONWAY: Look, the President is a great negotiator and great listener. This is primarily the plan. But he has been very open this week to listening to people's concerns and their considerations, their best practices. And he has been incredibly open-minded and in giving an olive branch to many of them. He will be the ultimate decision maker here. But I would point out to you, Eric, we are really heartened by the fact that in Energy and Commerce and Ways and Means, the bill passed with unanimous Republicans support, that's 54 Republicans including some House Freedom Caucus members.\nSo, when they had to actually put it to a vote and not just on TV or on Twitter, they are supportive of it. We also just point out that this has been an entitlement for seven years, some people live under it and like it, and the President has promised them a smooth transition. He promised to them that they maybe can continue with the exchanges as they are, but for the vast majority of Americans, they want something more patient-centric in free market. They want these penalties and mandate and taxes gone. They want -- accounts, they want which will happen in prong three, getting the drug pricing under control, they want the interstate mobility of health care, we combined across state lines. Everything he has promised to do is part of this.\nBOLLING: I want to get to this. So much to talk to. I want to get to this. I know that there's a lot we can go on. We can go on for hours on all the stuff. But the Trump Tower wiretaps, now, this has been all over the board. First they said there were no wiretaps, then they say they were wiretaps, then it wasn't ordered by former President Obama, where is the administration right now? Was Trump Tower wiretapped?\nCONWAY: What President Trump has asked for and received is for the House and Senate Intelligence Committees to add to their existing investigation, this piece of it, and they have agreed to do that. So, we will wait until that oversight and investigations are complete and then we'll have further comment.\nBOLLING: Okay. So, he's not saying that, I mean, look, I remember a \"New York Times\" front page on January 20th using the word wiretaps about the Trump Tower, someone at the Trump Tower, and sending that information back to President Obama.\nCONWAY: Eric, we know that there are many ways to surveil people now, and you had reports of that just this week. I would note because the really frustrating part are all the leaks coming from intelligence security sources. And that is really the frustration here that the President talks about frequently, and the day after his widely heralded very successful Joint Session to Congress, the New York Times ran a story the next day talking about how members of the Obama administration rushed to preserve and sprinkle around the government these intelligence information.\nThat is not a partisan issue. That is about National Security intelligence and it affects all of us. And so, the President has also had that very much on his mind. But when it comes to this particular issue, he has called for an investigation. It seems like that will be underway, and as part of an increasing investigation, we will await the findings.\nBOLLING: If it turns out that Valerie Jarrett was the one who set -- may be suggested to the Attorney General Loretta Lynch that maybe the investigation or a wiretap would be a good idea. I mean, what is the difference if it is Valerie Jarrett or President Obama asking for it, it still came from the upper levels of the Obama administration?\nCONWAY: I don't want to answer hypotheticals and I certainly don't want to particularly specific people's names involved in hypotheticals. But let me just say that Kevin Lewis is a spokesman for President Obama, said last Saturday that it was a cardinal rule that the President and people in the White House never interfered in the Department of Justice investigations. Okay. Let's take that as fact for the moment.\nBut what about the rest of the huge government? That is the point. And even when Director Clapper said nothing under my purview. He couldn't close the door on everything. Director Comey of the FBI almost a week ago now said what he said asking the DOJ to make a statement denouncing this. And yet, if he has something to say, we're willing to hear it. He's welcome to put out a statement. But we just haven't seen it. We have seen reports of it.\nBOLLING: A little bit of a controversy the last couple of weeks. President Trump gave the Communications Department a C minus. Now, Sean Spicer had a little bit of a rough time at times in front of the press. Does Sean Spicer have the President's full confidence?\nCONWAY: Yes, he does, and in fairness the President told your colleagues here at FOX that he would give himself an A on substance, on the issues, and we all should, 235,000 jobs created in this first full month including in manufacturing, construction, unemployment at 4.7 percent, economic confidence up the markets loved this presidency. But he said, the President said, he gave himself an A on substance and issues, and he gave A C or C minus on communication of it.\nAnd then he said, you know, he thinks he can do a better job. I think that meaning we all could. He meant all of us. I think Donald Trump is his own best spokesperson. We all agree when he gets out there. When he does the press conference, when he addresses a Joint Session of Congress, and he goes to CPAC, when he is to rally Melbourne, Florida. It is the best way to communicate and connect with people directly. I've never seen a more brilliant communicator and more natural connector than Donald Trump, I think it is in large part how they got connected and cut through the noise and the silence.\nAnd so, in the White House, I have been the loudest voice for having gotten the President and Vice President out there more, our cabinet secretaries, Sean Spicer does a daily briefing under very tough circumstances. I think he does a tremendous job, when the President is reaching the commending the job he's doing, he knows he's under -- we all know that we are also representing the President and we all know that the media can be really rough on the President. We think that they are often unfair. And we think that they're often incomplete in their coverage. But it is a two-way street and we hope that it improves. I am very pro-press, I hope it improves because we need to have a fair and free press in this country. But we also need the President of the United States to be showing respect.\nBOLLING: I'd like you to comment on the travel ban, the new executive order for the travel ban. It looks like it is going to be again pushed back, several states look like they're going to mount a challenge to it, your thoughts?\nCONWAY: We anticipated several states which challenge it legally. But this travel ban will pass legal muster. It has a new effective date of March 16th, next week, and Iraq is no longer on the list, and I think it is great signal on how to get yourself off the list, there are six countries on the list, these are all countries that have either harbor, trained, or experts terrorists. They cannot prove that they are not written by terrorists, some are failed states.\nBut all of them were put on a list earlier by President Obama and the Congress, and this president, you know, I think that Secretary of State Rex Tillerson and Secretary Kelly and others have worked with, as I understand, have worked with Iraq to find a way to get a better policy moving forward in reporting and in vetting so that Iraq is now off the list. What the executive order does is make very clear that legal permanent residence's with green card Eric, those who have proper travel and visa documentations are not covered by this trouble holds. They are fine. Also --\nBOLLING: That was the one issue that the Ninth Circuit was hung up on.\nCONWAY: That is right. It was always true that they were exempt from this but it wasn't made clear perhaps. And so, that's something from the get go here. Also, Syrian refugees are treated, along with all refugees, and instead of there being nonreligious persecution, anybody can apply under hardships. So, there are some significant changes and we know it will pass legal muster.\nContent and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": [], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" March 10, 2017. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nERIC BOLLING, FOX NEWS HOST: Hi, I am Eric Bolling and for Bill O'Reilly. Thanks for watching this special edition of THE FACTOR, \"The Trump Agenda,\" let's get straight to our top story.\nPresident Trump's first 50 days, it has been a whirlwind start for the administration, to say the least, and with us now, counselor to the President, Kellyanne Conway.\nSo, Kellyanne, let's start with some of the depressing thing of the week, was the ObamaCare bill, the rollout, what's going on, where do you see it, where does the President see it?\nKELLYANNE CONWAY, COUNSELOR TO PRESIDENT TRUMP: The President is very confident that he is repeal and replace ObamaCare the way he promised during the campaign. And I love the fact that this is the first major legislative action while he's been president, most has been executive in nature. And we really see Donald Trump the negotiator, the decision-maker, the dealmaker, the great listener, he's been receiving different members of Congress and senators into the Oval Office, into the White House.\nHe's also been working the phones with them, Vice President Pence is on the help pretty much every day. Secretary Price, so it's been a full court press, but it's also really a House and Senate bill. So, we know it is going to come out in three-pronged, we want people to know that it will be a much improved, getting rid of this mandate, penalties, et cetera, contained the cost.\nBOLLING: I think the big question is, is he willing to negotiate with the freedom caucus? Clearly the House need the freedom caucus to get that bill through the House and then on to the Senate. Will he negotiate? Paul Ryan seems to be fairly rigid on, this is it, take it or leave it.\nCONWAY: Look, the President is a great negotiator and great listener. This is primarily the plan. But he has been very open this week to listening to people's concerns and their considerations, their best practices. And he has been incredibly open-minded and in giving an olive branch to many of them. He will be the ultimate decision maker here. But I would point out to you, Eric, we are really heartened by the fact that in Energy and Commerce and Ways and Means, the bill passed with unanimous Republicans support, that's 54 Republicans including some House Freedom Caucus members.\nSo, when they had to actually put it to a vote and not just on TV or on Twitter, they are supportive of it. We also just point out that this has been an entitlement for seven years, some people live under it and like it, and the President has promised them a smooth transition. He promised to them that they maybe can continue with the exchanges as they are, but for the vast majority of Americans, they want something more patient-centric in free market. They want these penalties and mandate and taxes gone. They want -- accounts, they want which will happen in prong three, getting the drug pricing under control, they want the interstate mobility of health care, we combined across state lines. Everything he has promised to do is part of this.\nBOLLING: I want to get to this. So much to talk to. I want to get to this. I know that there's a lot we can go on. We can go on for hours on all the stuff. But the Trump Tower wiretaps, now, this has been all over the board. First they said there were no wiretaps, then they say they were wiretaps, then it wasn't ordered by former President Obama, where is the administration right now? Was Trump Tower wiretapped?\nCONWAY: What President Trump has asked for and received is for the House and Senate Intelligence Committees to add to their existing investigation, this piece of it, and they have agreed to do that. So, we will wait until that oversight and investigations are complete and then we'll have further comment.\nBOLLING: Okay. So, he's not saying that, I mean, look, I remember a \"New York Times\" front page on January 20th using the word wiretaps about the Trump Tower, someone at the Trump Tower, and sending that information back to President Obama.\nCONWAY: Eric, we know that there are many ways to surveil people now, and you had reports of that just this week. I would note because the really frustrating part are all the leaks coming from intelligence security sources. And that is really the frustration here that the President talks about frequently, and the day after his widely heralded very successful Joint Session to Congress, the New York Times ran a story the next day talking about how members of the Obama administration rushed to preserve and sprinkle around the government these intelligence information.\nThat is not a partisan issue. That is about National Security intelligence and it affects all of us. And so, the President has also had that very much on his mind. But when it comes to this particular issue, he has called for an investigation. It seems like that will be underway, and as part of an increasing investigation, we will await the findings.\nBOLLING: If it turns out that Valerie Jarrett was the one who set -- may be suggested to the Attorney General Loretta Lynch that maybe the investigation or a wiretap would be a good idea. I mean, what is the difference if it is Valerie Jarrett or President Obama asking for it, it still came from the upper levels of the Obama administration?\nCONWAY: I don't want to answer hypotheticals and I certainly don't want to particularly specific people's names involved in hypotheticals. But let me just say that Kevin Lewis is a spokesman for President Obama, said last Saturday that it was a cardinal rule that the President and people in the White House never interfered in the Department of Justice investigations. Okay. Let's take that as fact for the moment.\nBut what about the rest of the huge government? That is the point. And even when Director Clapper said nothing under my purview. He couldn't close the door on everything. Director Comey of the FBI almost a week ago now said what he said asking the DOJ to make a statement denouncing this. And yet, if he has something to say, we're willing to hear it. He's welcome to put out a statement. But we just haven't seen it. We have seen reports of it.\nBOLLING: A little bit of a controversy the last couple of weeks. President Trump gave the Communications Department a C minus. Now, Sean Spicer had a little bit of a rough time at times in front of the press. Does Sean Spicer have the President's full confidence?\nCONWAY: Yes, he does, and in fairness the President told your colleagues here at FOX that he would give himself an A on substance, on the issues, and we all should, 235,000 jobs created in this first full month including in manufacturing, construction, unemployment at 4.7 percent, economic confidence up the markets loved this presidency. But he said, the President said, he gave himself an A on substance and issues, and he gave A C or C minus on communication of it.\nAnd then he said, you know, he thinks he can do a better job. I think that meaning we all could. He meant all of us. I think Donald Trump is his own best spokesperson. We all agree when he gets out there. When he does the press conference, when he addresses a Joint Session of Congress, and he goes to CPAC, when he is to rally Melbourne, Florida. It is the best way to communicate and connect with people directly. I've never seen a more brilliant communicator and more natural connector than Donald Trump, I think it is in large part how they got connected and cut through the noise and the silence.\nAnd so, in the White House, I have been the loudest voice for having gotten the President and Vice President out there more, our cabinet secretaries, Sean Spicer does a daily briefing under very tough circumstances. I think he does a tremendous job, when the President is reaching the commending the job he's doing, he knows he's under -- we all know that we are also representing the President and we all know that the media can be really rough on the President. We think that they are often unfair. And we think that they're often incomplete in their coverage. But it is a two-way street and we hope that it improves. I am very pro-press, I hope it improves because we need to have a fair and free press in this country. But we also need the President of the United States to be showing respect.\nBOLLING: I'd like you to comment on the travel ban, the new executive order for the travel ban. It looks like it is going to be again pushed back, several states look like they're going to mount a challenge to it, your thoughts?\nCONWAY: We anticipated several states which challenge it legally. But this travel ban will pass legal muster. It has a new effective date of March 16th, next week, and Iraq is no longer on the list, and I think it is great signal on how to get yourself off the list, there are six countries on the list, these are all countries that have either harbor, trained, or experts terrorists. They cannot prove that they are not written by terrorists, some are failed states.\nBut all of them were put on a list earlier by President Obama and the Congress, and this president, you know, I think that Secretary of State Rex Tillerson and Secretary Kelly and others have worked with, as I understand, have worked with Iraq to find a way to get a better policy moving forward in reporting and in vetting so that Iraq is now off the list. What the executive order does is make very clear that legal permanent residence's with green card Eric, those who have proper travel and visa documentations are not covered by this trouble holds. They are fine. Also --\nBOLLING: That was the one issue that the Ninth Circuit was hung up on.\nCONWAY: That is right. It was always true that they were exempt from this but it wasn't made clear perhaps. And so, that's something from the get go here. Also, Syrian refugees are treated, along with all refugees, and instead of there being nonreligious persecution, anybody can apply under hardships. So, there are some significant changes and we know it will pass legal muster.\nContent and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n"}