{"vcmId": "22c21f55-10ce-4c48-af56-be7b760ecb4b", "url": "http://www.foxnews.com/transcript/2016/03/30/trump-campaign-manager-charged-with-battery.html", "title": "Trump campaign manager charged with battery", "description": "Corey Lewandowski accused of grabbing reporter Michelle Fields in a rough manner; 'The O'Reilly Factor' investigates the latest", "date": "2016-03-30T12:19:48Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" March 29, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nERIC BOLLING, FOX NEWS HOST: Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching this special edition of The Factor \"Election 2016.\" Let's get straight to our top story.\nDonald Trump's campaign manager Corey Lewandowski charged with battery in Florida. Lewandowski's accused of grabbing former Breitbart reporter Michelle Fields in a rough way following a Trump press conference in Jupiter, Florida on March 8th. Jupiter police released this previously unseen surveillance video of the incident in which Lewandowski appears to make direct contact with Fields. Donald Trump is giving a full support for Lewandowski.\n(BEGIN VIDEO CLIP)\nDONALD TRUMP (R), PRESIDENTIAL CANDIDATE: Cory is a fine person. Those tapes to me are very conclusive. A lot of people are looking and saying how can anybody be charged? She was actually -- if you look at her -- and according to a lot of people -- she is grabbing at me and he is acting as intermediary.\n(END VIDEO CLIP)\nBOLLING: Trump also tweeted, \"Why aren't people looking at this reporter's earlier statement as to what happened that is before she found out the episode was on tape?\" Michelle Fields respond to Trump on Twitter writing, quote, \"Because my story never changed. Seriously, just stop lying.\" Cory Lewandowsky was booked to be on this show exclusively tonight but has subsequently cancelled.\nSo, joining us now with reaction from Dallas, Trump campaign spokesperson Katrina Pierson and from Houston, Cruz campaign communications Director Alice Stewart.\nLet me start with you, Katrina. So, it was a very, very busy day, breaking news all over the place. The police in Florida said that they were going to go ahead and charge him. Originally they said, they were arresting Corey Lewandowski. He didn't get arrested. Tell us what the latest is from the camp.\nKATRINA PIERSON, TRUMP CAMPAIGN SPOKESPERSON: Well, Mr. Lewandowski did go and turn himself in because there was a notice to appear in court. There was not an arrest. And he is going to plead guilty. The allegation is that Cory Lewandowski aggressively grabbed a reporter nearly throwing her to the ground, those are her words, those were her original statements. She even wrote a blog about it. And we can from the video that is not what happened.\nBOLLING: All right. Katrina, you said, he is going to plead guilty?\nPIERSON: I mean, I'm sorry, plead not guilty.\nBOLLING: All right.\nPIERSON: Cory Lewandowski is innocent. And you were correct in your statement by saying that Donald Trump stands by Corey Lewandowski as does the rest of the campaign.\nBOLLING: Okay. Alice, what is the Cruz camp see? What do they see when they look at all of this going on in the Trump campaign?\nALICE STEWART, COMMUNICATIONS DIRECTOR FOR TED CRUZ CAMPAIGN: Well, a picture paints a thousand words, Eric. And that picture says it all. Look, this is the consequence of the Trump culture and the culture of a campaign that is based on insults, verbal, physical attacks and complete disrespect for people. When you have a candidate that goes out to events and encourages people at his events to punch others in the face and attacks and harasses another candidate's spouse and insults your colleague Megyn Kelly and Carly Fiorina, this is a campaign that -- leadership starts at the top.\nAnd when you have a leader who engages in a culture of such disrespect, it trickles down. And this is a consequences of it and, look, people have a choice. You can side with a campaign that is based on insults and attacks or someone like Ted Cruz who is bringing the Republican Party together. And we don't want to talk about this. We want to put this behind us. And I'm assuming that the Trump campaign does as well. Because, what we are seeing, Ted Cruz is unifying Republicans. We had the governor of Wisconsin come out today.\nBOLLING: All right. Hold on, let me stay on this. Let me stay on this.\nPIERSON: That's basically not the case.\nBOLLING: Go ahead, Katrina, you respond to this. Alice is saying that this starts from the top basically pointing the finger at Donald Trump for what happened to Michelle Fields.\nPIERSON: Well, that's just not the case. I mean, the culture of this campaign as Mr. Trump mentioned it from the very beginning is not politically correct and sometimes telling the truth inherently is belligerent. And these are facts. Mr. Trump has been defending himself and members of his campaign for a very long time. He has never once gone on offense. He has always been on defense. And as he always mentions, he is a counter puncher. There is no culture of anything. If there is a culture of anything in a campaign, it's dirty tricks. And that has been the Cruz campaign from the beginning. It's undeniable. But to the further point with this specific allegation against Cory Lewandowski.\nThis is another example of how everyone tries to take advantage of attacking Mr. Trump. This is a #NeverTrump idea. The incident occurred and it was wasn't until days later when this reporter went to the police after the narrative was shaped on Twitter. Nothing happened at this event that hasn't happened in any other event. When you are in the middle of press scrum, more importantly crossing a secret service threshold to reach out and put your hands on a candidate and you can see Donald Trump withdraw, when she grabbed his arm, what do you expect to happen? So, of course reporters are always moved around in these types of scrum.\nBOLLING: So, let me ask Alice. Alice, is it possible that this incident is being somewhat politicized?\nSTEWART: Absolutely not. Like I said, the picture paints a thousand words. What we are seeing with our own two eyes and for Donald Trump and the campaign to say that this didn't happen, I heard another Trump spokesperson earlier today said, this is the new normal. Well, I certainly hope not. I think the people of this country deserve much better. Reporters deserve much better and the political process deserves much better. Look, it is absolutely plane and simple what happened here.\nBOLLING: What did happen, Alice? I mean, look, I'm watching --\nSTEWART: Played out in a court of law.\nBOLLING: I'm watching the video --\nSTEWART: This reporter was not thrown to the ground.\nBOLLING: So, here's the question. I mean, part of the, you know, the legal barrier that they have to pass is, I believe, there has to be some sort of intent on one hand or, you know, some malice by Cory Lewandowski. Do you think that was there, Alice?\nSTEWART: Well, that's what will be decided in a court of law. And, look, the picture says a lot. And I encourage everyone to take a look at this. And I take Michelle's words for what she says. And as well as the local law enforcement officers that brought these charges forth. Look, this is a situation that Trump has to deal with. This is another case of actions have consequences. And the actions throughout the culture of this campaign have been those of disrespect, those of verbal and physical abuse, and let them deal with that. Look, what we are doing today, we started out today with phenomenal news of the endorsement of Wisconsin Governor Scott Walker.\nBOLLING: Okay. All right.\nSTEWART: He stands behind Ted Cruz.\nBOLLING: We want to stand this. Let's stand this. Let's stand this you guys. Stay on this, the topic is this Corey Lewandowski showing up at police headquarters in Florida. Katrina, take a listen to Ted Cruz and John Kasich responding to what happened today, the events of the day.\n(BEGIN VIDEO CLIP)\nSEN. TED CRUZ (R), PRESIDENTIAL CANDIDATE: This is a very sad development and this is the consequence of the culture of the Trump campaign. The abusive culture when you have a campaign that is built on personal insults, an attacks, and now physical violence.\nGOV. JOHN KASICH (R-OH), PRESIDENTIAL CANDIDATE: I can only talk about what I would do. We probably would suspend somebody. And you know, it would depend on what it is and what the evidence was. But when we see things that we think are inappropriate, we take action.\n(END VIDEO CLIP)\nBOLLING: Now, Katrina, the Donald Trump campaign, Donald Trump himself has tweeted as we showed earlier in the segment, his support for Cory Lewandowski.\nPIERSON: Sure. Well, I mean in these two candidates, Kasich and Cruz both are also two candidates that took the side of domestic terrorist, Bill Ayer is in Black Lives Matter at a Trump rally. So, what they're talking about is more politicization. But to Alice's point, I will say this, allegations also have consequences. This is a man that has four small children being accused of battering a woman. I am very confident that Mr. Lewandowski is going to beat these charges. And the only thing this is going to do is change the way the press is handled at these events. Because, again, this was in scrum. I personally have been knocked around by cameras for reporters trying to get in front of my boss' face even slashed with a camera. You don't go and sue the network. That's insane.\nBOLLING: Alice, do you hold the secret service accountable for this? Because if they were able to keep the reporters away, Lewandowski wouldn't have been there to do that.\nSTEWART: Look, I have been on the campaign in these secret service bubble, and they do tremendous work. And believe me, if there was a threat to a candidate, the secret service would be the first ones to jump in and take action. And they were right there, right by Donald Trump when this happened. And for Corey to step in and do this, clearly the local law enforcement authority, after reviewing the case and talking to people felt there was a concern. Look, and as we continue to say, this is not the first time there has been violent activity at a campaign event and this is all part of the Trump culture and that is why he is having difficulty --\nPIERSON: Again, taking the side of Black Live Matter, Bill Ayers and MoveOn.org.\nBOLLING: All right. We'll going to have to leave it right there --\nPIERSON: That's your choice, America.\nBOLLING: -- a fair and balance debate. Alice, Katrina, thank you very much.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": ["DONALD TRUMP (R), PRESIDENTIAL CANDIDATE: Cory is a fine person. Those tapes to me are very conclusive. A lot of people are looking and saying how can anybody be charged? She was actually -- if you look at her -- and according to a lot of people -- she is grabbing at me and he is acting as intermediary.", "SEN. TED CRUZ (R), PRESIDENTIAL CANDIDATE: This is a very sad development and this is the consequence of the culture of the Trump campaign. The abusive culture when you have a campaign that is built on personal insults, an attacks, and now physical violence.GOV. JOHN KASICH (R-OH), PRESIDENTIAL CANDIDATE: I can only talk about what I would do. We probably would suspend somebody. And you know, it would depend on what it is and what the evidence was. But when we see things that we think are inappropriate, we take action."], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" March 29, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nERIC BOLLING, FOX NEWS HOST: Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching this special edition of The Factor \"Election 2016.\" Let's get straight to our top story.\nDonald Trump's campaign manager Corey Lewandowski charged with battery in Florida. Lewandowski's accused of grabbing former Breitbart reporter Michelle Fields in a rough way following a Trump press conference in Jupiter, Florida on March 8th. Jupiter police released this previously unseen surveillance video of the incident in which Lewandowski appears to make direct contact with Fields. Donald Trump is giving a full support for Lewandowski.\nBOLLING: Trump also tweeted, \"Why aren't people looking at this reporter's earlier statement as to what happened that is before she found out the episode was on tape?\" Michelle Fields respond to Trump on Twitter writing, quote, \"Because my story never changed. Seriously, just stop lying.\" Cory Lewandowsky was booked to be on this show exclusively tonight but has subsequently cancelled.\nSo, joining us now with reaction from Dallas, Trump campaign spokesperson Katrina Pierson and from Houston, Cruz campaign communications Director Alice Stewart.\nLet me start with you, Katrina. So, it was a very, very busy day, breaking news all over the place. The police in Florida said that they were going to go ahead and charge him. Originally they said, they were arresting Corey Lewandowski. He didn't get arrested. Tell us what the latest is from the camp.\nKATRINA PIERSON, TRUMP CAMPAIGN SPOKESPERSON: Well, Mr. Lewandowski did go and turn himself in because there was a notice to appear in court. There was not an arrest. And he is going to plead guilty. The allegation is that Cory Lewandowski aggressively grabbed a reporter nearly throwing her to the ground, those are her words, those were her original statements. She even wrote a blog about it. And we can from the video that is not what happened.\nBOLLING: All right. Katrina, you said, he is going to plead guilty?\nPIERSON: I mean, I'm sorry, plead not guilty.\nBOLLING: All right.\nPIERSON: Cory Lewandowski is innocent. And you were correct in your statement by saying that Donald Trump stands by Corey Lewandowski as does the rest of the campaign.\nBOLLING: Okay. Alice, what is the Cruz camp see? What do they see when they look at all of this going on in the Trump campaign?\nALICE STEWART, COMMUNICATIONS DIRECTOR FOR TED CRUZ CAMPAIGN: Well, a picture paints a thousand words, Eric. And that picture says it all. Look, this is the consequence of the Trump culture and the culture of a campaign that is based on insults, verbal, physical attacks and complete disrespect for people. When you have a candidate that goes out to events and encourages people at his events to punch others in the face and attacks and harasses another candidate's spouse and insults your colleague Megyn Kelly and Carly Fiorina, this is a campaign that -- leadership starts at the top.\nAnd when you have a leader who engages in a culture of such disrespect, it trickles down. And this is a consequences of it and, look, people have a choice. You can side with a campaign that is based on insults and attacks or someone like Ted Cruz who is bringing the Republican Party together. And we don't want to talk about this. We want to put this behind us. And I'm assuming that the Trump campaign does as well. Because, what we are seeing, Ted Cruz is unifying Republicans. We had the governor of Wisconsin come out today.\nBOLLING: All right. Hold on, let me stay on this. Let me stay on this.\nPIERSON: That's basically not the case.\nBOLLING: Go ahead, Katrina, you respond to this. Alice is saying that this starts from the top basically pointing the finger at Donald Trump for what happened to Michelle Fields.\nPIERSON: Well, that's just not the case. I mean, the culture of this campaign as Mr. Trump mentioned it from the very beginning is not politically correct and sometimes telling the truth inherently is belligerent. And these are facts. Mr. Trump has been defending himself and members of his campaign for a very long time. He has never once gone on offense. He has always been on defense. And as he always mentions, he is a counter puncher. There is no culture of anything. If there is a culture of anything in a campaign, it's dirty tricks. And that has been the Cruz campaign from the beginning. It's undeniable. But to the further point with this specific allegation against Cory Lewandowski.\nThis is another example of how everyone tries to take advantage of attacking Mr. Trump. This is a #NeverTrump idea. The incident occurred and it was wasn't until days later when this reporter went to the police after the narrative was shaped on Twitter. Nothing happened at this event that hasn't happened in any other event. When you are in the middle of press scrum, more importantly crossing a secret service threshold to reach out and put your hands on a candidate and you can see Donald Trump withdraw, when she grabbed his arm, what do you expect to happen? So, of course reporters are always moved around in these types of scrum.\nBOLLING: So, let me ask Alice. Alice, is it possible that this incident is being somewhat politicized?\nSTEWART: Absolutely not. Like I said, the picture paints a thousand words. What we are seeing with our own two eyes and for Donald Trump and the campaign to say that this didn't happen, I heard another Trump spokesperson earlier today said, this is the new normal. Well, I certainly hope not. I think the people of this country deserve much better. Reporters deserve much better and the political process deserves much better. Look, it is absolutely plane and simple what happened here.\nBOLLING: What did happen, Alice? I mean, look, I'm watching --\nSTEWART: Played out in a court of law.\nBOLLING: I'm watching the video --\nSTEWART: This reporter was not thrown to the ground.\nBOLLING: So, here's the question. I mean, part of the, you know, the legal barrier that they have to pass is, I believe, there has to be some sort of intent on one hand or, you know, some malice by Cory Lewandowski. Do you think that was there, Alice?\nSTEWART: Well, that's what will be decided in a court of law. And, look, the picture says a lot. And I encourage everyone to take a look at this. And I take Michelle's words for what she says. And as well as the local law enforcement officers that brought these charges forth. Look, this is a situation that Trump has to deal with. This is another case of actions have consequences. And the actions throughout the culture of this campaign have been those of disrespect, those of verbal and physical abuse, and let them deal with that. Look, what we are doing today, we started out today with phenomenal news of the endorsement of Wisconsin Governor Scott Walker.\nBOLLING: Okay. All right.\nSTEWART: He stands behind Ted Cruz.\nBOLLING: We want to stand this. Let's stand this. Let's stand this you guys. Stay on this, the topic is this Corey Lewandowski showing up at police headquarters in Florida. Katrina, take a listen to Ted Cruz and John Kasich responding to what happened today, the events of the day.\nBOLLING: Now, Katrina, the Donald Trump campaign, Donald Trump himself has tweeted as we showed earlier in the segment, his support for Cory Lewandowski.\nPIERSON: Sure. Well, I mean in these two candidates, Kasich and Cruz both are also two candidates that took the side of domestic terrorist, Bill Ayer is in Black Lives Matter at a Trump rally. So, what they're talking about is more politicization. But to Alice's point, I will say this, allegations also have consequences. This is a man that has four small children being accused of battering a woman. I am very confident that Mr. Lewandowski is going to beat these charges. And the only thing this is going to do is change the way the press is handled at these events. Because, again, this was in scrum. I personally have been knocked around by cameras for reporters trying to get in front of my boss' face even slashed with a camera. You don't go and sue the network. That's insane.\nBOLLING: Alice, do you hold the secret service accountable for this? Because if they were able to keep the reporters away, Lewandowski wouldn't have been there to do that.\nSTEWART: Look, I have been on the campaign in these secret service bubble, and they do tremendous work. And believe me, if there was a threat to a candidate, the secret service would be the first ones to jump in and take action. And they were right there, right by Donald Trump when this happened. And for Corey to step in and do this, clearly the local law enforcement authority, after reviewing the case and talking to people felt there was a concern. Look, and as we continue to say, this is not the first time there has been violent activity at a campaign event and this is all part of the Trump culture and that is why he is having difficulty --\nPIERSON: Again, taking the side of Black Live Matter, Bill Ayers and MoveOn.org.\nBOLLING: All right. We'll going to have to leave it right there --\nPIERSON: That's your choice, America.\nBOLLING: -- a fair and balance debate. Alice, Katrina, thank you very much.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n"}