{"vcmId": "26905578-0a2d-416a-9e56-2d03e28dea37", "url": "http://www.foxnews.com/transcript/2016/12/23/europe-under-siege-from-islamic-terror.html", "title": "Europe under siege from Islamic terror", "description": "'The O'Reilly Factor' analyzes the threat to the US and overseas", "date": "2016-12-23T13:34:30Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" December 22, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nJUAN WILLIAMS, FOX NEWS HOST: Hi, I'm Juan Williams in for Bill O'Reilly. Thanks for watching us tonight.\nLet's get right to our top story. Europe under siege from Islamic terror and the threat to the U.S. Homeland. The Tunisian man reportedly behind this week's terror attack in Berlin has known ties to other Islamic radicals and was supposed to have been deported from Germany months ago. Yet somehow he was still allowed to roam free there. The Berlin attack is intensifying calls here in the U.S. to ramp up what President-elect Trump calls extreme vetting of immigrants and refugees coming into this country.\n(BEGIN VIDEO CLIP)\nDR. SEBASTIAN GORKA, VICE PRESIDENT, INSTITUTE OF WORLD POLITICS: Of the 400 plus terrorist cases that have been prosecuted in America in the last 15 years, more than half of them involved people who are not born in the United States, many of them who were immigrants or people who had refugee status.\n(END VIDEO CLIP)\nWILLIAMS: And in Florida yesterday, Donald Trump was pressed on the latest wave of attacks to hit Europe.\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: Has it caused to you rethink or reevaluate your plan to create a Muslim registry or ban Muslim immigration to the United States?\nDONALD TRUMP (R), PRESIDENT-ELECT: You know my plan all along and I have been proven to be right 100 percent correct. What's happening is disgraceful. That's an attack on humidity. That's what it is. It's an attack on humanity. And it's got to be stopped.\n(END VIDEO CLIP)\nWILLIAMS: Joining us from Washington with analysis, Jim Hanson, executive Vice President at the Center for Security Policy. And from Houston, national security analyst Arash Aramesh.\nMr. Hanson, let me begin with you. One hundred percent right? One hundred percent. Is this really justification for limiting the number of immigrants, Muslim immigrants allowed into the United States or simply saying it's not Muslims I'm talking about people coming from countries where there is evidence of Islamic terrorism? Is that a fair judgment as it's explained to us by the President-elect?\nJIM HANSON, EXECUTIVE VICE PRESIDENT, CENTER FOR SECURITY POLICY: Well, it is Muslims, but it's not all Muslims. Let's be perfectly clear. But Pew International, a nice liberal organization polled Muslims worldwide and support for violence among the Muslim population all over hit somewhere north of 20 to 25 percent. That's a lot of folks who believe that violence is okay. Now, if you can't vet them and both the FBI director and ODNI agree that we cannot, then letting them into the country as Angela Merkel did in Germany and we have been here is a suicide pact.\nIt's the wrong answer and stopping immigration in some way from areas where jihadists hold sway is a common sense solution. There is no right to immigrate and we have no need to bring refugees here. We can do better things for them where they are.\nWILLIAMS: All right. So let's go to that point, Mr. Aramesh. In fact, Jim Comey the FBI director said there is no way, there is no way the FBI and other American agencies can fully vet everyone coming into the country. So, is President-elect Trump right in saying that after what happened in Germany he is looking again at limiting who comes in and employing extreme vetting?\nARASH ARAMESH, NATIONAL SECURITY ANALYST: We have every right to make sure the people that we let to enter our country are vetted are interviewed and are screened. But here's the big difference between the refugee population that goes to Europe and the refugees that try to seek status here in the United States. Europe has land borders with Turkey, Europe has land borders with Greece. Europe has land borders with many European Union country. They are in the European Union and Turkey and people from Syria go up to Turkey and cross the border.\nWe are talking about millions of people that just cross over the border. In order to come to the United States, as a refugee first and foremost, you have to wait for two years for the United Nations to process you. Hundreds of thousands of applicants failed that. After that you have to go through an FBI screening. Then you have to be interviewed by representatives from the Department of Defense and interviewed by representatives from Department of Homeland Security and State Department interview. So, it's not as if that people will just come here, get off the port of Long Beach and declare refugee status. I mind you, by the way, refugees and immigrants are not the same thing. You heard Gorka, Mr. Gorka if I --\nWILLIAMS: Sebastian Gorka.\nARAMESH: Who himself --\nWILLIAMS: Yes.\nARAMESH: Sebastian Gorka who himself is actually Hungarian. And I welcome, we welcome immigrants in this country. I urge to you to go to any major research institution in this country go. Go to Stanford, go to Harvard. Go to Berkeley and Yale. Go to Princeton --\nWILLIAMS: All right.\nARAMESH: How many immigrants --\nWILLIAMS: I get your point but, Mr. Hanson, so, what we're hearing from Mr. Aramesh is the idea that America is turning its back on its roots as a nation of immigrants. A nation who has always welcomed political refugees. In fact, said we will take in your tired and your poor, Statue of Liberty. What President Trump is proposing, a new direction for America for the land of immigrants.\nHANSON: Absolutely not. I am the grandson of an immigrant. But the people were talking about who were welcomed by the Statue of Liberty did not have the destruction of America as their main goal. If you look at people who are sharia compliant Muslims, who are coming from areas controlled by jihadist they believe Sharia law should be supreme over the U.S. constitution. The Somali population in Minneapolis was polled and 25 percent of them believe that Sharia should be supreme above the constitution. So that's a different class of immigrants. And I think I would point out that the Tsarnaev brothers came as asylums and the wife of the -- killers in the --\nWILLIAMS: San Bernardino.\nHANSON: San Bernardino --\nWILLIAMS: Right.\nHANSON: She was, she came on an immigrant visa -- she was vetted.\nWILLIAMS: Let's see what Mr. Aramesh has to say to that. That is a pretty strong point.\nARAMESH: You have to vet. And there is no argument there. Having said that when you try mix and paint a huge group of people with the same brush, that's a problem. Let me tell you something, I take this very personally. About 70 years ago when the largest biggest genocide in human history was going on, a big group of people in this country said do not allow Jewish refugees to come here. You're going to have Arthur Ranstin (ph) and Merrill Lansky (ph) and thugs and criminals. And guess what? That became a dark spot in our history, America welcomes people. America brings --\nWILLIAMS: Mr. Hanson -- Mr. Hanson --\nARAMESH: -- refugees and immigrants and we are proud of that.\nWILLIAMS: Here is history, here is the welcome refugees, welcome people who are being oppressed elsewhere fleeing violence as we see in Syria. Now he uses this as a point to combat what you're seeing. What do you think, Mr. Hanson?\nHANSON: I think I would love to bring people who are being oppressed all over the world here. However, when a significant portion of a population outrageously says that they are willing to support violence to overthrow our government or to kill us, and impose Islamic law, I don't think we can take the chance. That's not the same thing as a group of folks who are coming here simply to flee oppression.\nARAMESH: Then screen them. Then screen them.\n(CROSSTALK)\nHANSON: We can't. That's the whole point. We've already proved we can't.\nARAMESH: You can ask questions. You know what? People who come here as refugees have to go through several rounds of interviews. If you are telling me that trained FBI agents, trained Department of Homeland Security agents, those people cannot get a simple and I'm a lawyer --\nHANSON: They are not allowed to. They are not allowed to.\nARAMESH: Yes you are allowed to. Check the law.\nHANSON: It's not just Mr. Hanson. It's not just Mr. Hanson. This is what Jim Comey -- this is what Jim Comey the FBI director has said.\nWILLIAMS: Well, gentlemen, let's go to the news of the day because Donald Trump had a fascinating tweet today that is setting off sparks around the country. Here it is. \"The United States must greatly strengthen and expand its nuclear capacity until such time as the world comes to its senses regarding nukes.\"\nNow, his spokesman has come back and said he is talking about preventing any future event that someone might perceive the United States to be weak and take action unless we strengthen our nuclear capacity. Mr. Hanson, do you agree or should people be alarmed at the idea that Donald Trump seems to be taking a sort of an attitude of let's proliferate nuclear weapons held by the U.S.A.?\nHANSON: The U.S.A. has nuclear weapons. They just happen to be ancient and falling apart. A colleague of mine visited Sandia labs and they showed him how they have to cannibalize the weapons just to keep them operational. And we haven't tested them in so long we barely have a single scientists anywhere in our government who has ever seen or conducted a nuclear test. We don't want know if they worked and I don't want some windows update, computer simulation to give us the blue screen of death rather than an actual working nuke.\nWILLIAMS: All right. Mr. Aramesh?\nHANSON: We need new weapons.\nARAMESH: We have over 7,000 nuclear war heads. If you don't know about, this let me tell you. The reason I tell you, I know this stuff firsthand. I used to work for William Perry the defense secretary and Siegfried Hecker, he is the former director of the Los Alamos National Laboratory. That's where we built our first nuclear weapon. They both teach at Stanford. I used to work for them. We have one of the most up to date nuclear arsenals in the world. It is great --\nWILLIAMS: Wait a second, you said, one of the most. And I think Donald Trump is saying he wants the best.\nARAMESH: We have the one. We have the best. No doubt about it. That's not true. The Russians have surpassed us.\nWILLIAMS: He says, the Russians are better.\nARAMESH: Look, I don't know where you get your news but I hope it's not Breitbart but go online and do a little fact-checking and you will see that we have the best military and the most advanced ordinance in the world.\nWILLIAMS: Gentlemen, we get the idea. But I want to say thank you. That's an excellent debate. Thank you very much.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": ["DR. SEBASTIAN GORKA, VICE PRESIDENT, INSTITUTE OF WORLD POLITICS: Of the 400 plus terrorist cases that have been prosecuted in America in the last 15 years, more than half of them involved people who are not born in the United States, many of them who were immigrants or people who had refugee status.", "UNIDENTIFIED MALE: Has it caused to you rethink or reevaluate your plan to create a Muslim registry or ban Muslim immigration to the United States?DONALD TRUMP (R), PRESIDENT-ELECT: You know my plan all along and I have been proven to be right 100 percent correct. What's happening is disgraceful. That's an attack on humidity. That's what it is. It's an attack on humanity. And it's got to be stopped."], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" December 22, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nJUAN WILLIAMS, FOX NEWS HOST: Hi, I'm Juan Williams in for Bill O'Reilly. Thanks for watching us tonight.\nLet's get right to our top story. Europe under siege from Islamic terror and the threat to the U.S. Homeland. The Tunisian man reportedly behind this week's terror attack in Berlin has known ties to other Islamic radicals and was supposed to have been deported from Germany months ago. Yet somehow he was still allowed to roam free there. The Berlin attack is intensifying calls here in the U.S. to ramp up what President-elect Trump calls extreme vetting of immigrants and refugees coming into this country.\nWILLIAMS: And in Florida yesterday, Donald Trump was pressed on the latest wave of attacks to hit Europe.\nWILLIAMS: Joining us from Washington with analysis, Jim Hanson, executive Vice President at the Center for Security Policy. And from Houston, national security analyst Arash Aramesh.\nMr. Hanson, let me begin with you. One hundred percent right? One hundred percent. Is this really justification for limiting the number of immigrants, Muslim immigrants allowed into the United States or simply saying it's not Muslims I'm talking about people coming from countries where there is evidence of Islamic terrorism? Is that a fair judgment as it's explained to us by the President-elect?\nJIM HANSON, EXECUTIVE VICE PRESIDENT, CENTER FOR SECURITY POLICY: Well, it is Muslims, but it's not all Muslims. Let's be perfectly clear. But Pew International, a nice liberal organization polled Muslims worldwide and support for violence among the Muslim population all over hit somewhere north of 20 to 25 percent. That's a lot of folks who believe that violence is okay. Now, if you can't vet them and both the FBI director and ODNI agree that we cannot, then letting them into the country as Angela Merkel did in Germany and we have been here is a suicide pact.\nIt's the wrong answer and stopping immigration in some way from areas where jihadists hold sway is a common sense solution. There is no right to immigrate and we have no need to bring refugees here. We can do better things for them where they are.\nWILLIAMS: All right. So let's go to that point, Mr. Aramesh. In fact, Jim Comey the FBI director said there is no way, there is no way the FBI and other American agencies can fully vet everyone coming into the country. So, is President-elect Trump right in saying that after what happened in Germany he is looking again at limiting who comes in and employing extreme vetting?\nARASH ARAMESH, NATIONAL SECURITY ANALYST: We have every right to make sure the people that we let to enter our country are vetted are interviewed and are screened. But here's the big difference between the refugee population that goes to Europe and the refugees that try to seek status here in the United States. Europe has land borders with Turkey, Europe has land borders with Greece. Europe has land borders with many European Union country. They are in the European Union and Turkey and people from Syria go up to Turkey and cross the border.\nWe are talking about millions of people that just cross over the border. In order to come to the United States, as a refugee first and foremost, you have to wait for two years for the United Nations to process you. Hundreds of thousands of applicants failed that. After that you have to go through an FBI screening. Then you have to be interviewed by representatives from the Department of Defense and interviewed by representatives from Department of Homeland Security and State Department interview. So, it's not as if that people will just come here, get off the port of Long Beach and declare refugee status. I mind you, by the way, refugees and immigrants are not the same thing. You heard Gorka, Mr. Gorka if I --\nWILLIAMS: Sebastian Gorka.\nARAMESH: Who himself --\nWILLIAMS: Yes.\nARAMESH: Sebastian Gorka who himself is actually Hungarian. And I welcome, we welcome immigrants in this country. I urge to you to go to any major research institution in this country go. Go to Stanford, go to Harvard. Go to Berkeley and Yale. Go to Princeton --\nWILLIAMS: All right.\nARAMESH: How many immigrants --\nWILLIAMS: I get your point but, Mr. Hanson, so, what we're hearing from Mr. Aramesh is the idea that America is turning its back on its roots as a nation of immigrants. A nation who has always welcomed political refugees. In fact, said we will take in your tired and your poor, Statue of Liberty. What President Trump is proposing, a new direction for America for the land of immigrants.\nHANSON: Absolutely not. I am the grandson of an immigrant. But the people were talking about who were welcomed by the Statue of Liberty did not have the destruction of America as their main goal. If you look at people who are sharia compliant Muslims, who are coming from areas controlled by jihadist they believe Sharia law should be supreme over the U.S. constitution. The Somali population in Minneapolis was polled and 25 percent of them believe that Sharia should be supreme above the constitution. So that's a different class of immigrants. And I think I would point out that the Tsarnaev brothers came as asylums and the wife of the -- killers in the --\nWILLIAMS: San Bernardino.\nHANSON: San Bernardino --\nWILLIAMS: Right.\nHANSON: She was, she came on an immigrant visa -- she was vetted.\nWILLIAMS: Let's see what Mr. Aramesh has to say to that. That is a pretty strong point.\nARAMESH: You have to vet. And there is no argument there. Having said that when you try mix and paint a huge group of people with the same brush, that's a problem. Let me tell you something, I take this very personally. About 70 years ago when the largest biggest genocide in human history was going on, a big group of people in this country said do not allow Jewish refugees to come here. You're going to have Arthur Ranstin (ph) and Merrill Lansky (ph) and thugs and criminals. And guess what? That became a dark spot in our history, America welcomes people. America brings --\nWILLIAMS: Mr. Hanson -- Mr. Hanson --\nARAMESH: -- refugees and immigrants and we are proud of that.\nWILLIAMS: Here is history, here is the welcome refugees, welcome people who are being oppressed elsewhere fleeing violence as we see in Syria. Now he uses this as a point to combat what you're seeing. What do you think, Mr. Hanson?\nHANSON: I think I would love to bring people who are being oppressed all over the world here. However, when a significant portion of a population outrageously says that they are willing to support violence to overthrow our government or to kill us, and impose Islamic law, I don't think we can take the chance. That's not the same thing as a group of folks who are coming here simply to flee oppression.\nARAMESH: Then screen them. Then screen them.\n(CROSSTALK)\nHANSON: We can't. That's the whole point. We've already proved we can't.\nARAMESH: You can ask questions. You know what? People who come here as refugees have to go through several rounds of interviews. If you are telling me that trained FBI agents, trained Department of Homeland Security agents, those people cannot get a simple and I'm a lawyer --\nHANSON: They are not allowed to. They are not allowed to.\nARAMESH: Yes you are allowed to. Check the law.\nHANSON: It's not just Mr. Hanson. It's not just Mr. Hanson. This is what Jim Comey -- this is what Jim Comey the FBI director has said.\nWILLIAMS: Well, gentlemen, let's go to the news of the day because Donald Trump had a fascinating tweet today that is setting off sparks around the country. Here it is. \"The United States must greatly strengthen and expand its nuclear capacity until such time as the world comes to its senses regarding nukes.\"\nNow, his spokesman has come back and said he is talking about preventing any future event that someone might perceive the United States to be weak and take action unless we strengthen our nuclear capacity. Mr. Hanson, do you agree or should people be alarmed at the idea that Donald Trump seems to be taking a sort of an attitude of let's proliferate nuclear weapons held by the U.S.A.?\nHANSON: The U.S.A. has nuclear weapons. They just happen to be ancient and falling apart. A colleague of mine visited Sandia labs and they showed him how they have to cannibalize the weapons just to keep them operational. And we haven't tested them in so long we barely have a single scientists anywhere in our government who has ever seen or conducted a nuclear test. We don't want know if they worked and I don't want some windows update, computer simulation to give us the blue screen of death rather than an actual working nuke.\nWILLIAMS: All right. Mr. Aramesh?\nHANSON: We need new weapons.\nARAMESH: We have over 7,000 nuclear war heads. If you don't know about, this let me tell you. The reason I tell you, I know this stuff firsthand. I used to work for William Perry the defense secretary and Siegfried Hecker, he is the former director of the Los Alamos National Laboratory. That's where we built our first nuclear weapon. They both teach at Stanford. I used to work for them. We have one of the most up to date nuclear arsenals in the world. It is great --\nWILLIAMS: Wait a second, you said, one of the most. And I think Donald Trump is saying he wants the best.\nARAMESH: We have the one. We have the best. No doubt about it. That's not true. The Russians have surpassed us.\nWILLIAMS: He says, the Russians are better.\nARAMESH: Look, I don't know where you get your news but I hope it's not Breitbart but go online and do a little fact-checking and you will see that we have the best military and the most advanced ordinance in the world.\nWILLIAMS: Gentlemen, we get the idea. But I want to say thank you. That's an excellent debate. Thank you very much.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n"}