{"vcmId": "460f7329-feb3-401f-89bf-488554ba3a66", "url": "http://www.foxnews.com/transcript/2015/07/03/jimmy-carter-criticizes-president-obama-foreign-policy.html", "title": "Jimmy Carter criticizes President Obama's foreign policy", "description": "Assessing the United States' relationship with Russia, China and the Middle East", "date": "2015-07-03T13:31:39Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" July 2, 2015. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nO'REILLY: Thanks for staying with us. I'm Bill O'Reilly in the \"Unresolved Problem\" segment tonight. U.S. foreign policy. Many thinks it's a disaster, big problems in the Middle East, Russia and China. Speaking in Colorado last week, former President Jimmy Carter said this.\n(BEGIN VIDEO CLIP)\nJIMMY CARTER, FORMER U.S. PRESIDENT: I can't think of many nations in the world where we have a better relationship now than we did when we took over. You know, if you look at Russia, if you look at England, if you look at China, if you look at Egypt, and so. But I'm not saying it's his fault, but we have not improved our relationship with individual countries.\nJoining us now from Washington, Simon Rosenberg, president of NDN, Center Left Think Tank. And from London, England, David Tafuri, former president, former foreign policy adviser I should say to President Obama's first campaign.\nAll right. Mr. Tafuri, we begin with you. How do asses Carter's comments? Are they flat-out wrong?\nDAVID TAFURI, FORMER OBAMA CAMPAIGN FOREIGN POLICY ADVISER: Well, President Carter has a point to an extent. I think he's right there may not be many countries where we have a much better relationship as a result of President Obama. However, President Carter also said that we lost prestige and influence over the last seven years since President Obama took office. I cannot agree with that. I think our prestige and influence were at an all-time low as President Bush left office because of some of his brash decisions because he ran into two wars without putting a lot of planning into it. And also because of the financial crisis which we had at that time. American standing is much stronger right now. Yes, President Obama could be more bold in his foreign policy. He could have more --\n(CROSSTALK)\nO'REILLY: When you say though --\nTAFURI: -- accomplishments.\nO'REILLY: When you say, America's standing is higher now, you're basing that on a poll? Is that what you're basing it on?\nTAFURI: Basing that on lots of things. Basing that on how countries interact with the U.S. on the ability of the U.S. to bring in countries to cooperate with the U.S. on U.S. foreign policy goals --\nO'REILLY: I'm a little.\nTAFURI: U.S. countries --\n(CROSSTALK)\nO'REILLY: I'm a little surprise -- I just give you one, I want to get over to Mr. Rosenberg but let just me define this. President said he had 60 nation coalition to fight ISIS. Nobody one showed up. ISIS is stronger now than they when he said they were the jayvee. All right? They are creating massive problems for the world. Okay? So, I don't know where you're coming from on that. We're not getting a lot of cooperation from other nations at all.\nTAFURI: Well, there are a lot of weaknesses --\n(CROSSTALK)\nO'REILLY: No, that's big. That's huge.\nTAFURI: However, there is a coalition, there are countries that are supporting the U.S. and that are supporting Iraqi forces and the Kurds. France is involved, Italy is involved, Germany is involved, England is involved.\nO'REILLY: Come on! All you have to do is look at the bombings --\nTAFURI: So, that is the coalition.\nO'REILLY: -- and the troops on the ground, it's nothing\nAll right. Mr. Rosenberg, Jimmy Carter's comments. How do you see that?\nSIMON ROSENBERG, PRESIDENT OF NDN: I have tremendous respect for anyone who served in the Oval Office but I think he is flat-out wrong on this one. First of all, there is polling. There are Gallup polls. You know --\nO'REILLY: Yes. And it shows that most people around the world respect America more now. And do you know the why, why they said that? Do you know the why?\nROSENBERG: Well, so, I want to --\nO'REILLY: Well, Mr. Rosenberg. Do you why the people overseas answer the question that way. Do you know?\nROSENBERG: I think that it's because the contrast between the kind of engage diplomacy --\nO'REILLY: No. It's because they see America as weaker now and not the big bully that it used to be.\nROSENBERG: Bill, you have to prove that point. I mean, that may be the case but you have no data backing that up.\nO'REILLY: Look. Come on, I read the Gallup poll. I read it.\nROSENBERG: No, I think what we're seeing, and if I could just make my case here, is that the President has been dramatically engaged in Asia, and in Europe, in Latin-America. Our standing in Latin-America has never been higher than it is today, because of the diplomatic initiatives. Since you have the Brazilian president praising Barack Obama in an unparalleled way in the White House just this week. And so, I think the premise that we're not doing better is false and wrong. I think though on the issue you've raised on the Middle East, I think it's a jump ball. I don't think we know how this is going to play out. I think certainly, what happens with the Iran deal, what happens in the battle with ISIS in the next 18 months will determine to a great degree --\nO'REILLY: All right. I don't know about -- America. I have to admit, I'm not a South American expert, it seems that the Brazilian president was very happy with Barack Obama. So, I'll cede that. On the bigger pick though, you have to both of you, have to admit that Putin doesn't fear President Obama and it's causing a lot of trouble. China doesn't fear him and it's causing trouble in the Pacific Ocean. And the Middle East, where you say the next 18 months, how many people going to die in the next 18 months because of ISIS when it should have been taken care of a long time ago, Mr. Tafuri and you know that.\nTAFURI: Well, I agree with you. The President could have done things better with respect to ISIS. Certainly the President should have acted much more quickly in Syria. Had we acted in Syria, supported moderate opposition, perhaps ISIS wouldn't have grown as strong as they did. We need a stronger policy on Syria, we need to arm the forces on the ground like the Kurds in Iraq and in Syria who are fighting ISIS. We haven't done a great job on that. However, the President is putting his attention on it now. And let's see what happens over the next 18 months.\nO'REILLY: All right, Mr. Tafuri. And I'm directing this question, Mr. Rosenberg to give him the last word. Just today Mr. Rosenberg, it was made known the White House is not going to directly arm the Kurds. The only fighting force against ISIS because Iraq doesn't like it. They want to go through Baghdad. I mean, this is just insane to me. Last word, Mr. Rosenberg.\nROSENBERG: Listen, I think it would be great if the two parties could come together to find a better path in the Middle East. If the Republicans want to, you know, put up for what they are saying, let them pass resolutions in Congress, to arm the Kurds, to be more aggressive, to go into Syria. They have done nothing. They have been sitting back letting the President lead on this. It would be great if the Republicans could do more than carp, join the White House in a better strategy.\nO'REILLY: All right. I don't disagree, I think Republicans -- I don't disagree, I think Republicans should lay out their foreign policy vision. Gentlemen, thank you for a good debate.\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": [], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" July 2, 2015. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nO'REILLY: Thanks for staying with us. I'm Bill O'Reilly in the \"Unresolved Problem\" segment tonight. U.S. foreign policy. Many thinks it's a disaster, big problems in the Middle East, Russia and China. Speaking in Colorado last week, former President Jimmy Carter said this.\n"}