{"vcmId": "4d5d9e99-960b-47e9-9b2f-c2955841f1e0", "url": "http://www.foxnews.com/transcript/2016/09/07/donald-trump-reacts-to-new-polls.html", "title": "Donald Trump reacts to new polls", "description": "Is he gaining ground on Hillary Clinton? Republican presidential nominee weighs in on 'The O'Reilly Factor'", "date": "2016-09-07T13:02:40Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" September 6, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nO'REILLY: \"Impact\" segment tonight, let's bring in Donald Trump. Joins us now from Greenville, North Carolina where he is campaigning.\nSo, first of all, let's talk about your campaign. You've said in the past that you expect to beat Hillary Clinton somewhat easily. Do you still feel that way?\nTRUMP: I don't know if I said easily but I hope to win and I think we will win. We are doing very well as you probably know. And I think we're going to have a great -- I think we have a great campaign going. North Carolina now Virginia before, Ohio yesterday. We had a tremendous crowd in Ohio. It was unbelievable actually. And I think we are doing very well.\nO'REILLY: All right. So, you are not going to say you are going to beat her easily because have you said that in the past. But you say you are still going to win on track to win. Now, let's look at the CNN poll which has you ahead by one. It's divided along race and gender. For example, you beat Secretary Clinton with men 54 percent to 32 percent. Why do you think you beat her with men?\nTRUMP: Well, maybe they like strong borders. And maybe they like strong military. But I think women do, also. That's why I think I'm going to do very well with women. I notice that we are doing very well with married women.\nO'REILLY: All right. Stay on the men now. We get to the women in a moment.\nTRUMP: I think a lot has to do with the military. A lot has to do with the strength of the borders. And not allowing the Syrians to come in who we just don't know where they are coming from. Who they are. There is no documentation. It's a disaster. Hillary wants them to pour into our country and I don't.\nO'REILLY: All right. So you think it's a national security play for men to favor you over Mrs. Clinton?\nTRUMP: Well, I guess. But I think women want that just as much as men.\nO'REILLY: Whoa, whoa. Let's get to --\nTRUMP: I think women want it as much as men.\nO'REILLY: Well, I don't know about that. CNN poll has women. Fifty three Clinton, 38 Trump.\nTRUMP: Well, you know, if you are asking me the question, I think we went way up with married women and we are going very much higher with women than we were two months ago. I never really understood that why we weren't doing well because it's very much also, it's national security, it's jobs. I think jobs for men and for women. You know, I'm not sure there is such a big difference to be honest with you, Bill.\nO'REILLY: But there is in the poll. I mean, maybe I don't know why. I think it mostly has to be style over substance, maybe. But there is a huge difference. You dominate on men. Dominate with men. And she dominates with American women. Let's get to the race. In white, white Americans, again, you dominate 55 percent to 34 percent. You are up 21 with whites. Why?\nTRUMP: I can't tell you, Bill. I mean, all I'm doing is talking about jobs and bringing back our jobs. I can't say why.\nO'REILLY: You don't have any opinion on that?\nTRUMP: I don't really. I really don't.\nO'REILLY: All right.\nTRUMP: I mean, I had a tremendous experience in Detroit and in Philadelphia this last week. With African-Americans and really inner cities and we went to a church, an African-American church, which was incredible. And, you know, I think, you know, I would think that I'm doing very well with the African-Americans.\nO'REILLY: Let's go with the nonwhite. Nonwhite is, you know, all non- Caucasians. Clinton 72 percent, Trump 18.\nTRUMP: Well, I think maybe 18 is a lot higher than it was three weeks ago. I think we have made a lot of progress. I mean, I actually saw one where it was one percent.\nO'REILLY: That was just African-Americans. This is in all nonwhites in it. All right. But anyway, look, what I am trying to get at --\nTRUMP: I think it's highly under rated, Bill.\nO'REILLY: Okay.\nTRUMP: I think it's highly underrated.\nO'REILLY: This is polarized race. It's polarized along gender. Right now, this could change. I mean, I think the debates will change a lot of things. But it's polarized right now. It's gender, women like her, men like you. Whites like you. Nonwhites like her and, you know, you don't have a theory on why, you know, you don't have a theory.\nTRUMP: I don't have a theory, Bill.\nO'REILLY: Okay.\nTRUMP: I'm about jobs. I'm about the fence. I'm about borders. I'm about a lot of things. I'm about our vets. I'm about strong military. You know, whether you break it down into men or women or anybody else, I mean, I think people want to hear that and I'm much better at it than she is. She will be very weak on the border. She wants people just to flow in terms of illegal immigration. People are going to flow into the country. And it's going to be a disaster.\nO'REILLY: All right. But apparently non-White Americans don't find that.\n(CROSSTALK)\nTRUMP: -- women like that.\nO'REILLY: I mean, that's the thing. The factor is that some people want open borders. And Bernie Sanders and his crew, let everybody in. Everybody do, you know, open society, George Soros. Everybody comes in. You know that crew. Okay. Now, Electoral College. See, in my view and I said this on my website today, it's a tie. It's a tie. You might be ahead in the popular vote a little bit right now which is pretty interesting come back from where you were four weeks ago.\nBut Electoral College is tough. It's tough. You have very little margin for error. You have got to knock off Ohio, you have got to knock off Florida, you have to win North Carolina where some polls you have behind. You have got to win either Michigan or Pennsylvania. That's tough. You don't have any margin for error where she does have some margin.\nTRUMP: Well, when you say you, you are talking about the Republican Party because it's always been that way or it's been that way for the last 20 years. And there is truth to it, but I think we are doing very well in those states. I just left again, Ohio we are doing well. We are leading in Ohio. We are leading in Florida. We are leading in --\nO'REILLY: In some polls you are. In some polls you aren't. I know how it is.\nTRUMP: Yes.\n(CROSSTALK)\nO'REILLY: Would you cede tonight you don't have a lot of margin for error. You have to take the key states that I mentioned. It's going to be tough for you in Virginia. But you don't need Virginia. It's not a have to have.\nTRUMP: Well, I just left Virginia. I know but I just left Virginia and we're just about even in Virginia.\nO'REILLY: Close. But you know McAuliffe.\nTRUMP: I'm not surprised. I think, you know, I see the crowds. I see the people. But we are pretty even in Virginia, too.\nO'REILLY: All right. Would you cede that you don't have much margin for error in the Electoral College or no?\nTRUMP: Well, when you say you again, you are talking about the Republican Party.\nO'REILLY: You, you, Donald Trump, no, no, no. It's you, Donald Trump.\nTRUMP: Well, I'm just saying the Republican Party has a tougher road. There is no question about it. I have known that. It's been that way for a long number of years.\nO'REILLY: Yes.\nTRUMP: But I think we're doing well and I think we are going to win.\nO'REILLY: All right.\nTRUMP: Now, let's get to Detroit. I was going to do this in the second segment. I was going to carry out Mr. Trump over but let's go there now. I thought they were respectful to you when you did have the dialogue with the people in Detroit. But the reaction was, you know, they ran out, they being the media, ran out to find people that smash you which they did. What was your assessment of that whole situation?\nO'REILLY: I thought the reaction was amazing. And the church was amazing. The bishop was amazing. I thought the whole thing was really an incredible experience for me. And I think it was tremendous success.\nTRUMP: What did you learn? What did you learn by going there?\nO'REILLY: Well, I don't know learn because I knew they were great people to start off with. But, I just reinforced it. These are people of faith. These are people that are strong believers in God. They were absolutely so warm and so genuine and I was very, very impressed.\nTRUMP: Did you learn anything about --\nO'REILLY: Section of Detroit.\nTRUMP: All right. Did you learn anything about why Detroit has collapsed? Why have the population has fled the area? Did you learn why?\nO'REILLY: Well, I think I know a lot of the reasons why because our leadership has lost the jobs. I mean, a lot of these companies have moved to Mexico. They moved out of Michigan, generally. That's why I'm doing well in Michigan. Because I have been talking about this for five years not just the last three weeks like, you know, Hillary who doesn't have any clue as to why they are leaving. And I know how to get them back and I know how to keep them from leaving. But if you look at Michigan generally speaking. You look at the big auto plants that are being built in Mexico and you look at what is happening with respect to Mexico is like the eighth wonder of the world. And Michigan is getting killed.\nO'REILLY: Yes, they are.\nTRUMP: And I will stop it. They are getting killed.\nO'REILLY: Do you think -- last question on this. Do you think your birther position has hurt you among African-Americans?\nTRUMP: I don't know. I have no idea. I don't even talk about it anymore, Bill.\nO'REILLY: No, I know.\nTRUMP: Because, you know, I just don't find the --\nO'REILLY: But it's there on the record.\nTRUMP: I don't know. I guess was maybe some, I don't know. Why? I really don't know why. But I don't think, very few people, you are the first one that's brought that up in a while. I don't think so. I mean, look, I went to Detroit. We had -- it was like a love fest. We had just a great, great time. I was there for a long time. Again, the bishop and his wife and whole congregation, these are fantastic people.\nO'REILLY: All right.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": [], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" September 6, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nO'REILLY: \"Impact\" segment tonight, let's bring in Donald Trump. Joins us now from Greenville, North Carolina where he is campaigning.\nSo, first of all, let's talk about your campaign. You've said in the past that you expect to beat Hillary Clinton somewhat easily. Do you still feel that way?\nTRUMP: I don't know if I said easily but I hope to win and I think we will win. We are doing very well as you probably know. And I think we're going to have a great -- I think we have a great campaign going. North Carolina now Virginia before, Ohio yesterday. We had a tremendous crowd in Ohio. It was unbelievable actually. And I think we are doing very well.\nO'REILLY: All right. So, you are not going to say you are going to beat her easily because have you said that in the past. But you say you are still going to win on track to win. Now, let's look at the CNN poll which has you ahead by one. It's divided along race and gender. For example, you beat Secretary Clinton with men 54 percent to 32 percent. Why do you think you beat her with men?\nTRUMP: Well, maybe they like strong borders. And maybe they like strong military. But I think women do, also. That's why I think I'm going to do very well with women. I notice that we are doing very well with married women.\nO'REILLY: All right. Stay on the men now. We get to the women in a moment.\nTRUMP: I think a lot has to do with the military. A lot has to do with the strength of the borders. And not allowing the Syrians to come in who we just don't know where they are coming from. Who they are. There is no documentation. It's a disaster. Hillary wants them to pour into our country and I don't.\nO'REILLY: All right. So you think it's a national security play for men to favor you over Mrs. Clinton?\nTRUMP: Well, I guess. But I think women want that just as much as men.\nO'REILLY: Whoa, whoa. Let's get to --\nTRUMP: I think women want it as much as men.\nO'REILLY: Well, I don't know about that. CNN poll has women. Fifty three Clinton, 38 Trump.\nTRUMP: Well, you know, if you are asking me the question, I think we went way up with married women and we are going very much higher with women than we were two months ago. I never really understood that why we weren't doing well because it's very much also, it's national security, it's jobs. I think jobs for men and for women. You know, I'm not sure there is such a big difference to be honest with you, Bill.\nO'REILLY: But there is in the poll. I mean, maybe I don't know why. I think it mostly has to be style over substance, maybe. But there is a huge difference. You dominate on men. Dominate with men. And she dominates with American women. Let's get to the race. In white, white Americans, again, you dominate 55 percent to 34 percent. You are up 21 with whites. Why?\nTRUMP: I can't tell you, Bill. I mean, all I'm doing is talking about jobs and bringing back our jobs. I can't say why.\nO'REILLY: You don't have any opinion on that?\nTRUMP: I don't really. I really don't.\nO'REILLY: All right.\nTRUMP: I mean, I had a tremendous experience in Detroit and in Philadelphia this last week. With African-Americans and really inner cities and we went to a church, an African-American church, which was incredible. And, you know, I think, you know, I would think that I'm doing very well with the African-Americans.\nO'REILLY: Let's go with the nonwhite. Nonwhite is, you know, all non- Caucasians. Clinton 72 percent, Trump 18.\nTRUMP: Well, I think maybe 18 is a lot higher than it was three weeks ago. I think we have made a lot of progress. I mean, I actually saw one where it was one percent.\nO'REILLY: That was just African-Americans. This is in all nonwhites in it. All right. But anyway, look, what I am trying to get at --\nTRUMP: I think it's highly under rated, Bill.\nO'REILLY: Okay.\nTRUMP: I think it's highly underrated.\nO'REILLY: This is polarized race. It's polarized along gender. Right now, this could change. I mean, I think the debates will change a lot of things. But it's polarized right now. It's gender, women like her, men like you. Whites like you. Nonwhites like her and, you know, you don't have a theory on why, you know, you don't have a theory.\nTRUMP: I don't have a theory, Bill.\nO'REILLY: Okay.\nTRUMP: I'm about jobs. I'm about the fence. I'm about borders. I'm about a lot of things. I'm about our vets. I'm about strong military. You know, whether you break it down into men or women or anybody else, I mean, I think people want to hear that and I'm much better at it than she is. She will be very weak on the border. She wants people just to flow in terms of illegal immigration. People are going to flow into the country. And it's going to be a disaster.\nO'REILLY: All right. But apparently non-White Americans don't find that.\n(CROSSTALK)\nTRUMP: -- women like that.\nO'REILLY: I mean, that's the thing. The factor is that some people want open borders. And Bernie Sanders and his crew, let everybody in. Everybody do, you know, open society, George Soros. Everybody comes in. You know that crew. Okay. Now, Electoral College. See, in my view and I said this on my website today, it's a tie. It's a tie. You might be ahead in the popular vote a little bit right now which is pretty interesting come back from where you were four weeks ago.\nBut Electoral College is tough. It's tough. You have very little margin for error. You have got to knock off Ohio, you have got to knock off Florida, you have to win North Carolina where some polls you have behind. You have got to win either Michigan or Pennsylvania. That's tough. You don't have any margin for error where she does have some margin.\nTRUMP: Well, when you say you, you are talking about the Republican Party because it's always been that way or it's been that way for the last 20 years. And there is truth to it, but I think we are doing very well in those states. I just left again, Ohio we are doing well. We are leading in Ohio. We are leading in Florida. We are leading in --\nO'REILLY: In some polls you are. In some polls you aren't. I know how it is.\nTRUMP: Yes.\n(CROSSTALK)\nO'REILLY: Would you cede tonight you don't have a lot of margin for error. You have to take the key states that I mentioned. It's going to be tough for you in Virginia. But you don't need Virginia. It's not a have to have.\nTRUMP: Well, I just left Virginia. I know but I just left Virginia and we're just about even in Virginia.\nO'REILLY: Close. But you know McAuliffe.\nTRUMP: I'm not surprised. I think, you know, I see the crowds. I see the people. But we are pretty even in Virginia, too.\nO'REILLY: All right. Would you cede that you don't have much margin for error in the Electoral College or no?\nTRUMP: Well, when you say you again, you are talking about the Republican Party.\nO'REILLY: You, you, Donald Trump, no, no, no. It's you, Donald Trump.\nTRUMP: Well, I'm just saying the Republican Party has a tougher road. There is no question about it. I have known that. It's been that way for a long number of years.\nO'REILLY: Yes.\nTRUMP: But I think we're doing well and I think we are going to win.\nO'REILLY: All right.\nTRUMP: Now, let's get to Detroit. I was going to do this in the second segment. I was going to carry out Mr. Trump over but let's go there now. I thought they were respectful to you when you did have the dialogue with the people in Detroit. But the reaction was, you know, they ran out, they being the media, ran out to find people that smash you which they did. What was your assessment of that whole situation?\nO'REILLY: I thought the reaction was amazing. And the church was amazing. The bishop was amazing. I thought the whole thing was really an incredible experience for me. And I think it was tremendous success.\nTRUMP: What did you learn? What did you learn by going there?\nO'REILLY: Well, I don't know learn because I knew they were great people to start off with. But, I just reinforced it. These are people of faith. These are people that are strong believers in God. They were absolutely so warm and so genuine and I was very, very impressed.\nTRUMP: Did you learn anything about --\nO'REILLY: Section of Detroit.\nTRUMP: All right. Did you learn anything about why Detroit has collapsed? Why have the population has fled the area? Did you learn why?\nO'REILLY: Well, I think I know a lot of the reasons why because our leadership has lost the jobs. I mean, a lot of these companies have moved to Mexico. They moved out of Michigan, generally. That's why I'm doing well in Michigan. Because I have been talking about this for five years not just the last three weeks like, you know, Hillary who doesn't have any clue as to why they are leaving. And I know how to get them back and I know how to keep them from leaving. But if you look at Michigan generally speaking. You look at the big auto plants that are being built in Mexico and you look at what is happening with respect to Mexico is like the eighth wonder of the world. And Michigan is getting killed.\nO'REILLY: Yes, they are.\nTRUMP: And I will stop it. They are getting killed.\nO'REILLY: Do you think -- last question on this. Do you think your birther position has hurt you among African-Americans?\nTRUMP: I don't know. I have no idea. I don't even talk about it anymore, Bill.\nO'REILLY: No, I know.\nTRUMP: Because, you know, I just don't find the --\nO'REILLY: But it's there on the record.\nTRUMP: I don't know. I guess was maybe some, I don't know. Why? I really don't know why. But I don't think, very few people, you are the first one that's brought that up in a while. I don't think so. I mean, look, I went to Detroit. We had -- it was like a love fest. We had just a great, great time. I was there for a long time. Again, the bishop and his wife and whole congregation, these are fantastic people.\nO'REILLY: All right.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n"}