{"vcmId": "7150e51a-f139-4a4d-b1a4-e62ba8db7129", "url": "http://www.foxnews.com/transcript/2015/05/08/did-know-that-bill-oreilly.html", "title": "Did you know that? : Bill O'Reilly", "description": "Fox News' Bill O’Reilly shares his story in the 'No Spin Zone'", "date": "2015-05-08T12:27:15Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" May 7, 2015. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nO'REILLY: \"Did you know that?\" segment tonight, I hope you'll pardon this upcoming exercise. As you may know, we feature FOX News correspondents and contributors telling you about their backgrounds. Well, tonight it's my turn.\n(BEGIN VIDEO CLIP)\nARTHEL NEVILLE, CO-HOST, \"AMERICA'S NEWS HEADQUARTERS\": I want to go back to third grade. If you can remember that far back? Something you're doing caused the sister Lorena and sister Mary to say William, you are a bold fresh piece of humanity.\nO'REILLY: That's he where it all started. I was a little thug, all right? In St. Bridget School. And me and a couple of others, we just wanted to have a few laughs, so I would kind of bored with it, you know, third grade, so I would just do annoying things and then a nun would come down and call us names and give us a little slap with the eraser, whatever it is. I know this is interesting with the folks. Number one, when I was ten, my father says you got to work so I cut lawns and I shoveled snow in the winter.\nNEVILLE: Yes.\nO'REILLY: Okay, all right. Then I graduated to Carville, the ice cream stand when I was 16-years-old. And then I got my life guard certification, safety instructor.\nNEVILLE: And you more than doubled your salary.\nO'REILLY: Yes. And I made some pretty good money out of Long Island teaching people to swim and I saved a couple of people. But it wasn't enough. I said, now I got to go to college and now I got to have some money, so we started a painting business. And we actually painting houses, we undercut the union painters which wasn't really smart.\nNEVILLE: Right.\nO'REILLY: But they weren't going to kill us. So, we could run fast. But we painted these houses, and I had crew of four or five, we made humongous money at shoe boxes full of cash. And that put me through spending money and other things through college.\nNEVILLE: I want to talk to you about your journalism studies at Boston University.\nO'REILLY: My mother went there. She has a physical therapy degree from there and I went there to go to journalism school, get a degree in broadcast journalism and it was the greatest because all the Watergate stuff and the busing was huge in Boston. So I got to cover stories on a freelance basis while I was in school and I would get a little money for writing stories and then hand in those stories as papers to the pin head BU professors, so it worked perfectly and had a great time.\nNEVILLE: In the spring of 1969, right? Your friends were accepted to the third year abroad program. Now, you were not accepted at first.\nO'REILLY: Well, my third year in college, at Marist College, I was playing football and, you know, I kind of thought I might want to stay and not go. But then one of the guys at Marist said, you know, you're really not smart enough to go abroad anyway.\nNEVILLE: Yes.\nO'REILLY: So of course I went. And once I got to London and learned that there was something different than Levy Town and Poughkeepsie in New York, and your whole world expands. We had adventures. Europe on five dollars a day. You know? We stayed in Youth Hostels. But I learned more in that year than the other preceding 20 years combined.\nNEVILLE: You write in your book \"Bold Fresh Piece Humanity\" but your core belief you say is that life is a constant struggle between good and evil. This eventually led to you create The Factor. Tell us more about why you created The Factor.\nO'REILLY: I was up at Harvard at the Kennedy's school -- so I created The Factor up there.\nHi, I'm Bill O'Reilly. Thank you for watching on our very first day.\nA show that would going to be opinion based on fact. But really feisty and really obnoxious.\nUNIDENTIFIED MAN: That's one problem, the second problem is --\nO'REILLY: Let me stop you there. I disagree with you. I disagree.\nI knew that in prime time up against the dancing and the singing and the wrestling that you'd have to have something very provocative, so I put it together and it worked.\nUNIDENTIFIED MAN: You wouldn't send your children to this war, Bill.\nO'REILLY: My name isn't listed in the army, you don't know what the hell you're talking about.\nUNIDENTIFIED MAN: Very good. Congratulations.\nO'REILLY: Yes. I mean, I'm a patriot, and don't denigrate the service or I'll boot you right off the set.\nBut I think that the folks depend on us. I write The Factor as you know.\nNEVILLE: Uh-mm.\nO'REILLY: We delivered it every night. It's a challenge to stay number one and so I like the challenge.\nNEVILLE: Now, there is the books, the films, other pending productions. Was this part of a strategy?\nO'REILLY: I think God has a plan for me and I just let it unfold as it happens. And I think that's the advice I give everybody else. Do your best, get into something you like and then things start to unfold.\nNEVILLE: Final question, Bill. What would you like written on your tombstone?\nO'REILLY: He finally stopped talking.\nNEVILLE: Thank you.\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": [], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" May 7, 2015. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nO'REILLY: \"Did you know that?\" segment tonight, I hope you'll pardon this upcoming exercise. As you may know, we feature FOX News correspondents and contributors telling you about their backgrounds. Well, tonight it's my turn.\n"}