{"vcmId": "8bb04277-5da3-4ed1-ad00-5c3837bb883e", "url": "http://www.foxnews.com/transcript/2015/08/10/breaking-down-republican-presidential-debate.html", "title": "Breaking down the Republican presidential debate", "description": "Chris Wallace and Bret Baier analyze how the debate will shape the race for GOP nomination", "date": "2015-08-10T15:44:38Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" August 7, 2015. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nCHRIS WALLACE, FOX NEWS ANCHOR: The O'REILLY FACTOR is on.\n(BEGIN VIDEOTAPE)\nDONALD TRUMP (R), PRESIDENTIAL CANDIDATE: Our politicians are stupid, and the Mexican government is much smarter. And they send the bad ones over because they don't want to pay for them. Why should they when the stupid leaders of the United States will do it for them?\nWALLACE: Fighting words from Donald Trump at the big GOP debate. The central question tonight, did he help or hurt himself? We'll have complete analysis.\nSEN. RAND PAUL (R), PRESIDENTIAL CANDIDATE: I want to collect more records from terrorists but less records from innocent Americans.\nGOV. CHRIS CHRISTIE (R), PRESIDENTIAL CANDIDATE: That's a completely ridiculous answer.\nWALLACE: Debate night confrontation between Rand Paul and Chris Christie. Senator Paul will be here.\nGOV. JOHN KASICH (R), PRESIDENTIAL CANDIDATE: Guess what? I just went to a wedding of a friend of mine who happens to be gay. Because somebody doesn't think the way I do doesn't mean that I can't care about them or can't love them.\nWALLACE: And is Governor John Kasich breaking with the Republican pack over gay rights? We'll ask.\n(END VIDEOTAPE)\nWALLACE: The Factor begins right now.\nHi. I'm Chris Wallace. Bill O'Reilly always told me, Wallace, you can substitute for me once you bring in 20 million viewers. Just kidding. But the fact is, some 24 million of you watched the big FOX News Republican presidential debate. That's the biggest audience in the history of the FOX News Channel. And it's the highest rated non-sports telecast ever. Ever on cable.\nWe're going to drill down tonight into what happened in the debate and how it has changed the shape of the race for the GOP nomination. There were plenty of fireworks, confrontations, even some humor, as the candidates went after each other and us, the moderators -- Megyn Kelly, Bret Baier, and me. Things got explosive right from the start.\n(BEGIN VIDEO CLIP)\nBRET BAIER, DEBATE MODERATOR: Is there anyone on stage, and can I see hands, who is unwilling tonight to pledge your support to the eventual nominee of the Republican Party and pledge to not run an independent campaign against that person?\nAgain, we're looking for you to raise your hand now. Raise your hand now if you won't make that pledge tonight.\nMr. Trump. You can't say tonight that you can make that pledge?\nTRUMP: I cannot say I have to respect the person that, if it's not me, the person that wins. If I do win, and I'm leading by quite a bit, that's what I want to do. I can totally make that pledge if I'm the nominee. I will pledge I will not run as an independent.\nMEGYN KELLY, DEBATE MODERATOR: How would you destroy ISIS in 90 days?\nSEN. TED CRUZ (R), PRESIDENTIAL CANDIDATE: Megyn, we need a commander-in- chief that speaks the truth. We will not defeat radical Islamic terrorism, so long as we have a president unwilling to utter the words, radical Islamic terrorism.\n(APPLAUSE)\nWALLACE: I want to ask you about your business record. Trump Corporations. Trump Corporations, casinos and hotels, have declared bankruptcy four times over the last quarter century. Question, sir, with that record, why should we trust you to run the nation's business?\nTRUMP: Because I have used the laws of this country just like the greatest people that you read about every day in business have used the laws of this country, the chapter laws, to do a great job for my company, for myself, for my employees, for my family, et cetera. I have never gone bankrupt, by the way. I have never. But out of hundreds --\n(CROSSTALK)\nWALLACE: No, no, Mr. Trump. But, sir.\nTRUMP: Excuse me. Excuse me.\nWALLACE: That's your line. But your companies have gone bankrupt.\nTRUMP: Excuse me. Out of -- what am I saying? Out of hundreds of deals that I've done, hundreds, on four occasions, I've taken advantage of the laws of this country, like other people.\n(END VIDEO CLIP)\nWALLACE: Well, tonight, since we have all been getting so many questions about what it was like to be on that stage, to be one of the moderators dealing with all those candidates, we're going to do something a little different. We're going to take you behind the scenes.\nJoining me now, co-moderator and anchor of \"SPECIAL REPORT,\" Bret Baier.\nWelcome to The Factor.\nBAIER: Thank you.\nWALLACE: New place for both of us. So on a few hours sleep and I got to say few hours sleep.\nBAIER: That's right.\nWALLACE: Your thoughts the day after about this debate?\nBAIER: Well, I think it was obviously a surprise to see that many people tune in. I knew it was going to be a big night. I just don't think I'd knew there was going to be 24 million people. I think that going into the debate, we had a feeling it was going to be big.\nI think overall, we covered all the topics we wanted to cover. We were pointed, but I think on balance, fair. And I've heard all kinds of reactions, as I know you have. My Twitter feed is filled. And I think that -- you know, that opening question was hanging there for the leader of the Republican Party to not be able to say on a Republican primary debate stage that he could support the Republican nominee was a big moment. And it had been talked about. And I think it was fair.\nWALLACE: All right. I said we're going to take people behind the scene. Your impressions, your views, things that you noticed on the stage last night that the viewers at home may not have seen.\nBAIER: Well, when we go to commercial break, a lot of the candidates obviously would come over to the desk. Some of them would lobby for more time. I think a lot of them understood that there were 10 candidates on that stage, and it's difficult to provide the exact amount of time for each candidate.\nI thought that the interaction between candidates at the commercial breaks was interesting. Mr. Trump didn't really do a lot of that. He talked to Scott Walker a little bit. Rand Paul kind of kept to himself.\nI think it was an interesting thing that they all, at the end of it, seemed to think that, largely, they were treated OK. Minus, I think, Mr. Trump had some major problems.\nWALLACE: You know, I have to say that one of the things that struck me, and I doubt that it showed up on the stage, was that when Trump would make some of his more outlandish statements about some things, you would see some of the other candidates, particularly Jeb Bush, who was right next to him, kind of shaking his heads and rolling his eyes. And it reminded me of that classic \"Saturday Night Live\" skit when Bush's father, 41, is debating Michael Dukakis and John Chaffetz looks at the camera and goes, I can't believe I'm losing to this guy.\nAnd that's what the sense I had of Jeb Bush. He couldn't believe that he's losing to this guy, and he is losing to this guy.\nBAIER: Yes, definitely. I mean, I think that the -- you know, Jeb Bush had a social night. If you look across the people looking at it. I think that, also, the interesting thing is that anybody thought that this was going to be just a cakewalk, you know. On the way to the nomination, on the way to a general election win, you're going to have to face a lot of tough questions. And as the nominee, you may face a Clinton machine. And if you can't handle you and Megyn and me, I don't know if, you know -- I think that's a fair test.\nWALLACE: All right. We're going to talk a lot during this hour about Donald Trump. But other candidates who stood out for you either for good or ill for their campaigns?\nBAIER: Yes, I thought Senator Rubio had a good night overall.\nWALLACE: I agree.\nBAIER: He's very concise. I think John Kasich had a good night making his case, and obviously had the home crowd in Ohio. So that was a bit of a factor. And I do think that Ted Cruz had a good night. He's really comfortable in that setting, in that debate setting. And you can see how he --\nWALLACE: It is amazing.\nBAIER: He's yearning for that.\nWALLACE: You ask him a question and he will give you a one-minute answer. Perfectly composed. The word scanned, the sentence scanned, paragraph scanned. It is an amazing verbal ability.\nAll right. You have been our lead political guy here at FOX since 2009. You've done election nights, you've done conventions, you've done major events. The buildup to last night and, of course, we didn't know there were going to be 24 million people there, how was it for you?\nBAIER: It was a little nerve racking. I think, you know, when the light went on and you got over the original -- butterflies, the 8:50 to 9:00 p.m. time was a little iffy, a little awkward with the candidates on the stage there and it didn't go as we really planned. They came out a little early, and --\nWALLACE: They just stood there and didn't talk to each other.\nBAIER: Yes. That didn't work. But once we got to 9:00, I felt we were rolling. And you kind of had this feeling like we're in it. And I looked at you, and you know, it was -- it was fun.\nWALLACE: OK. We got less than a minute left. Just give people a sense of how intense the preparation was, preparing these questions and how long it took us.\nBAIER: It took a long time. Weeks. And you were doing it on vacation in Martha's Vineyard. I was doing it at home late at night. And then we'd get into this room in Cleveland and really go over these questions, one after another. And I should say, we collectively stand by each one of the questions that was delivered on Thursday night.\nWALLACE: Absolutely.\nBAIER: One hundred percent. And each one of us, and as well as the team, refined each question and we stand behind each question.\nWALLACE: Absolutely. And I've got to also say, folks, it was brutal because what would happen is, I would present my questions to Bret and Megyn, and they'd say, well, you can do it a little better, you can do it a little differently. Your facts are wrong.\nBAIER: I would say Chris is a tough editor, too.\n(LAUGHTER)\nWALLACE: Well, I probably gave as much as I got.\nBret, thank you.\nBAIER: Thanks, Chris.\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": ["BRET BAIER, DEBATE MODERATOR: Is there anyone on stage, and can I see hands, who is unwilling tonight to pledge your support to the eventual nominee of the Republican Party and pledge to not run an independent campaign against that person?Again, we're looking for you to raise your hand now. Raise your hand now if you won't make that pledge tonight.Mr. Trump. You can't say tonight that you can make that pledge?TRUMP: I cannot say I have to respect the person that, if it's not me, the person that wins. If I do win, and I'm leading by quite a bit, that's what I want to do. I can totally make that pledge if I'm the nominee. I will pledge I will not run as an independent.MEGYN KELLY, DEBATE MODERATOR: How would you destroy ISIS in 90 days?SEN. TED CRUZ (R), PRESIDENTIAL CANDIDATE: Megyn, we need a commander-in- chief that speaks the truth. We will not defeat radical Islamic terrorism, so long as we have a president unwilling to utter the words, radical Islamic terrorism.(APPLAUSE)WALLACE: I want to ask you about your business record. Trump Corporations. Trump Corporations, casinos and hotels, have declared bankruptcy four times over the last quarter century. Question, sir, with that record, why should we trust you to run the nation's business?TRUMP: Because I have used the laws of this country just like the greatest people that you read about every day in business have used the laws of this country, the chapter laws, to do a great job for my company, for myself, for my employees, for my family, et cetera. I have never gone bankrupt, by the way. I have never. But out of hundreds --(CROSSTALK)WALLACE: No, no, Mr. Trump. But, sir.TRUMP: Excuse me. Excuse me.WALLACE: That's your line. But your companies have gone bankrupt.TRUMP: Excuse me. Out of -- what am I saying? Out of hundreds of deals that I've done, hundreds, on four occasions, I've taken advantage of the laws of this country, like other people."], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" August 7, 2015. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nCHRIS WALLACE, FOX NEWS ANCHOR: The O'REILLY FACTOR is on.\n(BEGIN VIDEOTAPE)\nDONALD TRUMP (R), PRESIDENTIAL CANDIDATE: Our politicians are stupid, and the Mexican government is much smarter. And they send the bad ones over because they don't want to pay for them. Why should they when the stupid leaders of the United States will do it for them?\nWALLACE: Fighting words from Donald Trump at the big GOP debate. The central question tonight, did he help or hurt himself? We'll have complete analysis.\nSEN. RAND PAUL (R), PRESIDENTIAL CANDIDATE: I want to collect more records from terrorists but less records from innocent Americans.\nGOV. CHRIS CHRISTIE (R), PRESIDENTIAL CANDIDATE: That's a completely ridiculous answer.\nWALLACE: Debate night confrontation between Rand Paul and Chris Christie. Senator Paul will be here.\nGOV. JOHN KASICH (R), PRESIDENTIAL CANDIDATE: Guess what? I just went to a wedding of a friend of mine who happens to be gay. Because somebody doesn't think the way I do doesn't mean that I can't care about them or can't love them.\nWALLACE: And is Governor John Kasich breaking with the Republican pack over gay rights? We'll ask.\n(END VIDEOTAPE)\nWALLACE: The Factor begins right now.\nHi. I'm Chris Wallace. Bill O'Reilly always told me, Wallace, you can substitute for me once you bring in 20 million viewers. Just kidding. But the fact is, some 24 million of you watched the big FOX News Republican presidential debate. That's the biggest audience in the history of the FOX News Channel. And it's the highest rated non-sports telecast ever. Ever on cable.\nWe're going to drill down tonight into what happened in the debate and how it has changed the shape of the race for the GOP nomination. There were plenty of fireworks, confrontations, even some humor, as the candidates went after each other and us, the moderators -- Megyn Kelly, Bret Baier, and me. Things got explosive right from the start.\nWALLACE: Well, tonight, since we have all been getting so many questions about what it was like to be on that stage, to be one of the moderators dealing with all those candidates, we're going to do something a little different. We're going to take you behind the scenes.\nJoining me now, co-moderator and anchor of \"SPECIAL REPORT,\" Bret Baier.\nWelcome to The Factor.\nBAIER: Thank you.\nWALLACE: New place for both of us. So on a few hours sleep and I got to say few hours sleep.\nBAIER: That's right.\nWALLACE: Your thoughts the day after about this debate?\nBAIER: Well, I think it was obviously a surprise to see that many people tune in. I knew it was going to be a big night. I just don't think I'd knew there was going to be 24 million people. I think that going into the debate, we had a feeling it was going to be big.\nI think overall, we covered all the topics we wanted to cover. We were pointed, but I think on balance, fair. And I've heard all kinds of reactions, as I know you have. My Twitter feed is filled. And I think that -- you know, that opening question was hanging there for the leader of the Republican Party to not be able to say on a Republican primary debate stage that he could support the Republican nominee was a big moment. And it had been talked about. And I think it was fair.\nWALLACE: All right. I said we're going to take people behind the scene. Your impressions, your views, things that you noticed on the stage last night that the viewers at home may not have seen.\nBAIER: Well, when we go to commercial break, a lot of the candidates obviously would come over to the desk. Some of them would lobby for more time. I think a lot of them understood that there were 10 candidates on that stage, and it's difficult to provide the exact amount of time for each candidate.\nI thought that the interaction between candidates at the commercial breaks was interesting. Mr. Trump didn't really do a lot of that. He talked to Scott Walker a little bit. Rand Paul kind of kept to himself.\nI think it was an interesting thing that they all, at the end of it, seemed to think that, largely, they were treated OK. Minus, I think, Mr. Trump had some major problems.\nWALLACE: You know, I have to say that one of the things that struck me, and I doubt that it showed up on the stage, was that when Trump would make some of his more outlandish statements about some things, you would see some of the other candidates, particularly Jeb Bush, who was right next to him, kind of shaking his heads and rolling his eyes. And it reminded me of that classic \"Saturday Night Live\" skit when Bush's father, 41, is debating Michael Dukakis and John Chaffetz looks at the camera and goes, I can't believe I'm losing to this guy.\nAnd that's what the sense I had of Jeb Bush. He couldn't believe that he's losing to this guy, and he is losing to this guy.\nBAIER: Yes, definitely. I mean, I think that the -- you know, Jeb Bush had a social night. If you look across the people looking at it. I think that, also, the interesting thing is that anybody thought that this was going to be just a cakewalk, you know. On the way to the nomination, on the way to a general election win, you're going to have to face a lot of tough questions. And as the nominee, you may face a Clinton machine. And if you can't handle you and Megyn and me, I don't know if, you know -- I think that's a fair test.\nWALLACE: All right. We're going to talk a lot during this hour about Donald Trump. But other candidates who stood out for you either for good or ill for their campaigns?\nBAIER: Yes, I thought Senator Rubio had a good night overall.\nWALLACE: I agree.\nBAIER: He's very concise. I think John Kasich had a good night making his case, and obviously had the home crowd in Ohio. So that was a bit of a factor. And I do think that Ted Cruz had a good night. He's really comfortable in that setting, in that debate setting. And you can see how he --\nWALLACE: It is amazing.\nBAIER: He's yearning for that.\nWALLACE: You ask him a question and he will give you a one-minute answer. Perfectly composed. The word scanned, the sentence scanned, paragraph scanned. It is an amazing verbal ability.\nAll right. You have been our lead political guy here at FOX since 2009. You've done election nights, you've done conventions, you've done major events. The buildup to last night and, of course, we didn't know there were going to be 24 million people there, how was it for you?\nBAIER: It was a little nerve racking. I think, you know, when the light went on and you got over the original -- butterflies, the 8:50 to 9:00 p.m. time was a little iffy, a little awkward with the candidates on the stage there and it didn't go as we really planned. They came out a little early, and --\nWALLACE: They just stood there and didn't talk to each other.\nBAIER: Yes. That didn't work. But once we got to 9:00, I felt we were rolling. And you kind of had this feeling like we're in it. And I looked at you, and you know, it was -- it was fun.\nWALLACE: OK. We got less than a minute left. Just give people a sense of how intense the preparation was, preparing these questions and how long it took us.\nBAIER: It took a long time. Weeks. And you were doing it on vacation in Martha's Vineyard. I was doing it at home late at night. And then we'd get into this room in Cleveland and really go over these questions, one after another. And I should say, we collectively stand by each one of the questions that was delivered on Thursday night.\nWALLACE: Absolutely.\nBAIER: One hundred percent. And each one of us, and as well as the team, refined each question and we stand behind each question.\nWALLACE: Absolutely. And I've got to also say, folks, it was brutal because what would happen is, I would present my questions to Bret and Megyn, and they'd say, well, you can do it a little better, you can do it a little differently. Your facts are wrong.\nBAIER: I would say Chris is a tough editor, too.\n(LAUGHTER)\nWALLACE: Well, I probably gave as much as I got.\nBret, thank you.\nBAIER: Thanks, Chris.\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n"}