{"vcmId": "8d94f480-8d11-4481-a541-b89f360b6970", "url": "http://www.foxnews.com/transcript/2015/07/21/donald-trump-criticizing-john-mccain.html", "title": "Donald Trump criticizing John McCain", "description": "Presidential hopeful disenchanted with Senator on illegal immigration", "date": "2015-07-21T12:22:57Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" July 20, 2015. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nHi, I'm Bill O'Reilly. Thanks for watching us tonight.\nWe will have the \"Talking Points Memo\" a bit later on. But first an interview with Donald Trump.\nAs you may know Mr. Trump has caused big controversy by criticizing John McCain. It all began after the Senator described some Trump supporters as crazies. That prompted Mr. Trump to describe Mr. McCain as being soft on illegal immigration and not helping American veterans enough. Mr. McCain is the chairman of the Senate Armed Services Committee.\n(BEGIN VIDEO CLIP)\nTRUMP: I see the vets. They come to me. These are powerful, wonderful people and they are crying. They don't know what to do. They are lost because of what we are doing. Frankly, illegal immigrants get treated better than many of our vets.\n(END VIDEO CLIP)\nO'REILLY: Donald Trump is also disenchanted with John McCain on the illegal immigrant front. Those were the issues but then things got personal.\n(BEGIN VIDEO CLIP)\nTRUMP: I don't like losers.\nUNIDENTIFIED MALE: He is a war hero.\nTRUMP: He's not a war hero.\nUNIDENTIFIED MALE: He's a war hero.\nTRUMP: He's a war hero --\nUNIDENTIFIED MALE: Five and a half years he's a POW.\nTRUMP: He's a war hero because he was captured. I like people that weren't captured, ok?\n(END VIDEO CLIP)\nO'REILLY: And that's the comment that has caused the uproar. However, new Washington Post poll just out this afternoon shows Mr. Trump surging 24 percent of Republicans or GOP leaners now support him. That poll was taken before the McCain situation exploded.\nJoining us now from his New York City headquarters is Donald Trump. So, a supporter of yours, somebody likes you, asked me yesterday why doesn't Trump just stick to the issues because some of them are resonating. Why does he have to get personal? How do you answer that?\nTRUMP: Well, you know, when you get personal, if you look at what John McCain said, we had 15,000 incredible Americans talking about illegal immigration bill and he called them crazies. That was a very insulting thing. They were all very insulted in Phoenix the other day. And that was very insulting thing, not good.\nAnd I also I see what's happening. Because I am making the round all across the country and I see how badly our veterans are being treated.\nAnd he is the guy. I mean he is supposed to be doing it. And I see him on television all the time. He is always talking, talking but nothing gets done. These veterans are living in hell, Bill. They are hurting and they are crying. And you see these strong, powerful people and you see tears coming down their eyes.\nThe Veterans Administration is a scandal. It's corrupt and what's going on is a disgrace. And, believe me, if I win, if I become president, that will end. The veterans will be treated properly.\nO'REILLY: Now, I'm going to get to that issue in a moment. I also want to talk about the illegal immigration issue. But, you kind of dodged the question. You could have made the point that Mr. McCain's characterization of your supporters as crazies was false and you could have just said what you said right now that the vets need better treatment and I, Donald Trump, am going to do that if elected.\nBut then when asked about McCain you got into his war record and I think you would admit here tonight that was a mistake because John McCain was a hero and you know that?\nTRUMP: But I haven't said anything different. In fact, Sharyl Attkisson analyzed what I said. She took it all the way and she included a few minutes later at a news conference which everybody goes to immediately and she looked at it and she said Trump did absolutely nothing wrong. He said the right things. In fact he said war hero four times.\nO'REILLY: Ok. But wait, wait, wait, wait, wait. You can backtrack into that. But the fact of the matter is, we just played the clip where you said he was captured and I like people who aren't captured. Now, you know that that wasn't correct. He was on a bombing mission. He was shot down. He was tortured. He could have been released but he said no because he wanted to stay with his captured comrades.\nCome on Donald -- you know that the way that came off wasn't correct.\nTRUMP: Bill, no matter how you say it, what I said, including my remarks right afterwards, right off the stage, if you look at it and Sharyl Attkisson is highly respected. She said it was very unfair the way the media played -- really reported on me.\nO'REILLY: Maybe that was unfair. But you yourself and I know you for a long time and I want you to be honest. You do think John McCain is a hero. I know you do.\nTRUMP: I do. And by the way, I said it. I actually said it four times and I said it immediately after I went off stage because I was asked that question.\nO'REILLY: I want everybody to know, there is no debate about John McCain's heroism. he is an American hero.\nNow, let's get on to the two issues. And you know this is close to my heart because I have raised through The Factor viewers tens of millions of dollars for the wounded vets to get the wheelchairs. I shouldn't have to be doing that. The government should do that. The Factor viewers and Americans who have donated tens of millions of dollars -- that should come from the government but it doesn't.\nSo you are right. The government doesn't give the priority it should to the wounded vets. You are right.\nBut McCain has done some good work. All right? He was behind the Veterans Affair Reform bill. He was behind the Clay Hunt Suicide Prevention Act. You picked the wrong guy here, I think.\nTRUMP: Bill, regardless of work or not work. They are suffering. I'm all over the country. I see them all the time.\nO'REILLY: You're right. They are suffering. So how can he be doing --\nTRUMP: But he is virtually the head person in Washington. He is the head of the group that runs. I mean, he is -- somebody is doing a bad job. It's corruption. It's massive corruption. It's massive incompetence. And the people are really being treated like third class citizens, Bill. And so he's in charge.\nO'REILLY: All right. I can't (INAUDIBLE) with any of that. I think the V.A. is a disgrace, generally speaking and I think President Obama and Bush the younger didn't do what they should have done, which is prioritize the best treatment on earth for anybody hit in Iraq and Afghanistan. I agree.\nI don't think McCain is the villain here.\nNow, your disdain for the establishment is why you are leading in the \"Washington Post\" poll. You would agree with that. You are coming across as a guy who doesn't -- thinks all of these people are pinheads. The Democrats and the Republicans are just a bunch of mouth offs. They don't get anything done. That's why you are popular -- is that correct?\nTRUMP: Well, I have great record. I built a great company. I have a tremendously -- you know, I have a wonderful company. In fact, I just released my financials and people were amazed at how good they are. They are great.\nAnd I did something, you know, I employ thousands of people. I employ, you know, I don't know if you just saw but the Nevada poll just came out and it was fantastic. It was a tremendous victory for me.\nBut most importantly as far as I'm concerned, I won the Hispanics by a tremendous margin. So, a lot of good polls, North Carolina just came out, I'm way ahead in North Carolina.\nO'REILLY: Yes, you're polling -- look, you are ahead by -- walker is second in the \"Washington Post\". And I think he is at 14 and you are at 24. But the reason that you are surging, look, Governor Walker did a decent job in Wisconsin. Kasich did a decent job in Ohio. Bush did a decent job in Florida. Perry did a decent job in Texas. You did a good job with your company.\nBut the reason people are coming to you is you are the anti- politician. But that's a double edged sword because you can't alienate the establishment totally, can you?\nTRUMP: You know, the funny thing is that I would really not. If I win, I will tell you I will get along with people. And you've known me for a long time, Bill, I do get along with people. I deal with foreign countries. I made a lot of money dealing against China. I've made a lot of money dealing against many other countries.\nI have a great relationship. In a \"Business Week\" poll, they said who do you most prefer -- you know, they talked about the different things that the Chinese want. One of the things is anything Trump. I mean -- and I hit them very hard because their leaders are much smarter, much more capable, much more competent than ours and they beat us all the time. I hit them hard and let people know that.\nO'REILLY: All right. You certainly hit them hard.\nTRUMP: You know -- and yet they still like me which is sort of an amazing thing, right?\nO'REILLY: Ok. You got 45 seconds, I want you to say something to Senator McCain tonight man to man right to him right now.\nTRUMP: Well, I'm going to say this.\nI have respect for Senator McCain. I used to like him a lot. I supported him. I raised a lot of money for his campaign against President Obama. And certainly if there was a misunderstanding I would totally take that back.\nBut hopefully I said it correctly and certainly shortly thereafter I said it correctly. I would like him, however, to do something with the 15,000 people that were in Phoenix about illegal, you know, immigration. They are being decimated. These people are being decimated. And I would love to see him too a much better job taking care of the veterans, Bill.\nO'REILLY: All right. Thanks for showing up tonight, Donald. We appreciate it.\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": ["TRUMP: I see the vets. They come to me. These are powerful, wonderful people and they are crying. They don't know what to do. They are lost because of what we are doing. Frankly, illegal immigrants get treated better than many of our vets.", "TRUMP: I don't like losers.UNIDENTIFIED MALE: He is a war hero.TRUMP: He's not a war hero.UNIDENTIFIED MALE: He's a war hero.TRUMP: He's a war hero --UNIDENTIFIED MALE: Five and a half years he's a POW.TRUMP: He's a war hero because he was captured. I like people that weren't captured, ok?"], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" July 20, 2015. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nHi, I'm Bill O'Reilly. Thanks for watching us tonight.\nWe will have the \"Talking Points Memo\" a bit later on. But first an interview with Donald Trump.\nAs you may know Mr. Trump has caused big controversy by criticizing John McCain. It all began after the Senator described some Trump supporters as crazies. That prompted Mr. Trump to describe Mr. McCain as being soft on illegal immigration and not helping American veterans enough. Mr. McCain is the chairman of the Senate Armed Services Committee.\nO'REILLY: Donald Trump is also disenchanted with John McCain on the illegal immigrant front. Those were the issues but then things got personal.\nO'REILLY: And that's the comment that has caused the uproar. However, new Washington Post poll just out this afternoon shows Mr. Trump surging 24 percent of Republicans or GOP leaners now support him. That poll was taken before the McCain situation exploded.\nJoining us now from his New York City headquarters is Donald Trump. So, a supporter of yours, somebody likes you, asked me yesterday why doesn't Trump just stick to the issues because some of them are resonating. Why does he have to get personal? How do you answer that?\nTRUMP: Well, you know, when you get personal, if you look at what John McCain said, we had 15,000 incredible Americans talking about illegal immigration bill and he called them crazies. That was a very insulting thing. They were all very insulted in Phoenix the other day. And that was very insulting thing, not good.\nAnd I also I see what's happening. Because I am making the round all across the country and I see how badly our veterans are being treated.\nAnd he is the guy. I mean he is supposed to be doing it. And I see him on television all the time. He is always talking, talking but nothing gets done. These veterans are living in hell, Bill. They are hurting and they are crying. And you see these strong, powerful people and you see tears coming down their eyes.\nThe Veterans Administration is a scandal. It's corrupt and what's going on is a disgrace. And, believe me, if I win, if I become president, that will end. The veterans will be treated properly.\nO'REILLY: Now, I'm going to get to that issue in a moment. I also want to talk about the illegal immigration issue. But, you kind of dodged the question. You could have made the point that Mr. McCain's characterization of your supporters as crazies was false and you could have just said what you said right now that the vets need better treatment and I, Donald Trump, am going to do that if elected.\nBut then when asked about McCain you got into his war record and I think you would admit here tonight that was a mistake because John McCain was a hero and you know that?\nTRUMP: But I haven't said anything different. In fact, Sharyl Attkisson analyzed what I said. She took it all the way and she included a few minutes later at a news conference which everybody goes to immediately and she looked at it and she said Trump did absolutely nothing wrong. He said the right things. In fact he said war hero four times.\nO'REILLY: Ok. But wait, wait, wait, wait, wait. You can backtrack into that. But the fact of the matter is, we just played the clip where you said he was captured and I like people who aren't captured. Now, you know that that wasn't correct. He was on a bombing mission. He was shot down. He was tortured. He could have been released but he said no because he wanted to stay with his captured comrades.\nCome on Donald -- you know that the way that came off wasn't correct.\nTRUMP: Bill, no matter how you say it, what I said, including my remarks right afterwards, right off the stage, if you look at it and Sharyl Attkisson is highly respected. She said it was very unfair the way the media played -- really reported on me.\nO'REILLY: Maybe that was unfair. But you yourself and I know you for a long time and I want you to be honest. You do think John McCain is a hero. I know you do.\nTRUMP: I do. And by the way, I said it. I actually said it four times and I said it immediately after I went off stage because I was asked that question.\nO'REILLY: I want everybody to know, there is no debate about John McCain's heroism. he is an American hero.\nNow, let's get on to the two issues. And you know this is close to my heart because I have raised through The Factor viewers tens of millions of dollars for the wounded vets to get the wheelchairs. I shouldn't have to be doing that. The government should do that. The Factor viewers and Americans who have donated tens of millions of dollars -- that should come from the government but it doesn't.\nSo you are right. The government doesn't give the priority it should to the wounded vets. You are right.\nBut McCain has done some good work. All right? He was behind the Veterans Affair Reform bill. He was behind the Clay Hunt Suicide Prevention Act. You picked the wrong guy here, I think.\nTRUMP: Bill, regardless of work or not work. They are suffering. I'm all over the country. I see them all the time.\nO'REILLY: You're right. They are suffering. So how can he be doing --\nTRUMP: But he is virtually the head person in Washington. He is the head of the group that runs. I mean, he is -- somebody is doing a bad job. It's corruption. It's massive corruption. It's massive incompetence. And the people are really being treated like third class citizens, Bill. And so he's in charge.\nO'REILLY: All right. I can't (INAUDIBLE) with any of that. I think the V.A. is a disgrace, generally speaking and I think President Obama and Bush the younger didn't do what they should have done, which is prioritize the best treatment on earth for anybody hit in Iraq and Afghanistan. I agree.\nI don't think McCain is the villain here.\nNow, your disdain for the establishment is why you are leading in the \"Washington Post\" poll. You would agree with that. You are coming across as a guy who doesn't -- thinks all of these people are pinheads. The Democrats and the Republicans are just a bunch of mouth offs. They don't get anything done. That's why you are popular -- is that correct?\nTRUMP: Well, I have great record. I built a great company. I have a tremendously -- you know, I have a wonderful company. In fact, I just released my financials and people were amazed at how good they are. They are great.\nAnd I did something, you know, I employ thousands of people. I employ, you know, I don't know if you just saw but the Nevada poll just came out and it was fantastic. It was a tremendous victory for me.\nBut most importantly as far as I'm concerned, I won the Hispanics by a tremendous margin. So, a lot of good polls, North Carolina just came out, I'm way ahead in North Carolina.\nO'REILLY: Yes, you're polling -- look, you are ahead by -- walker is second in the \"Washington Post\". And I think he is at 14 and you are at 24. But the reason that you are surging, look, Governor Walker did a decent job in Wisconsin. Kasich did a decent job in Ohio. Bush did a decent job in Florida. Perry did a decent job in Texas. You did a good job with your company.\nBut the reason people are coming to you is you are the anti- politician. But that's a double edged sword because you can't alienate the establishment totally, can you?\nTRUMP: You know, the funny thing is that I would really not. If I win, I will tell you I will get along with people. And you've known me for a long time, Bill, I do get along with people. I deal with foreign countries. I made a lot of money dealing against China. I've made a lot of money dealing against many other countries.\nI have a great relationship. In a \"Business Week\" poll, they said who do you most prefer -- you know, they talked about the different things that the Chinese want. One of the things is anything Trump. I mean -- and I hit them very hard because their leaders are much smarter, much more capable, much more competent than ours and they beat us all the time. I hit them hard and let people know that.\nO'REILLY: All right. You certainly hit them hard.\nTRUMP: You know -- and yet they still like me which is sort of an amazing thing, right?\nO'REILLY: Ok. You got 45 seconds, I want you to say something to Senator McCain tonight man to man right to him right now.\nTRUMP: Well, I'm going to say this.\nI have respect for Senator McCain. I used to like him a lot. I supported him. I raised a lot of money for his campaign against President Obama. And certainly if there was a misunderstanding I would totally take that back.\nBut hopefully I said it correctly and certainly shortly thereafter I said it correctly. I would like him, however, to do something with the 15,000 people that were in Phoenix about illegal, you know, immigration. They are being decimated. These people are being decimated. And I would love to see him too a much better job taking care of the veterans, Bill.\nO'REILLY: All right. Thanks for showing up tonight, Donald. We appreciate it.\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n"}