{"vcmId": "8dc43e0f-78d3-4517-804c-0f13a4466866", "url": "http://www.foxnews.com/transcript/2016/11/01/bill-oreilly-hillary-clinton-and-law.html", "title": "Bill O'Reilly: Hillary Clinton and the law", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/31", "date": "2016-11-01T12:16:05Z", "full_transcript": "The October surprise is here. The FBI saying it is examining new evidence over allegations that Hillary Clinton may have violated national security by using a private email system as secretary of state. Mrs. Clinton thought she had put this to rest. When FBI Director Comey said the case was not strong enough to prosecute last summer. Upon hearing that, Congressman Elijah Cummings was overjoyed with Comey.\n(BEGIN VIDEO CLIP)\nELIJAH CUMMINGS (D), MARYLAND CONGRESSMAN: I don't know whether your family is watching this. But I hope that they are as proud of you as I am. Because you are the epitome of what a public servant is all about.\n(END VIDEO CLIP)\nO'REILLY: But that was then. After Friday's announcement, that Comey was reopening the investigation, Cummings had a different take.\n(BEGIN VIDEO CLIP)\nCUMMINGS: I think here Director Comey made a grave mistake. We all make mistakes. But this is a grave mistake.\n(END VIDEO CLIP)\nO'REILLY: My question how would the congressman know it's a grave mistake? He has not seen what the FBI has seen. Truth is Elijah Cummings and other Democrats do not want to know the truth. Do not want justice to take place. That holds true for the president of the United States, Barack Obama as well. Based on reporting by FOX News and other agencies, Talking Points has come to the conclusion that the President has made it quite clear to Attorney General Loretta Lynch that he, he does not want any prosecution of Hillary Clinton or any investigation into the Clinton Foundation.\nMrs. Lynch got the message. And according to the \"Wall Street Journal\" is furious that FBI Director Comey has reopened the email investigation. For his part, Comey had to inform Congress about possible new information because, in September, he said this.\n(BEGIN VIDEO CLIP)\nLAMAR SMITH (D), TEXAS CONGRESSMAN: Would you reopen the Clinton investigation if you discovered new information that was both relevant and substantial?\nJAMES COMEY, FBI DIRECTOR: It's hard for me to answer in the abstract we would certainly look at any new and substantial information.\n(END VIDEO CLIP)\nO'REILLY: Comey is not a fool. He knows that if email on Huma Abedin's computer, that's Mrs. Clinton's top assistant, contains classified national security information, he knows that he, Comey, would eventually take the fall, if he did not pursue obvious leads and tell Congress. So he had to go public, even though reports are Loretta Lynch did not want him to do so. The whole thing is a mess. With politics, perhaps, trumping justice. Even former Attorney General Eric Holder weighed in saying Comey was wrong. This is the same Holder who has held in contempt of Congress because he failed to turn over documents related to the fast and furious gun scandal.\nHolder ran his Justice Department under President Obama in the most partisan political way possible. A deplorable situation. Unfortunately, it looks like Attorney General Lynch is doing the same thing. There is no question the new exposure is hurting Hillary Clinton. A new ABC News poll says 34 percent of Americans are now less likely to vote for her. Also, her poll numbers are falling. The Real Clear Average is now less than three percent in her favor, down substantially in a week. Mrs. Clinton is not happy.\nHILLARY CLINTON (D), PRESIDENTIAL NOMINEE: I'm sure a lot of you may be asking what this new email story is about and why in the world the FBI would decide to jump in to an election with no evidence of any wrongdoing with just days to go.\n(CROWD BOOING)\nThat's a good question.\n(END VIDEO CLIP)\nO'REILLY: And it is a question that deserves an answer. And we will not get that answer before Election Day. For his part, Donald Trump, who condemned Comey for letting Clinton off the hook last summer is now happy.\n(BEGIN VIDEO CLIP)\nTRUMP: And I have to give the FBI credit. That was so bad what happened originally and it took guts for Director Comey to make the move that he made in light of the kind of opposition he had where they are trying to protect her from criminal prosecution. You know that. It took a lot of guts.\n(COMMERCIAL BREAK)\nO'REILLY: Talking Points is not sure whether it took a lot of guts because he stated Comey would have eventually been held accountable if the emails on Ms. Abedin's computer show national security violations. So while Comey was covering his butt last summer, he may be also covering it now. Finally, there is a civil war within the FBI, Comey knows that, some career agents have offered their resignations because they don't believe the Clinton email investigation was conducted in a rigorous way.\nComey, Lynch, and President Obama could have saved the nation all of this turmoil, had they done what they should have done in the first place convened a federal grand jury to review the evidence presented by the FBI. That would have gotten politics out of it. But, in America at this point in history, justice takes a backseat to politics. Not acceptable. And that's \"The Memo\".", "video_clips": ["ELIJAH CUMMINGS (D), MARYLAND CONGRESSMAN: I don't know whether your family is watching this. But I hope that they are as proud of you as I am. Because you are the epitome of what a public servant is all about.", "CUMMINGS: I think here Director Comey made a grave mistake. We all make mistakes. But this is a grave mistake.", "LAMAR SMITH (D), TEXAS CONGRESSMAN: Would you reopen the Clinton investigation if you discovered new information that was both relevant and substantial?JAMES COMEY, FBI DIRECTOR: It's hard for me to answer in the abstract we would certainly look at any new and substantial information.", ""], "remaining_transcript": "The October surprise is here. The FBI saying it is examining new evidence over allegations that Hillary Clinton may have violated national security by using a private email system as secretary of state. Mrs. Clinton thought she had put this to rest. When FBI Director Comey said the case was not strong enough to prosecute last summer. Upon hearing that, Congressman Elijah Cummings was overjoyed with Comey.\nO'REILLY: But that was then. After Friday's announcement, that Comey was reopening the investigation, Cummings had a different take.\nO'REILLY: My question how would the congressman know it's a grave mistake? He has not seen what the FBI has seen. Truth is Elijah Cummings and other Democrats do not want to know the truth. Do not want justice to take place. That holds true for the president of the United States, Barack Obama as well. Based on reporting by FOX News and other agencies, Talking Points has come to the conclusion that the President has made it quite clear to Attorney General Loretta Lynch that he, he does not want any prosecution of Hillary Clinton or any investigation into the Clinton Foundation.\nMrs. Lynch got the message. And according to the \"Wall Street Journal\" is furious that FBI Director Comey has reopened the email investigation. For his part, Comey had to inform Congress about possible new information because, in September, he said this.\nO'REILLY: Comey is not a fool. He knows that if email on Huma Abedin's computer, that's Mrs. Clinton's top assistant, contains classified national security information, he knows that he, Comey, would eventually take the fall, if he did not pursue obvious leads and tell Congress. So he had to go public, even though reports are Loretta Lynch did not want him to do so. The whole thing is a mess. With politics, perhaps, trumping justice. Even former Attorney General Eric Holder weighed in saying Comey was wrong. This is the same Holder who has held in contempt of Congress because he failed to turn over documents related to the fast and furious gun scandal.\nHolder ran his Justice Department under President Obama in the most partisan political way possible. A deplorable situation. Unfortunately, it looks like Attorney General Lynch is doing the same thing. There is no question the new exposure is hurting Hillary Clinton. A new ABC News poll says 34 percent of Americans are now less likely to vote for her. Also, her poll numbers are falling. The Real Clear Average is now less than three percent in her favor, down substantially in a week. Mrs. Clinton is not happy.\nHILLARY CLINTON (D), PRESIDENTIAL NOMINEE: I'm sure a lot of you may be asking what this new email story is about and why in the world the FBI would decide to jump in to an election with no evidence of any wrongdoing with just days to go.\n(CROWD BOOING)\nThat's a good question.\nO'REILLY: And it is a question that deserves an answer. And we will not get that answer before Election Day. For his part, Donald Trump, who condemned Comey for letting Clinton off the hook last summer is now happy.\n"}