{"vcmId": "bf1220ff-7668-4a87-9865-38ef5f127c55", "url": "http://www.foxnews.com/transcript/2014/10/08/leon-panetta-enters-no-spin-zone-part-1.html", "title": "Leon Panetta enters the 'No Spin Zone', Part 1", "description": "This is a RUSH transcript from \"The O'Reilly Factor,\" October 7, 2014.", "date": "2014-10-07T04:00:00Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" October 7, 2014. This copy may not be in its final form and may be updated.\nWatch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nHi, I'm Bill O'Reilly. Thanks for watching us tonight.\nNo \"Talking Points\" memo so we can get right to former Secretary of Defense and CIA Chief Leon Panetta. His new book \"Worthy Fights\" is out today and is destined to be a bestseller. In the book Mr. Panetta talks about terrorism, presidential leadership and touches briefly on Benghazi.\nHe also tells the moving story of his immigrant parents and his own rise to become one of the most powerful men in the United States. From July 1994 to January '97, Mr. Panetta was President Clinton's chief of staff. Before that he had been a congressman from California for 16 years. He left Washington in '97 but returned in 2009 to become the director of the Central Intelligence Agency under President Obama. In 2011 he became Secretary of Defense. A position he held until February of last year. Simply put Leon Panetta knows plenty about to how the U.S. government really works.\nThis morning on the \"Today\" show, Mr. Panetta was asked about ISIS and about why President Obama pulled all U.S. troops out of Iraq instead of leaving a force behind.\n(BEGIN VIDEO CLIP)\nPANETTA: I think he really did want to try to do what was right, but his feeling was if Maliki doesn't want it, you know, why should we keep pushing on this?\n(END VIDEO CLIP)\nO'REILLY: Maliki being the incompetent Prime Minister of Iraq who was forced to resign after ISIS overran parts of Iraq earlier this year.\nLeon Panetta joins us now. So by not leaving U.S. troops in Iraq, President Obama committed a colossal blunder, did he not?\nPANETTA: Yes. There's no question that not maintaining a true presence in Iraq so that we could continue the momentum towards trying to secure that country and try to hope that it could govern itself in the right way -- I think was a mistake.\nO'REILLY: All right. I say it was a colossal blunder, not just a mistake, a mistake is -- uh, driving your rear-view fender into the wall when you're parking your car. This is a colossal blunder that has led to the deaths of tens of thousands of people because ISIS has now expanded throughout Syria and Iraq and the slaughter -- even today slaughtering people.\nNow, the why of it. So you and a bunch of other people, Hillary Clinton, Secretary of State went in and said, you know what, you've got to keep some troops there. Did you pound the table like I would have? Or were you diplomatic like you usually are?\nPANETTA: Well and I think we made a very strong case that we had to maintain at least 10,000 troops.\nO'REILLY: And you looked him in the eye and you said, I, Leon Panetta, Secretary of Defense -- and I'm assuming Mrs. Clinton did the same thing -- I, Hillary Clinton, Secretary of State, and I'm assuming the CIA did the same thing.\nPANETTA: Exactly.\nO'REILLY: All three of you looked Barack Obama in the eye like I'm looking you in the eye right now and said, \"You have to keep forces there.\" And he said, \"Well, I don't --\nPANETTA: Well Bill, just to keep the record straight here, I think the President did support providing that $10,000 --\nO'REILLY: Troops.\nPANETTA: -- 10,000-troop presence in Iraq and supported CIA operations, supported the diplomatic operations that we wanted to continue. The real issue was how hard did he fight to make it happen?\nO'REILLY: He didn't fight hard at all.\nPANETTA: That's the issue that I raised.\nO'REILLY: He didn't do anything. Maliki said, because Maliki is being threatened by the Iranians as you know, the Iranians didn't want the force in there, did they?\nPANETTA: No.\nO'REILLY: No.\nPANETTA: The Iranians were trying to influence Maliki.\nO'REILLY: Right so Maliki fold to the Iranians and Obama didn't say, we're keeping those guys in because Maliki couldn't have gotten them out. And so, all right, we know what happened. You know what bothers me here, and you're part of the problem here, is that the United States is caught by surprise by everything. All right? ISIS, we didn't know. Clapper didn't tell me. You saw that, right? On \"60 Minutes,\" did you see it?\nPANETTA: That's right. I saw the --\nO'REILLY: That's embarrassing. Isn't that embarrassing?\nPANETTA: Well, I think that when things like that happen, it's more than just an intelligence failure, it's a policy failure as well.\nO'REILLY: But he didn't admit that, did he, the President?\nPANETTA: Well, I think, you know, the fact is when you look at all of the issues --\nO'REILLY: Did he admit that on \"60 Minutes\" that it was his fault? Did he say it was his fault?\nPANETTA: Well I think he -- no, he quoted Jim Clapper as saying that intelligence failed. I understand pointing to Clapper's comment here, but I think when you look at the situation, it's more than just an intelligence failure. It's a policy failure.\nO'REILLY: Ok. Have you ever heard Barack Obama in your conversations with him as CIA chief and Defense Secretary say \"I was wrong, I made a mistake.\"\nPANETTA: I have heard him admit to mistakes. The real question is whether or not you learn from those lessons and then do the right thing.\nO'REILLY: And obviously in your book you don't think he learned from the lessons.\nPANETTA: Well, he certainly has learned the importance of now taking on ISIS and going to war against ISIS.\nO'REILLY: Oh, bull.\nPANETTA: Well he's -- look.\nO'REILLY: Come on, he tells the enemy we are not even going to put soldiers on the ground to get you.\nPANETTA: Well wait a minute. Let me answer your question. He now has made very clear that we ought to maintain 10,000 troops in Afghanistan. Obviously, he worked at that, he worked with --\n(CROSSTALK)\nO'REILLY: He had to do that.\nPANETTA: The new leadership yes but --\nO'REILLY: Had to.\nPANETTA: -- that's something we should have done in Iraq.\nO'REILLY: All right let me stop you here. I mean I read your book, all right?\nPANETTA: Good. I'm glad you did.\nO'REILLY: Yes and I'm sorry, but according to you, he hasn't learned from his mistakes and he doesn't admit his mistakes.\nPANETTA: Well, I want him to learn from his mistakes.\nO'REILLY: I know you want him to but he doesn't.\nPANETTA: You should want the President --\nO'REILLY: Sure I do.\nPANETTA: You want the President to succeed. I want the President to succeed.\nO'REILLY: You know what I want all Americans to be protected and we are not being protected. ISIS caught him by surprise, correct? Correct?\nPANETTA: Yes. That's what he admitted.\nO'REILLY: Ok Putin getting Crimea caught you by surprise, correct? Correct? That's pretty big. That's pretty big.\nPANETTA: No we know what Putin did in Crimea.\nO'REILLY: Right but you didn't know he was going to do it. All right ok.\nPANETTA: I don't know if he knew whether or not Putin --\nO'REILLY: 75,000 children from Guatemala, Honduras come to the border. This administration is caught by surprise. You see the big picture here? I'm sure you do, you're smarter than I am. You're much smarter than I am. The big picture is the Obama administration doesn't know what the deuce is doing on.\nPANETTA: I think the big picture is that this is a President who I think wants to do the right thing for the country. The real question is, whether or not he's willing to --\nO'REILLY: All right so did John Tyler, all right? Ok? There's a performance level, is there not? This is -- would you say to be fair -- and I know I'm being tough on you, but that's what I get paid to do, all right?\nPANETTA: Yes.\nO'REILLY: Would you say that President Obama's foreign policy has been effective? Yes or no?\nPANETTA: Yes, but Bill, you've got to put this in context and let me do that, ok, just to be fair. In the four years that I was there President Obama supported the operations I was involved in, in the CIA. He supported the bin Laden operation.\nO'REILLY: He had to.\nPANETTA: He supported the operations we did at the Defense Department. I think he provided pretty strong leadership with regards to the war on terrorism. I think the last two years have been a lot of mixed messages in terms of what the United States' role is going to be. And now I think he's back with the position on ISIS, I think he's beginning to see that we have to take a strong stand against terrorism.\nO'REILLY: Beginning to?\nPANETTA: Well, he's back to seeing how important that grid is.\nO'REILLY: How many people have to die -- how many people have to die and be beheaded -- beginning to? Look here's my beef in the big picture. Drones, very good. I got no problem with that. You guys did an excellent job, you found them, you killed them you should have done. Bin Laden, don't give me that this was a brave thing. The CIA and under your direction, found him -- all right? Where's the doctor, the Pakistani doctor that helped you do that, where is he? Where is he?\nPANETTA: He's in Pakistan.\nO'REILLY: Yes. Where? Where?\nPANETTA: In prison.\nO'REILLY: In prison. Why hasn't our President gotten him out? Why?\nPANETTA: We have made a lot of requests to the Pakistanis to do the right thing.\nO'REILLY: Yes are we still sending them money? Yes.\nPANETTA: Of course, we are sending them money and we're continuing to.\nO'REILLY: Why? That doctor is in jail. You shouldn't be sending them a cent until he gets out. You see what I'm talking about, there's a way to do stuff.\nAnd I tell you what, our enemies throughout the world, and this includes China and Russia, do not fear the United States now. Do they?\nPANETTA: It's very important when the President says something that we do it. And I think that's one of the problems with taking the position on chemical warfare in Syria -- that we drew a line and we get to stand by it.\nO'REILLY: Give me a straight answer. Do our enemies throughout the world fear us?\nPANETTA: I think they are getting a mixed message as to whether or not the United States will stand by its word.\nO'REILLY: Ok so I'm taking that as a no because that emboldens as you know the bad guys if they don't fear you, then they go and they do bad things. Because Putin knows nobody is going to stop him, correct?\nPANETTA: When you deal with Putin, you've got to deal with him from strength now weakness.\nO'REILLY: Have we been dealing with Putin from strength?\nPANETTA: When you deal with Putin you've got to make big --\n(CROSSTALK)\nO'REILLY: Have we been dealing with Putin from strength?\nPANETTA: I would have taken some very tough positions with regard to Putin not just sanctions but I would have also provided military aid to the Ukrainians. I would have resurrected the whole issue on missile defense. I would make sure that NATO was strengthened in terms of the surrounding countries. And I would provide an additional energy resource to other countries to make clear to Russia that they alone cannot blackmail these countries through energy.\nO'REILLY: That was not done. Why was it not done?\nPANETTA: Well, I think that's the kind of tough position that needs to be taken if we're going to confront Putin.\nO'REILLY: All right so just to be fair, I'm just recapping -- we're going to hold Mr. Panetta over unless the Secret Service agents shoot me or beat me up for two more segments.\nIn the initial part of this interview, I'm seeing a President, all right, from your eyes, former CIA chief, former defense secretary, who is either incapable or doesn't understand the dangers that the United States faces. That's the message I'm getting from you.\nPANETTA: I think this President is smart enough to understand the dangers. The real question is, can he translate that into the kind of action that will help protect this country?\nO'REILLY: Ok. So, so far he has not done that, except for the drones, all right? Why? Is he not a courageous man? Does he not trust the military? What is it that holds him back from doing the tough things that neutralize our enemies?\nPANETTA: But Bill, he is taking the right step for now with regards to ISIS.\nO'REILLY: I don't believe that.\nPANETTA: We are going to war against ISIS we're doing air attacks against ISIS. We have troops in Iraq to try to help the Iraqis. I mean I do believe that the President understands that ISIS represents a real threat to this country and that we have to confront them.\nO'REILLY: Here is how impotent President Obama's foreign policy is. Right now as we speak, people are being murdered on the border of Syria and Turkey by ISIS. Number one, we didn't bomb ISIS as they approached the town that they're siegeing. Why? I don't know, we didn't do it.\nNumber two, the Turkish army is on the border within eyesight of the slaughter and won't come over to fight ISIS. Are you kidding me? This is -- ISIS is winning. They are winning because the West and the anti-terror forces don't have the will to confront them.\nPANETTA: ISIS is going to be a tough and resilient enemy. There's no question about it. I think we are taking steps to try to confront them. I think the problem is this is going to be a long and sustained effort. And I don't know that the American people are prepared for that, but I think the President has an obligation to say to this country, we are confronting an enemy in ISIS. This is going to take time and we've got to be committed to doing everything necessary to defeat that enemy.\nO'REILLY: Would I be wrong and a mean guy to say, I don't believe Barack Obama has the stomach for the fight?\nPANETTA: Look, I'm a guy who believes that Barack Obama by virtue of what I've seen from the time I was there, has the guts to do the right thing. The real question is, will he make the decision to do it?\nO'REILLY: Ok, let's take a break. I have many more questions. And we'll be back in just a few moments.\nContent and Programming Copyright 2012 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2012 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": ["PANETTA: I think he really did want to try to do what was right, but his feeling was if Maliki doesn't want it, you know, why should we keep pushing on this?"], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" October 7, 2014. This copy may not be in its final form and may be updated.\nWatch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nHi, I'm Bill O'Reilly. Thanks for watching us tonight.\nNo \"Talking Points\" memo so we can get right to former Secretary of Defense and CIA Chief Leon Panetta. His new book \"Worthy Fights\" is out today and is destined to be a bestseller. In the book Mr. Panetta talks about terrorism, presidential leadership and touches briefly on Benghazi.\nHe also tells the moving story of his immigrant parents and his own rise to become one of the most powerful men in the United States. From July 1994 to January '97, Mr. Panetta was President Clinton's chief of staff. Before that he had been a congressman from California for 16 years. He left Washington in '97 but returned in 2009 to become the director of the Central Intelligence Agency under President Obama. In 2011 he became Secretary of Defense. A position he held until February of last year. Simply put Leon Panetta knows plenty about to how the U.S. government really works.\nThis morning on the \"Today\" show, Mr. Panetta was asked about ISIS and about why President Obama pulled all U.S. troops out of Iraq instead of leaving a force behind.\nO'REILLY: Maliki being the incompetent Prime Minister of Iraq who was forced to resign after ISIS overran parts of Iraq earlier this year.\nLeon Panetta joins us now. So by not leaving U.S. troops in Iraq, President Obama committed a colossal blunder, did he not?\nPANETTA: Yes. There's no question that not maintaining a true presence in Iraq so that we could continue the momentum towards trying to secure that country and try to hope that it could govern itself in the right way -- I think was a mistake.\nO'REILLY: All right. I say it was a colossal blunder, not just a mistake, a mistake is -- uh, driving your rear-view fender into the wall when you're parking your car. This is a colossal blunder that has led to the deaths of tens of thousands of people because ISIS has now expanded throughout Syria and Iraq and the slaughter -- even today slaughtering people.\nNow, the why of it. So you and a bunch of other people, Hillary Clinton, Secretary of State went in and said, you know what, you've got to keep some troops there. Did you pound the table like I would have? Or were you diplomatic like you usually are?\nPANETTA: Well and I think we made a very strong case that we had to maintain at least 10,000 troops.\nO'REILLY: And you looked him in the eye and you said, I, Leon Panetta, Secretary of Defense -- and I'm assuming Mrs. Clinton did the same thing -- I, Hillary Clinton, Secretary of State, and I'm assuming the CIA did the same thing.\nPANETTA: Exactly.\nO'REILLY: All three of you looked Barack Obama in the eye like I'm looking you in the eye right now and said, \"You have to keep forces there.\" And he said, \"Well, I don't --\nPANETTA: Well Bill, just to keep the record straight here, I think the President did support providing that $10,000 --\nO'REILLY: Troops.\nPANETTA: -- 10,000-troop presence in Iraq and supported CIA operations, supported the diplomatic operations that we wanted to continue. The real issue was how hard did he fight to make it happen?\nO'REILLY: He didn't fight hard at all.\nPANETTA: That's the issue that I raised.\nO'REILLY: He didn't do anything. Maliki said, because Maliki is being threatened by the Iranians as you know, the Iranians didn't want the force in there, did they?\nPANETTA: No.\nO'REILLY: No.\nPANETTA: The Iranians were trying to influence Maliki.\nO'REILLY: Right so Maliki fold to the Iranians and Obama didn't say, we're keeping those guys in because Maliki couldn't have gotten them out. And so, all right, we know what happened. You know what bothers me here, and you're part of the problem here, is that the United States is caught by surprise by everything. All right? ISIS, we didn't know. Clapper didn't tell me. You saw that, right? On \"60 Minutes,\" did you see it?\nPANETTA: That's right. I saw the --\nO'REILLY: That's embarrassing. Isn't that embarrassing?\nPANETTA: Well, I think that when things like that happen, it's more than just an intelligence failure, it's a policy failure as well.\nO'REILLY: But he didn't admit that, did he, the President?\nPANETTA: Well, I think, you know, the fact is when you look at all of the issues --\nO'REILLY: Did he admit that on \"60 Minutes\" that it was his fault? Did he say it was his fault?\nPANETTA: Well I think he -- no, he quoted Jim Clapper as saying that intelligence failed. I understand pointing to Clapper's comment here, but I think when you look at the situation, it's more than just an intelligence failure. It's a policy failure.\nO'REILLY: Ok. Have you ever heard Barack Obama in your conversations with him as CIA chief and Defense Secretary say \"I was wrong, I made a mistake.\"\nPANETTA: I have heard him admit to mistakes. The real question is whether or not you learn from those lessons and then do the right thing.\nO'REILLY: And obviously in your book you don't think he learned from the lessons.\nPANETTA: Well, he certainly has learned the importance of now taking on ISIS and going to war against ISIS.\nO'REILLY: Oh, bull.\nPANETTA: Well he's -- look.\nO'REILLY: Come on, he tells the enemy we are not even going to put soldiers on the ground to get you.\nPANETTA: Well wait a minute. Let me answer your question. He now has made very clear that we ought to maintain 10,000 troops in Afghanistan. Obviously, he worked at that, he worked with --\n(CROSSTALK)\nO'REILLY: He had to do that.\nPANETTA: The new leadership yes but --\nO'REILLY: Had to.\nPANETTA: -- that's something we should have done in Iraq.\nO'REILLY: All right let me stop you here. I mean I read your book, all right?\nPANETTA: Good. I'm glad you did.\nO'REILLY: Yes and I'm sorry, but according to you, he hasn't learned from his mistakes and he doesn't admit his mistakes.\nPANETTA: Well, I want him to learn from his mistakes.\nO'REILLY: I know you want him to but he doesn't.\nPANETTA: You should want the President --\nO'REILLY: Sure I do.\nPANETTA: You want the President to succeed. I want the President to succeed.\nO'REILLY: You know what I want all Americans to be protected and we are not being protected. ISIS caught him by surprise, correct? Correct?\nPANETTA: Yes. That's what he admitted.\nO'REILLY: Ok Putin getting Crimea caught you by surprise, correct? Correct? That's pretty big. That's pretty big.\nPANETTA: No we know what Putin did in Crimea.\nO'REILLY: Right but you didn't know he was going to do it. All right ok.\nPANETTA: I don't know if he knew whether or not Putin --\nO'REILLY: 75,000 children from Guatemala, Honduras come to the border. This administration is caught by surprise. You see the big picture here? I'm sure you do, you're smarter than I am. You're much smarter than I am. The big picture is the Obama administration doesn't know what the deuce is doing on.\nPANETTA: I think the big picture is that this is a President who I think wants to do the right thing for the country. The real question is, whether or not he's willing to --\nO'REILLY: All right so did John Tyler, all right? Ok? There's a performance level, is there not? This is -- would you say to be fair -- and I know I'm being tough on you, but that's what I get paid to do, all right?\nPANETTA: Yes.\nO'REILLY: Would you say that President Obama's foreign policy has been effective? Yes or no?\nPANETTA: Yes, but Bill, you've got to put this in context and let me do that, ok, just to be fair. In the four years that I was there President Obama supported the operations I was involved in, in the CIA. He supported the bin Laden operation.\nO'REILLY: He had to.\nPANETTA: He supported the operations we did at the Defense Department. I think he provided pretty strong leadership with regards to the war on terrorism. I think the last two years have been a lot of mixed messages in terms of what the United States' role is going to be. And now I think he's back with the position on ISIS, I think he's beginning to see that we have to take a strong stand against terrorism.\nO'REILLY: Beginning to?\nPANETTA: Well, he's back to seeing how important that grid is.\nO'REILLY: How many people have to die -- how many people have to die and be beheaded -- beginning to? Look here's my beef in the big picture. Drones, very good. I got no problem with that. You guys did an excellent job, you found them, you killed them you should have done. Bin Laden, don't give me that this was a brave thing. The CIA and under your direction, found him -- all right? Where's the doctor, the Pakistani doctor that helped you do that, where is he? Where is he?\nPANETTA: He's in Pakistan.\nO'REILLY: Yes. Where? Where?\nPANETTA: In prison.\nO'REILLY: In prison. Why hasn't our President gotten him out? Why?\nPANETTA: We have made a lot of requests to the Pakistanis to do the right thing.\nO'REILLY: Yes are we still sending them money? Yes.\nPANETTA: Of course, we are sending them money and we're continuing to.\nO'REILLY: Why? That doctor is in jail. You shouldn't be sending them a cent until he gets out. You see what I'm talking about, there's a way to do stuff.\nAnd I tell you what, our enemies throughout the world, and this includes China and Russia, do not fear the United States now. Do they?\nPANETTA: It's very important when the President says something that we do it. And I think that's one of the problems with taking the position on chemical warfare in Syria -- that we drew a line and we get to stand by it.\nO'REILLY: Give me a straight answer. Do our enemies throughout the world fear us?\nPANETTA: I think they are getting a mixed message as to whether or not the United States will stand by its word.\nO'REILLY: Ok so I'm taking that as a no because that emboldens as you know the bad guys if they don't fear you, then they go and they do bad things. Because Putin knows nobody is going to stop him, correct?\nPANETTA: When you deal with Putin, you've got to deal with him from strength now weakness.\nO'REILLY: Have we been dealing with Putin from strength?\nPANETTA: When you deal with Putin you've got to make big --\n(CROSSTALK)\nO'REILLY: Have we been dealing with Putin from strength?\nPANETTA: I would have taken some very tough positions with regard to Putin not just sanctions but I would have also provided military aid to the Ukrainians. I would have resurrected the whole issue on missile defense. I would make sure that NATO was strengthened in terms of the surrounding countries. And I would provide an additional energy resource to other countries to make clear to Russia that they alone cannot blackmail these countries through energy.\nO'REILLY: That was not done. Why was it not done?\nPANETTA: Well, I think that's the kind of tough position that needs to be taken if we're going to confront Putin.\nO'REILLY: All right so just to be fair, I'm just recapping -- we're going to hold Mr. Panetta over unless the Secret Service agents shoot me or beat me up for two more segments.\nIn the initial part of this interview, I'm seeing a President, all right, from your eyes, former CIA chief, former defense secretary, who is either incapable or doesn't understand the dangers that the United States faces. That's the message I'm getting from you.\nPANETTA: I think this President is smart enough to understand the dangers. The real question is, can he translate that into the kind of action that will help protect this country?\nO'REILLY: Ok. So, so far he has not done that, except for the drones, all right? Why? Is he not a courageous man? Does he not trust the military? What is it that holds him back from doing the tough things that neutralize our enemies?\nPANETTA: But Bill, he is taking the right step for now with regards to ISIS.\nO'REILLY: I don't believe that.\nPANETTA: We are going to war against ISIS we're doing air attacks against ISIS. We have troops in Iraq to try to help the Iraqis. I mean I do believe that the President understands that ISIS represents a real threat to this country and that we have to confront them.\nO'REILLY: Here is how impotent President Obama's foreign policy is. Right now as we speak, people are being murdered on the border of Syria and Turkey by ISIS. Number one, we didn't bomb ISIS as they approached the town that they're siegeing. Why? I don't know, we didn't do it.\nNumber two, the Turkish army is on the border within eyesight of the slaughter and won't come over to fight ISIS. Are you kidding me? This is -- ISIS is winning. They are winning because the West and the anti-terror forces don't have the will to confront them.\nPANETTA: ISIS is going to be a tough and resilient enemy. There's no question about it. I think we are taking steps to try to confront them. I think the problem is this is going to be a long and sustained effort. And I don't know that the American people are prepared for that, but I think the President has an obligation to say to this country, we are confronting an enemy in ISIS. This is going to take time and we've got to be committed to doing everything necessary to defeat that enemy.\nO'REILLY: Would I be wrong and a mean guy to say, I don't believe Barack Obama has the stomach for the fight?\nPANETTA: Look, I'm a guy who believes that Barack Obama by virtue of what I've seen from the time I was there, has the guts to do the right thing. The real question is, will he make the decision to do it?\nO'REILLY: Ok, let's take a break. I have many more questions. And we'll be back in just a few moments.\nContent and Programming Copyright 2012 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2012 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n"}