{"vcmId": "c8621121-ae9f-40fd-8719-98759b80922d", "url": "http://www.foxnews.com/transcript/2016/08/25/mike-pence-on-clinton-controversies-no-one-is-above-law.html", "title": "Mike Pence on Clinton controversies: No one is above the law", "description": "Republican vice presidential candidate joins 'The O'Reilly Factor' to discuss calls for special prosecutor investigation of Democratic presidential candidate", "date": "2016-08-25T12:20:26Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" August 24, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nERIC BOLLING, FOX NEWS HOST: Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching us tonight. Governor Mike Pence, the Republican vice presidential nominee will join us in just a second. And there are many big developments in the presidential campaign to talk with him about, beginning with an Associated Press investigation finding that more than half the private individuals Hillary Clinton met with, as secretary of state were donors to the Clinton Foundation.\nThe report adding fuel to Donald Trump's calls earlier this week for a special prosecutor to investigate Clinton and her family foundation during her time at the State Department. Now, earlier today, Clinton Campaign Manager Robby Mook responded to the new revelations this way.\n(BEGIN VIDEO CLIP)\nROBBY MOOK, CLINTON CAMPAIGN MANAGER: By our count, there were over 1700 other meetings that she had. You know, she was secretary of state. She was meeting with foreign officials and government officials constantly. So to pull all of them out of the equation, cherry-pick a very small number of meetings is pretty outrageous.\n(END VIDEO CLIP)\nBOLLING: Joining us now from Wilmington, North Carolina, Republican vice presidential nominee Mike Pence. Governor Pence, thanks for joining us. You heard Bobby Mook there, campaign manager --\nGOV. MIKE PENCE (R-IN), VICE PRESIDENTIAL NOMINEE: Hey, Eric.\nBOLLING: -- for Hillary saying, hey, there's cherry-picked data that the AP used. I don't know. Do you agree with that, disagree? Push back?\nPENCE: It really is extraordinary, Eric, that this cascade of controversies and new emails coming out each and every day are continuing to give further and further evidence of a direct connection between foreign contributors and corporate contributors to the Clinton Foundation and access and special favors granted by the State Department. I mean, Donald Trump and I have made it clear that this evidence cries out for action. The Clintons should immediately shut down the Clinton Foundation, not just if she gets elected president, and, frankly, the Obama administration should initiate an Independent special prosecutor immediately to get to the bottom of what's been going on.\nI mean, this is really remarkable. Now, the Clintons have actually admitted that there would be a conflict of interest if she became president of the United States so them accepting foreign contributions to the Clinton Foundation. But apparently, Eric, there was no conflict of interest when Hillary Clinton was the secretary of state of the United States involved in and directing all of America's diplomatic efforts. It just -- it makes no sense. No one is above the law.\nThe American people have a right to know the answers and to know what was going on here and Donald Trump and I are calling for immediate action by the administration to create an Independent special prosecutor and that would be the right thing for them to do.\nBOLLING: Governor, why do you think there is not much of an appetite by the Obama administration and his Department of Justice to, in fact, appoint a special prosecutor?\nPENCE: Well, we've just seen a course of conduct here. It was a couple of weeks ago that the latest tranche of emails came out that for the first time seemed to establish a direct connection between foreign contributors to the Clinton Foundation and access and favors by the State Department and a day later, you remember, Eric, we found out that the FBI had actually wanted to initiate a public corruption investigation into the Clinton Foundation but was shut down by other officials in the Justice Department or in the administration.\nThat's exactly what the special prosecutor statute is for. If the FBI is unable to take action on this, then that's what you appoint an independent special prosecutor for. That's what Donald Trump and I are calling on, and I think millions of Americans would support that call and we'll see if the President is willing to take the action.\nBOLLING: You know. President Obama early on, when he appointed asked Hillary Clinton to join the State Department said, we want you to keep the Clinton Foundation business separate from the State Department business. It doesn't seem like they did that very well, did they?\nPENCE: Well, you know, the so-called -- you know, separation or the wall between the State Department and the Clinton Foundation appears to be crumbling before our eyes. And frankly, Hillary Clinton is making light of it. It really is remarkable. The toughest interview she has done in a while was with Jimmy Kimmel and she joked that her emails were boring. But Eric, this is no laughing matter. This is the kind of pay to play politics that the American people are tired of and they deserve to know before early voting begins in just a matter of weeks what the truth of all of this is.\nAnd it's time for Hillary Clinton to come clean. It's time for the Clintons to shut down the Clinton Foundation but, more important than that, it's time for this administration to appoint an independent special prosecutor to look into what is increasingly obvious conflict of interest that existed between the Clinton Foundation.\nBOLLING: Conflict of interests is the nice way of saying, possibly pay to play, possibly illegal activity. In the corporate world if you were doing this as a board member ingratiating lining your own pocket on the basis of you work with the corporation, you would get thrown out and maybe thrown in jail. So let's turn to the next topic.\nPENCE: There was that other piece too, Eric -- there was that other piece too that we just found out. The A.P., I mean, hat tipped to the Associated Press for finding out that more than half of the private meetings that Secretary of State Clinton held during her tenure as America's top diplomat were with individuals who had contributed and interest that contributed more than $150 million to the Clinton Foundation. I mean that is just breath-taking.\nBecause you have to remember, your viewers need to remember, you know, foreigners cannot contribute to the American political process. And so the idea that the foreign contributions to the Clinton Foundation gained access to the very office of the Secretary of State is I think frankly is just shocking to the American people deserve to know what was going on.\nBOLLING: I have been looking into the Clinton Foundation for a long time. And I'm telling you, this hook on the company called Teneo Holdings. You will going to hear a lot more about Teneo Holdings going forward. But boy, this is that wall that you are talking about. They brought that wall right down. Teneo bridged the gap between those two worlds and it looks to me very, very fishy, shady, shadowing.\nSo, I will move onto the next topic. Your campaign, Donald Trump has been on the campaign trail courting the African-American vote and Hispanic vote. Let's take a listen.\n(BEGIN VIDEO CLIP)\nDONALD TRUMP (R), PRESIDENTIAL NOMINEE: To the African-American vote, great people. To the Hispanic voter, who had been absolutely treated terribly, I say, what do you have to lose? What? I will fix it. I will be able to make sure that when you walk down the street in your inner city or wherever you are, you are not going to be shot, your child isn't going to be shot.\n(END VIDEO CLIP)\nBOLLING: Okay, Governor. What are you going for? What number are you looking for? I think you are polling somewhere around eight percent of the black vote, somewhere around, 20, 22 percent Hispanic vote. What number do you need?\nPENCE: Donald Trump has made it clear that he wants to be president for all the people of the United States of America. His vision to make America great again, make America safe again. To make America work again is a vision for every American in every community in the city and on the farm. And I have got to tell you, I'm so proud to be standing shoulder to shoulder with this man who understands the Republican Party is the party of Lincoln.\nAbraham Lincoln, you know, led America through that great trial of the civil war and ended slavery once and for all. It was Abraham Lincoln who championed the end of the abomination of slavery and our party, I believe, I believe our party has to continue as my hero Jack Kemp used to say, continue to reach out with that opportunity vision to every American. Whether it's African-Americans or Hispanic Americans, everybody wants safe streets. They want good schools. They want more jobs. And Donald Trump and I are going to fight to bring that to every community.\nBOLLING: There was a marked pivot maybe about a week and a half, two weeks ago where he did, he turn the focus to African-Americans and Hispanics maybe with this somewhat of a softening position on immigration. Where did that come from? Who generated that pivot?\nPENCE: Well, I can tell you that the person running Donald Trump's campaign, the person writing Donald Trump's speeches is Donald Trump. I mean, what you get from Donald Trump and what I just saw here in North Carolina today again, Eric, is he has made a connection with the American people like no one in my lifetime since Ronald Reagan. And it's because quite a contrast with Hillary Clinton, he is a truth teller who speaks straight from his mind, straight from his heart and so I -- you know, I know many of the pundits and the political class want to see some sort of strategy that's at work.\nWhat can I tell you is, Donald Trump is speaking his mind straight to the American people. They hear him loud and clear. And I truly do believe the momentum in this campaign is extraordinary and it's going to carry us all the way to victory in November.\nBOLLING: All right. We're going to leave it there. Governor, before I let you go, I just want to point out to our audience here that manufacturing methods in North Carolina, tool and dye company. They're flourishing. They started at a small business, they expanded that's the reason you are there. And thank you very much for spending some time with us tonight.\nPENCE: Eric, this is a great success story. Started with that guy with two employees and we couldn't be more proud to be here.\nBOLLING: Yes, sir. All right. Thank you very much.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": ["ROBBY MOOK, CLINTON CAMPAIGN MANAGER: By our count, there were over 1700 other meetings that she had. You know, she was secretary of state. She was meeting with foreign officials and government officials constantly. So to pull all of them out of the equation, cherry-pick a very small number of meetings is pretty outrageous.", "DONALD TRUMP (R), PRESIDENTIAL NOMINEE: To the African-American vote, great people. To the Hispanic voter, who had been absolutely treated terribly, I say, what do you have to lose? What? I will fix it. I will be able to make sure that when you walk down the street in your inner city or wherever you are, you are not going to be shot, your child isn't going to be shot."], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" August 24, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nERIC BOLLING, FOX NEWS HOST: Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching us tonight. Governor Mike Pence, the Republican vice presidential nominee will join us in just a second. And there are many big developments in the presidential campaign to talk with him about, beginning with an Associated Press investigation finding that more than half the private individuals Hillary Clinton met with, as secretary of state were donors to the Clinton Foundation.\nThe report adding fuel to Donald Trump's calls earlier this week for a special prosecutor to investigate Clinton and her family foundation during her time at the State Department. Now, earlier today, Clinton Campaign Manager Robby Mook responded to the new revelations this way.\nBOLLING: Joining us now from Wilmington, North Carolina, Republican vice presidential nominee Mike Pence. Governor Pence, thanks for joining us. You heard Bobby Mook there, campaign manager --\nGOV. MIKE PENCE (R-IN), VICE PRESIDENTIAL NOMINEE: Hey, Eric.\nBOLLING: -- for Hillary saying, hey, there's cherry-picked data that the AP used. I don't know. Do you agree with that, disagree? Push back?\nPENCE: It really is extraordinary, Eric, that this cascade of controversies and new emails coming out each and every day are continuing to give further and further evidence of a direct connection between foreign contributors and corporate contributors to the Clinton Foundation and access and special favors granted by the State Department. I mean, Donald Trump and I have made it clear that this evidence cries out for action. The Clintons should immediately shut down the Clinton Foundation, not just if she gets elected president, and, frankly, the Obama administration should initiate an Independent special prosecutor immediately to get to the bottom of what's been going on.\nI mean, this is really remarkable. Now, the Clintons have actually admitted that there would be a conflict of interest if she became president of the United States so them accepting foreign contributions to the Clinton Foundation. But apparently, Eric, there was no conflict of interest when Hillary Clinton was the secretary of state of the United States involved in and directing all of America's diplomatic efforts. It just -- it makes no sense. No one is above the law.\nThe American people have a right to know the answers and to know what was going on here and Donald Trump and I are calling for immediate action by the administration to create an Independent special prosecutor and that would be the right thing for them to do.\nBOLLING: Governor, why do you think there is not much of an appetite by the Obama administration and his Department of Justice to, in fact, appoint a special prosecutor?\nPENCE: Well, we've just seen a course of conduct here. It was a couple of weeks ago that the latest tranche of emails came out that for the first time seemed to establish a direct connection between foreign contributors to the Clinton Foundation and access and favors by the State Department and a day later, you remember, Eric, we found out that the FBI had actually wanted to initiate a public corruption investigation into the Clinton Foundation but was shut down by other officials in the Justice Department or in the administration.\nThat's exactly what the special prosecutor statute is for. If the FBI is unable to take action on this, then that's what you appoint an independent special prosecutor for. That's what Donald Trump and I are calling on, and I think millions of Americans would support that call and we'll see if the President is willing to take the action.\nBOLLING: You know. President Obama early on, when he appointed asked Hillary Clinton to join the State Department said, we want you to keep the Clinton Foundation business separate from the State Department business. It doesn't seem like they did that very well, did they?\nPENCE: Well, you know, the so-called -- you know, separation or the wall between the State Department and the Clinton Foundation appears to be crumbling before our eyes. And frankly, Hillary Clinton is making light of it. It really is remarkable. The toughest interview she has done in a while was with Jimmy Kimmel and she joked that her emails were boring. But Eric, this is no laughing matter. This is the kind of pay to play politics that the American people are tired of and they deserve to know before early voting begins in just a matter of weeks what the truth of all of this is.\nAnd it's time for Hillary Clinton to come clean. It's time for the Clintons to shut down the Clinton Foundation but, more important than that, it's time for this administration to appoint an independent special prosecutor to look into what is increasingly obvious conflict of interest that existed between the Clinton Foundation.\nBOLLING: Conflict of interests is the nice way of saying, possibly pay to play, possibly illegal activity. In the corporate world if you were doing this as a board member ingratiating lining your own pocket on the basis of you work with the corporation, you would get thrown out and maybe thrown in jail. So let's turn to the next topic.\nPENCE: There was that other piece too, Eric -- there was that other piece too that we just found out. The A.P., I mean, hat tipped to the Associated Press for finding out that more than half of the private meetings that Secretary of State Clinton held during her tenure as America's top diplomat were with individuals who had contributed and interest that contributed more than $150 million to the Clinton Foundation. I mean that is just breath-taking.\nBecause you have to remember, your viewers need to remember, you know, foreigners cannot contribute to the American political process. And so the idea that the foreign contributions to the Clinton Foundation gained access to the very office of the Secretary of State is I think frankly is just shocking to the American people deserve to know what was going on.\nBOLLING: I have been looking into the Clinton Foundation for a long time. And I'm telling you, this hook on the company called Teneo Holdings. You will going to hear a lot more about Teneo Holdings going forward. But boy, this is that wall that you are talking about. They brought that wall right down. Teneo bridged the gap between those two worlds and it looks to me very, very fishy, shady, shadowing.\nSo, I will move onto the next topic. Your campaign, Donald Trump has been on the campaign trail courting the African-American vote and Hispanic vote. Let's take a listen.\nBOLLING: Okay, Governor. What are you going for? What number are you looking for? I think you are polling somewhere around eight percent of the black vote, somewhere around, 20, 22 percent Hispanic vote. What number do you need?\nPENCE: Donald Trump has made it clear that he wants to be president for all the people of the United States of America. His vision to make America great again, make America safe again. To make America work again is a vision for every American in every community in the city and on the farm. And I have got to tell you, I'm so proud to be standing shoulder to shoulder with this man who understands the Republican Party is the party of Lincoln.\nAbraham Lincoln, you know, led America through that great trial of the civil war and ended slavery once and for all. It was Abraham Lincoln who championed the end of the abomination of slavery and our party, I believe, I believe our party has to continue as my hero Jack Kemp used to say, continue to reach out with that opportunity vision to every American. Whether it's African-Americans or Hispanic Americans, everybody wants safe streets. They want good schools. They want more jobs. And Donald Trump and I are going to fight to bring that to every community.\nBOLLING: There was a marked pivot maybe about a week and a half, two weeks ago where he did, he turn the focus to African-Americans and Hispanics maybe with this somewhat of a softening position on immigration. Where did that come from? Who generated that pivot?\nPENCE: Well, I can tell you that the person running Donald Trump's campaign, the person writing Donald Trump's speeches is Donald Trump. I mean, what you get from Donald Trump and what I just saw here in North Carolina today again, Eric, is he has made a connection with the American people like no one in my lifetime since Ronald Reagan. And it's because quite a contrast with Hillary Clinton, he is a truth teller who speaks straight from his mind, straight from his heart and so I -- you know, I know many of the pundits and the political class want to see some sort of strategy that's at work.\nWhat can I tell you is, Donald Trump is speaking his mind straight to the American people. They hear him loud and clear. And I truly do believe the momentum in this campaign is extraordinary and it's going to carry us all the way to victory in November.\nBOLLING: All right. We're going to leave it there. Governor, before I let you go, I just want to point out to our audience here that manufacturing methods in North Carolina, tool and dye company. They're flourishing. They started at a small business, they expanded that's the reason you are there. And thank you very much for spending some time with us tonight.\nPENCE: Eric, this is a great success story. Started with that guy with two employees and we couldn't be more proud to be here.\nBOLLING: Yes, sir. All right. Thank you very much.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n"}