{"vcmId": "c925140b-2d79-4269-838f-62b5a30d2c40", "url": "http://www.foxnews.com/transcript/2016/06/16/paul-ryan-enters-no-spin-zone.html", "title": "Paul Ryan enters the 'No Spin Zone'", "description": "Speaker of the House joins 'The O'Reilly Factor' to discuss Donald Trump, radical Islam and more", "date": "2016-06-16T12:29:57Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" June 15, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nO'REILLY: \"Personal Story\" segment tonight, we are pleased to welcome the Speaker of the House Congressman Paul Ryan to The Factor. Yesterday, he said this.\n(BEGIN VIDEO CLIP)\nREP. PAUL RYAN (R-WI), SPEAKER OF THE HOUSE: I do not think a Muslim ban is in our country's interest. I do not think it is reflective of our principles not just as a party but as a country. And I think the smarter way to go in all respects is to have a security test and not a religious test.\n(END VIDEO CLIP)\nO'REILLY: Congressman Ryan joins us now from Washington.\nDon't you think that Americans have simply had enough of the Muslim deal and that's why Trump gets traction with his temporary ban? You know, he is mobilizing people in an emotional way to support him. That's what it is all about, is it not?\nRYAN: Well, sure, but if I'm going to ask a question, Bill, I'm going to give an honest answer. And the honest answer is I actually think a Muslim ban based on religion is counterproductive to our efforts to fight terrorism. More importantly, we believe in the First Amendment which is freedom of religion. So I really do think a security test, that's what we passed here in the House. We said you can't have the Syrian refugee program until you have a security test where you can properly vet every single person and we have passed that bill. It's sitting over in the senate. Harry Reid is filibustering it.\nO'REILLY: Meantime President Obama is bringing people in.\nRYAN: That is right. That's right. And we don't agree with that. That's right. And we passed a bill stopping it but based on not religion, based on security. And we don't have the kind of assurances we want to be secure about this. And that's why I call this a security test. Because it's not saying, look, anybody can come and say they are this or that. If they declare their religion to get into the United States, that doesn't really do much, does it? We need a security test.\nO'REILLY: We have a problem up in Minneapolis, Saint Paul have a problem there. And those are refugees from Somalia. So, and if God forbid, some refugee comes in and, you know, blows people up,.\nRYAN: Right.\nO'REILLY: You know, it's going to be grizzly. Now --\nRYAN: Right. Now, did we talk to -- that's why we passed a bill pausing this refugee program. We don't think the refugee program works. That's why we don't want it to continue right now.\nO'REILLY: With all due respect, I didn't even know Harry Reid was blocking that bill. You know, you guys have got to get out there and you got to bang the drum on this thing. Like him or not, Trump bangs that drum and you guys don't. I mean, I didn't know until you just told me tonight that Harry Reid, who is a villain, he blocked Kate's Law, is trying to block this. All right? Now we know. But you guys should be screaming at the top of your lungs.\nRYAN: We passed the bill in January.\nO'REILLY: When you met with Trump, did you discuss this Muslim ban thing?\nRYAN: Yes, we did. We discussed this and many, many other things. But we did discuss this Muslim ban thing. We just have a difference of opinion on it.\nO'REILLY: Okay. So, you are not going to move him, he is not going to move you. Now, last night we discussed the declaration of war. That if Congress would declare war on the Islamic jihadi and then name the groups that we are declaring war on, give the President and the military more power to deal with them. Has President Obama ever come to you, ever called you, ever texted you, any of his guys and said you know, this might be a good idea. Let's discuss it.\nRYAN: I haven't discussed this specifically with him in quite a while. I think I did a few months ago. We have discussed it. Here's the problem. I agree with what you just said, I think we should declare war on ISIS and every other one of these groups fresh authorization of the military force. Here's the problem. President Obama wants to tie the hands of the military. President Obama is saying that he will not accept an authorization of the military force that does not completely hamstring his successor and we are not going to do that.\nO'REILLY: If Congress declared war, you know, Congress has the power to declare war. So if Congress declares war, all right? Then, yes, he might be a bad commander-in-chief. Yes, he might blow it. But, that's all going to be on him then. You guys have done what you can do.\nRYAN: The point I'm making is, the only AMF he says he will accept is one that we find unacceptable which ties the hands of the military.\nO'REILLY: Let him veto it. You see what I'm talking about? I think Americans are angry. I think that they want action. And they don't --\nRYAN: I hear.\nO'REILLY: And they don't want to hear, we can't, we can't, we can't. Pass the declaration of war. If Reid tries to filibuster it in the Senate, then we will all know again that he is the big villain again. But you guys have got to show the American people that you really feel the way they feel. That these people have to be dealt with.\nRYAN: And I would encourage you to go to Better.GOP. Because at Better.GOP, we released a national security strategy last Thursday before Orlando, 67 recommendations on exactly what we should be doing to confront Islamic radical terrorism --\nO'REILLY: But the declaration of war is huge. Because NATO would have to come in. You know that that is a game changer. It's gone on too long. You know that Mr. Speaker. You know, we got hit in 2001.\nRYAN: 01.\nO'REILLY: 9/11 and now it's 15 years later. It's September. And we still have to deal with these pigs. And these savages. And I think that people, the American people are as angry as I have ever seen them in my lifetime. And I think that Congress has to reflect that now.\nRYAN: Talk about anger. Let me just -- we passed a bill last year calling for the President to give us a plan to defeat ISIS. What did he do? He sent us a few pages of talking points. He was phoning in on the war.\nO'REILLY: Yes. He doesn't have the -- he is only president for a few more months.\n(CROSSTALK)\nWe share that frustration.\nO'REILLY: Right. He is only president for a few more months. And you guys have got to mobilize.\nNow, when you are in session and you want a moment of silence for the victims of the terror killing in Orlando, then you have Democrats walk out of the chamber. Can you explain exactly what happened there so everybody knows?\nRYAN: Yes, sure. I think they were trying to bring attention to themselves to talk about gun control. I don't think after the worst terrorist attack since 9/11 the greatest mass shooting inspired. We know at least it was inspired by ISIS. I don't think the answer is to walk out. I think the answer is at a moment of silence to pay respect to those who are grieving to the victims and their loved ones and not to try and redirect attention to compromising law abiding citizens' Second Amendment rights.\nO'REILLY: But that's been the whole --\nRYAN: I think that's what they did. And I think they brought attention to themselves. And I don't think that that --\nO'REILLY: That's the whole strategy of the left though. Don't put it where it belongs on the ISIS doorstep.\nRYAN: Right.\nO'REILLY: And then tell the world it's America's fault because of the guns. We know the game they play. We know and I have to deal with this every day of my life. But specifically, the Congress people who walked out, what did they want you to do?\nRYAN: I don't think they want me to do -- they didn't want me to do anything because they knew they were in violation of the rules. They just want to bring attention to themselves on this issue.\nO'REILLY: But there was no bill they wanted? There was no debate they want to do have? It was a grandstand play.\nRYAN: That is right. It was a grandstand play around gun control legislation.\nO'REILLY: Okay. Now, you and I have talked before about Kate's law. And this ties into terrorism, too. Because right now we have a system where we can't protect Americans from violent criminal aliens who defy deportation four, five, six times.\nRYAN: Right. Right.\nO'REILLY: Who still can't protect Kate Steinle, a 32-year-old woman in San Francisco from being killed. Kate's law would make it easier for the authorities to apprehend foreign criminals, there the alleged shooter, okay? And it would also provide mandatory sentences just for defying deportation. And Congress can't get it done and the folks don't understand why.\nRYAN: Well, first of all, the guy shouldn't have been here in the first place if we actually enforced our immigration laws. That's point one. Point two, we have to take after sanctuary cities. We have to deal with and we have been doing this with the appropriations process. We have to deal with cities that are openly defying our immigration laws because that gives safe haven to people like this. So, that's point one, two. Point three, what we have to figure out is, how do we write Kate's law so that we are not clogging up our jails so much for say, DUI but for the true violent criminals --\nO'REILLY: Aggravated felon.\nRYAN: Yes. That is right. So, we need to get the details right so that we actually are going after the people that are doing this.\nO'REILLY: But it's almost a year and now the Steinle family is so broken hearted they are suing the federal government because the federal government won't write right the wrong. And I'm going to come back now --\nRYAN: We are going after sanctuary cities and the appropriation's process but we're having a problem with the President as well on that. So, thrust me.\nO'REILLY: You know what Kate's Law stand alone. Do something. See? Americans just want you to try. They want you to try. And if Obama doesn't do it or Reid doesn't do it, let them take it. You try. You do the right thing. I will give you the last word.\nRYAN: You know that we are trying. You know that we are -- the reason that we are so frustrated is because in this divided government, we can't pass our principled conservative reforms through into law. Forget about the filibuster. We can't even get the President to sign them into law. That is why we are offering an agenda that we are asking the American people, give us the kind of government to get these things into law. How do we keep ourselves safe? How do we grow the economy? How do we reduce intrusive government? How do we have National Security policy to keep us safe? How do we replace ObamaCare? Better.GOP. Because we're so frustrated. Because we can pass these bills over the House and (INAUDIBLE) the filibuster --\n(CROSSTALK)\nO'REILLY: You pass it in a heartbeat in the House. You know you will. Pass it. Then I can at least ram it down their throats.\nRYAN: Point taken. Point taken.\nO'REILLY: All right, Mr. Speaker. We appreciate it.\nRYAN: You bet. Thank you.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": ["REP. PAUL RYAN (R-WI), SPEAKER OF THE HOUSE: I do not think a Muslim ban is in our country's interest. I do not think it is reflective of our principles not just as a party but as a country. And I think the smarter way to go in all respects is to have a security test and not a religious test."], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" June 15, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nO'REILLY: \"Personal Story\" segment tonight, we are pleased to welcome the Speaker of the House Congressman Paul Ryan to The Factor. Yesterday, he said this.\nO'REILLY: Congressman Ryan joins us now from Washington.\nDon't you think that Americans have simply had enough of the Muslim deal and that's why Trump gets traction with his temporary ban? You know, he is mobilizing people in an emotional way to support him. That's what it is all about, is it not?\nRYAN: Well, sure, but if I'm going to ask a question, Bill, I'm going to give an honest answer. And the honest answer is I actually think a Muslim ban based on religion is counterproductive to our efforts to fight terrorism. More importantly, we believe in the First Amendment which is freedom of religion. So I really do think a security test, that's what we passed here in the House. We said you can't have the Syrian refugee program until you have a security test where you can properly vet every single person and we have passed that bill. It's sitting over in the senate. Harry Reid is filibustering it.\nO'REILLY: Meantime President Obama is bringing people in.\nRYAN: That is right. That's right. And we don't agree with that. That's right. And we passed a bill stopping it but based on not religion, based on security. And we don't have the kind of assurances we want to be secure about this. And that's why I call this a security test. Because it's not saying, look, anybody can come and say they are this or that. If they declare their religion to get into the United States, that doesn't really do much, does it? We need a security test.\nO'REILLY: We have a problem up in Minneapolis, Saint Paul have a problem there. And those are refugees from Somalia. So, and if God forbid, some refugee comes in and, you know, blows people up,.\nRYAN: Right.\nO'REILLY: You know, it's going to be grizzly. Now --\nRYAN: Right. Now, did we talk to -- that's why we passed a bill pausing this refugee program. We don't think the refugee program works. That's why we don't want it to continue right now.\nO'REILLY: With all due respect, I didn't even know Harry Reid was blocking that bill. You know, you guys have got to get out there and you got to bang the drum on this thing. Like him or not, Trump bangs that drum and you guys don't. I mean, I didn't know until you just told me tonight that Harry Reid, who is a villain, he blocked Kate's Law, is trying to block this. All right? Now we know. But you guys should be screaming at the top of your lungs.\nRYAN: We passed the bill in January.\nO'REILLY: When you met with Trump, did you discuss this Muslim ban thing?\nRYAN: Yes, we did. We discussed this and many, many other things. But we did discuss this Muslim ban thing. We just have a difference of opinion on it.\nO'REILLY: Okay. So, you are not going to move him, he is not going to move you. Now, last night we discussed the declaration of war. That if Congress would declare war on the Islamic jihadi and then name the groups that we are declaring war on, give the President and the military more power to deal with them. Has President Obama ever come to you, ever called you, ever texted you, any of his guys and said you know, this might be a good idea. Let's discuss it.\nRYAN: I haven't discussed this specifically with him in quite a while. I think I did a few months ago. We have discussed it. Here's the problem. I agree with what you just said, I think we should declare war on ISIS and every other one of these groups fresh authorization of the military force. Here's the problem. President Obama wants to tie the hands of the military. President Obama is saying that he will not accept an authorization of the military force that does not completely hamstring his successor and we are not going to do that.\nO'REILLY: If Congress declared war, you know, Congress has the power to declare war. So if Congress declares war, all right? Then, yes, he might be a bad commander-in-chief. Yes, he might blow it. But, that's all going to be on him then. You guys have done what you can do.\nRYAN: The point I'm making is, the only AMF he says he will accept is one that we find unacceptable which ties the hands of the military.\nO'REILLY: Let him veto it. You see what I'm talking about? I think Americans are angry. I think that they want action. And they don't --\nRYAN: I hear.\nO'REILLY: And they don't want to hear, we can't, we can't, we can't. Pass the declaration of war. If Reid tries to filibuster it in the Senate, then we will all know again that he is the big villain again. But you guys have got to show the American people that you really feel the way they feel. That these people have to be dealt with.\nRYAN: And I would encourage you to go to Better.GOP. Because at Better.GOP, we released a national security strategy last Thursday before Orlando, 67 recommendations on exactly what we should be doing to confront Islamic radical terrorism --\nO'REILLY: But the declaration of war is huge. Because NATO would have to come in. You know that that is a game changer. It's gone on too long. You know that Mr. Speaker. You know, we got hit in 2001.\nRYAN: 01.\nO'REILLY: 9/11 and now it's 15 years later. It's September. And we still have to deal with these pigs. And these savages. And I think that people, the American people are as angry as I have ever seen them in my lifetime. And I think that Congress has to reflect that now.\nRYAN: Talk about anger. Let me just -- we passed a bill last year calling for the President to give us a plan to defeat ISIS. What did he do? He sent us a few pages of talking points. He was phoning in on the war.\nO'REILLY: Yes. He doesn't have the -- he is only president for a few more months.\n(CROSSTALK)\nWe share that frustration.\nO'REILLY: Right. He is only president for a few more months. And you guys have got to mobilize.\nNow, when you are in session and you want a moment of silence for the victims of the terror killing in Orlando, then you have Democrats walk out of the chamber. Can you explain exactly what happened there so everybody knows?\nRYAN: Yes, sure. I think they were trying to bring attention to themselves to talk about gun control. I don't think after the worst terrorist attack since 9/11 the greatest mass shooting inspired. We know at least it was inspired by ISIS. I don't think the answer is to walk out. I think the answer is at a moment of silence to pay respect to those who are grieving to the victims and their loved ones and not to try and redirect attention to compromising law abiding citizens' Second Amendment rights.\nO'REILLY: But that's been the whole --\nRYAN: I think that's what they did. And I think they brought attention to themselves. And I don't think that that --\nO'REILLY: That's the whole strategy of the left though. Don't put it where it belongs on the ISIS doorstep.\nRYAN: Right.\nO'REILLY: And then tell the world it's America's fault because of the guns. We know the game they play. We know and I have to deal with this every day of my life. But specifically, the Congress people who walked out, what did they want you to do?\nRYAN: I don't think they want me to do -- they didn't want me to do anything because they knew they were in violation of the rules. They just want to bring attention to themselves on this issue.\nO'REILLY: But there was no bill they wanted? There was no debate they want to do have? It was a grandstand play.\nRYAN: That is right. It was a grandstand play around gun control legislation.\nO'REILLY: Okay. Now, you and I have talked before about Kate's law. And this ties into terrorism, too. Because right now we have a system where we can't protect Americans from violent criminal aliens who defy deportation four, five, six times.\nRYAN: Right. Right.\nO'REILLY: Who still can't protect Kate Steinle, a 32-year-old woman in San Francisco from being killed. Kate's law would make it easier for the authorities to apprehend foreign criminals, there the alleged shooter, okay? And it would also provide mandatory sentences just for defying deportation. And Congress can't get it done and the folks don't understand why.\nRYAN: Well, first of all, the guy shouldn't have been here in the first place if we actually enforced our immigration laws. That's point one. Point two, we have to take after sanctuary cities. We have to deal with and we have been doing this with the appropriations process. We have to deal with cities that are openly defying our immigration laws because that gives safe haven to people like this. So, that's point one, two. Point three, what we have to figure out is, how do we write Kate's law so that we are not clogging up our jails so much for say, DUI but for the true violent criminals --\nO'REILLY: Aggravated felon.\nRYAN: Yes. That is right. So, we need to get the details right so that we actually are going after the people that are doing this.\nO'REILLY: But it's almost a year and now the Steinle family is so broken hearted they are suing the federal government because the federal government won't write right the wrong. And I'm going to come back now --\nRYAN: We are going after sanctuary cities and the appropriation's process but we're having a problem with the President as well on that. So, thrust me.\nO'REILLY: You know what Kate's Law stand alone. Do something. See? Americans just want you to try. They want you to try. And if Obama doesn't do it or Reid doesn't do it, let them take it. You try. You do the right thing. I will give you the last word.\nRYAN: You know that we are trying. You know that we are -- the reason that we are so frustrated is because in this divided government, we can't pass our principled conservative reforms through into law. Forget about the filibuster. We can't even get the President to sign them into law. That is why we are offering an agenda that we are asking the American people, give us the kind of government to get these things into law. How do we keep ourselves safe? How do we grow the economy? How do we reduce intrusive government? How do we have National Security policy to keep us safe? How do we replace ObamaCare? Better.GOP. Because we're so frustrated. Because we can pass these bills over the House and (INAUDIBLE) the filibuster --\n(CROSSTALK)\nO'REILLY: You pass it in a heartbeat in the House. You know you will. Pass it. Then I can at least ram it down their throats.\nRYAN: Point taken. Point taken.\nO'REILLY: All right, Mr. Speaker. We appreciate it.\nRYAN: You bet. Thank you.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n"}