{"vcmId": "de1ac4a7-f661-4fdd-b753-2e8ac65a01f7", "url": "http://www.foxnews.com/transcript/2015/11/10/bill-oreilly-defamation-game.html", "title": "Bill O'Reilly: The defamation game", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/9", "date": "2015-11-10T20:12:17Z", "full_transcript": "Right now, it is Ben Carson and Senator Marco Rubio who are being marginalized in the American press. Both men, of course, seeking the presidency so aggressive reporting on them is certainly legitimate but defamation is not.\nTalking Points well knows the game. Back in 2001, Michael Kinsley a former editor at \"The L.A. Times\" wrote a column that said I faked my working class upbringing. Three years later the despicable Al Franken wrote a book accusing me of lying saying I did not grow up in Levittown, New York. Gleefully the mainstream media picked up Franken's incredible deceit calling me all kinds of names.\nThankfully, I still have the deed to my parent's home in Levittown, New York. You see it there on the screen. My mother got a big kick out of the whole thing but I didn't find it funny at all. And, of course, there was never any apologies. That's because Franken and Kinsley and their co- coconspirators were trying to destroy my reputation because The Factor was becoming very successful.\nSame thing happened earlier this year. Far left (inaudible) printed that I had exaggerated my reporting over the years. Again, I presented the evidence and The Factor's ratings actually went up.\nNow Dr. Ben Carson and Marco Rubio are experiencing the same thing.\nLet's take Senator Rubio first. There's no question that he has had financial problems in the past. He is the father of two boys and two girls who have been educated in private schools. That costs money.\nMr. Rubio while a member of the Florida house used a Republican Party credit card to pay some bills, about $22,000 of personal expenses were charged to that card. Senator says he paid the amount with his own money. He reimbursed the card. At this point there is no evidence to contradict that statement.\nSo Talking Points will leave it to you, fair-minded Americans, to decide whether or not Rubio's financial history is a big issue. But the media certainly has made a big deal out of it, almost as big a deal as Hillary Clinton's financial situation surrounding the Clinton Foundation.\nAs you may know, she served as secretary of state for more than four years. During that time the Clinton Foundation brought in nearly $500 million in revenue -- much of that money from overseas concerns. Conflict of interest -- you make the call.\nBut Talking Points will say this with certainty: Rubio $22,000 -- Hillary Clinton $500 million.\nNow, on to Ben Carson. There is a bunch of small ball stuff in play. CNN says they can't find anybody to confirm that Carson was an angry child. Yet in a 1997 \"Parade Magazine\" article the doctor's mother confirmed attempted stabbing incident by him.\nThe \"Wall Street Journal\" says it can't corroborate the doctor's claims that he protected white students during a school fracas. Finally the Journal says Carson's explanation of a psychology exam at Yale doesn't exactly stack up. But the Carson campaign has produced an article by the Yale student newspaper that gives Dr. Carson some cover. Ok, fine.\nBut is this really important? Remember a couple of weeks ago Hillary Clinton testified in front of a house committee that she gave separate explanations of the Benghazi terror attack that killed four Americans -- remember that? Privately, Mrs. Clinton told people it was an organized terrorist action; publicly she went along with President Obama and blamed it on a videotape.\nSo Dr. Carson is on the defensive about a number of tiny things in his life while Mrs. Clinton largely got a pass on the entire Benghazi situation by the press.\nDoes that make any sense to anyone? Now, some of you have might accuse me of being partisan -- that is false. If Dr. Carson has proved to be a deceiver I will say that. If Marco Rubio used GOP money to pay private bills, I will report that, no problem.\nBut it is now an industry in America to try to defame individuals with whom you disagree. George Will tried to pull that stunt on Friday. We confronted him. We will have your reaction in our mail segment a bit later on.\nOn the Dr. Carson front we'll give you some reaction from fair people. First columnist Kimberley Strassel who writes for the \"Wall Street Journal\".\n(BEGIN VIDEO CLIP)\nKIMBERLEY STRASSEL, \"WALL STREET JOURNAL\": There is a difference between betting and vendetta and I think that a lot of times when it comes to the press and they are looking at conservative candidates they get this treatment that just nobody else gets. And it's --\nCHRIS WALLACE, FOX NEWS HOST: Well, I'm curious, do you think that examining whether or not he was offered a scholarship to West Point, trying to find out the truth of that, is that a vendetta or vetting?\nSTRASSEL: That's probably something worth looking at.\n(END VIDEO CLIP)\nO'REILLY: And we have looked at it. The West Point thing is simply a matter of imprecise language. We see no attempt to deceive by Dr. Carson. Could be wrong but I have looked at it pretty hard.\nAs Talking Points stated on Friday it is simple to find people who'll say anything about what happened 50 years ago.\nEvaluating its own reporting the \"Wall Street Journal\" editorialized this way today, quote: \"Our view is that voters will decide what is or isn't a voting issue and conservatives shouldn't play the Clinton game of claiming that challenges to credibility are out of bounds. But the CNN politico stories don't strike us as all that damaging much less disqualifying, and neither one undermines the truth of Mr. Carson's rise from poverty to the pinnacle of the medical profession,\" quote.\nNow that editorial strikes me as logical. No political candidate is perfect. Ben Carson has written nine books, given thousands of speeches, done thousands of interviews. Same thing with Hillary Clinton who also got hammered for misremembering her history -- you may remember she told the world she was under sniper fire in Bosnia, that turned out to be false. Yet, Mrs. Clinton will secure the Democratic nomination for the presidency because voters know not everybody is perfect and enough far left leaning Americans like her so that she will be the nominee.\nOne final thing you may remember that President Obama birth certificate controversy. Some Americans claim without any evidence at all that the President was not born in the U.S.A. We investigated. The Factor investigated and here's what we said four and a half years ago.\n(BEGIN VIDEO CLIP)\nO'REILLY: The state of Hawaii has once again said Mr. Obama's birth certificate is on file. A certificate of live birth has been released. Factor investigation also showed Mr. Obama was born in a Honolulu hospital and we stand by our reporting.\n(END VIDEO CLIP)\nO'REILLY: So once again, Talking Points does not analyze from a partisan point of view. We're in the truth business here. And the truth is that Barack Obama was born in Honolulu. His father abandoned the family. His mother kind of a hippy and then took the young boy to Indonesia. Barack returned to Hawaii, was raised primarily by his grandparents and rose up to become president of the United States.\nHe is not a Muslim, he's not a Manchurian candidate; he's simply a politician. While we have been very critical of Mr. Obama's tenure in office and we believe the country has been weakened by it. We do not play foolish games here.\nAnd we suggest to the left wing press that it follow our example. That's “The Memo”.", "video_clips": ["KIMBERLEY STRASSEL, \"WALL STREET JOURNAL\": There is a difference between betting and vendetta and I think that a lot of times when it comes to the press and they are looking at conservative candidates they get this treatment that just nobody else gets. And it's --CHRIS WALLACE, FOX NEWS HOST: Well, I'm curious, do you think that examining whether or not he was offered a scholarship to West Point, trying to find out the truth of that, is that a vendetta or vetting?STRASSEL: That's probably something worth looking at.", "O'REILLY: The state of Hawaii has once again said Mr. Obama's birth certificate is on file. A certificate of live birth has been released. Factor investigation also showed Mr. Obama was born in a Honolulu hospital and we stand by our reporting."], "remaining_transcript": "Right now, it is Ben Carson and Senator Marco Rubio who are being marginalized in the American press. Both men, of course, seeking the presidency so aggressive reporting on them is certainly legitimate but defamation is not.\nTalking Points well knows the game. Back in 2001, Michael Kinsley a former editor at \"The L.A. Times\" wrote a column that said I faked my working class upbringing. Three years later the despicable Al Franken wrote a book accusing me of lying saying I did not grow up in Levittown, New York. Gleefully the mainstream media picked up Franken's incredible deceit calling me all kinds of names.\nThankfully, I still have the deed to my parent's home in Levittown, New York. You see it there on the screen. My mother got a big kick out of the whole thing but I didn't find it funny at all. And, of course, there was never any apologies. That's because Franken and Kinsley and their co- coconspirators were trying to destroy my reputation because The Factor was becoming very successful.\nSame thing happened earlier this year. Far left (inaudible) printed that I had exaggerated my reporting over the years. Again, I presented the evidence and The Factor's ratings actually went up.\nNow Dr. Ben Carson and Marco Rubio are experiencing the same thing.\nLet's take Senator Rubio first. There's no question that he has had financial problems in the past. He is the father of two boys and two girls who have been educated in private schools. That costs money.\nMr. Rubio while a member of the Florida house used a Republican Party credit card to pay some bills, about $22,000 of personal expenses were charged to that card. Senator says he paid the amount with his own money. He reimbursed the card. At this point there is no evidence to contradict that statement.\nSo Talking Points will leave it to you, fair-minded Americans, to decide whether or not Rubio's financial history is a big issue. But the media certainly has made a big deal out of it, almost as big a deal as Hillary Clinton's financial situation surrounding the Clinton Foundation.\nAs you may know, she served as secretary of state for more than four years. During that time the Clinton Foundation brought in nearly $500 million in revenue -- much of that money from overseas concerns. Conflict of interest -- you make the call.\nBut Talking Points will say this with certainty: Rubio $22,000 -- Hillary Clinton $500 million.\nNow, on to Ben Carson. There is a bunch of small ball stuff in play. CNN says they can't find anybody to confirm that Carson was an angry child. Yet in a 1997 \"Parade Magazine\" article the doctor's mother confirmed attempted stabbing incident by him.\nThe \"Wall Street Journal\" says it can't corroborate the doctor's claims that he protected white students during a school fracas. Finally the Journal says Carson's explanation of a psychology exam at Yale doesn't exactly stack up. But the Carson campaign has produced an article by the Yale student newspaper that gives Dr. Carson some cover. Ok, fine.\nBut is this really important? Remember a couple of weeks ago Hillary Clinton testified in front of a house committee that she gave separate explanations of the Benghazi terror attack that killed four Americans -- remember that? Privately, Mrs. Clinton told people it was an organized terrorist action; publicly she went along with President Obama and blamed it on a videotape.\nSo Dr. Carson is on the defensive about a number of tiny things in his life while Mrs. Clinton largely got a pass on the entire Benghazi situation by the press.\nDoes that make any sense to anyone? Now, some of you have might accuse me of being partisan -- that is false. If Dr. Carson has proved to be a deceiver I will say that. If Marco Rubio used GOP money to pay private bills, I will report that, no problem.\nBut it is now an industry in America to try to defame individuals with whom you disagree. George Will tried to pull that stunt on Friday. We confronted him. We will have your reaction in our mail segment a bit later on.\nOn the Dr. Carson front we'll give you some reaction from fair people. First columnist Kimberley Strassel who writes for the \"Wall Street Journal\".\nO'REILLY: And we have looked at it. The West Point thing is simply a matter of imprecise language. We see no attempt to deceive by Dr. Carson. Could be wrong but I have looked at it pretty hard.\nAs Talking Points stated on Friday it is simple to find people who'll say anything about what happened 50 years ago.\nEvaluating its own reporting the \"Wall Street Journal\" editorialized this way today, quote: \"Our view is that voters will decide what is or isn't a voting issue and conservatives shouldn't play the Clinton game of claiming that challenges to credibility are out of bounds. But the CNN politico stories don't strike us as all that damaging much less disqualifying, and neither one undermines the truth of Mr. Carson's rise from poverty to the pinnacle of the medical profession,\" quote.\nNow that editorial strikes me as logical. No political candidate is perfect. Ben Carson has written nine books, given thousands of speeches, done thousands of interviews. Same thing with Hillary Clinton who also got hammered for misremembering her history -- you may remember she told the world she was under sniper fire in Bosnia, that turned out to be false. Yet, Mrs. Clinton will secure the Democratic nomination for the presidency because voters know not everybody is perfect and enough far left leaning Americans like her so that she will be the nominee.\nOne final thing you may remember that President Obama birth certificate controversy. Some Americans claim without any evidence at all that the President was not born in the U.S.A. We investigated. The Factor investigated and here's what we said four and a half years ago.\nO'REILLY: So once again, Talking Points does not analyze from a partisan point of view. We're in the truth business here. And the truth is that Barack Obama was born in Honolulu. His father abandoned the family. His mother kind of a hippy and then took the young boy to Indonesia. Barack returned to Hawaii, was raised primarily by his grandparents and rose up to become president of the United States.\nHe is not a Muslim, he's not a Manchurian candidate; he's simply a politician. While we have been very critical of Mr. Obama's tenure in office and we believe the country has been weakened by it. We do not play foolish games here.\nAnd we suggest to the left wing press that it follow our example. That's “The Memo”.\n"}