{"vcmId": "ea45bdee-cbe8-4941-b058-baf9555c5c8a", "url": "http://www.foxnews.com/transcript/2016/08/11/how-much-will-2nd-amendment-comments-impact-trump-campaign.html", "title": "How much will 2nd Amendment comments impact Trump campaign?", "description": "'The O'Reilly Factor' analyzes the Republican presidential candidate's defense of the controversial statement", "date": "2016-08-11T12:09:56Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" August 10, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nBOLLING: In the \"Impact\" segment tonight, the left not letting up on Donald Trump's Second Amendment comments. Liberal outrage is at a fevered pitch following his remarks yesterday.\n(BEGIN VIDEO CLIP)\nDONALD TRUMP, REPUBLICAN PRESIDENTIAL NOMINEE: Hillary wants to abolish, essentially abolish the Second Amendment. By the way, if she gets to pick.\n(CROWD BOOING)\nIf she gets to pick her judges, nothing you can do, folks. Although the Second Amendment people maybe there is, I don't know.\n(END VIDEO CLIP)\nBOLLING: Trump has made it clear he was talking about political action, not violence. Mrs. Clinton isn't buying that explanation and said so today.\n(BEGIN VIDEO CLIP)\nHILLARY CLINTON, DEMOCRATIC PRESIDENTIAL CANDIDATE: Yesterday we witnessed the latest in a long line of casual comments from Donald Trump that cross the line. And now his casual inciting of violence. Every single one of these incidents shows us that Donald Trump simply does not have the temperament to be president and commander-in-chief of the United States.\n(CHEERS AND APPLAUSE)\nSo the stakes have never been higher.\n(END VIDEO CLIP)\nBOLLING: But Hillary Clinton supporters ought to flashback to 2008, the presidential campaign when Clinton herself was accused at hinting at violence directed at her primary opponent then Senator Barack Obama.\n(BEGIN VIDEO CLIP)\nCLINTON: My husband did not wrap up the nomination in 1992 until he won the California primary somewhere in the middle of June, right? We all remember Bobby Kennedy was assassinated in June in California.\n(END VIDEO CLIP)\nBOLLING: Joining us now with reaction from Dallas, Trump campaign spokesperson Katrina Pierson and from Washington, Republican strategist Ashley Pratte. Now, Ashley, I'm going to put you on the spot. I know you are not Hillary person but you are anti-Trump person.\nASHLEY PRATTE, REPUBLICAN STRATEGIST: That's right.\nBOLLING: But I listen to Hillary Clinton and in 2008, remember, she was in -- she was up against Barack Obama and she was losing. This was May and she was losing. And the question was, should she drop out in the interest of unity, party unity? And she said I'm not dropping out, basically I'm paraphrasing, I'm not dropping out because anything can happen. And then she cited a month later in years back Bobby Kennedy was assassinated in the month of June while they were in the month of May. So, there was still time for something like that to happen. Please tell me, how is that any different than what Donald Trump said the other day on the Second Amendment?\nPRATTE: Well, it's a lot different. And I'm not going to defend something that she said as well as I'm not going to defend what he said last night. Look, Eric, a president's words are incredibly important. They can start words. They are important for global, you know, attitudes towards us and at the same time Donald Trump is the nominee for president of the United States. So when his language is as loose as it is, it is indefensible, as well as quite frankly pretty dangerous. And I think, you know, based off of what he said last night, his comments prove one of two things.\nEither that he is exceedingly reckless or that he is exceedingly unaware of the impact that his words do have on people. So joking, or not, he needs to really clarify what he is saying. But there seems to be a pattern with him because of the language that he chooses to use. His rallies, his comments have all incited violence in the past. We have seen his senior advisor from him say that Hillary Clinton belongs in a firing line. I mean, there have been statements made by the campaign that just seem to make it seem like a big joke, quite frankly.\nBOLLING: What about it, Katrina? Has the candidate decided that he is going to pivot? I mean, he doesn't strike me as the type of person that wants to pivot or will pivot but is this the plan?\nKATRINA PIERSON, TRUMP CAMPAIGN NATIONAL SPOKESPERSON: Well, I believe it was General Bob Scales who said war is not caused by hot air, which is what the never trumpers in the media would like for you to believe. And I will also note that the media, when these previous controversies, many of them made up by the media is that, well, the campaign would just respond more quickly and get it out of the way. Well, guess what? The campaign responded immediately clarifying those statements because Mr. Trump have always talked about Supreme Court picks and the Second Amendment because Hillary Clinton will pick up and put in horrible Supreme Court justices that will go after the Second Amendment piece by piece.\nSo this was really nothing new and it was clarified immediately. So the answer is, no, Donald Trump is not going to stop talking about the Supreme Court, he is not going to stop talking about the Second Amendment. And, look, the media and never Trumpers are going to sit there and they are going to wait and they're going to look for something right out of the DNC playbook that Wikileaks released on page six, message number one the theme violence. They look for it and they try to promote.\nPRATTE: Katrina.\nPIERSON: It's not going to work.\nPRATTE: Katrina, it is very important to note there one important thing that you said that he had to clarify. He is the tell it like it is candidate, right? Why is it that every time the campaign, including yourself, has to come out there and clarify what he said?\nPIERSON: Hey, Ash, Ash -- hold on. Hold on, guys. Because the media, the media will put out there any headline that they want. So, we absolutely have to clarify. They're not going to determine our message.\nBOLLING: Hold on one second, Ashley, Hillary Clinton had to clarify her comment. In 2008, the sound bite we played she had to come back very quickly and say, A, a try and clarify and say, what I intended and didn't intend and then said, and then apologized. But, you know, so, for Hillary Clinton to make the comment that Donald Trump shouldn't be using these words as you point out, she is guilty of the same thing.\nPRATTE: Yes. And that doesn't make one okay for the other to do.\nBOLLING: But we're down to two choices, Ashley.\nPRATTE: That's right. That's right. And the --\nBOLLING: Those are the only two choices we have left.\nPRATTE: And that's fine, Eric, but guess what? I think they are both temperamentally unfit. I think one is reckless, I think one is dangerous. And I think that goes both ways. The things that they say incite things and people that I don't think are great. But look, here is the issue here, the media held her accountable in `08 and he's holding him accountable for things he says. And maybe if they spend more time focusing on her emails in that whole scandal, if he didn't blow up every single thing and run his mouth. Because he's taking the --\nBOLLING: Yes. But you're assuming --\nPRATTE: -- deliberately because he flies off the handle.\nBOLLING: Ashley, you are assuming he meant violence. I'm going to give this to Katrina.\nPRATTE: I didn't --\nBOLLING: Go ahead, Katrina, am I wrong here?\nPIERSON: No, you're absolutely right. And that's my point. You know, as I have said earlier today, Donald Trump could sneeze and CNN would run a headline for four days saying that Donald Trump attacked the environment and then they would bring on a bipartisan EPA. Reporter saying that yes, he is trying to take out the world. I mean, this is the kind of nonsense and absurdity that we are dealing with on the Trump campaign from the media with the help of the Never Trump --\nPRATTE: He creates the absurdity.\n(CROSSTALK)\nPIERSON: We have been talking about espionage, devils and babies, for crying out loud when the real --\nPRATTE: He kicked one out of his rally.\nPIERSON: People that have been supporting these unconstitutional wars, arming the enemies, killing tens of thousands over the last few years and we're talking about Donald Trump being a threat to the United States? Are you kidding me?\nPRATTE: Because Katrina, the media would focus on those serious issues if, in fact, your candidate --\nPIERSON: No they wouldn't. No they wouldn't.\nPRATTE: -- didn't go out there and say stupid things.\nPIERSON: That is what we've seen in this campaign, Ashley.\nBOLLING: Okay. Ashley, let me ask you this, Ashley, we will do a segment later in the show talking about how the media treats both candidates. And Media Research Center tells us that there is five times the amount of coverage of Donald Trump's Second Amendment comments than there is about Hillary Clinton having Seddique Mateen, the Orlando terrorist' father sitting right behind her and her campaign really took a long time, if they even ever pushed back on having that guy in the audience.\nPRATTE: Now, maybe, if his comments weren't as ridiculous as they were and as inflammatory as they were, they would have spent more time or equal time covering it. But the point is, he is the one doing this to himself. He gets off message and then this is what ends up happening. And look, I, as a Republican for the last eight years, have joined in that messaging of blaming the liberal media because at times it can be hostile towards Republicans. But guess what? When someone needs to be called out for their outrageous rhetoric, it is their job to hold people accountable. So, yes, they should be doing the same thing for Trump and Clinton. But he does himself no favors by saying what he does in flying off the handle.\nBOLLING: Quick final thought, Katrina to you.\nPIERSON: Well, look, the operative, term Ashley just used is, maybe, maybe if this then that. That's simply not the case this election cycle. And it's not just the Media Research Center. Everyone, it's obvious, they are not even trying to hide it anymore that the media bias that's going on in this campaign.\nPRATTE: Your candidate has received significant coverage, Katrina, that it has benefited from it?\nPIERSON: It doesn't matter. It doesn't matter Ashley, what Mr. Trump says or does, they will find something to talk about. And as a Republican, you are sitting there helping Hillary Clinton, someone that actually defended.\nPRATTE: Nice spin, Katrina, I would rather help none of them get elected because they are both dangerous and reckless.\nBOLLING: All right. We'll leave it right there. We'll leave it right there.\nKatrina and Ashley great debate. Thank you very much.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": ["DONALD TRUMP, REPUBLICAN PRESIDENTIAL NOMINEE: Hillary wants to abolish, essentially abolish the Second Amendment. By the way, if she gets to pick.(CROWD BOOING)If she gets to pick her judges, nothing you can do, folks. Although the Second Amendment people maybe there is, I don't know.", "HILLARY CLINTON, DEMOCRATIC PRESIDENTIAL CANDIDATE: Yesterday we witnessed the latest in a long line of casual comments from Donald Trump that cross the line. And now his casual inciting of violence. Every single one of these incidents shows us that Donald Trump simply does not have the temperament to be president and commander-in-chief of the United States.(CHEERS AND APPLAUSE)So the stakes have never been higher.", "CLINTON: My husband did not wrap up the nomination in 1992 until he won the California primary somewhere in the middle of June, right? We all remember Bobby Kennedy was assassinated in June in California."], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" August 10, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nBOLLING: In the \"Impact\" segment tonight, the left not letting up on Donald Trump's Second Amendment comments. Liberal outrage is at a fevered pitch following his remarks yesterday.\nBOLLING: Trump has made it clear he was talking about political action, not violence. Mrs. Clinton isn't buying that explanation and said so today.\nBOLLING: But Hillary Clinton supporters ought to flashback to 2008, the presidential campaign when Clinton herself was accused at hinting at violence directed at her primary opponent then Senator Barack Obama.\nBOLLING: Joining us now with reaction from Dallas, Trump campaign spokesperson Katrina Pierson and from Washington, Republican strategist Ashley Pratte. Now, Ashley, I'm going to put you on the spot. I know you are not Hillary person but you are anti-Trump person.\nASHLEY PRATTE, REPUBLICAN STRATEGIST: That's right.\nBOLLING: But I listen to Hillary Clinton and in 2008, remember, she was in -- she was up against Barack Obama and she was losing. This was May and she was losing. And the question was, should she drop out in the interest of unity, party unity? And she said I'm not dropping out, basically I'm paraphrasing, I'm not dropping out because anything can happen. And then she cited a month later in years back Bobby Kennedy was assassinated in the month of June while they were in the month of May. So, there was still time for something like that to happen. Please tell me, how is that any different than what Donald Trump said the other day on the Second Amendment?\nPRATTE: Well, it's a lot different. And I'm not going to defend something that she said as well as I'm not going to defend what he said last night. Look, Eric, a president's words are incredibly important. They can start words. They are important for global, you know, attitudes towards us and at the same time Donald Trump is the nominee for president of the United States. So when his language is as loose as it is, it is indefensible, as well as quite frankly pretty dangerous. And I think, you know, based off of what he said last night, his comments prove one of two things.\nEither that he is exceedingly reckless or that he is exceedingly unaware of the impact that his words do have on people. So joking, or not, he needs to really clarify what he is saying. But there seems to be a pattern with him because of the language that he chooses to use. His rallies, his comments have all incited violence in the past. We have seen his senior advisor from him say that Hillary Clinton belongs in a firing line. I mean, there have been statements made by the campaign that just seem to make it seem like a big joke, quite frankly.\nBOLLING: What about it, Katrina? Has the candidate decided that he is going to pivot? I mean, he doesn't strike me as the type of person that wants to pivot or will pivot but is this the plan?\nKATRINA PIERSON, TRUMP CAMPAIGN NATIONAL SPOKESPERSON: Well, I believe it was General Bob Scales who said war is not caused by hot air, which is what the never trumpers in the media would like for you to believe. And I will also note that the media, when these previous controversies, many of them made up by the media is that, well, the campaign would just respond more quickly and get it out of the way. Well, guess what? The campaign responded immediately clarifying those statements because Mr. Trump have always talked about Supreme Court picks and the Second Amendment because Hillary Clinton will pick up and put in horrible Supreme Court justices that will go after the Second Amendment piece by piece.\nSo this was really nothing new and it was clarified immediately. So the answer is, no, Donald Trump is not going to stop talking about the Supreme Court, he is not going to stop talking about the Second Amendment. And, look, the media and never Trumpers are going to sit there and they are going to wait and they're going to look for something right out of the DNC playbook that Wikileaks released on page six, message number one the theme violence. They look for it and they try to promote.\nPRATTE: Katrina.\nPIERSON: It's not going to work.\nPRATTE: Katrina, it is very important to note there one important thing that you said that he had to clarify. He is the tell it like it is candidate, right? Why is it that every time the campaign, including yourself, has to come out there and clarify what he said?\nPIERSON: Hey, Ash, Ash -- hold on. Hold on, guys. Because the media, the media will put out there any headline that they want. So, we absolutely have to clarify. They're not going to determine our message.\nBOLLING: Hold on one second, Ashley, Hillary Clinton had to clarify her comment. In 2008, the sound bite we played she had to come back very quickly and say, A, a try and clarify and say, what I intended and didn't intend and then said, and then apologized. But, you know, so, for Hillary Clinton to make the comment that Donald Trump shouldn't be using these words as you point out, she is guilty of the same thing.\nPRATTE: Yes. And that doesn't make one okay for the other to do.\nBOLLING: But we're down to two choices, Ashley.\nPRATTE: That's right. That's right. And the --\nBOLLING: Those are the only two choices we have left.\nPRATTE: And that's fine, Eric, but guess what? I think they are both temperamentally unfit. I think one is reckless, I think one is dangerous. And I think that goes both ways. The things that they say incite things and people that I don't think are great. But look, here is the issue here, the media held her accountable in `08 and he's holding him accountable for things he says. And maybe if they spend more time focusing on her emails in that whole scandal, if he didn't blow up every single thing and run his mouth. Because he's taking the --\nBOLLING: Yes. But you're assuming --\nPRATTE: -- deliberately because he flies off the handle.\nBOLLING: Ashley, you are assuming he meant violence. I'm going to give this to Katrina.\nPRATTE: I didn't --\nBOLLING: Go ahead, Katrina, am I wrong here?\nPIERSON: No, you're absolutely right. And that's my point. You know, as I have said earlier today, Donald Trump could sneeze and CNN would run a headline for four days saying that Donald Trump attacked the environment and then they would bring on a bipartisan EPA. Reporter saying that yes, he is trying to take out the world. I mean, this is the kind of nonsense and absurdity that we are dealing with on the Trump campaign from the media with the help of the Never Trump --\nPRATTE: He creates the absurdity.\n(CROSSTALK)\nPIERSON: We have been talking about espionage, devils and babies, for crying out loud when the real --\nPRATTE: He kicked one out of his rally.\nPIERSON: People that have been supporting these unconstitutional wars, arming the enemies, killing tens of thousands over the last few years and we're talking about Donald Trump being a threat to the United States? Are you kidding me?\nPRATTE: Because Katrina, the media would focus on those serious issues if, in fact, your candidate --\nPIERSON: No they wouldn't. No they wouldn't.\nPRATTE: -- didn't go out there and say stupid things.\nPIERSON: That is what we've seen in this campaign, Ashley.\nBOLLING: Okay. Ashley, let me ask you this, Ashley, we will do a segment later in the show talking about how the media treats both candidates. And Media Research Center tells us that there is five times the amount of coverage of Donald Trump's Second Amendment comments than there is about Hillary Clinton having Seddique Mateen, the Orlando terrorist' father sitting right behind her and her campaign really took a long time, if they even ever pushed back on having that guy in the audience.\nPRATTE: Now, maybe, if his comments weren't as ridiculous as they were and as inflammatory as they were, they would have spent more time or equal time covering it. But the point is, he is the one doing this to himself. He gets off message and then this is what ends up happening. And look, I, as a Republican for the last eight years, have joined in that messaging of blaming the liberal media because at times it can be hostile towards Republicans. But guess what? When someone needs to be called out for their outrageous rhetoric, it is their job to hold people accountable. So, yes, they should be doing the same thing for Trump and Clinton. But he does himself no favors by saying what he does in flying off the handle.\nBOLLING: Quick final thought, Katrina to you.\nPIERSON: Well, look, the operative, term Ashley just used is, maybe, maybe if this then that. That's simply not the case this election cycle. And it's not just the Media Research Center. Everyone, it's obvious, they are not even trying to hide it anymore that the media bias that's going on in this campaign.\nPRATTE: Your candidate has received significant coverage, Katrina, that it has benefited from it?\nPIERSON: It doesn't matter. It doesn't matter Ashley, what Mr. Trump says or does, they will find something to talk about. And as a Republican, you are sitting there helping Hillary Clinton, someone that actually defended.\nPRATTE: Nice spin, Katrina, I would rather help none of them get elected because they are both dangerous and reckless.\nBOLLING: All right. We'll leave it right there. We'll leave it right there.\nKatrina and Ashley great debate. Thank you very much.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n"}