{"vcmId": "f3663c0e-9cf8-483a-afa1-e20a0822d977", "url": "http://www.foxnews.com/transcript/2017/02/07/exclusive-interview-with-president-trump-part-2.html", "title": "Exclusive interview with President Trump, Part 2", "description": "Bill and President Trump discuss immigration, Kate's Law and President Obama on 'The O'Reilly Factor'", "date": "2017-02-07T13:35:24Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" February 6, 2017. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nO'REILLY: Continuing now with our lead story, an interview with President Trump at the White House last Friday. As stated the talk is making headlines all over the world. Here is part two.\n(BEGIN VIDEO CLIP)\nO'REILLY: Now, this is a fascinating story. I just spent the week in California, as you know. They are now voting on whether they should become a sanctuary state. So, the state of California, led by Governor Jerry Brown is defying you, absolutely defying the President of the United States. So, California and the USA are on a collision course. How do you see it?\nTRUMP: Well, I think it is a ridiculous sanctuary cities as you know. I am very much opposed to sanctuary cities. They break crime, there are lots of problems. You do it very well with Kate and all of the other people you talk about on the show that I watch. I will tell you that sanctuary cities are -- they got a lot of problems, and if there is tremendous crime. A lot of people agree with me. This was a campaign issue. This isn't just brought up now. California in many ways is out of control, as you know. And from an economic standpoint, people are leaving California and going to Texas and other places that run in a different manner, but we will see what happens. We will certainly not stand for sanctuary even cities, let alone states.\nO'REILLY: You mentioned Kate's Law. Why do you think the Democratic Party opposes Kate's Law? It seems so logical.\nTRUMP: Yes. It's so logical. There are many things that are very logical, the tax cuts are logical but the Democrats who want to raise taxes --\nO'REILLY: But you didn't answer my question. Why do the Democrats oppose, oppose, protecting Americans from violent foreign criminals? Why?\nTRUMP: Because they think that is their voter.\nO'REILLY: You know what is fascinating, to watch you at the inauguration with Barack Obama. You guys seem to get along. All right? Would that be accurate?\nTRUMP: It's a very strange phenomenon. We get along. I don't know if he will admit this, but he likes me.\nO'REILLY: How do you know he likes you?\nTRUMP: I like him because I can feel it. You know, that is what I do in life, it's called like, I understand. Now, we had a rough campaign. He was fighting better for Hillary than she did. He was vicious during the campaign toward me, and I was vicious toward him. We said horrible things about each other. And then we hopped into the car and we drive down Pennsylvania Avenue together. We don't even talk about it. Politics is amazing.\nO'REILLY: What did you talk about?\nTRUMP: We talked about the country. We talked about the future of the country. I asked him about what you think our biggest problem is, and he told me that I can't tell you, but it's a problem. It's a military problem.\nO'REILLY: China?\nTRUMP: No, it's not China.\nO'REILLY: No?\nTRUMP: No, it is, he did mention -- because I did ask him, I said, what would you say one, two, three problems are? And the number one problem that he felt I was a little bit surprised but I fully understand --\nO'REILLY: But you can't tell us?\nTRUMP: I can't do that. I can't do that. Not for any other reason other than I don't think he would mind if I said it. I don't want to let that particular place know that that's the way he or I feel. But we had a great -- it was a great inauguration. I loved every minute of it, and I got along with him. In fact, people were sort of surprised. I finished, I turned around, he was smiling, I was smiling.\nO'REILLY: It was fascinating. But here's what was more fascinating. Right after you guys embraced, shook hands, all of that, you gave a speech. But your speech excoriated him. You basically took his administration apart, and he is sitting five feet away from you. In your mind, did you say, how is he reacting to this speech?\nTRUMP: See, I am an honest person, the country has a very, very deep- seated problems. We have to do something about it. And if you noticed, when I finish my speech, I turned around, shook his hand --\nO'REILLY: Yes. Absolutely.\nTRUMP: And he was very gracious. And smiling.\nO'REILLY: I don't know if he was happy with that.\nTRUMP: I don't know, but he seemed to be. But this isn't just a knock on him. We have been going down the wrong path for many years beyond him.\n(END VIDEO CLIP)\nO'REILLY: Now, tomorrow, I asked the President some personal questions about his White House experience so far. I think you will find it interesting.\nContent and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": ["O'REILLY: Now, this is a fascinating story. I just spent the week in California, as you know. They are now voting on whether they should become a sanctuary state. So, the state of California, led by Governor Jerry Brown is defying you, absolutely defying the President of the United States. So, California and the USA are on a collision course. How do you see it?TRUMP: Well, I think it is a ridiculous sanctuary cities as you know. I am very much opposed to sanctuary cities. They break crime, there are lots of problems. You do it very well with Kate and all of the other people you talk about on the show that I watch. I will tell you that sanctuary cities are -- they got a lot of problems, and if there is tremendous crime. A lot of people agree with me. This was a campaign issue. This isn't just brought up now. California in many ways is out of control, as you know. And from an economic standpoint, people are leaving California and going to Texas and other places that run in a different manner, but we will see what happens. We will certainly not stand for sanctuary even cities, let alone states.O'REILLY: You mentioned Kate's Law. Why do you think the Democratic Party opposes Kate's Law? It seems so logical.TRUMP: Yes. It's so logical. There are many things that are very logical, the tax cuts are logical but the Democrats who want to raise taxes --O'REILLY: But you didn't answer my question. Why do the Democrats oppose, oppose, protecting Americans from violent foreign criminals? Why?TRUMP: Because they think that is their voter.O'REILLY: You know what is fascinating, to watch you at the inauguration with Barack Obama. You guys seem to get along. All right? Would that be accurate?TRUMP: It's a very strange phenomenon. We get along. I don't know if he will admit this, but he likes me.O'REILLY: How do you know he likes you?TRUMP: I like him because I can feel it. You know, that is what I do in life, it's called like, I understand. Now, we had a rough campaign. He was fighting better for Hillary than she did. He was vicious during the campaign toward me, and I was vicious toward him. We said horrible things about each other. And then we hopped into the car and we drive down Pennsylvania Avenue together. We don't even talk about it. Politics is amazing.O'REILLY: What did you talk about?TRUMP: We talked about the country. We talked about the future of the country. I asked him about what you think our biggest problem is, and he told me that I can't tell you, but it's a problem. It's a military problem.O'REILLY: China?TRUMP: No, it's not China.O'REILLY: No?TRUMP: No, it is, he did mention -- because I did ask him, I said, what would you say one, two, three problems are? And the number one problem that he felt I was a little bit surprised but I fully understand --O'REILLY: But you can't tell us?TRUMP: I can't do that. I can't do that. Not for any other reason other than I don't think he would mind if I said it. I don't want to let that particular place know that that's the way he or I feel. But we had a great -- it was a great inauguration. I loved every minute of it, and I got along with him. In fact, people were sort of surprised. I finished, I turned around, he was smiling, I was smiling.O'REILLY: It was fascinating. But here's what was more fascinating. Right after you guys embraced, shook hands, all of that, you gave a speech. But your speech excoriated him. You basically took his administration apart, and he is sitting five feet away from you. In your mind, did you say, how is he reacting to this speech?TRUMP: See, I am an honest person, the country has a very, very deep- seated problems. We have to do something about it. And if you noticed, when I finish my speech, I turned around, shook his hand --O'REILLY: Yes. Absolutely.TRUMP: And he was very gracious. And smiling.O'REILLY: I don't know if he was happy with that.TRUMP: I don't know, but he seemed to be. But this isn't just a knock on him. We have been going down the wrong path for many years beyond him."], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" February 6, 2017. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nO'REILLY: Continuing now with our lead story, an interview with President Trump at the White House last Friday. As stated the talk is making headlines all over the world. Here is part two.\nO'REILLY: Now, tomorrow, I asked the President some personal questions about his White House experience so far. I think you will find it interesting.\nContent and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n"}