{"vcmId": "009861fe-5aba-4f04-a914-520eac393cb8", "url": "http://www.foxnews.com/transcript/2016/05/26/bill-oreilly-how-black-lives-matter-is-killing-americans.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>First, the stats, and they are stunning. Since the Ferguson chaos, murders in the USA's 15 largest cities are up close to 17 percent. And much higher in cities with large black populations. In Chicago, for example, this year alone, shootings up around 80 percent.. Why? Because Chicago police have stopped stopping suspicious people.</p>                \n                \r\n\n            \n                <p>So-called pedestrians stops are down 90 percent in the windy city. When you fail to police people proactively, people commit more crimes. The media will not spotlight that much of the violent crime in America is being committed right now by young black men. In fact, Black males between the ages of 14 and 17 commit homicide at a rate 10 times higher than White and Hispanic male teenagers combined. And Blacks of all ages commit homicide at a rate of eight times higher than Whites and Hispanics combined.</p>                \n                \r\n\n            \n                <p>Conclusion? There is a violent subculture in the African-American community that should be exposed and confronted. Enter the Black Lives Matter crew which roams around the country promoting a false narrative that American police officers are actively hunting down and killing blacks. Here's the truth. Police shot Whites at a rate of 50 percent in 2015. Police shot blacks at a rate of 26 percent. In addition, Black Lives Matter is now infringing on freedom of assembly and freedom of expression. In Chicago, at DePauw University, this happened Tuesday night.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Hello, darling.</p>                \n                \r\n\n            \n                <p><b>(Whistle)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Sir, please. Sir, please!</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: We need some help.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Sir, please? Sir, please.</p>                \n                \r\n\n            \n                <p><b>(CROWD CHANTING GET A JOB, GET A JOB, GET A JOB, GET A JOB!)</b></p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, there is no question Black Lives Matter is affecting what we do here in the USA. A new book by Heather McDonald entitled the war on cops have a new attack on law and order makes everyone less safe leaves out the threat from the radical group which oftenly attacks come stat, a policy placing police officers where violent crime is taking place. Here is a quote from Miss McDonald.</p>                \n                \r\n\n            \n                <p>\"In terms of economic stimulus alone no other government program has come close to this successive come stat. In New York City, businesses that had previously shunned drug infested areas now set-up shops there. Offering residents a choice in shopping and creating a demand for workers. Children could ride their bikes on city sidewalks without their mothers worrying they could be shot. But the crime victories of the last two decades and the moral support on which law and order depends are now in jeopardy, thanks to the falsehoods of the Black Lives Matter movement.\"</p>                \n                \r\n\n            \n                <p>So, summing up, thousands more Americans are being murdered because police are being more passive. Since the Ferguson situation and the Black Lives Matter protests. Talking Points believes every American should know that, should know the truth. Sympathetic media and many race hustlers are backing Black Lives Matter and the final indignity, members of the group have even been invited to the White House. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: How Black Lives Matter is killing Americans", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 5/25", "date": "2016-05-26T12:16:56Z"}