{"vcmId": "02064d1a-d840-4f04-8b5c-728b23554c98", "url": "http://www.foxnews.com/transcript/2015/12/14/rand-paul-strategy-for-war-on-terror.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 11, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Thanks for staying with us. I'm Eric Bolling in for Bill O'Reilly. And we continue with this special edition of the O'Reilly Factor, \"The War on Terror,\" the political equation. In the 2016 segment tonight, do any of the presidential candidates have a real strategy to win the war on Islamic terror? We just heard from Donald Trump defend his plan to temporarily ban Muslims from entering the country. He also wants to police the internet.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> We have to go see Bill Gates and a lot of different people that really understand what's happening. We have to talk to them maybe in certain areas, closing that internet up in some way. Somebody will say oh, freedom of speech. Freedom of speech. These are foolish people. We have a lot of foolish people. We have a lot of foolish people. We have got to maybe do something with the internet because they are recruiting by the thousands.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Joining us now from New Hampshire, Kentucky senator and presidential candidate Senator Rand Paul. So, Senator, are you one of those foolish people Donald Trump is talking about?</p>                \n                \r\n\n            \n                <p><b>SEN. RAND PAUL (R-KY), PRESIDENTIAL CANDIDATE: </b>Well, I think he was talking about the First Amendment. The first time I have heard people called foolish who want to defend your right to continue to have freedom of speech. I think it's one of our precious liberties and it scares me to think of an authoritarian getting in charge of our country who would say oh, we just need to, you know, police the internet and don't let people say things that we might disagree with. I think we need to defend the country but eliminating the things that we stand for like freedom of speech is not the way to go about it.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Now ISIS has been very active on the internet -- in the administration's pushed Facebook, Twitter, snap chat, whatever, to police themselves. Is that the way to go?</p>                \n                \r\n\n            \n                <p><b>PAUL</b>: It can be part of it. And I think we should do a good investigation. So, for example, I am all for looking at the records of terrorists. I have only asked for one thing that we ought to do which is constitutional. Ask a judge for a warrant, put an individual's name on it. So, I want to look at more records of individual terrorist suspects but I don't want to look every American's records. So, I think that's something that one of the things we fought the American Revolution over.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Senator, what do you think of Donald Trump's proposal, plan to at least temporarily ban all Muslims from coming to the country?</p>                \n                \r\n\n            \n                <p><b>PAUL:</b> Well, you know, I don't think we ought to have a religious test for who comes to the country but also, at the same time, I think Hillary Clinton saying or not being able to say who the enemy is, not declaring the words radical Islam is equally as bad. What I have proposed is actually a stoppage or a moratorium on immigration from about 34 countries that have radical Islamists or terrorist movements because we need to know who is coming here and what their intentions are. All 19 hijackers that came here on 9/11 came here legally through our immigration system and they came through loopholes that I don't believe we still are policing adequately --</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: So, can I ask you --</p>                \n                \r\n\n            \n                <p><b>PAUL: </b>-- to agree with the sentiment.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>-- about your plans? Is Saudi Arabia one of the 34 countries?</p>                \n                \r\n\n            \n                <p><b>PAUL:</b> Yes. There is about 34 countries. They are predominantly Islamic countries that have radical Jihadist movements. We also have countries like North Korea that are not Islamic. We also countries like Nigeria that are half Christian, half Islamic. We look where the terrorist threat is and we say, we do have to restrict that for now. But what I want is a system where --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Senator, until when?</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> You say for now. But until when? Is this is also a temporary ban on say, Saudis coming over or any of the other 34 country nationals?</p>                \n                \r\n\n            \n                <p><b>PAUL:</b> Yes. We have specific road items that we would have to get to. We would have to say that we are doing this with the immigration system. A 100 percent of the people coming in, we would have to know a 100 percent of the time that they are leaving on time. So, we have 11 million people in our country that came illegally and 40 percent of them overstayed their visa but we really don't know who they are. We don't know if any of them were potential terrorists. But we also have no intention, really of doing anything about it. So we have to fix our immigration system once and for all. For national security reasons. And I think the first line of defense is to defend your border.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Senator, I want to get this in here. It's likely to come up in the CNN debate next week. There are some out there saying that you won't be on that stage. What are your thoughts?</p>                \n                \r\n\n            \n                <p><b>PAUL:</b> Well, we think if they give us the same treatment that Carly Fiorina was given last time that you measure from debate to debate, that we actually do meet the criteria already. So, you know, we will have those discussions and we will see what comes from it. But we hope that we are treated fairly. I have every expectation that I will be treated fairly. But we want the same and equal treatment that other candidates have gotten in the past. We have a first tier campaign and we don't plan on being labeled by the mainstream media anything less.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> All right. We're going to have to leave it right there, Senator. Thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Rand Paul's strategy for the war on terror", "description": "GOP presidential hopeful joins 'The O'Reilly Factor' to discuss confronting Islamic extremism", "date": "2015-12-14T13:25:34Z"}