{"vcmId": "0226a170-225d-47f8-bed6-11a3d6710466", "url": "http://www.foxnews.com/transcript/2016/04/06/bill-oreilly-big-night-for-republican-party-in-particular.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>So, here I am on the election set. Very expensive as we await the vote tally from Wisconsin. Where the polls close in less than an hour. Important night for the GOP, if Donald Trump wins. He will likely get the nomination. If he loses in Wisconsin, much longer nominating process will kick in and Ted Cruz will pick up some steam. Both Cruz and Trump have called for John Kasich to drop out no matter what happens tonight. But that is not likely to happen.</p>                \n                \r\n\n            \n                <p>\"Wall Street Journal\" editorial today says that Governor Kasich made by his time until the convention in July hoping he can win the nomination on delegates who defect after the first ballot. It's all very complicated but Trump does not get the 1237 delegates needed, there will be a big fight in Cleveland, high noon drama. A non-Scientific poll on BillO'Reilly.com asked, should John Kasich quit the race? Seventy seven percent say, yes. Twenty three percent, no. Nearly 35,000 of you voted.</p>                \n                \r\n\n            \n                <p>But if you look at it from the governor's point of view, he thinks he has a chance if the controversial Trump and ideological Cruz do not have the delegates to win the nomination outright. Similar situation on the Democrat side. Bernie Sanders hanging tough knowing Hillary Clinton controls more delegates. But Mrs. Clinton has that FBI thing, that pesky thing that Is It Legal will define for us a bit later on. If Hillary is indicted over the email deal, Sanders believes he can win the nomination so why not hang on?</p>                \n                \r\n\n            \n                <p>The Trump campaign seems to understand that their guy has to broaden his base by being more specific. As Trump now says, he will stop Mexican nationals in the U.S.A. Both illegal and legal from sending U.S. dollars back home if Mexico does not contribute billions to building a border wall. Another controversial plan no doubt but one that goes beyond the general statement that Mexico will pay for the wall, that, I can tell you. American voters deserve specifics in a very important election. It looks like the Trump campaign is responding to that. Now, we have asked Mr. Trump to appear with us tomorrow and I hope he will be here. Summing up, Wisconsin matters. And we'll know what the voters think in less than 60 minutes. That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Big night for the Republican Party in particular", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 4/5", "date": "2016-04-06T12:10:57Z"}