{"vcmId": "0343fc90-df14-4266-9b7f-127c72645066", "url": "http://www.foxnews.com/transcript/2015/11/25/bill-oreilly-is-world-war-getting-closer.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>This morning in Turkey, Russian fighter jets shot out of the sky by the Turkish military. There is bad blood between Turkey, a member of NATO and Russia over the Syrian tyrant Assad. Turkey wants him out. Russia is propping him up as Putin has sent planes and troops into Syria to destroy anti-Assad forces.</p>                \n                \r\n\n            \n                <p>The chaos we are seeing in the Middle East is now reaching critical mass. With ISIS launching terror attacks directed from Syria and Russia now destroying American-supported assets on the ground. A world war while not probable is not inconceivable.</p>                \n                \r\n\n            \n                <p>Today, President Obama met with French President Hollande in Washington for some tough talk about the ISIS terror attack in Paris.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>It is a scourge that threatens all of us. And that's why for more than a year, the United States, France and our coalition of some 65 nations have been united in one mission, to destroy these ISIL terrorists and defeat their vial ideology.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So let's' get this on the record.</p>                \n                \r\n\n            \n                <p>For more than a year according to President Obama, 65 countries have been actively trying to defeat ISIS. 65. Yet, the savages still hold major cities in Iraq, have a command and control center in Raqqa, Syria, and are fanning out all over the world to kill innocent people.</p>                \n                \r\n\n            \n                <p>So you might say 65 nations are losing the fight against ISIS, or am I wrong?</p>                \n                \r\n\n            \n                <p>Anyone hoping for a robust anti-ISIS campaign announcement today was surely disappointed. The two presidents talked and talked and talked some more. Nothing concrete announced. No NATO declaration of war, no strategy on the ground, no new proposals. If ISIS was watching that press conference, they may have nodded off.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" believes the solution to the Syrian ISIS situation lies in NATO declaring war on the terror group. Mounting a ground force that would confront the savages where they live and establishing safe zones inside Syria and Iraq, where refugees could be protected so they wouldn't have to go all over the world.</p>                \n                \r\n\n            \n                <p>Surely, the 28 NATO countries could accomplish that, surely. Aided by other concerned nations around the world. But to put together that kind of a strategy requires leadership and muscle.</p>                \n                \r\n\n            \n                <p>The French president who wants the action doesn't have enough juice to do it alone and President Obama is M.I.A. on the NATO issue.</p>                \n                \r\n\n            \n                <p>So here's what's likely to happen. The ISIS killers will continue to ride out the bombings, will continue to export terror and will continue to laugh at the weakness of the west. Only after ISIS attacks America will anything change. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Is world war getting closer?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/24", "date": "2015-11-25T13:48:06Z"}