{"vcmId": "03d088a7-9e5f-4856-aad4-22286e190e15", "url": "http://www.foxnews.com/transcript/2015/11/06/politicians-and-pundits-going-on-entertainment-programs.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 5, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That, of course, will guarantee huge ratings for \"Saturday Night Live.\"</p>                \n                \r\n\n            \n                <p>Joining us from Miami, the purveyor of BernardGoldberg.com, Mr. Goldberg. So, if you are Trump's campaign manager and I'm sure he would love to have you, would you advise him to do \"Saturday Night Live\" and the late night shows and things like that?</p>                \n                \r\n\n            \n                <p><b>BERNARD GOLDBERG, FOX NEWS CONTRIBUTOR</b>: Yes, I think on balance, it's a bigger plus than a minus. Look, going on these comedy shows, these late night comedy shows gives a politician an opportunity to portray himself or herself in a different light. Not as a politician, but as a human being. And since the audiences for a lot of these shows, they are not up of news junkies, a lot of the people watching don't follow politics closely. So, if you play your cards right, you can come off as likeable which is important in life in general but for a politician, it's really important. And if you are going after a certain segment of the audience let's say the 20 somethings, you don't go on the Sunday morning talk shows, you go on Comedy Central or \"Saturday night live\" that's where they are.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So you expand your possibility for votes. But Ben Carson, he sees it a little bit differently. Roll the tape.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Right. Right.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Having been guest host on \"Saturday Night Live,\" does that interest you?</p>                \n                \r\n\n            \n                <p><b>DR. BEN CARSON (R), PRESIDENTIAL CANDIDATE:</b> No.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Why not?</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Because I think the presidency of the United States is a very serious thing and I don't even want to begin to put it in the light of comedy.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, does Carson have a point?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Yes. He is not the first person to say that. When Bill Clinton in 1992 went on the Arsenio Hall show with his shades and his tenor sax, there were people at the time who said the same thing that it's not presidential. And by the way, before that, Richard Nixon, who was a total stiff, went on laugh-in and he couldn't even get the line right. He was supposed to say sock it to me. After 100 takes he said, sock it to me? I mean, he couldn't even get the line right. But he came off as someone who was willing to make fun of himself and I think in an entertainment culture and we do live in an entertainment culture. While I understand Dr. Carson's position and those who thought Bill Clinton was not acting presidential, you know what? I think it's a net plus.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. They have got to be human beings. But you know what really outrages me and really makes me furious, when pundits go on these programs. Roll the tape.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Right.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. We have got to wise these people up, all right? So, here is the first demand. Stop complaining. You hurt my feelings. Come on. You guys are starting to sound like a bunch of Democrats out there.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>My last demand, Trump, you have got to take it down, man. You have got to take it down. How about a six, all right? Now, I know it's fun. I know it's fun. But blew out my TV speakers. If anybody gets to yell that loud on FOX News, it should be me.</p>                \n                \r\n\n            \n                <p><b>(END VIDEOCLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know that guy, he is just -- he is a publicity hound.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Look, who is the guy with Jimmy Fallon? Who is that guy --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know, some guy on some cable show.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Okay.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I mean the guy is just all over the place. He is an egomaniac.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: I have a theory on this. I have a theory on this. You have fine-tuned a reputation over the years of being yourself and that's -- let's just call it being brash. Let's just use one word. We can use more words but let's call it brash. But when you go on a show like that and people have an impression of you, some people like you, some people don't like you, you come off and you may have to bleep on what I am about to say. You come off as a nice guy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Oh, jeez.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> No, I know. I know, I apologize.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You ruined the whole gig here Goldberg. Come on!</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>I know. That's what I mean. You complete that. But people look at that and they say, you know, I thought this guy was the guy who was brash and loud and not nice in some people's minds. But, you know, you come off as sort of like fun and, again, a nice guy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I know.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> I think going on those shows is a plus. I mean there, may be some minuses if somebody blows it. If they do something stupid. You know, but on balance, it's a good thing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. Successful. And I have --</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Let me take that back. Not a good thing necessarily but it's a plus.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And I go on the shows. Once in a while I will go on a show that I don't really care for. But most of the people I talk to is people who I have a rapport with. And you are right. It reaches people that won't watch or don't watch cable news and then expands the base a little bit. Bernie Goldberg, everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Politicians and pundits going on entertainment programs", "description": "Bernie Goldberg weighs in on Donald Trump hosting SNL on 'The O'Reilly Factor'", "date": "2015-11-06T13:10:43Z"}