{"vcmId": "0481d981-73ff-4180-860d-2f565bdb3369", "url": "http://www.foxnews.com/transcript/2015/02/18/white-house-neglecting-major-terror-details.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 17, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Continuing now with our lead story: the holy war. Joining us here in New York, Father Gerald Murray, pastor of the Holy Family Church. And from Dallas, Pastor Robert Jeffress, author of the new book \"Countdown to the Apocalypse: Why ISIS and Ebola are only the beginning\".</p>                \n                \r\n\n            \n                <p>So Pastor, begin with you. Why do you think the White House neglected to mention the men beheaded in Libya were Christian?</p>                \n                \r\n\n            \n                <p><b>PASTOR ROBERT JEFFRESS, DALLAS FIRST BAPTIST CHURCH: </b>This is a part of a disturbing pattern. This president is continually lecturing us that we're not in a religious war against Islam.</p>                \n                \r\n\n            \n                <p>And while that's true, it's time for this president to get off of his high horse and acknowledge that radical Islam is in a religious war against us. And until we understand that, we won't understand where this is headed.</p>                \n                \r\n\n            \n                <p>These Islamists will not rest until they have exterminated every Jew and every Christian from the face of the earth. If you think that is hyperbole, just listen to what they said on that Libyan beach after they butchered those 21 Christians. They said we are headed to Rome next. And while Rome may be their next stop, I guarantee you it won't be their final stop.</p>                \n                \r\n\n            \n                <p>They are coming after every one of us as well if we don't stop them now.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. The President doesn't want to overreact to this crew ISIS and behind the scenes he is telling the American people, look, we are doing what we can to dismantle them. We are bombing them. We are using drones against terrorists. You know, we have an active alliance with 60 other nations to fight them.</p>                \n                \r\n\n            \n                <p>So, he is not ignoring the threat but he seems to be downplaying it. And, again, I'm not sure why he is doing it. Do you have the why, Pastor?</p>                \n                \r\n\n            \n                <p><b>JEFFRESS: </b>Well, I think part of it is the influence of Islam on his own life. He sees radical Islam as a tiny minority. And while that's true, a powerful minority is much more potent than a passive majority. And I just don't think he can acknowledge this branch of Islam and I think he's Neville Chamberlain approach -- if we can contain or ignore this threat it will go away.</p>                \n                \r\n\n            \n                <p>Bill, this is not going away.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So the Pope, you know, is not generally an activist, a political activist, comes out and looked to me like he was angry about what happened as he should be. I mean these people -- they were poor people, Father. These weren't activists or soldiers or anything like that. Poor people who went from Egypt to Libya to try to make a buck for their family and they rounded them up and they cut their heads off. I mean it doesn't get worse than that.</p>                \n                \r\n\n            \n                <p>So do you believe that the Pope will start to lead in the holy war? Will he take an active leadership as the secular leaders are receding?</p>                \n                \r\n\n            \n                <p><b>FR. GERALD MURRAY, HOLY FAMILY CHURCH: </b>I think the Pope will continue to say that the West has a duty to protect the innocent and fight this. And we have to recognize martyrdom is when you die for religious reasons. So the Pope is saying quite clearly ISIS is killing people because they think that's what God wants them to do. The Pope is saying the truth is God does not want this kind of murderous criminal behavior. It's up though to the leaders with armies like our president to get out there and fight them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But I wish he would say that. See he doesn't say that. And again, I'm being unfair to the Pope because it's not his job to, you know, control the world and run the world. If he would say something like that, Father, imagine the headlines, if he would say that America and the West has a moral obligation to neutralize or destroy the jihad. That would be an enormous story. But I don't see him doing that.</p>                \n                \r\n\n            \n                <p><b>MURRAY: </b>He did say back in the summer that we have to stop ISIS in reference to what's happening in Iraq and Syria. But, you know, let's face it, we don't have to wait for the Pope to tell us what to do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, we don't.</p>                \n                \r\n\n            \n                <p><b>MURRAY: </b>And you know the United States of America is the moral leader in world. Where is the moral leadership here?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>There isn't any.</p>                \n                \r\n\n            \n                <p><b>MURRAY:</b> This is ridiculous.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But Pastor Jeffress, Father Murray poses an interesting question, where is the moral leadership? There is no moral leadership in the entire world. It's not just Barack Obama. It's Europe, it's -- you know, the King of Jordan got outraged after his guy got burned to death and he started to do something. The Australian prime minister was outraged after they went to Sydney and gunned down people there.</p>                \n                \r\n\n            \n                <p>But a cohesive moral leadership does not exist on this earth. And I think that's the theme of your book, is it not?</p>                \n                \r\n\n            \n                <p><b>JEFFRESS: </b>It really is and Bill I believe in the prophecies of the Bible that things are going to get worse before the Lord returns but that is no excuse for fatalism. And I believe that Christians ought to be on the forefront of fighting this evil. And this is unmitigated evil.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No doubt about that.</p>                \n                \r\n\n            \n                <p><b>JEFFRESS:</b> Burning people alive. And listen that's why tonight I am calling on Christians everywhere. Catholics and Protestants together to join with our Jewish friends and demand that this president do whatever is necessary including boots on the ground to eradicate this cancer of ISIS and radical Islam before it destroys us.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You know I think that's a good idea. I think that's a good idea. I think all Christians, Jews and secularists who love their country and want to protect humanity should email and call the White House and say enough. Wouldn't that be a good idea? You would get behind that, wouldn't you?</p>                \n                \r\n\n            \n                <p><b>MURRAY:</b> Absolutely. Look, we don't maintain a military so they can stay in barracks. They are supposed to go out and defend us. People are being killed all the time by ISIS. We get complaints. I'm very happy that the Egyptians and Jordanians took some action. We need to take action.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. And we are not talking about occupation or anything like that. But I'm going to also make a call, gentlemen, and I hope you will be with me on this for every cleric in the country next Sunday, Saturday, Friday in the mosques with the imams to address this with their congregation and to say enough. We people of good faith have to tell our leader to get in gear. I would like to see every cleric in this country do that. You guys agree?</p>                \n                \r\n\n            \n                <p><b>MURRAY: </b>I'm going to talk about it, hallelujah.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Pastor, you're going to agree?</p>                \n                \r\n\n            \n                <p><b>JEFFRESS:</b> I'm with you, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Let's make that happen. And I want every pastor, every priest, every rabbi and every imam to email me personally and tell me you are going to do that. I will read as many on the air as I can.</p>                \n                \r\n\n            \n                <p>Gentlemen, thanks very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The White House neglecting major terror details", "description": "Pastor Robert Jeffress and Father Gerald Murray react to the White House making no mention of religion in their press release of Muslim extremists beheading 21 Coptic Christians", "date": "2015-02-18T13:30:17Z"}