{"vcmId": "058bad65-e177-458d-9c5a-0c811f9e3ea4", "url": "http://www.foxnews.com/transcript/2015/09/11/bill-oreilly-what-presidential-candidates-are-doing-wrong.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>This campaign season is and has been dominated by Donald Trump and that's not changing.</p>                \n                \r\n\n            \n                <p>New CNN poll of Republican and independent voters has Trump continuing to surge, now with 32 percent favoring him for the Presidential nomination. Dr. Ben Carson, who will be here shortly, is second 19 percent, up 10 points in less than a month. Jeb Bush has 9 percent. Ted Cruz 7. Mike Huckabee 5. Scott Walker 5. Carly Fiorina 3 percent. Rand Paul, Marco Rubio also at 3 percent. John Kasich and Chris Christie clock in at 2 percent each.</p>                \n                \r\n\n            \n                <p>So it is clear that Donald Trump is setting the pace. And his mistakes have not yet hurt him. Those mistakes come in two forms. First, he gets way too personal in defending himself against criticism. Latest \"Rolling Stone\" magazine article quotes him as disparaging Carly Fiorina's looks.</p>                \n                \r\n\n            \n                <p>Trump says he was just kidding. But a president can't do that and Donald Trump should be thinking of himself as a president. That's how you win. He is not a reality star anymore. Personal attacks get a lot of attention. But Trump doesn't need more attention. Everybody knows him. Instead of lobbing verbal grenades he should begin putting forth some incisive problem solving statements.</p>                \n                \r\n\n            \n                <p>Look, I have no beef with Trump or anybody else pointing out that America is losing power abroad and is chaotic at home. That's true. Problems are rarely solved in Washington. Poverty is on the rise. And many Americans are furious. Trump has brilliantly locked in on that. And his poll numbers show it. But it would serve him well to knock off the petty stuff and make better editorial decisions.</p>                \n                \r\n\n            \n                <p>\"Rolling Stone\" magazine? Was the \"Moscow Times\" not available? Why would you allow them access? They hate you -- Donald.</p>                \n                \r\n\n            \n                <p>Now, Ben Carson is the anti-Trump, but he needs to sharpen his message as well into sound bites that really bite. Getting into a faith controversy with Trump doesn't do the doctor any good. Comparing Obamacare to slavery is provocative but you need to hammer home your point or risk being demonized as an extremist by a largely dishonest national press.</p>                \n                \r\n\n            \n                <p>Carson is a good man who understands that traditional values provide far more success than politically correct madness which, indeed, does enslave. Carson needs to hone that message.</p>                \n                \r\n\n            \n                <p>Jeb Bush also a good man who did very well governing Florida. But his style is hurting him.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Having trouble sleeping at night? Too much energy? Need some low energy?</p>                \n                \r\n\n            \n                <p><b>JEB BUSH (R), PRESIDENTIAL CANDIDATE:</b> They have an HSA in some companies. Some companies don't. But I think the norm ought to be --</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>Jeb, for all your sleeping needs.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Trump ad against Bush. Now, I don't know the governor very well. But my advice is you have got to be more confrontational about things you believe are wrong. Show some passion.</p>                \n                \r\n\n            \n                <p>Passion is no problem for Ted Cruz and Mike Huckabee. Conservative guys who see America as a nation in steep social decline. But at this point their messages are not taking hold because of the Trump factor which almost obliterates standard ideological campaign rhetoric. Without Trump in the race, Cruz and Huckabee would be polling better.</p>                \n                \r\n\n            \n                <p>Carly Fiorina has run a very good campaign so far, establishing herself as the anti-Hillary Clinton and showing courage by taking on Trump. But most voters still don't know who she is. And her business record is dubious to enormous hurdles.</p>                \n                \r\n\n            \n                <p>Governors Kasich and Christie are trying to break through but having a hard time getting media attention because Trump is getting most of it. Both have to break out in next week's debate in order to establish some momentum which they do not -- do not have now.</p>                \n                \r\n\n            \n                <p>Rand Paul is done. His isolationist platform not appealing in the age of ISIS and Iran -- it's that simple.</p>                \n                \r\n\n            \n                <p>On the Democratic side Hillary Clinton's campaign is a mess. She should fire John Podesta and the political assassins she has embraced and put her husband in charge of her campaign. Mrs. Clinton often looks lost out there. She doesn't like confrontation. And has so many ethical problems she can hardly get a policy word out.</p>                \n                \r\n\n            \n                <p>Her speech yesterday on the Iranian nuke deal was actually incisive although I disagree with her contention that Iran will be contained. It won't be. Unless they are overthrown, we're going to have to fight the mullahs down the road. Israel knows that and most of our intelligence folks know that. We should not be giving Iran any tools to make that pernicious country even more powerful.</p>                \n                \r\n\n            \n                <p>Hillary Clinton may not understand this, but her associations matter. Allying herself with smear merchants and dishonest political hacks sends a strong message. Her smear merchants are now in a fight with the \"New York Times\" of all people. Again, Bill Clinton needs to take over that operation and fast.</p>                \n                \r\n\n            \n                <p>As far as Bernie Sanders is concerned, he is almost as entertaining as Trump. The old socialist warrior from Brooklyn burning up the stump by telling folks who are struggling capitalism is to blame. Of course, Bernie would drive this country into a depression if he ever got elected but he is not going to get elected.</p>                \n                \r\n\n            \n                <p>However, I give Bernie Sanders a lot of credit. He is a true believer who wants to do good. He just doesn't understand and never will understand that in a nation of 320 million people the free marketplace is where prosperity lies not in the tired halls of Washington, D.C.</p>                \n                \r\n\n            \n                <p>Finally, Vice President Biden, I expect to see him in the race shortly. Most likely after the Pope departs at the end of the month. Biden will probably announce then. Now, I could be wrong as Biden's emotional state is something no outsider can assess.</p>                \n                \r\n\n            \n                <p>The Vice President is a savvy player who has one huge stone around his neck. He is exactly the same as President Obama. There is no difference. All the polls say about two-thirds of Americans believe the country is going in the wrong direction and are not satisfied with the way the Obama administration has handled things. So Biden starts with a big deficit. And in a debate with Trump, for example, Biden would get hammered beyond belief but lay off his looks, ok, Donald?</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: What the Presidential candidates are doing wrong", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 9/10", "date": "2015-09-11T12:15:05Z"}