{"vcmId": "05e8325e-9c86-4d72-8dda-9bc9c858a49b", "url": "http://www.foxnews.com/transcript/2016/04/13/bill-oreilly-truth-about-political-promises.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As we reported last night, the rise of Donald Trump to the top echelons of the Republican Party is one of the most stunning political stories in the past century.</p>                \n                \r\n\n            \n                <p>Also, the campaign of Bernie Sanders is giving Hillary Clinton all she can handle, and who would have predicted that?</p>                \n                \r\n\n            \n                <p>The popularity of both men is based on promises, things they say they will do if elected president.</p>                \n                \r\n\n            \n                <p>Talking Points believes that many, perhaps most followers of Trump and Sanders do not really care whether the men can deliver.</p>                \n                \r\n\n            \n                <p>It's their tone, point of view, philosophy that is mesmerizing millions of voters.</p>                \n                \r\n\n            \n                <p>Because the truth is Sanders and Trump will not be able to do some of the things they are promising.</p>                \n                \r\n\n            \n                <p>We believe they want to do them, but they will not be able to overcome our political structure.<br> Let's take Donald Trump first.</p>                \n                \r\n\n            \n                <p>He says he will build a wall between the U.S.A. and Mexico. &#160;That is certainly possible.</p>                \n                \r\n\n            \n                <p>It will not be a continuous wall. &#160;There are natural barriers that will stop that.</p>                \n                \r\n\n            \n                <p>However, the construction of an effective barrier is possible and would happen if Trump is elected president:</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: &#8220;We are going to have a strong border &#8211; we are going to build a wall. &#160;It will be a real wall. &#160;A real wall! ((EDIT)) Who is going to pay for the wall?&#8221;</p>                \n                \r\n\n            \n                <p><b>CROWD:</b> &#8220;Mexico!&#8221;</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> &#8220;Who?&#8221;</p>                \n                \r\n\n            \n                <p><b>CROWD:</b> &#8220;Mexico!&#8221;</p>                \n                \r\n\n            \n                <p>One problem: Mexico will not pay for the wall no matter what a President Trump might threaten.</p>                \n                \r\n\n            \n                <p>His proposed action to stop Mexicans illegally in the USA from sending money back to their family and friends is impossible.</p>                \n                \r\n\n            \n                <p>No one can stop the mail.</p>                \n                \r\n\n            \n                <p>Mr. Trump also says he will deport perhaps as many as 12 million illegal aliens within two years.<br> Again, the courts would likely block a mass deportation and if they did not, each individual alien would have to have a court hearing before any action would be taken.</p>                \n                \r\n\n            \n                <p>Right now the average wait time for an immigration hearing is about two years.</p>                \n                \r\n\n            \n                <p>Realistically for a mass deportation to take place, hundreds of billions of dollars would have to be allotted. &#160;And even then, the actual movement of that many people would be unprecedented.</p>                \n                \r\n\n            \n                <p>And what about Mr. Trump's wish to temporarily ban Muslims who live in areas dominated by terrorism from coming to America.</p>                \n                \r\n\n            \n                <p>Again, the courts would likely block the action based on the equal protection clause, whereby you cannot single out a specific group for legislative action.</p>                \n                \r\n\n            \n                <p>Finally, Donald Trump wants to force China from devaluing its currency.</p>                \n                \r\n\n            \n                <p>He says if they do not stop that there will be a trade war.</p>                \n                \r\n\n            \n                <p>Here Mr. Trump is on solid ground.</p>                \n                \r\n\n            \n                <p>The trade deficit with China was $366 billion last year.</p>                \n                \r\n\n            \n                <p>That means they get all of those billions free and clear above what we are buying from them.</p>                \n                \r\n\n            \n                <p>Donald Trump could certainly renegotiate this appalling situation. &#160;That is a job killer for Americans.</p>                \n                \r\n\n            \n                <p>On the Bernie Sanders front, it is a similar situation.</p>                \n                \r\n\n            \n                <p>He says he will break up the big banks:</p>                \n                \r\n\n            \n                <p><b>SANDERS:</b> &#8220;They are too powerful economically, they are too powerful politically. &#160;And that is what I believe, and many economists believe. &#160;Time to break them up.&#8221; Of course the courts would stop that. &#160;The only way the federal government can destroy a banking concern is if it poses \"a grave threat to the financial stability of the United States.\"</p>                \n                \r\n\n            \n                <p>No president can break up any private enterprise unless there is a drastic reason to do so, and<br> then the federal apparatus would have to approve, not a single individual like a president.</p>                \n                \r\n\n            \n                <p>Senator Sanders is also proposing much higher taxes for just about everybody in the country.</p>                \n                \r\n\n            \n                <p>But he would never get that through Congress if Republicans hold even 40 senators in that chamber.<br> The GOP would block any drastic tax increase.</p>                \n                \r\n\n            \n                <p>Sanders says he will defeat ISIS by somehow convincing the Muslim nations of Saudi Arabia, Turkey, Jordan and the Emirates to launch ground attacks against the terror group.</p>                \n                \r\n\n            \n                <p>You can file this under amazing, fantasy, or, to be more kind, wishful thinking.</p>                \n                \r\n\n            \n                <p>Only if the West leads would anti-ISIS Muslim nations initiate ground action.</p>                \n                \r\n\n            \n                <p>Finally Senator Sanders wants to add $14 trillion in government spending over a 10-year period to provide healthcare run by the government.</p>                \n                \r\n\n            \n                <p>The national debt is now approaching $20 trillion, so, again, this is a dangerous fantasy.</p>                \n                \r\n\n            \n                <p>Sanders says he would raise taxes on business and workers to pay for the $14 trillion, but nearly every single analysis of the subject says the new taxes would not even come close to covering the health expense.</p>                \n                \r\n\n            \n                <p>An out of control national debt could collapse the U.S. economy, and punitive taxation would likely strangle economic growth.</p>                \n                \r\n\n            \n                <p>Senator Sanders is talking theory when reality dictates that the federal government must stop running up massive debt.</p>                \n                \r\n\n            \n                <p>We are not Sweden here with nine million people.</p>                \n                \r\n\n            \n                <p>All government programs are rife with wasteful spending and inefficient performance.</p>                \n                \r\n\n            \n                <p>Does Sanders have a magic wand to fix that?</p>                \n                \r\n\n            \n                <p>I mean we can't even provide an efficient health care system for our vets, and he believes the feds can serve 323 million people?</p>                \n                \r\n\n            \n                <p>Come on.</p>                \n                \r\n\n            \n                <p>Summing up, Trump could probably do two out of the five things he is promising.</p>                \n                \r\n\n            \n                <p>Sanders, zero for five.</p>                \n                \r\n\n            \n                <p>But again, it doesn't really matter to many American voters. &#160;They like what they are hearing from Donald Trump and Bernie Sanders, and that's enough.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The truth about political promises", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 4/12", "date": "2016-04-13T12:19:17Z"}