{"vcmId": "06aba919-dab6-49be-b002-fdf25f28589a", "url": "http://www.foxnews.com/transcript/2016/08/23/bill-oreilly-what-olympics-say-about-usa.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The final medal count in Rio shows how much America dominated the games.</p>                \n                \r\n\n            \n                <p>The USA-winning 121 total medals.</p>                \n                \r\n\n            \n                <p>China was next, 70.</p>                \n                \r\n\n            \n                <p>Great Britain, 67.</p>                \n                \r\n\n            \n                <p>Russia, 56.</p>                \n                \r\n\n            \n                <p>Germany and France both had 42.</p>                \n                \r\n\n            \n                <p>The games demonstrated that this country remains a superpower not only in military matters but also in athletics.</p>                \n                \r\n\n            \n                <p>Look, a pool is a pool, a track is a track. &#160;It doesn't matter how much money a country has, it doesn't matter what the social system is.</p>                \n                \r\n\n            \n                <p>Kenya, for example, dominates long-distance running and that's a very poor place.</p>                \n                \r\n\n            \n                <p>The adage is that skill gets you to the Olympic games but will makes you a champion.</p>                \n                \r\n\n            \n                <p>And it's very clear that American athletes have the will the discipline and the skill to dominate the sporting world.</p>                \n                \r\n\n            \n                <p>The best image for me was the sight of the American basketball team carrying our flags after they won the gold medal.</p>                \n                \r\n\n            \n                <p>The team was all minority and demonstrated pride in their country.</p>                \n                \r\n\n            \n                <p>When the national anthem was played, players had their hands on their hearts &#8230; no cheap shots at the country that had given them the opportunity to succeed at the highest level.</p>                \n                \r\n\n            \n                <p>So to me the spirit of America is intact despite the fact that zealots and loons on both political spectrums are trying to tear the USA down.</p>                \n                \r\n\n            \n                <p>If you believe the far left, we are a bigoted country that actively seeks to destroy young black males.</p>                \n                \r\n\n            \n                <p>The crazy left also puts out that we want to persecute innocent immigrants, that our economic system is geared only to help the wealthy, that our social system punishes the poor.</p>                \n                \r\n\n            \n                <p>Those are all lies but they are spread by politicians and some in the dishonest media who actively despise their country and seek to break it down.</p>                \n                \r\n\n            \n                <p>Talking Points has expounded on Black Lives Matter, there's no need to do that again here other than to say the leadership of that organization hates America.</p>                \n                \r\n\n            \n                <p>On the other side, there are far-right cranks -- the David Duke folks -- who refuse to recognize the struggles and achievements of minority Americans.</p>                \n                \r\n\n            \n                <p>These are hateful people who deserve all the scorn they are receiving.</p>                \n                \r\n\n            \n                <p>But remember, the American media will viciously attack anyone on the right who offends them, while many far-left people like George Soros get a complete pass.</p>                \n                \r\n\n            \n                <p>That's why the true image of the USA is not portrayed to the world, while rank propaganda often is.</p>                \n                \r\n\n            \n                <p>However, the truth was put forth by our Olympic athletes who performed magnificently and once again proved that America is a place of tremendous achievement.</p>                \n                \r\n\n            \n                <p>Yes, the swimmer Ryan Lochte and his friends demonstrated the narcissism and deceit that so many younger Americans have embraced.</p>                \n                \r\n\n            \n                <p>But other than that, our athletes represented America in a very positive way.</p>                \n                \r\n\n            \n                <p>We are indeed a country of achievement, opportunity and success.</p>                \n                \r\n\n            \n                <p>If you are here, you can make it.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: What the Olympics Say About the USA", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 8/22", "date": "2016-08-23T12:12:13Z"}