{"vcmId": "072b44d5-4789-4d4a-a309-90288121276a", "url": "http://www.foxnews.com/transcript/2015/09/22/bill-oreilly-what-really-matters-in-presidential-race.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It is down right sad watching the left leaning media beat up all the Republican candidates because they don't embrace the liberal PC litmus test. You could be the most brilliant problem solver on the planet but if you don't support Planned Parenthood, Black Lives Matter, global warming you are not worthy. And now, it's ridiculous Muslim stuff that the media is propelling.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CHUCK TODD, NBC NEWS HOST: </b>So do you believe that Islam is consistent with the constitution?</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: No I don't. I do not. I would not advocate that we put a Muslim in charge of this nation. I absolutely would not agree with that.</p>                \n                \r\n\n            \n                <p><b>NIHAD AWAD, COUNCIL OF AMERICAN-ISLAMIC RELATIONS: </b>And we ask Mr. Ben Carson to withdraw from the Presidential race because he is unfit to lead because his views are in contradiction with the United States constitution.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Oh, give me a break. Dr. Carson believing that Islamic tenets don't line up Judeo-Christian philosophy on which the country was founded? And he is not allowed to say that? It's his opinion.</p>                \n                \r\n\n            \n                <p>Well here's a bulletin, unlike many Muslim countries, we have free speech in America. And Carson's opinion shouldn't disqualify him from anything but individual votes if that be the case. All of this PC fog has shrouded important issues. Like the new census report released last week. It says median income for working Americans is 6.5 percent lower than it was in 2007, seven years ago because 2014 was the census stat.</p>                \n                \r\n\n            \n                <p>That means only one thing. President Obama's economic policies have failed -- right. Democrats will never admit that but facts are stubborn things. Unlike Mr. Obama, poverty and income inequality have become worse in America especially in the minority precincts, but the President will never say that. While salaries from working folks are down. But the President will never say that. And the liberal media largely ignores the facts, instead Trumping up dopey stuff about Muslims.</p>                \n                \r\n\n            \n                <p>And then there is foreign policy. Almost a year ago I spoke with former Obama secretary of defense Leon Panetta.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>LEON PANETTA, FORMER U.S. SECRETARY OF DEFENSE:</b> We govern either by leadership or crisis. And today we are largely governing by crisis.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Look, when you say -- when President Obama says and you agree with him here that arming Syrian rebels who we don't even know much about is going to blunt the ISIS fanatics guys like me say that's just bull. That's not going to happen.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And it didn't happen. Again last week, another very telling story downplayed. It seems that the Defense Department, despite having $500 million to train anti-Assad Syrian rebels has failed dismally.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. DEB FISCHER (R), NEBRASKA: </b>We have heard reports about the attacks on those individuals when they were reinserted back into Syria. Can you tell us what the total number of trained fighters remains?</p>                \n                \r\n\n            \n                <p><b>GEN. LLOYD AUSTIN, U.S. CENTRAL COMMAND:</b> It's a small number. And the ones that are in the fight is -- we're talking four or five.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Four or five men. That's all the Obama administration has in the field right now for $500 million -- four or five. Unbelievable. If it sounds like a \"Saturday Night Live\" skit, you're correct. Hogan's Heroes could have done a better job.</p>                \n                \r\n\n            \n                <p>But the national media barely covering the story because it makes the liberal president look bad. All the Republican presidential candidates should know they are not going to get a fair shot with the media and they had better stop, had better stop answering loaded questions about Muslims, physical appearances and who has more pep.</p>                \n                \r\n\n            \n                <p>This country is devolving quickly. It has nothing to do with Muslim political candidates, a phony war on women, or global warming. It has everything to do with staggering incompetence.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: What really matters in the Presidential race?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 9/21", "date": "2015-09-22T12:13:41Z"}