{"vcmId": "077806cd-9da2-4ec4-9626-f6f1499b0e15", "url": "http://www.foxnews.com/transcript/2014/10/06/bergdahl-investigation-update.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><em>This is a RUSH transcript from \"The O'Reilly Factor,\" October 3, 2014. This copy may not be in its final form and may be updated.</em></p>                \n                \r\n\n            \n                <p><em>Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</em></p>                \n                \r\n\n            \n                <p>O'REILLY: \"Impact\" segment tonight the investigation into Sergeant Bowe Bergdahl by the U.S. Army. You may remember the 28-year-old Sergeant held by the Taliban in Afghanistan for nearly five years returned to the USA after being traded by President Obama for five top Taliban commanders who were in U.S. custody. That was on May 31st of this year.</p>                \n                \r\n\n            \n                <p>Now soldiers in Bergdahl's unit accused him of deserting. The Army initiated an investigation which was supposed to be completed by August 15th. It's now October 3rd the Army tells us there's no untoward going on, nothing out of bounds but it would not provide a spokesperson this evening.</p>                \n                \r\n\n            \n                <p>However joining us from San Diego, former Marine Corps prosecutor Captain Christopher Oprison; and from Washington Cully Stimson former deputy assistant Secretary of Defense under President Bush the Younger. Mr. Stimson I begin with you, just before air time, the Army who is nervous about this gave us a statement that said the investigation is complete on Sergeant Bergdahl but being reviewed.</p>                \n                \r\n\n            \n                <p>Now, this is long overdue so what do you think is holding it up?</p>                \n                \r\n\n            \n                <p>CULLY STIMSON, FORMER DEPUTY ASSISTANT SECRETARY OF DEFENSE: I think what's holding it up, Bill, is the fact that unlike most courtmartials where the investigation is done relatively quickly after the crime has been committed, the alleged crime has been committed, this process inserted a general, outside the military criminal justice process into this to do a full and complete follow-up investigation before the potential court martial started so there's extra road bump along the way.</p>                \n                \r\n\n            \n                <p>O'REILLY: Well wait, wait now but if you've got a general that should make things go faster. He's a General. Let's go.</p>                \n                \r\n\n            \n                <p>STIMSON: Yes, yes. Well it's an absolute \"aye, aye\" because it's a legal process. He had lawyers advising him. No doubt they interviewed him and other people associated with this case. And this is one of the primary reasons for the delay.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right Captain I suspect there is politics involved here because if it comes out that Sergeant Bergdahl is a deserter and perhaps a collaborator this going to make the President look bad.</p>                \n                \r\n\n            \n                <p>CHRISTOPHER OPRISON, FORMER MARINE PROSECUTOR: No, that's exactly right. Listen this is one guy how long does it take to do an interview? The two Star General, General Dahl waited almost to the very end, literally to a week before the end of the 60 day period to do his interview and it was a two day interview.</p>                \n                \r\n\n            \n                <p>Now if he had other people he wanted to follow up with he should have done that before he met with Bergdahl.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right so you agree with me then Captain that this thing has not been expedited the way you would have done it in the Marine Corps?</p>                \n                \r\n\n            \n                <p>OPRISON: I think they are slow rolling it.</p>                \n                \r\n\n            \n                <p>O'REILLY: And, now this is speculation and we don't like to do that here but there is this political component that's enormous, Mr. Stimson, correct?</p>                \n                \r\n\n            \n                <p>STIMSON: You're absolutely correct there is a political component and at the end of the day, Bill, some people are going to be happy no matter what happens in this case. You can be sure of this Bergdahl is out of the military at the end of this process whether he goes by a court martial or whether he gets administrated separated or just allowed to get out. He's gone.</p>                \n                \r\n\n            \n                <p>But you know unless he gets life without parole or a heavy sentence. Some people are just going to say it wasn't fair.</p>                \n                \r\n\n            \n                <p>O'REILLY: Well look I'm not worried about what some people say, I want the truth. I mean I feel like \"A Few Good Men\" Jack Nicholson right and there's Tom Cruise -- and I'm Tom Cruise in my dreams all right -- and I'm saying Captain I want the truth. And I do.</p>                \n                \r\n\n            \n                <p>I want to know if Bergdahl was a collaborator. I want to know if he was a deserter and I want to know if our Commander-in-Chief President Obama made a bad deal for this nation. And I think everybody else wants to know the same thing.</p>                \n                \r\n\n            \n                <p>OPRISON: I think that's right. I mean, listen, everything about this stinks from the start. They turn on a dime and let this -- they do the trade on a Saturday, May 31st. They don't give the proper notice to the congressional hearing committees. And they say they an open, they had to act within a window of time. Well listen you've had your time to act, you had your time to do your investigation now it's going to go through multiple layers of review, legal review, command review.</p>                \n                \r\n\n            \n                <p>Listen just get it done. Tell us what the results are and by the way, I don't want to see any legal varnishing on the two star's report. I want to see what he wrote. What he came out and how he came out of it.</p>                \n                \r\n\n            \n                <p>O'REILLY: That's right and you're absolutely right. There will be the review process that will take a couple of months. But here is how bad it is. Here's how bad it is. They said the Sergeant had to be released or they had to make the deal then and they couldn't go through Congress or anybody else because of his health. And then he goes to Germany and he is fine. He's fine. He's fine.</p>                \n                \r\n\n            \n                <p>OPRISON: He's fine.</p>                \n                \r\n\n            \n                <p>O'REILLY: There is nothing wrong with him. So this whole thing from the jump was, I don't know why -- I don't know why he did it, Mr. Stimson. I don't know why the President did it I mean, look, you don't want a soldier languishing over there with the Taliban. Everybody knows you don't want it. But five war criminals who are about to go back to the Afghan theater? I mean, that's pretty big.</p>                \n                \r\n\n            \n                <p>STIMSON: Yes. And, this Bill is, is where the rubber meets the road. Because now that the General has got his long delayed report finished, the criminal justice system and the military can kick into gear and my co-guest and I have worked in that system. It's an efficient, fair system and hopefully they will get to ground truth here and convene the authority the General that's out now actually owns Bowe Bergdahl will make the right call and the case can go forward.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right gentlemen -- we appreciate your expertise for coming on this evening thank you.</p>                \n                \r\n\n            \n                <p><em>Content and Programming Copyright 2012 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2012 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</em></p>                \n                \r\n\n            \n\n            \n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bergdahl investigation update", "description": "This is a RUSH transcript from \"The O'Reilly Factor,\" October 3, 2014.", "date": "2014-10-03T04:00:00Z"}