{"vcmId": "07b03fdc-8956-4daa-8d03-ce503d18bb5b", "url": "http://www.foxnews.com/transcript/2016/09/22/more-racial-unrest-in-north-carolina.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" September 21, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Unresolved Problem\" segment tonight, more racial unrest. This time in Charlotte, North Carolina. One quick comment before we get to the story. Every American police officer should know that any mistake he or she makes involving violence toward a black suspect will now become a national story. Therefore, restraint and caution should be the order of the day. That being said, this program generally supports the police because we well understand the danger involved with the job. Last night in Charlotte, hundreds of people protested, some of them unlawfully after police shot and killed 43-year-old Keith Scott.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>KERR PUTNEY, CHARLOTTE POLICE CHIEF: </b>I can just tell you what I know based on what we have gathered through the scientific process of going through the evidence and we did find a weapon and the weapon was there and the witnesses corroborated it, too.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Despite that protesters set fires, looted and blocked Interstate 85. Some demonstrators actually threw rocks at police causing at least 16 injuries. The vigilante action was justified by an activist.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>REV. B.J. MURPHY, NATION OF ISLAM:</b> But what we are standing up for now is our black manhood and our black people who are being gunned down in the street and we don't get no justice.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Also in Tulsa, Oklahoma, another troubling situation this time the black man shot dead 40-year-old Terrence Crutcher did not, did not have a gun. Police say, he was acting suspiciously, may have been intoxicated. However, Crutcher's family, lawyer, Benjamin Crump says, the man was no threat to the cops at all. Both local and federal investigators now examining the evidence.</p>                \n                \r\n\n            \n                <p>With us now here in Los Angeles, Leo Terrell, a civil rights attorney. Let's take Charlotte, first, if the dead man did have a gun, all right, and it seems that he did, the protesters really have no right to go out and do -- commit crimes themselves. I mean, I don't mind them going out and saying we are upset. We would like to know what happened. I think that I would do that. But to throw rocks and to set fires and things like that, totally out.</p>                \n                \r\n\n            \n                <p><b>LEO TERRELL, CIVIL RIGHTS ATTORNEY:</b> Well, I agree with you throwing the rocks is wrong. Just having a gun is not justified for shooting or killing this man. Bill, we are assuming that this gun was posing a threat to the officer.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: I cannot believe the police chief version of the facts. The facts are not even in yet.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Wait, wait, wait, wait. If the police chief says.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Which we all heard.</p>                \n                \r\n\n            \n                <p><b>TERRELL:</b> He wasn't there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The man had a gun.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. And witnesses corroborate that, which he said, all right? Then, in a society that is built upon innocence until proven guilty.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You must, at least, consider that a credible source.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Wouldn't you conclude that's a rush to judgment before 24 hour -- before a trial, before a D.A. gets involved?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I want to see this case investigated and evidence.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But the protesters must abide or we have anarchy by the innocent until proven guilty adage.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Bill, let me tell you the fundamental issue. We are talking about the Carolina case first. But you know why they can't say the thing about the Tulsa case because we have a video, we have a camera. If we don't have a camera here in Carolina, that's why the chief gets the liberty of saying, hey, everything was right. And I'm telling you there is a problem. There is no.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You are suspicious of the chief. All right. I'm saying that he is entitled to the belief of what he is saying is true. But, even if you're right that the police chief isn't being straight, all right, the protesters have no right to go out and do vigilante stuff, all right, at all in this case.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: I'm not going to justify --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: There is reasonable doubt here.</p>                \n                \r\n\n            \n                <p><b>TERRELL:</b> I'm not going to justify the vigilante stuff. Bill O'Reilly, can't you agree that with cameras we have learned that police officers lie, they don't tell the truth?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: In certain cases that's absolutely true.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: But why are we going to believe this police chief right now?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You have to.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: It's a rush to judgment.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, it's not. You have to give him the presumption of innocence like you give any citizen. Now, let's go to Oklahoma.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Okay.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. So in Oklahoma, it's different.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Only because of a camera, Mr. O'Reilly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, wait, wait, wait. It's a different situation because the man wasn't armed. It's not the camera. He didn't have a gun. And the police chief there says that. He didn't have a gun. Okay. So now you have a dead American citizen, all right, with no gun, and obviously walking away from police, not confronting police, the thing will all hinge around a window. And we are investigating this case. We are not going to try it on TV. But we have some new information on this tomorrow. But here, I agree that this is more unsettling and that if you wanted to protest here, you have a little bit higher ground than in Charlotte.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: And the only reason why have a little higher ground is because of that camera. Look, we wouldn't even know.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Because he had no gun.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: You know what would have happened if there was no camera. Police ongoing investigation, we can't release the information. That's the power of that video.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No, it isn't. They could have said he had a gun in the car, reaching the car. They could have been a whole bunch of things. The fact of the matter is, the police in Tulsa were honest and they said the man did not have a gun or deadly weapon.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: The police officer in Tulsa have to be honest because they were going to be impeached by the video. Bill, I'm going to tell you right now. I'm not justifying the crime or the damage. I'm saying to you that black people have a problem trusting the police and video has proven that officers don't tell the truth. I have a sister in the law enforcement.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Some officers.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: And it's the 97 percent of the good officers that protect the three percent that are rotten to the core.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, if protesters know that these kind of aberrations, A, shouldn't be tolerated, I agree with you, I mean, if police are shooting down not only black but anybody for, you know, because they are drunk, I mean, you can't do that. But, on the other hand, the black community has to be somewhat restrained before it goes out and starts burning things down.</p>                \n                \r\n\n            \n                <p><b>TERRELL:</b> Let me just give you one other point.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Quick.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: In that Tulsa case, remember the audio, that guy looks dangerous. Why? Because he is black.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, because he was acting suspiciously. And they have a right to say, he looks dangerous. They have a right to do that. They have don't have a right to hurt him. And so, again, we have a follow up on this thing tomorrow. It was good debating you.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: My pleasure, Bill. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "More racial unrest in North Carolina", "description": "What is the responsible way to react to police shootings? 'The O'Reilly Factor' investigates", "date": "2016-09-22T13:10:04Z"}