{"vcmId": "089f6207-081e-42a9-a06b-1341d3b7bc05", "url": "http://www.foxnews.com/transcript/2017/01/31/political-fallout-from-executive-orders.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 30, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thanks for staying with us. I am Bill O'Reilly in the \"Unresolved Problem\" segment tonight. There is no question that President Trump is causing controversy with his executive orders. He knows it. But politically, is that a good or bad thing?</p>                \n                \r\n\n            \n                <p>Joining us now from Austin, Texas, Karl Rove.</p>                \n                \r\n\n            \n                <p>Okay. So, I could be wrong on this, but I don't think I am because I know Mr. Trump very well. He believes that all of this controversy, including the refugee stuff, all right? Even though they are walking it back now, in the sense that they are allowing people with green cards in, and all of that, helps him. It fires his base up and the people in the middle are getting fed up with the anti-Trump people. Am I wrong?</p>                \n                \r\n\n            \n                <p><b>KARL ROVE, FORMER PRESIDENT GEORGE W. BUSH ADVISOR</b>: Well, there is some truth in there. And I agree with some of it and I disagree with some of it. But look, every action may have the tendency to strengthen the enthusiasm of your supporters. But in this instance, I think that the controversy is hurting him more than the controversy is helping him. And I think he could have gotten a lot of the good out of this by being a little bit more deliberate and not looking like this was, you know, being hastily thrown together.</p>                \n                \r\n\n            \n                <p>If you want to get something to drive it home, don't do it at 5:30 on Friday night. That is when Washington tries to bury news. Don't do it by issuing a piece of paper and not being able to brief reporters for two hours on what is going on or hound out a piece of paper. Sunday morning, I am still trying to get a copy of the executive order off the White House website. I have to get enough of \"The New York Times\" website for FOX News Sunday.</p>                \n                \r\n\n            \n                <p>So, get your act together. Imagine what would have happened, if rather than doing it on Friday night, he had had a big thing on Monday or better yet, the day after his secretary of state is confirmed, and he is standing there, surrounded by the Secretary of State, and the Homeland Security secretary, and he says, I am declaring today, an immediate suspension of the issuances of visas to these seven countries, here's where why, we are going to take 90 days to come up with extreme vetting.</p>                \n                \r\n\n            \n                <p>In the meantime, nobody from these countries is going to at a visa. If you got a piece already from these countries, and you have come to the United States, you are going to be subject to rigorous monitoring because there is a relatively modest number of those people who are going to be coming here who have those kind of visas. And incidentally, this is not going to apply to people with a green card. People who are permanent, legal residents of the United States. He would have gotten all of the advantage of, I am tough on potential sources of terrorism, I got a program that I am putting in place for extreme vetting, I am decisive and I am taking action.</p>                \n                \r\n\n            \n                <p>I got two guys standing next to me who can help explain this to the American people. I am explaining it to you. And guess what, if you are the person with a green card, that woman from North Carolina, who has been here for almost a decade, who is got a life in a family here, who went home to visit her family in Iran for one last time, and got caught up in this, do you think it helps that the first person off the airplane at JFK was a guy in Iraq who spent ten years working for the U.S. government in Iraq?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And certainly, the media blows that up.</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: Sure. Don't give him a chance to do it. Don't give him a chance to do it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Okay. But he doesn't seem to care about that, President Trump. He doesn't seem to care about it. He believes that by fulfilling campaign promises dramatically, and that is what all of this is, it's drama. Okay? His base is getting bigger and getting more loyal. Last word.</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: Well, I would say two things. One is, it gets bigger and better when you do it in the kind of way that I talked about rather than dumping it out on a Friday night. And second of all, let's remember the base. Forty six percent of the electorate. But nine points of that, nine points of that were part of that, 18 percent of the electorate that didn't have a favorable opinion of Donald Trump or Hillary Clinton and went for him by 49-29. That means his base, his 37 percent of the people who voted for him -- and I bet they do come too. But guess what, I think if he had in a different way, they would have gone up further and he would have been on the offense, not on the defense.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. I got to run, Mr. Rove. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Political fallout from executive orders", "description": "Karl Rove joins 'The O'Reilly Factor' to discuss how President Trump should handle controversy", "date": "2017-01-31T13:15:00Z"}