{"vcmId": "0a8808b9-c74a-4614-9a05-798263d1266a", "url": "http://www.foxnews.com/transcript/2016/11/03/bill-oreilly-can-presidential-candidates-solve-dangerous-problems.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>With five days left in the campaign, both candidates are ramping up the rhetoric.</p>                \n                \r\n\n            \n                <p>I think it would be fair to say that both Trump and Clinton know what the problems are, but have mostly put forth general solutions.</p>                \n                \r\n\n            \n                <p>Here's a prime example.</p>                \n                \r\n\n            \n                <p>Speaking in Florida yesterday, Hillary Clinton spotlighted the danger that some young Americans face on the streets where they live.</p>                \n                \r\n\n            \n                <p>Mrs. Clinton apparently believing the gun threat is upending society:</p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON:</b> &#8220;Something is wrong when young people just staring their lives are dying. &#160;Something is wrong when so many parents live in fear that their child will be hurt or killed, going to the movies, sitting in a first-grade classroom, attending a Bible study. &#160;The list goes on. &#160;This has nothing to do with the Second Amendment and responsible gun owners.&#8221;</p>                \n                \r\n\n            \n                <p>What Hillary Clinton has to know is that so far this year in the city of Chicago, 585 people have been killed and 3,100 wounded by gun fire.</p>                \n                \r\n\n            \n                <p>Most of those poor, black Americans.</p>                \n                \r\n\n            \n                <p>But the problem is not gun control.</p>                \n                \r\n\n            \n                <p>Chicago and the state of Illinois have strict gun-possession measures.</p>                \n                \r\n\n            \n                <p>But obviously the thugs who are shooting people don't really care about those measures.</p>                \n                \r\n\n            \n                <p>Therefore it is a total waste of time for Hillary Clinton or any politician to say that more gun control measures are going to solve the problem of street violence.</p>                \n                \r\n\n            \n                <p>There is a solution but neither Clinton nor Trump has mentioned it.</p>                \n                \r\n\n            \n                <p>In the USA anyone committing any crime with a gun, even simple illegal possession, should be subject to federal mandatory prison sentences.</p>                \n                \r\n\n            \n                <p>All gun crimes should become federal crimes.</p>                \n                \r\n\n            \n                <p>That means that if cops in Chicago find a gang member or anybody else carrying an illegal weapon, they will be prosecuted by a U.S. Attorney.</p>                \n                \r\n\n            \n                <p>And if convicted, serve at least five years in a federal penitentiary.</p>                \n                \r\n\n            \n                <p>That way American law enforcement could take not only guns off the streets but people who illegally carry them and-or use them to commit crimes.</p>                \n                \r\n\n            \n                <p>And the upshot -- pardon the pun -- is that legal gun owners would be left alone.</p>                \n                \r\n\n            \n                <p>Now this is a simple solution, but Hillary Clinton would never support it.</p>                \n                \r\n\n            \n                <p>Because she and many other liberals believe there are too many Americans in prison, and we should be more understanding of criminal behavior.</p>                \n                \r\n\n            \n                <p>That mindset has led to the carnage we have in cities like Chicago, Baltimore and St. Louis.</p>                \n                \r\n\n            \n                <p>Talking Points does not know whether Donald Trump would support federalizing gun crimes.</p>                \n                \r\n\n            \n                <p>But he should.</p>                \n                \r\n\n            \n                <p>Mr. Trump has been endorsed by the NRA and says he will uphold the rights of Americans to defend themselves with firearms.</p>                \n                \r\n\n            \n                <p>But he and every other politician must know that criminals can easily get guns and that situation has to be confronted.</p>                \n                \r\n\n            \n                <p>So when we vote for president next Tuesday, we might think about candidates who really want to solve problems as opposed to candidates who just want to blow smoke.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Can the presidential candidates solve dangerous problems?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/2", "date": "2016-11-03T11:41:36Z"}