{"vcmId": "0b065d97-ed42-4aec-bd5c-cb0fb48b20e9", "url": "http://www.foxnews.com/transcript/2015/04/24/bill-oreilly-buying-access-to-clintons.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Accusations mounting that while secretary of state, Hillary Clinton used her position to enrich the Clinton Foundation by doing favors for foreign governments and corporations. If true, that would likely eliminate Mrs. Clinton from the Presidential race - - if true.</p>                \n                \r\n\n            \n                <p>Right now the evidence is circumstantial, not vetted, and the subject of wild speculation by anti-Clinton forces. But as we reported last night, when a corporation like General Electric says it will not make public e- mails sent to it by the State Department during a period of time when GE secured a big contract from the Algerian government, while donating generously to the Clinton Foundation there is something very wrong.</p>                \n                \r\n\n            \n                <p>GE CEO Jeffrey Immelt must know that there is an appearance of impropriety here. And he has an obligation to the shareholders of GE to avoid any taint of scandal. Thus Immelt should release those e-mails immediately. If he does not, the Justice Department should begin an investigation. A welcome greeting to the new attorney general Loretta Lynch who we believe is a person of integrity.</p>                \n                \r\n\n            \n                <p>In addition, there are charges that the State Department under Mrs. Clinton signed off on a deal that allowed the Russian atomic energy agency Rosatom to acquire a huge Canadian uranium company called Uranium One. Uranium One's chairman, a man named Ian Telfer donated almost $2.5 million to the Clinton Foundation much of it while the negotiations were taking place. Shortly before the deal was done, Bill Clinton received $500,000 for a single speech he gave in Moscow.</p>                \n                \r\n\n            \n                <p>Again, the appearance of impropriety is staggering and the defense is paltry to say the least.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> The way it's talked about is as if the Clintons took this money for themselves. They didn't. This money all went to charitable causes.</p>                \n                \r\n\n            \n                <p><b>HOWARD DEAN (D), FORMER GOVERNOR OF VERMONT:</b> This was unearthed in this cash book or whatever it's called by a guy who's the president of something called the General Accountability Institute which is funded by opponents.</p>                \n                \r\n\n            \n                <p><b>JOE SCARBOROUGH, MSNBC HOST: </b>So this is the Clinton tactic. You are not talking about the facts but you attack the man.</p>                \n                \r\n\n            \n                <p><b>DEAN: </b>The fact is this guy is employed. He's the president of an operation well-funded by people who support Ted Cruz.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Talking Points believes there is enough evidence of major money flowing to the Clinton Foundation and to the Clintons themselves through lecture fees that an official investigation has to be launched.</p>                \n                \r\n\n            \n                <p>But I want to make it very clear that the Clintons are to be given the presumption of innocence as one who has been dishonestly smeared, I loathe political hit jobs. But there are major questions here. And they must, must be answered. No government official should benefit financially while serving the people.</p>                \n                \r\n\n            \n                <p>Once again, the investigation should start with General Electric, which admits it has e-mails from the State Department. But it's keeping them secret. All GE stockholders should demand honest accounting now.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Buying access to the Clintons", "description": "Bill O'Reilly's Talking Points 4/23", "date": "2015-04-24T12:10:53Z"}