{"vcmId": "0b5306be-787c-47be-b286-f96a88952ee1", "url": "http://www.foxnews.com/transcript/2017/04/17/gutfeld-blast-felt-around-world.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><b>GREG GUTFELD, FOX NEWS HOST:</b> Hi, I'm Greg Gutfeld in for Bill O'Reilly, who is on vacation. Thanks for watching this FACTOR Special. So, if you like your cave, you can keep your cave.</p>                \n                \r\n\n            \n                <p> <b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> KEVIN CORKE, FOX NEWS WHITE HOUSE CORRESPONDENT:</b> That strike delivering that nearly 22,000 pounds of ordinance, hammering at the system of tunnels and caves, supporting ISIS transport in Eastern Afghanistan.</p>                \n                \r\n\n            \n                <p> <b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> GUTFELD</b>: It was the blast felt around the world. The mother of all bombs. At least, that's what the media keeps calling it. Is that evidence of gender bias? I know that I'm offended. But what's more offensive to so many liberal media types is that it's a bomb. A big bomb in the time of war. The size and scope now the subject of so much concern.</p>                \n                \r\n\n            \n                <p> <b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> UNIDENTIFIED MALE</b>: The blast heard around the world. The biggest conventional bomb the U.S. has ever used.</p>                \n                \r\n\n            \n                <p> <b>UNIDENTIFIED MALE:</b> The U.S. military pulled out the big guns in the fight against ISIS today. A 21,000-pound bomb, the largest nonnuclear weapon the United States has ever used.</p>                \n                \r\n\n            \n                <p> <b>UNIDENTIFIED MALE</b>: Afghan witnesses living in villages miles away from where this bomb was dropped said they could feel the earth shake when it detonated. It's a devastating weapon.</p>                \n                \r\n\n            \n                <p> <b>UNIDENTIFIED MALE</b>: Called a massive ordnance air blast, but its nickname? The mother of all bombs. That 22,000 pounds, it is the largest non-nuclear bomb the U.S. has ever dropped in combat.</p>                \n                \r\n\n            \n                <p> <b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> GUTFELD:</b> Wow! The discipline effect. Do you know what a nonnuclear bomb is? It's a bomb! And so productively, the media and celebrities freak out over a strategy that addresses the world beyond #slogans on Twitter, or sappy essays on how to understand the enemy. George Takei, do you remember him? Former Star Trek actor and now online scold, he tweeted this. \"Dropping bigger bombs does not make you a bigger man, Donald.\"</p>                \n                \r\n\n            \n                <p> Well, thanks, George. Your hot take has the depth of a farewell scribble on a high school yearbook. But we get it. The bomb is pretty big, but sometimes you have to use big things to stop bad things. And it was used to pulverize an area where ISIS lives and breathes. It killed 36 dirt bags. And yes, it probably costs us. But in money, not life or limb. That's what we call in scientific terms \"abargon\" (ph). Which brings us to Joey Jones.</p>                \n                \r\n\n            \n                <p> During his last deployment to Afghanistan, Jones disarmed and destroyed more than 80 improvised explosive devices. In August 2010, he stepped on an IED, losing both legs above the knee. After the bomb was dropped in Eastern Afghanistan on Thursday, he tweeted this. \"I lost my legs because my government was afraid to use the tools they had and saw me as expendable. I wish had this administration.\" That's pretty strong stuff.</p>                \n                \r\n\n            \n                <p> His point? Bombs like this clear places where you should take life and limbs of those who had that job before. So using this tool, it's quite a shift. So we in the media, we are put off by big banks. But the bigger they are, the less likely we lose or injure heroes like Jones. And it also sends a message that we not only have the tools, but we will use them. It's a message heard not just by ISIS, but by North Korea. Remember, tomorrow is the founder of North Korea's birthday, when their leaders usually try to show off with their own brand of fireworks, it's pretty exciting.</p>                \n                \r\n\n            \n                <p> America beat them to it, with a preemptive strike to rattle the cage of a fiend who loves to rattle hours. That was just one bomb in Eastern Afghanistan. That's what I call multitasking.<br> </p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i><p>Greg Gutfeld currently serves as host of <a href=\"http://www.foxnews.com/shows/greg-gutfeld-show\">FOX News Channel's (FNC) <em>The Greg Gutfeld Show</em> (Saturdays 10-11PM/ET)</a> and co-host of <a href=\"http://www.foxnews.com/on-air/the-five/index.html\"><em>The Five</em> (weekdays 5-6PM/ET)</a>. He joined the network in 2007 as a contributor. <a href=\"http://www.foxnews.com/on-air/personalities/greg-gutfeld/bio/#s=e-g\">Click here for more information on Greg Gutfeld</a>.&#160;</p>\n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Gutfeld: The Blast felt around the world", "description": "Greg Gutfeld sounds off on reaction to US dropping MOAB in Afghanistan on 'The O'Reilly Factor' ", "date": "2017-04-17T11:51:00Z"}