{"vcmId": "0de8f85e-20c5-478f-aab1-7c5c17c4923b", "url": "http://www.foxnews.com/transcript/2016/02/18/federal-government-vs-apple.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 17, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>ERIC BOLLING, FOX NEWS HOST</b>: Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching this special edition of The Factor Election 2016: Protecting America.</p>                \n                \r\n\n            \n                <p>Let's get right to our top story: the federal government versus Apple. A federal judge is now ordering Apple to help the FBI crack into the iPhone owned by Syed Farook, one of the two shooters in the December San Bernardino terrorist attack that killed 14 innocent people. But Apple is hitting back saying it will not comply with the court order. The FBI has laced into Apple in recent months for creating virtually unbreakable security features on its phones.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JAMES COMEY, FBI DIRECTOR:</b> It is a big problem for law enforcement armed with a search warrant when you find a device that can't be opened even though the judge said there is probable cause to open it. As I said it affects our counter terrorism work.</p>                \n                \r\n\n            \n                <p>You know, San Bernardino very important investigation to us. We still have one of those killers' phones that we have not been able to open. It's been over two months now we're still working on it.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> But, despite that, Apple chief executive Tim Cook has fiercely defended the security protections on Apple's devices.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TIM COOK, APPLE CEO</b>: On your smart phone today, your iPhone, there is likely health information. There is financial information. There are intimate conversations with your family or your co-workers. There's probably business secrets. And you should have the ability to protect it. And the only way we know how to do that is to encrypt it.</p>                \n                \r\n\n            \n                <p>Why is that? It's because if there's a way to get in then somebody will find a way in. I don't believe that the tradeoff here is privacy versus national security. I think that's an overly simplistic view. We are America. We should have both.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> And the brawl between the feds and Apple is entering the 2016 presidential campaign. Donald Trump weighed in on the controversy today.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL CANDIDATE:</b> I agree 100 percent with the courts. We should -- in that case we should open it up. These are two people radicalized who were given a wedding party by the people that they killed. There is something going on. We have to be very careful. We have to be very vigilant.</p>                \n                \r\n\n            \n                <p>But to think that Apple won't allow us to get into her cell phone, who do they think they are?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Joining us now to analyze privacy and security attorney Scott Vernick along with Philip Segal an investigative attorney. Now, I have one pro-Apple and one pro-FBI.</p>                \n                \r\n\n            \n                <p>Let me start with you Scott. You are on the Tim Cook side that says Apple should keep this back door, this encrypting back door closed -- right?</p>                \n                \r\n\n            \n                <p><b>SCOTT VERNICK, PRIVACY AND SECURITY ATTORNEY:</b> Absolutely. I mean let's be real here. What is the court saying? The court is saying that it's ordering Apple to create a software that it doesn't yet have to break into this phone. This is a binary proposition. Either you are going to have encryption and it's going to protect us against everybody or we're going to put in a back door, create a weakness which isn't only going to be available to the good guys but also to the bad guys as well. That's a radical step here.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Phil, everyone wants security. Everyone is concerned about terrorism. But a lot of people say that once you give that back door, once you provide the software for a back door, the bad guys could get the key to that back door, too.</p>                \n                \r\n\n            \n                <p><b>PHILIP SEGAL, INVESTIGATIVE ATTORNEY: </b>That's right. They do say that but up until Apple only had this encryption for the last year. In 2012, 2013, 2014 -- the bad guys there were breaches but you are talking about having to have a balance. And to go back to one point --</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Wait -- hold on, is there a balance? It's either there is the software or there isn't. In other words, I don't see where there is a balance.</p>                \n                \r\n\n            \n                <p><b>SEGAL</b>: The government has the right to go into your ISP and get your e- mail. The government has the right to go to the hospital and get your medical records. The government already has these rights and these rights are limited by the courts. And no one is saying that the government will have the right to look at everybody's iPhone to go into your house, grab your iPhone and use this back door.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Not yet. What about it, Scott? I already heard the New York chief of police already saying, hey, we may want to use some of this back door window to look into some other types of crimes -- murder, rape, et cetera.</p>                \n                \r\n\n            \n                <p><b>VERNICK:</b> You see, therein lies the rub -- right.</p>                \n                \r\n\n            \n                <p>It's a slippery slope. Once you create this software that will enable law enforcement or homeland security to get past the passwords and look at the encrypted data, then everybody is going to want a piece at it. That's why this doesn't work.</p>                \n                \r\n\n            \n                <p>I say -- and here's the thing. Here is the other sort of total misnomer here, all right. If you do this, it's not as if the bad guys, whoever they are, the terrorists, state actors aren't going to find some other kind of encrypted technology. They certainly will. That's why we ought not to create this weakness. You just can't create it for one set of people who we like and not have it for another set of people.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> What about that? There is so much information. Honestly we keep everything on our smart phones -- our medical records -- our financial records.</p>                \n                \r\n\n            \n                <p><b>SEGAL:</b> The government already has those --</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Can I throw you one more? Allegedly with this back door encryption being able to break into the encryption, there may be an opportunity for people, good or bad, to get into your camera, and your microphone on your phone.</p>                \n                \r\n\n            \n                <p><b>SEGAL</b>: You cannot say to me, first of all that Apple doesn't know how to crack these phones. I just don't believe it number one.</p>                \n                \r\n\n            \n                <p>Number two, up until last year, we are talking about the capacity to erase all the data on your phone, if you enter ten erroneous passwords. Up to last year the iPhone didn't have that feature. No one was talking about bad guys stealing everybody's information.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Not stealing it. They're not getting their hands on it under that. Whatever the numbers, 10 or 20 attempts, it wipes out the information. They are not getting and that kind of is the point, right?</p>                \n                \r\n\n            \n                <p><b>SEGAL</b>: That's the point if you oppose any kind of government forcing Apple to hand over this information. I think what Apple could do is get this iPhone, crack it, hand over the information of this one iPhone and that's the end of it. But, the idea that either everyone's information is going to be for a free for all government to grab --</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: This is not a bad idea though. Let's say they do crack the encryption or whatever they have on the iPhone and get this information for the feds. They can develop a different type of encryption that wouldn't be able to be broken, right?</p>                \n                \r\n\n            \n                <p><b>VERNICK</b>: Listen, I don't know that they can do that. Apple deliberately created a system of encryption where they didn't hold the key themselves. And the fundamental question here is this. How much government intrusion are you prepared to ask for and how much government intrusion are you prepared to tolerate?</p>                \n                \r\n\n            \n                <p>It might make sense with respect to food safety or medical devices or pharmaceuticals or with respect to utilities. But here we are talking about your phone. As you point out people have a tremendous amount of personal stuff on that phone -- health data, financial information, who they are dating, who they're seeing.</p>                \n                \r\n\n            \n                <p><b>SEGAL: </b>The government already has access to all your tax records.</p>                \n                \r\n\n            \n                <p><b>VERNICK</b>: That makes my point.</p>                \n                \r\n\n            \n                <p><b>SEGAL</b>: If you're on single payer healthcare the government is going to have all your medical records anyway.</p>                \n                \r\n\n            \n                <p><b>VERNICK</b>: Phil makes my point. The fact of the matter is that without this, the government already has access to so much data. The question is do they really need access to more?</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Everyone wants this crime solved. Everyone wants the trail that these two murderers in San Bernardino took and see if we can open some --</p>                \n                \r\n\n            \n                <p><b>VERNICK</b>: It's not about solving the crime.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> I know that.</p>                \n                \r\n\n            \n                <p><b>VERNICK:</b> This one is -- this issue is about getting Farook cell phone so we can find out if he has any trail to other terrorists.</p>                \n                \r\n\n            \n                <p><b>SEGAL</b>: That's right.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: I get that. Aren't we -- so you solve a crime or you thwart one terror attack, do you really want to open literally the rest of the population up to possible terror -- ISIS getting hold of all of our information?</p>                \n                \r\n\n            \n                <p><b>SEGAL:</b> It already is a possibility that ISIS can get that because unless you're only using a phone there are lots of other ways that ISIS can find information. There are lots of -- if you are using a computer in an Internet cafe. It's not as if everyone in the world who is a bad actor is only using an iPhone.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Scott, I want to ask you this. Do you really want, if that information is sitting right there for the feds to have in that device, do you really want it unaccessible to the feds to solve a terror attack?</p>                \n                \r\n\n            \n                <p><b>VERNICK</b>: I say yes. The reason why I say yes is because I think that you can work around -- that the government, homeland security, FBI, whoever it is can work around that encryption issue. They can look at metadata. They can look at other sources of information they have.</p>                \n                \r\n\n            \n                <p>To me, standing firm and not allowing government intrusion into personal data is a thing that we ought to be very careful.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Big, big topic you guys and I guess it's not going away any time soon. Scott and Philip -- thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The Federal Government vs. Apple", "description": "Company hitting back against court order that would help the FBI crack into San Bernardino shooter's device; 'The O'Reilly Factor' with the latest", "date": "2016-02-18T13:35:38Z"}