{"vcmId": "0e0db2d6-3c2e-42b5-8841-2199c47fcdf9", "url": "http://www.foxnews.com/transcript/2016/12/06/bill-oreilly-coming-to-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>One of the reasons Donald Trump won the presidency is that millions of Americans now believe they are being conned on immigration.</p>                \n                \r\n\n            \n                <p>Hillary Clinton and the Democratic Party had absolutely no interest in being responsible on the issue of people traveling to the USA illegally or even protecting Americans from vicious foreign criminals already here.</p>                \n                \r\n\n            \n                <p>In fact, the far-left wing of that party actually wants open borders and blanket amnesty for the undocumented living all across the country.</p>                \n                \r\n\n            \n                <p>Never mind that would create a dangerous security nightmare and run up far more government debt.</p>                \n                \r\n\n            \n                <p>Liberal zealotry sees America as a nation driven by white privilege and wants to flood the USA with new citizens, the fewer restraints the better.</p>                \n                \r\n\n            \n                <p>And it doesn't matter that Hillary Clinton might not be that extreme.</p>                \n                \r\n\n            \n                <p>She put forth no vision on immigration other than the status quo, which has been a colossal failure.</p>                \n                \r\n\n            \n                <p>Thus, Trump's tough guy approach to enforcing immigration law propelled his campaign despite the unending charges of racism that came his way</p>                \n                \r\n\n            \n                <p>So now the question becomes, what is a fair policy in this most emotional of arenas?</p>                \n                \r\n\n            \n                <p>For that we turn to Australia, a nation of about 24-million people but with a land mass almost exactly the same as America's.</p>                \n                \r\n\n            \n                <p>And we have 325 million people.</p>                \n                \r\n\n            \n                <p>So there is plenty of room to roam Down Under.</p>                \n                \r\n\n            \n                <p>Australia has a stone-cold policy on illegal entry. &#160;If you are caught, you are forcibly taken by the Aussie military to remote locations in the South Pacific, where you can either sit for years or be deported home.</p>                \n                \r\n\n            \n                <p>Australia accepts less than 15,000 migrants a year on a humanitarian basis.</p>                \n                \r\n\n            \n                <p>Recently it announced it would take 12,000 Syrian refugees on top of that.</p>                \n                \r\n\n            \n                <p>But even more recently the Obama administration said it would take more than 2,000 refugees currently languishing in the South Pacific, human beings that Australia refuses to bring to its mainland.</p>                \n                \r\n\n            \n                <p>My question is, why not?</p>                \n                \r\n\n            \n                <p>Why won't the Aussies take them?</p>                \n                \r\n\n            \n                <p>Surely, desperately poor people in South Asia, or Central America for that matter, deserve sympathy.</p>                \n                \r\n\n            \n                <p>During my time in El Salvador, I visited folks who were actually living in caves. &#160;Dogs in America have more comforts.</p>                \n                \r\n\n            \n                <p>Judeo-Christian philosophy compels its followers to embrace the poor, and it seems that rejecting asylum-seekers and migrants goes against that tenet.</p>                \n                \r\n\n            \n                <p>Thus, the far-left demonizes those who call for restrictions on illegal immigration, saying they are bad people.</p>                \n                \r\n\n            \n                <p>That's what the Sanctuary City movement is all about.</p>                \n                \r\n\n            \n                <p>But you don't hear much condemnation of Australia and inside that country both political parties support the tough immigration laws.</p>                \n                \r\n\n            \n                <p>There is little moral debate.</p>                \n                \r\n\n            \n                <p>By the way, if Perth for example declared itself a Sanctuary City, it would have big trouble with the Aussie military, which as I stated actually enforces immigration law.</p>                \n                \r\n\n            \n                <p>And a general reports directly to the government in Canberra.</p>                \n                \r\n\n            \n                <p>Australians generally believe that undocumented migrants destabilize the country and put themselves at grave physical risk by crossing oceans to get Down Under.</p>                \n                \r\n\n            \n                <p>Also, Aussie politics have created a generous welfare state that works for a small population.</p>                \n                \r\n\n            \n                <p>That entitlement culture would be overwhelmed and go broke if mass illegal immigration was accepted as it has been here in the USA.</p>                \n                \r\n\n            \n                <p>Simply put, Australians do not want the enormous disruption that immigration chaos causes.</p>                \n                \r\n\n            \n                <p>So they are sending more than 2,000 poor souls here, folks they should assimilate. &#160;And Barack Obama is happy to take them.</p>                \n                \r\n\n            \n                <p>Are we chumps?</p>                \n                \r\n\n            \n                <p>Or are we the most compassionate nation on Earth?</p>                \n                \r\n\n            \n                <p>President Trump will have his hands full trying to figure out how to get things under control on the immigration front.</p>                \n                \r\n\n            \n                <p>Here is what Talking Points recommends.</p>                \n                \r\n\n            \n                <p>A moratorium on refugees for one year until Trump's new Homeland Security Department can reorganize and setup intense vetting procedures.</p>                \n                \r\n\n            \n                <p>Right now the federal government cannot properly investigate refugees who want to come here. &#160;The system is broken.</p>                \n                \r\n\n            \n                <p>All undocumented people already here must register with the feds at their local post offices within six months.</p>                \n                \r\n\n            \n                <p>It becomes a felony if they fail to do that and immediate deportation if they are caught.</p>                \n                \r\n\n            \n                <p>By the way, we told you very early on in the presidential campaign that mass deportations would not take place if Donald Trump were elected president.</p>                \n                \r\n\n            \n                <p>Speaker of the House Paul Ryan confirmed that yesterday:</p>                \n                \r\n\n            \n                <p><b>PAUL RYAN, SPEAKER OF THE HOUSE:</b> &#8220;We&#8217;re not working on a deportation force. &#160;Here&#8217;s what we&#8217;re working on with respect to immigration, securing our border, enforcing our current laws. &#160;He talked about criminal aliens. &#160;That&#8217;s just enforcing laws for people who came here illegally, who came and committed violent crimes. &#160;We should enforce those laws.&#8221;</p>                \n                \r\n\n            \n                <p>Once the federal government knows how many undocumented people are here and their circumstance, a fair system of evaluating migrants can take place.</p>                \n                \r\n\n            \n                <p>On the borders, all of those caught trying to enter illegally will be bussed back into Mexico or Canada after being fingerprinted.</p>                \n                \r\n\n            \n                <p>Second offense -- six months in jail then another bus ride.</p>                \n                \r\n\n            \n                <p>A congressional mandate on how many foreign nationals should be allowed into America each year should be agreed upon.</p>                \n                \r\n\n            \n                <p>That number should be generous, but legal papers have to be renewed each year and actual citizenship will have to be earned over a substantial period of time.</p>                \n                \r\n\n            \n                <p>A new law that suspends all federal transportation money to individual states that tolerate sanctuary cities must be passed.</p>                \n                \r\n\n            \n                <p>Texas is in the process of outlawing sanctuary cities, punishing them financially.</p>                \n                \r\n\n            \n                <p>Every state should do that.</p>                \n                \r\n\n            \n                <p>And if California says no, finance your own infrastructure. &#160;Same with all other defiant states.</p>                \n                \r\n\n            \n                <p>Finally, build effective barriers along the southern border using the Army Corps of Engineers.</p>                \n                \r\n\n            \n                <p>The barriers designed to stop the flow of people and drugs.</p>                \n                \r\n\n            \n                <p>Enough is enough.</p>                \n                \r\n\n            \n                <p>If I could, I'd help every poor and abused person in the world.</p>                \n                \r\n\n            \n                <p>But I can't.</p>                \n                \r\n\n            \n                <p>So I do what I can without making things worse by supporting policies that hurt the country at large.</p>                \n                \r\n\n            \n                <p>Australia has figured this out.</p>                \n                \r\n\n            \n                <p>We can, too.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Coming to America", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 12/5", "date": "2016-12-06T13:30:14Z"}