{"vcmId": "0e1153e6-430f-42ff-bb91-3207466f2e7c", "url": "http://www.foxnews.com/transcript/2015/02/02/bill-oreilly-romney-says-no.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>For about three weeks Mitt Romney was running, making speeches, trying to raise money, putting his finger up into the wind. Here is what the wind told him. Don't do it.</p>                \n                \r\n\n            \n                <p>The governor says many of his previous donors, big money people are now committed to Jeb Bush, so he is not running for president in 2016. But there is something else in play here.</p>                \n                \r\n\n            \n                <p>According to a recent Fox News poll, there was some bad news for Governor Romney. The question do you think Romney would have done a better job as president than Barack Obama -- yes 43 percent, no 50 percent, 6 percent don't know. You have to assume Republicans would say yes, Democrats no. So the swing vote against Romney in that poll came from Independents. Just the people he would need to defeat Hillary Clinton. That poll question was very bad news for Mitt Romney.</p>                \n                \r\n\n            \n                <p>Now let's look ahead. The same Fox News Poll asked this. Which candidate would you like to see as Republican nominee without Mitt Romney in a race? Jeb Bush 15 percent of registered Republican voters; Mike Huckabee 13 percent; Rand Paul 13 percent; Ben Carson 10 percent; Scott Walker rounds out the top five at 9 percent -- so that means it's anybody's race.</p>                \n                \r\n\n            \n                <p>Most of the Republican contenders have a chance. For those men it might be worthwhile to look back and see why Mitt Romney lost the last time around. Up until two weeks before the vote in 2012, Romney was leading in the national polls. But in the last week of the campaign, dominated by super storm Sandy coverage Romney disappeared.</p>                \n                \r\n\n            \n                <p>Adding to that, in the last debate with Barack Obama on foreign policy, the governor stumbled badly. He did not confront the President with the Benghazi debacle. That was inexplicable, a huge plunder.</p>                \n                \r\n\n            \n                <p>As I said before, I don't believe Mitt Romney really wanted to win the presidency. It could have been subconscious. But no aggressive candidate would do what he did.</p>                \n                \r\n\n            \n                <p>Barack Obama had massive trouble with the economy and his foreign policy was beginning to unravel. Yet, Governor Romney did not exploit those key things. Again, in explicable.</p>                \n                \r\n\n            \n                <p>This time, against the very powerful and well-funded Hillary Clinton, the Republican candidate is going to have to be charismatic, daring and coherent. It's actually a good thing for Republicans that Mitt Romney is not running. Now somebody new will be on that big stage. But they better be ready for a bruising battle.</p>                \n                \r\n\n            \n                <p>That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Romney says no", "description": "Talking Points 1/30", "date": "2015-02-02T13:24:41Z"}