{"vcmId": "1181c4b3-fecb-4c62-82ea-cd42f344e71d", "url": "http://www.foxnews.com/transcript/2015/09/10/assessing-republican-presidential-contenders.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" September 9, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thanks for staying with us. I'm Bill O'Reilly in the \"Personal Story\" segment tonight assessing the republican presidential contenders.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington, former speaker of the House Newt Gingrich who has been through it all. All right, Mr. Speaker. Let's assess one by one. Donald Trump, has he peeked? What do you think?</p>                \n                \r\n\n            \n                <p><b>NEWT GINGRICH (R), FORMER SPEAKER OF THE HOUSE</b>: Oh, I doubt it. Look, I think this guy learns every day. I think he has endless amounts of energy. As he has tapped into something real about the American people the desire to be great again. The desire to win. I think he is very formidable. He is not the nominee yet. He has a long, long way to go. But he certainly has done better for about four months than anybody expected. And he is staffing up. He is getting -- hiring more people, building a bigger organization. He will be formidable and somebody, I don't think he will implode. Somebody will have to beat him to stop him from becoming the nominee.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. Ben Carson rating second in the poll. Outsider. How is his campaign shaping up?</p>                \n                \r\n\n            \n                <p><b>GINGRICH:</b> Look, I think he is the most remarkable figure even more than Trump. Dr. Carson has a wonderful personal story. He has a remarkable story as a surgeon. But he is very quiet. He is very low key. And yet in South Carolina for example, he is in a solid second place nationally. He is in second place. There is something magic happening with him. And I think people who are sick and tired of Washington but also sort of tired of noise have found in Dr. Carson the alternative to Trump. The two of them together, I think, are now in like the high 50's in places like South Carolina.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. Well, something to be said for --</p>                \n                \r\n\n            \n                <p><b>GINGRICH</b>: It's an amazing performance.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: For Dr. Carson being a decent, honest man. I mean, you know? Let's --</p>                \n                \r\n\n            \n                <p><b>GINGRICH</b>: And he has, by the way, he has a real campaign.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>GINGRICH:</b> I know the people who put it together, and Carson has a real campaign. And he has chairman in all 99 counties in Iowa. He has raised, I think, $6 million in FNC hard money in August.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. Both Trump and Carson have genuine campaign. Now, Jeb Bush lots of money, trying to do the media thing with Colbert last night. How is he doing?</p>                \n                \r\n\n            \n                <p><b>GINGRICH</b>: Well, I'm really very surprised. I you think Jeb is a very, very good politician. He was a very good governor of Florida. And he doesn't -- I think he is sort of startled by the Trump phenomenon and he hasn't found his footing. And he certainly has enough money that he should be able to go to the distance. He should still be able to have a shot at this. But he is going to have to find some pattern that we don't see yet it. Jeb Bush is a person who likes people. He is not an actual fighter. He is up against a great bar room brawler in Donald Trump. And somehow Jeb is going to have to find a way to get in the ring equally tough.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. That's going to be interesting. Yes, that's going to be interesting. All right. Marco Rubio, a senator from Florida, competitive but really hasn't' caught fire.</p>                \n                \r\n\n            \n                <p><b>GINGRICH:</b> Yes. Look. He is stunningly talented. He is a terrific person. And he is very knowledgeable. He is almost a natural vice presidential nominee. But he hasn't broken through yet to be a presidential contender in a way that he should. And his performance was fine in the first debate. But it didn't -- people nodded yes but they didn't then vote for him. And that's a challenge for Marco to figure out what's the missing ingredient here?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't know either. Ted Cruz, very bombastic himself. How do you assess his chances?</p>                \n                \r\n\n            \n                <p><b>GINGRICH:</b> Well, Cruz is doing something very clever. Cruz is in a sense riding right next to Trump. I mean, the fact that Cruz inviting Trump to come to the U.S. capitol today and to oppose the Iranian deal together, you know, we will see. Cruz is a very, very smart man. And in the absence of Trump would have been the natural Tea Party candidate and maybe in the absence of Carson the natural evangelical candidate. The problem he has got is both those guys are now bigger than he is.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>GINGRICH:</b> And he hasn't quite yet figured out how to get past them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Scott Walker, governor of Wisconsin hasn't caught on yet, has he?</p>                \n                \r\n\n            \n                <p><b>GINGRICH: </b>No. And it's a little bit of a surprise. I have known Scott for a lot of years. He is very solid guy. Very courageous guy in what he did in Madison in taking on the government employee unions. But he is very quiet in a different way than Carson. He hasn't found his voice. And he hasn't communicated the kind of fervent, direct appeal that people want to hear. People want to feel it's in your gut. That you are ready to lead the country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. If you're an emotional guy.</p>                \n                \r\n\n            \n                <p><b>GINGRICH:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. The four remaining in the CNN debate, it looks like are Fiorina, Kasich, Huckabee and Christie. Any of those four do you feel have a chance to break out?</p>                \n                \r\n\n            \n                <p><b>GINGRICH:</b> Yes. I think both Fiorina and Kasich have huge opportunities. Kasich has run a very smart campaign. He is in second place in New Hampshire, which was a deliberate campaign decision on their part. He has raised a good bit of money. He is the governor of one of the most important states in electoral politics. He is the only sitting governor who has a net positive. He is about 60 percent approval. And he is probably the most innovative governor in the country. So, Kasich could break out presently. And Fiorina has had, you know, a great break through. I mean, this kind of ironic.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Very feisty.</p>                \n                \r\n\n            \n                <p><b>GINGRICH:</b> She didn't make the first debate but in the result she got a bigger boost being on in the earlier debate than she would have gotten had she been next to Trump.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. She'll be there next Wednesday night. Mr. Speaker we will going to bother you from time to time to come back in and take a look at the campaign.</p>                \n                \r\n\n            \n                <p><b>GINGRICH:</b> All right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We really appreciate it. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Assessing the Republican presidential contenders ", "description": "Newt Gingrich joins 'The O'Reilly Factor' to preview the upcoming GOP debate", "date": "2015-09-10T12:33:35Z"}