{"vcmId": "12d86f16-31d1-4086-ba89-eec59901f5cf", "url": "http://www.foxnews.com/transcript/2017/03/30/bill-oreilly-brand-new-poll-on-president-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>According to CBS News, the president's job approval rating stands at 40%.</p>                \n                \r\n\n            \n                <p> Fifty-two percent disapprove.</p>                \n                \r\n\n            \n                <p> Seven percent don't know.</p>                \n                \r\n\n            \n                <p> That's not surprising for a president with no prior political experience who is vowing to \"drain the swamp\" in Washington.</p>                \n                \r\n\n            \n                <p> This time next year President Trump's job approval ratings will be much more meaningful.</p>                \n                \r\n\n            \n                <p> Next question - what do you think is the main reason the Republican health care plan did not pass?</p>                \n                \r\n\n            \n                <p> Donald Trump didn't compromise enough - 14%.</p>                \n                \r\n\n            \n                <p> Congressional Republicans didn't compromise - 14%.</p>                \n                \r\n\n            \n                <p> Congressional Democrats didn't compromise - 14%.</p>                \n                \r\n\n            \n                <p> The bill just wasn't popular - 49%.</p>                \n                \r\n\n            \n                <p> So my analysis on Monday was correct.</p>                \n                \r\n\n            \n                <p> <b>O'REILLY</b>: &#8220;But I don't think the President is going to be blamed for this, that's my opinion as a very astute analyst.&#8221;</p>                \n                \r\n\n            \n                <p> <b>KRAUTHAMMER: </b>&#8220;Look &#8211; he ran &#8211;&#8220;</p>                \n                \r\n\n            \n                <p> <b>O'REILLY</b>: &#8220;Wait, wait. It's not like the folks out there are going, &#8216;Hey, Trump screwed this up,&#8217; they're going &#8211; &#8216;Congress screwed it up.&#8217; And both parties did.&#8221;</p>                \n                \r\n\n            \n                <p> Next question from CBS News:</p>                \n                \r\n\n            \n                <p> Do you think it's necessary for the FBI to investigate a possible link between the Trump campaign and the Russian government?</p>                \n                \r\n\n            \n                <p> 63% - necessary.</p>                \n                \r\n\n            \n                <p> 33% - not necessary.</p>                \n                \r\n\n            \n                <p> Finally, do you think Donald Trump's offices were wiretapped during the presidential campaign?</p>                \n                \r\n\n            \n                <p> Very likely - 22%.</p>                \n                \r\n\n            \n                <p> Somewhat likely - 25%.</p>                \n                \r\n\n            \n                <p> Not very likely - 20%.</p>                \n                \r\n\n            \n                <p> Not at all likely - 30%.</p>                \n                \r\n\n            \n                <p> So the country is pretty much split down the middle on that question, most likely along ideological lines.</p>                \n                \r\n\n            \n                <p> Now here's a question I would like posed to the American people. Do you believe that the hatred toward President Trump has reached a dangerous level for this country?</p>                \n                \r\n\n            \n                <p> The answer is yes.</p>                \n                \r\n\n            \n                <p> Whether you like the president or not, it is brutally unfair to try to undermine his administration as some of his opponents are trying to do.</p>                \n                \r\n\n            \n                <p> We have the Democratic Party refusing to cooperate on anything.</p>                \n                \r\n\n            \n                <p> And now it looks like Senate rules will have to be changed to appoint Judge Neil Gorsuch to the Supreme Court because not enough Democrats will support the man.</p>                \n                \r\n\n            \n                <p> It is clear that Judge Gorsuch is qualified and it's also clear the most powerful Democrat in Congress, Senator Chuck Schumer would look askance at any of his colleagues who support the judge.</p>                \n                \r\n\n            \n                <p> Many Democrat Senators fear Mr. Schumer.</p>                \n                \r\n\n            \n                <p> As fair-minded people will concede, there was hatred toward President Obama.</p>                \n                \r\n\n            \n                <p> But in the first months of his tenure, there was no apparent undermining of his administration.</p>                \n                \r\n\n            \n                <p> But now we have a climate of hatred where there are no rules.</p>                \n                \r\n\n            \n                <p> And the media feeds the beast every single day.</p>                \n                \r\n\n            \n                <p> As a historian, I can tell you I have never seen the national press despise a president more than they do Donald Trump.</p>                \n                \r\n\n            \n                <p> Richard Nixon might have come close at the end of his term, but what we have now is unfair and destructive for America.</p>                \n                \r\n\n            \n                <p> Hate should not be part of the political landscape.</p>                \n                \r\n\n            \n                <p> And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: A brand new poll on President Trump", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/29", "date": "2017-03-30T11:24:00Z"}