{"vcmId": "13b4adec-392c-42ec-9d50-68727c0bc549", "url": "http://www.foxnews.com/transcript/2016/02/25/bill-oreilly-donald-trump-populist-campaign.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As we predicted, Mr. Trump easily won the Nevada caucus yesterday. Marco Rubio came in second, Ted Cruz third. For Mr. Trump, it was another strong showing. And now some in the media are saying that his nomination is a lock. That is not good news for the Republican Party establishment which does not see Mr. Trump as a worthy candidate. One who can defeat Hillary Clinton. But the establishment has been wrong all along.</p>                \n                \r\n\n            \n                <p>In the beginning, they tried to marginalize Trump and now the G.O.P. Poobahs don't know what to do. As for Trump himself, as I told you back in August, he is not really a Republican guy.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Donald Trump really isn't a Republican, he is a Trumpian. He has absolutely no interest in what the Grand Ole Party says. He is a man on a mission, marching to his own beat. And Trump's timing is good because this presidential cycle should spell doom for the Democratic Party. It is so far left most Americans are appalled.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, the calculation Donald Trump made from the beginning of his campaign is that Americans are so fed up with career politicians and the direction of the country, they don't care anymore about party politics. Thus, Trump has run as a populist. Listen to what he said last night.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> We won the evangelicals. We won with young. We won with old. We won with highly educated. We won with poorly educated. I love the poorly educated.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And that was a smart statement because by saying he loves the poorly educated, Trump is slapping the elites who many voters despise. Trump realizes that he is mobilizing Americans who never before took part in the political process. He doesn't care whether you have a PH.D. from Harvard. He doesn't care whether you have a degree from the School of Hard Knocks. He just wants your vote. And obviously, he is getting plenty of votes more at this point in the campaign than Mitt Romney did back in 2012.</p>                \n                \r\n\n            \n                <p>Going forward, Talking Points believes that the Super Tuesday contest, six days from now will really tell the tale. Twelve states will vote. Trump is competitive in all of them according to polling. For example in Georgia, Trump leads by 12. In Massachusetts by 34. In Virginia he is up by six. To this point Marco Rubio running slightly ahead of Ted Cruz for second place but still really a toss-up between those two. And as long as they are both in the race, and they divide Republican votes, Trump will remain a solid favorite. In the end, Donald Trump doesn't care about politics. He doesn't care about parties. He does not care about elites. He does not care about what he says in attacking opponent. He only caress about one thing. Winning. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Donald Trump's populist campaign", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/24", "date": "2016-02-25T19:50:01Z"}