{"vcmId": "13c5a459-13c9-415b-a51e-f27c484186e1", "url": "http://www.foxnews.com/transcript/2015/10/02/bill-oreilly-mass-murder-in-oregon.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Shortly after 10:30am Pacific Time, 911 dispatchers received reports of shots fired and causalities at the Umpqua Community College in Roseburg, Oregon, 180 miles south of Portland.</p>                \n                \r\n\n            \n                <p><b>DISPATCHER: </b>\"UCC this is going to be the Snyder Hall . &#160;Somebody is outside one of the doors shooting through the door. (EDIT) We do have one female that has been shot at this time.\"</p>                \n                \r\n\n            \n                <p><b>(EDIT)</b></p>                \n                \r\n\n            \n                <p><b>MALE: </b>&#160;\"Exchanging shots with him. &#160;He's in a classroom on the - it's going to be the southeast side of the hall.\"</p>                \n                \r\n\n            \n                <p><b>(EDIT)</b></p>                \n                \r\n\n            \n                <p><b>MALE: </b>\"The suspect is down. &#160;We've got multiple gunshot wounds. We're going to need multiple ambulances on scene.\"</p>                \n                \r\n\n            \n                <p><b>(EDIT)</b></p>                \n                \r\n\n            \n                <p><b>KENDRA GORDON (WITNESS PHONER):</b> \"I was sitting in class when I first heard the shot. (EDIT) One of the students went out and checked it and she got shot twice - in the arm and stomach. &#160;She came back and told us to lock the door and turn the lights off. &#160;We sat there for 20 minutes (choking up) waiting for the police to show up.\"</p>                \n                \r\n\n            \n                <p><b>(EDIT)</b></p>                \n                \r\n\n            \n                <p><b>SHERIFF:</b> \"Officers engaged the suspect. There was an exchange of gunfire. The shooter threat was neutralized. <b>(EDIT)</b> The shooter is deceased.\"</p>                \n                \r\n\n            \n                <p><b>(EDIT)</b></p>                \n                \r\n\n            \n                <p><b>WITNESS:</b> \"People came into the library and said that we need to call 911 <b>(EDIT)</b> I have no idea how to handle it (crying) I'm so blesses that I was ok.\"</p>                \n                \r\n\n            \n                <p><b>(EDIT)</b></p>                \n                \r\n\n            \n                <p><b>SHEPARD SMITH:</b> \"Kourtney Moore, an 18-year-old from Rogue River, Oregon was in her Writing 115 class at Snyder Hall where all of this happened when she heard a shot come through the window. &#160;She said she watched as her teacher was shot in the head. The gunman was inside the building at that point she said and was ordering people to get on the ground. &#160;Ms. Moore said the man asked people to stand up and state their religion and that then he began firing.\"</p>                \n                \r\n\n            \n                <p>At this hour there are 10 reported dead, seven others wounded.</p>                \n                \r\n\n            \n                <p>The gunman, a 20-year old unidentified man, was shot dead by police.</p>                \n                \r\n\n            \n                <p>Now this is another black mark for all Americans, as people around the world must wonder what is really going on in the land of the free.</p>                \n                \r\n\n            \n                <p>And it is our freedom that allows insane individuals to kill so many people.</p>                \n                \r\n\n            \n                <p>Guns are legal in America under the Second Amendment.</p>                \n                \r\n\n            \n                <p>Tonight President Obama delivered impassioned anti-gun remarks, which we will discuss later.</p>                \n                \r\n\n            \n                <p>But the mass murder today could not have been prevented by any legislation in my opinion.</p>                \n                \r\n\n            \n                <p>Roseburg, Oregon is about as normal as it gets. &#160;A rural area that enjoys the stunning nature Oregon provides and a relatively simple lifestyle centered on family and community.</p>                \n                \r\n\n            \n                <p>I worked in Oregon. &#160;I have visited Roseburg. &#160;It is a calm place. &#160;But it is also gun country, as hunting is big in the area and the rural setting. &#160;Means folks must protect themselves with firearms. &#160;Police protection is far away for many people.</p>                \n                \r\n\n            \n                <p>As a journalist, it pains me to report stories like this because I know how much personal damage is caused to the people and families affected by murder.</p>                \n                \r\n\n            \n                <p>The country itself takes a massive hit whenever this kind of thing happens.</p>                \n                \r\n\n            \n                <p>Thirty-two people killed at Virginia Tech, 27 slain at Sandy Hook, 13 murdered at Fort Hood, 13 dead in Binghamton, New York, 12 murdered in Aurora, Colorado ... the same number at the Navy Yard in Washington.</p>                \n                \r\n\n            \n                <p>Charleston, South Carolina just last June, nine shot dead in a church.</p>                \n                \r\n\n            \n                <p>There is no rational explanation for all the carnage, none. &#160;And no public policy will stop it.</p>                \n                \r\n\n            \n                <p>We are living in a dangerous time where deranged human beings feel murder is an entitlement.</p>                \n                \r\n\n            \n                <p>But the situation has now reached the crisis stage, as America desperately searches for some kind of solution.</p>                \n                \r\n\n            \n                <p>Tonight we'll examine the situation from a number of angles.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The mass murder in Oregon", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/1", "date": "2015-10-02T13:07:56Z"}