{"vcmId": "160c8ff7-4149-464a-aa7e-790ae53d79ed", "url": "http://www.foxnews.com/transcript/2016/09/22/bill-oreilly-hitler-and-donald-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The left in America dazed and confused by how tight the presidential race is just a few days before the first debate. The liberal media in particular in panic mode so they're breaking out the evil card, Adolf Hitler.</p>                \n                \r\n\n            \n                <p>Writing in \"The Washington Post\" this week crazy left columnist Richard Cohen banters Trump's Hitlerian disregard for the truth. Basically Cohen putting forth that Trump is like Hitler in his thinking because, quote, \"he thinks the truth is what he says it is,\" unquote. Interesting. One point. According to most polls about two thirds of the American public believe the country is headed in the wrong direction.</p>                \n                \r\n\n            \n                <p>Yet, President Obama says his policies have put the U.S.A. in a good place. Is that true? Because the President says it is? Paging Richard Cohen. By the way, if you access the Hitler column online, \"The Washington Post\" suggests you read other articles such as Donald Trump is a unique threat to American democracy. Or this is how fascism comes to America. Or, the theory of political leadership that Donald Trump shares with Adolf Hitler.</p>                \n                \r\n\n            \n                <p>Finally, don't compare Donald Trump to Adolf Hitler, it belittles Hitler. Talking points is not making this up. Check it out. Now, the reason for that kind of hysteria, and that's what it is, has to do with voters not doing what \"The Washington Post\" wants them to do. A brand new FOX News poll out today has Trump up in Ohio, Nevada, and North Carolina, winning in those states. So, if enough deplorables show up on Election Day, Trump can win the election. That would spell doom for the progressive movement and our increasingly oppressive P.C. culture. There isn't a man on earth less P.C. than Donald Trump. And for committed progressive folks, he is a nightmare.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BONO, PHYSICIAN AND PHILANTHROPIST</b>: Look, America, he is like the best idea the world ever came up with. But Donald Trump is potentially the worst idea that ever happened to America potentially. It destroys. He's hijacked the party. I think he is trying to hijack the idea of America. And I think it's bigger than all of us. I think it's -- this is really dangerous.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, Bono really believes what he is saying. But what he and other anti-Trump people do not understand is that demonizing Donald Trump is useless at this point. We have heard it. What most Americans really want the next president to do is solve problems. Most of us understand that ideology has divided the nation that led to economic and security hardship.</p>                \n                \r\n\n            \n                <p>So you can Third Reich it all day long but it's not going to matter come November. The candidate who best articulates security and economic improvement will win. It's that simple. And that's 'The Memo'.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Hitler and Donald Trump", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 9/21", "date": "2016-09-22T13:04:12Z"}