{"vcmId": "168c626b-7555-4207-bc3c-943555822e60", "url": "http://www.foxnews.com/transcript/2016/07/01/bill-oreilly-finally-some-good-news-for-kate-law.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The nation was shocked when 32-year-old Kate Steinle was murdered in San Francisco just about one year ago, 45-year-old Juan Francisco Lopez Sanchez, an illegal alien from Mexico with seven felony convictions in the U.S.A. charged with murder. Not only was Sanchez allowed to roam the streets by San Francisco authorities but he had been deported five times and returned illegally six times.</p>                \n                \r\n\n            \n                <p>So, I proposed Kate's Law which would incarcerate illegal aliens, convicted of aggravated felonies for at least five years, they were caught defying deportation. You just sweep them off the street. My question, who would oppose that law? Who? Apparently Harry Reid would. The Senator and we will see about the other senators next week. That's when Kate's Law will finally be authored for a stand-alone vote in the Senate. Sixty votes are needed out of 100 to get the law in place for a full vote on the floor. Again, I simply can't believe that any sitting senator would not support Kate's Law. And we will tell you exactly who steps up and who does not.</p>                \n                \r\n\n            \n                <p>By the way, Senators Grassley, McCain, Cruz, Rubio and Sass have been heroes on this. Also, standing alone next week in the Senate. A new law that would hold -- withhold I should say, some federal funds from sanctuary cities, places that will not cooperate on federal immigration law. The bill is sponsored by Pennsylvania Senator Pat Toomey and has a lesser chance of success in Kate's Law because so many Democrats are invested in the illegal alien industry. And that's what it is an industry.</p>                \n                \r\n\n            \n                <p>Now, the reason Senate Majority Leader Mitch McConnell is finally getting these two bills to the floor in solo situations. Not together. Solo. Is twofold. The British vote to leave the EU ramped up the illegal immigration issue. And the upcoming election in November will mean that any Democrat voting against protecting Americans from violent aliens and the cities that harbor them will have to defend that vote when they run against a Republican opponent. It is assumed that all the Republican senators will support Kate's Law and the punishment of sanctuary cities.</p>                \n                \r\n\n            \n                <p>Summing up, simply inconceivable to me that any elected official would vote against harshly punishing violent foreign nationals who defy deportation. I can't fathom any responsible person doing that. And if a senator does vote against Kate's Law. We will deal with that person. On the sanctuary front again, in order to protect Americans from harm, immigration law must be obeyed. The issue is not as stark as Kate's Law but it is a litmus test of settled law versus anarchy. Is it not? And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Finally, some good news for Kate's Law", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 6/30", "date": "2016-07-01T12:52:23Z"}