{"vcmId": "1868d9c9-aee6-4862-8db6-76fb1190bfda", "url": "http://www.foxnews.com/transcript/2016/05/06/media-reaction-to-trump-clinton-matchup.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" May 5, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Thanks for staying with us. I'm Bill O'Reilly. In the \"Weekdays with Bernie\" segment tonight. Let's get right to the purveyor of BernardGoldberg.com who joins me from Miami. So, were you surprise to see last night, NBC News anchorman Lester Holt, good guy, at the Trump Tower broadcasting at the Trump Tower?</p>                \n                \r\n\n            \n                <p><b>BERNARD GOLDBERG, FOX NEWS CONTRIBUTOR</b>: Well, surprise. Not in the sense of the reason I think was because it was a ploy for ratings. So, I'm not surprised by that. If you tie yourself to Donald Trump in any way, it's good for ratings. Now, look, I wouldn't suggest that any news organization anchor an entire news program from the lobby of a building of someone running for president of the United States. But, there are far worse things going on in journalism. And this just isn't registering on my journalistic --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But now he has to go. Mr. Holt he has to go up to Chappaqua and do the show on Hillary's front lawn, does he need to be fair and balanced?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Right. Doesn't he?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> If I was Hillary, I would say I want Lester up here on my front lawn doing the show.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Are you suggesting that there is no news value in doing it from the lobby of Donald Trump's office building?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, I am suggesting that. But I'm also suggesting that if you are going to be a network news broadcast you can't go to one guy's house and not the other.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Well, I'm sure Hillary would welcome them to her front lawn.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: She could show them the server in the basement and everything.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>As I say, this isn't -- for some reason this is not registering on my Richter Scale.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I thought it was a little bizarre. I was picturing back with Huntley and Brinkley. Would Huntley and Brinkley been in the Trump Tower. I don't know.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> No. No. It's bizarre only if you don't accept that with Donald Trump running, everything is going to be a little bizarre and if you can get ratings out of it, a lot of people will do things that they wouldn't normally do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Like take phone calls from the candidate and that's unprecedented. Can you ever remember anybody -- any other presidential candidate calling in to news shows?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: No. I have got sort of mixed feelings on this one, too. Look, I think people, if the only way to get Donald Trump is to do it over the phone, some news organizations will do it and some won't. But, I would prefer to interview a candidate, he or she, sitting right next to that person. There is a certain dynamic. But, if Barack Obama called up any morning show or basically any show and said, look, let's say any morning show and said I'm not getting up in the middle of the night to be down at the studio at 6:30. If you want the interview I will do it over the phone, they would all say yes. So, and radio interviews when they interview candidates, they often do it over the phone.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, yes. That's a good point.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: I don't see this is --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Maybe I'm wrong for not allowing call-ins to The Factor. I will rethink it. But my rationale, so you know, was that if you're doing a phoner in here, you could have two or three guys whispering or writing you notes on what to say.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>No. That's a good point.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So I want, like you, you know, you're facing me now. You know, when you get in trouble, there is nobody to help you. The audience enjoys me filleting you. But if you were on the phone and you might have your wife saying, you tell him this. So, that's why I don't do it.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Hold on just a second. What?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. I know.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Tell him to shut up? Okay. Shut up, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, in the big picture, I believe most cable news operations and network news operations are overjoyed in the business sense that it's Clinton versus Trump. That's -- it's like the World Series L.A. versus New York. They want the big names and now they have them.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: I would say the only thing they're not happy about is that they can't put it on pay per view. That's the only thing they're not happy about. This is the show.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The show, right.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: This is the biggest -- and while they will cover the issues, this will basically be covered at least on television as a show. You know, when Henry Kissinger many years ago was asked what he thought of the Iran- Iraq war, he said it's a pity that they both can't lose. Well, millions of Americans feel the same way about these two. It's a pity that they both can't lose. They have high negatives, and that makes for a great show. There is going to be -- it's going to be nasty, it's going to be ugly, and forgive me for using a term I have used before. In the United States of entertainment, Bill, the only sin is being dull. And this will be many things but dull is not one of them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's right.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> That's why they will cover it as entertainment as much as anything else.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>This will be the first reality show presidential election in history. And that's what it is.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>That's right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, Bernie Goldberg, everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Media reaction to a Trump, Clinton matchup", "description": "Bernie Goldberg examines the network reporting of the two presidential candidates on 'The O'Reilly Factor'", "date": "2016-05-06T13:24:15Z"}