{"vcmId": "1966f098-78c8-495f-b91b-9bc1d204e58c", "url": "http://www.foxnews.com/transcript/2016/12/29/huckabee-blasts-kerry-speech-betrayal-to-israel.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 28, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: In the \"Unresolved Problem Segment\" tonight the frayed relationship between the Obama administration and one of the United States closest allies Israel. Less than a week after the U.S. abstained from voting on a resolution to condemn Israel for building settlements and disputed areas, Secretary of State John Kerry today defended the action and argued that a two state solution is the only path to peace in the Middle East.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOHN KERRY, SECRETARY OF STATE: </b>We reject the criticism that this vote abandons Israel. On the contrary, it is not this resolution that is isolating Israel, it is the permanent policy of settlement construction that risks making peace impossible. Now virtually every country in the world other than Israel opposes settlements.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Almost immediately after Kerry's speech, the Prime Minister of Israel slammed it as anti-Israel.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BENJAMIN NETANYAHU, PRIME MINISTER OF ISRAEL</b>: Now I must express my deep disappointment with the speech today of John Kerry. A speech that was almost as unbalanced as the anti-Israel resolution passed at the U.N. last week. In a speech ostensibly about peace between Israelis and Palestinians, Secretary Kerry paid lip service to the unremitting campaign of terrorism that has been waged by the Palestinians against the Jewish State for nearly a century. What he did was to spend most of his speech blaming Israel for the lack of peace by passionately condemning a policy of enabling Jews to live in their historic homeland and in their eternal capital Jerusalem.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Joining us now from Little Rock, Arkansas, former Republican presidential candidate Governor Mike Huckabee. It feels like this is one last shot Obama taking at BB Netanyahu on his way out. But it also feels like revenge to me. It feels like, do you remember when Netanyahu came out in favor of Donald Trump? It feels like this is hey, I got you now. This is my last shot at you right here.</p>                \n                \r\n\n            \n                <p><b>FMR. GOV. MIKE HUCKABEE (R-AR), FORMER PRESIDENTIAL CANDIDATE:</b> Well, let's be remindful that it was Obama's people that did everything they could and spend millions of dollars trying to defeat Netanyahu and involved themselves in a foreign election when he was up for re-election. Yes, it's personal. But, Eric, a lot is on the line. And when John Kerry made that ridiculous speech today, he bloviated for what seemed like an eternal amount of time. I thought, you know, that it made a Castro speech look like a tweet in comparison.</p>                \n                \r\n\n            \n                <p>But the sad thing is, he kept talking about the two state solutions and how Israel needed to give up something. I don't think a lot of people fully understand the complexity of this. I'm going to just quickly show you this little map. All that green, those are Arab-Muslim countries. You can't even see it but there is a tiny little red dot right there. That's Israel. Now, Israel has 1,640th of the land mass of all those Muslim countries. In John Kerry's fantasy, Israel is supposed to give up land and give it to people who could get it from those who have 640 times the amount of land that Israel has. Explain why that makes sense.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: This is important, Governor, I'm sorry. This is important because, you know, in negotiations the Palestinians are trying to negotiate with the Israelis. The U.N. with basically the backing of the United States says, look at what we have here. We have a resolution sanctioning Israel. That gives the Palestinians currency to negotiate. Does it not?</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> It not only gives them currency it gives them validity on the terrorism that they have sponsored and celebrated. They pay people a monthly salary if they kill a Jew. They name streets after people who kill Jews. They do not include on their maps Israel. Any form of Israel because they don't believe it should exist. Israel has offered -- back in 1995 Ehud Barak offered basically 95 percent of the Israeli land to get peace with Arafat.</p>                \n                \r\n\n            \n                <p>Arafat turned it down. Look, the Palestinians don't want peace. They want to destroy Israel. Golda Meir said it best back in 1972, there will be peace in the Middle East when Palestinian mothers love their own children more than they hate Jewish children. Eric, this is not going to be resolved. There is no such thing as a two-state solution if the second state is laying on top of the land that has been the land of the Jews since the time of Abraham 4,000 years ago.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Prime Minister Netanyahu today, today said that the Palestinian government pays anyone who murders Jews a salary.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: The thought of emboldening these people at the negotiating table it just blows my mind.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> Well, it should blow everybody's mind. It's one of the reasons that this resolution was so totally out of line. And for John Kerry to defend it and for him not to try to stand against it and veto it is a betrayal of our ally. Look, Israel is the only democracy between Africa and Asia. It's the only country that gives women total full rights as men have. Why doesn't John Kerry put a little pressure on the nations that subjugate women to a lack of education, won't let them drive? I mean, look at the differences here.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Help me figure this out. And I have a lot of Jewish friends. \"The Washington Post\" did a piece a couple of days ago saying that somewhere around north of 70 percent of Jews vote Democratic. Given what you know and given what's going on right now, why would a Jew vote a Democrat if this is their policy?</p>                \n                \r\n\n            \n                <p><b>HUCKABEE</b>: Well, it's one of the great imponderables of the world. I frankly can't understand why they would. Although a lot of people who are Jewish are maybe ethnically Jewish. But they are not necessarily religiously committed. They are not observant. And they are more liberal than they are Jew. I think that's unfortunate. But look, if anybody has been to Israel, and I've been, I mean, so many time I forgot and I will be there all next week. Here is the one thing you can understand. The Israelis have gone out of their way over and again to try to create peace but when people start talking the irrational insane words of saying, we will divide up Jerusalem. You can't do that, Eric.</p>                \n                \r\n\n            \n                <p>One quick thing to make clear. The Israelis protect the holly sites of Jews, Christians and Muslims. Can you name me one Muslim country that welcomes Christians to build and protect churches? No, you can't because there isn't one. And to say that the so-called Palestinians which by the way, they didn't exist until 1962 when Arafat coined the term, took it away from what had been everybody who lived in that area was a Palestinian.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: They took it.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE</b>: And created this group of people.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> They deemed it their own, kind of like what China is doing to South China Sea by the way.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> Exactly.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> They say this is ours. Mike, before we let you go about a minute or. The U.N., we fund -- the United States funds U.N. extensively -- the regular budget we account for about 22 percent. That is about $600 million in 2016. But there is a peace keeping budget, we have been talking about almost $2.5 billion as well. And further a voluntary contributions, they can be 7 or $8 billion as the U.S. funds the U.N. initiatives. Should we cut that back?</p>                \n                \r\n\n            \n                <p><b>HUCKABEE</b>: We should eliminate it, and I will tell you something, we ought to take that money that's going to the U.N. and make it available to veterans who have served under the U.S. flag and make sure they'll get the benefits they need. We are getting zero benefits. We are getting embarrassed by the actions of the U.N. That's money that ought to be spent on American servicemen and service women and I hope Donald Trump makes it one of the first acts of his presidency.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: I mean, guess what, we have a nice piece of real estate over on the East River over there of New York City as well if we do that. Governor Mike Huckabee, thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Huckabee blasts Kerry's speech: 'Betrayal' to Israel", "description": "Former Arkansas governor call the secretary of state's speech on peace in the Middle East a 'betrayal to our ally' on 'The O'Reilly Factor'", "date": "2016-12-29T13:49:26Z"}