{"vcmId": "1bfbe4c2-546e-407d-b3e0-5a9e3a261768", "url": "http://www.foxnews.com/transcript/2016/12/15/bill-oreilly-should-something-be-done-about-out-control-college-professors.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As we have been reporting, many colleges across the country are dominated by far-left teachers who are now hysterical about the election of Donald Trump.</p>                \n                \r\n\n            \n                <p><b>OLGA PEREZ STABLE COX, ORANGE COAST COLLEGE PROFESSOR</b>: &#8220;A white supremacist and a vice president that is one of the most anti-gay humans in this country. &#160;And so we are in for a difficult time. &#160;And then again I do think we can get past that. &#160;Our nation is divided. &#160;We have been assaulted. &#160;It&#8217;s an act of terrorism. &#160;One of the most frightening things for me, and most people in my life, is that the people who are leading the assault are among us. &#160;It is not some stranger from other country attacking our sense of what it means to be an American.&#8221;</p>                \n                \r\n\n            \n                <p>That was said in a classroom at the Orange Coast College in Costa Mesa, California.</p>                \n                \r\n\n            \n                <p>Of course it is simply gibberish slander, intellectually absurd.</p>                \n                \r\n\n            \n                <p>Yet the college pays that instructor to &#8220;assault,&#8221; using her word, her students.</p>                \n                \r\n\n            \n                <p>I mean, come on. &#160;Who wants to hear that kind of diatribe in a psychology class?</p>                \n                \r\n\n            \n                <p>So the question then becomes what should be done to stop the madness?</p>                \n                \r\n\n            \n                <p>It's a tough one because many college professors have tenure, which means they can't be fired no matter what they do. &#160;And there is the freedom of speech issue.</p>                \n                \r\n\n            \n                <p>But there comes a point when the nation has to know exactly what is happening in its institutions of higher learning.</p>                \n                \r\n\n            \n                <p>If you know your history, every totalitarian regime controlled the schools.</p>                \n                \r\n\n            \n                <p>In 1930s Germany, in the Soviet Union, in China after Mao took over, it was propaganda across the board in the classroom.</p>                \n                \r\n\n            \n                <p>And if the teachers didn't toe the line, they were fired or worse.</p>                \n                \r\n\n            \n                <p>Now we have the totalitarian left in America and if you don't see it their way, you are attacked and demonized.</p>                \n                \r\n\n            \n                <p>And if you're a student, you can be punished through the grading system.</p>                \n                \r\n\n            \n                <p>This cannot continue.</p>                \n                \r\n\n            \n                <p>It is up to each individual state to monitor what happens in their public colleges and high schools.</p>                \n                \r\n\n            \n                <p>Even in private school, if the institution gets taxpayer money, the state has a right to know what is going on.</p>                \n                \r\n\n            \n                <p>It is time for governors to hold college administrators responsible for crazy stuff going on in the classrooms.</p>                \n                \r\n\n            \n                <p>Academic freedom is one thing. &#160;Harming students with insane ideology is something else.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Should Something Be Done About Out-of-Control College Professors?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 12/14", "date": "2016-12-15T13:07:39Z"}