{"vcmId": "1c41da24-499a-49ad-8f89-77aad536b6a1", "url": "http://www.foxnews.com/transcript/2015/05/13/clinton-foundation-corporate-conflicts.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" May 12, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Thanks for staying with us, I'm Bill O'Reilly. In the \"Impact\" segment tonight, as we reported, Giant Corporations like General Electric and Boeing donated big money to the Clinton Foundation. Both corporations may have emails they will not release about the situation. Now we learn from the Washington examiner that Chevron may have donated up to a million bucks to the Clinton Foundation while it was lobbying Hillary Clinton State Department to intervene in the case involving the country of Ecuador. Subsequently an Ecuadorian court ordered Chevron to pay a whopping $9.5 billion in damages after the court found the company polluted the rain forest there.</p>                \n                \r\n\n            \n                <p>According to the examiner, Chevron's CEO John Watson actually spoke to Hillary Clinton face to face about the situation in 2012 nevertheless, the Clinton Foundation accepted Chevron's money.</p>                \n                \r\n\n            \n                <p>With us now Monica Crowley and Alan Colmes, both a FOX News analyst. But Colmes, surely, surely you see that an acting secretary of state, meeting face-to-face with a CEO of Chevron, discussing a case in a foreign country cases where billions of dollars gone against Chevron and then a one-million-dollar, up to one-million-dollar donation rolls in to Mrs. Clinton's foundation surely you see that as troubling.</p>                \n                \r\n\n            \n                <p><b>ALAN COLMES, RADIO TALK SHOW HOST:</b> Well, Bill Clinton's foundation, I'm not sure you can quid pro quo there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is it troubling?</p>                \n                \r\n\n            \n                <p><b>COLMES: </b>Yes. Yes, it's troubling.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Let's start there.</p>                \n                \r\n\n            \n                <p><b>COLMES:</b> I don't think you can prove the quid pro quo.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Look, we can't prove anything on television. So you say it's troubling?</p>                \n                \r\n\n            \n                <p><b>COLMES:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The next step then is, I have called for an FBI investigation because the press can't get to the bottom of bottom of this because we can't get the emails out of G.E., or Boeing or Chevron. The FBI can. All right? The FBI can look at Mrs. Clinton's server and retrieve the deleted messages there. Would you support an FBI investigation?</p>                \n                \r\n\n            \n                <p><b>COLMES: </b>Yes, let them look as much as they can.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Then I have gone one step further because I look out for all Americans and said to Hillary Clinton that she, herself should call for an FBI investigation to clear her own name.</p>                \n                \r\n\n            \n                <p><b>COLMES: </b>Yes. Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And you support that?</p>                \n                \r\n\n            \n                <p><b>COLMES:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. You can leave now.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>COLMES: </b>Did you not expect my answers to be what they were?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, I didn't. Because you are generally a loon.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>That says U.S. grant did something worse back in 1872.</p>                \n                \r\n\n            \n                <p><b>COLMES: </b>I give you direct answer.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You did for once in your life. And your hair isn't messed up.</p>                \n                \r\n\n            \n                <p><b>MONICA CROWLEY, FOX NEWS CONTRIBUTOR: </b>The rest of the segment is mine.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, you. Okay.</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>Yes. Now me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, look, have you convicted Hillary Clinton in your mind? Have you convicted her of wrongdoing?</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Well, let me put it this way, we have a known quantity in Bill and Hillary Clinton for 25 years. There is a pattern of conduct, corruption, lying that we have seen from them over two decades. In this particular case with the Clinton Foundation, what we have is mountains of circumstantial evidence. So when Alan talks about well, you can't really put a quid pro quo together that may be true right now, but people get convicted of murder based on circumstantial evidence. And the circumstantial evidence now looks pretty damning.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. But have you, you dodged my question. Have you convicted the woman?</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>Well, look, I obviously want to see more.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Answer honestly, have you convicted her?</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>I convicted her a long time ago because I'm a conservative.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Is this double jeopardy or triple jeopardy for you?</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>You know, what would be fascinating for Hillary Clinton to do what Alan and you are suggesting and say, look --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I suggested and Alan agreed with. He would never in a million years would Alan have ever suggested it.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>COLMES:</b> I agree with you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>She was implying that you suggested. In equal terms with me which is crazy.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> That would be totally counter intuitive and would be punk rock. And if she nothing to write --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It would be punk rock?</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What does that mean?</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Rebellious.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> She would tell the American people I have nothing to hide here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Listen, I'm deadly serious, people think that I'm being sarcastic or something like that, I'm not. Bill and Hillary Clinton should hold a press conference, answer the questions that are lodged, but say we want an FBI investigation to clear our names.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> I wrote my column -- my column last week in \"The Washington Times\" suggested that Hillary should go in front of the American people the way Richard Nixon did in 1952 when he was accused of having a political.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. But he had a dog. Hillary had a dog.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> He had a checkered dog.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He had to rent a dog to do that.</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>Wait a minute. Let me finish my point here. The only reason that that speech worked for Nixon and saved his political career is because he had the truth on his side. She has not said words and that speaks volume.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Hillary Clinton is not in that position.</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>That's right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>She is still the frontrunner, will get the nomination.</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>We will see.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, she doesn't have to do any of this.</p>                \n                \r\n\n            \n                <p><b>COLMES:</b> She can get coaching on how to pet a dog.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. She can do that. All right. It will be interesting to see what happens. But the FBI absolutely has to get involved in this. Thank you both.</p>                \n                \r\n\n            \n                <p><b>COLMES: </b>Thank you.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Pleasure.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The Clinton Foundation's corporate conflicts", "description": "More damaging allegations surrounding donations", "date": "2015-05-13T13:57:28Z"}