{"vcmId": "1caa3a9b-4d99-40e5-9e0f-ce0731a5ff3a", "url": "http://www.foxnews.com/transcript/2015/10/21/bill-oreilly-kate-law-donald-trump-and-ben-carson.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As we predicted here on The Factor, Democrats in the Senate blocked a vote on Kate's Law today. That is the bill that would impose a mandatory five-year prison sentence on any illegal immigrant convicted of an aggravated felony who is deported and then returns after being deported. Five years mandatory.</p>                \n                \r\n\n            \n                <p>The reason the Democrats blocked Kate's Law is that it was attached to defunding sanctuary cities which the left does not want to do. Foolishly, instead of simply voting straight up on Kate's Law, the senate put both pieces of legislation together.</p>                \n                \r\n\n            \n                <p>Everybody knew that would doom the vote. Everybody knew it. Yet the Republican leadership did it anyway. That's what makes Americans furious with the political system in Washington.</p>                \n                \r\n\n            \n                <p>On Gretchen Carlson's program today Senator Rand Paul actually tried to justify the situation which is just another reason Paul will never be president of the United States. The truth is politicians are playing games with our safety.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. HARRY REID (D-NV), MINORITY LEADER:</b> Democrats believe (inaudible) and local law enforcement are better judges on what keep their communities safe than Donald Trump or Bill O'Reilly. The safety of our neighborhoods and local communities should not be a pawn for a Republican latest gambit tied to their failure to act on comprehensive immigration reform.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Senator Reid, the poster boy for anarchy, could not care less about the death of Kate Steinle -- could not care less. All he cares about is complete amnesty for undocumented immigrants. That's it.</p>                \n                \r\n\n            \n                <p>Now, this is why Donald Trump and Ben Carson continue to lead in the Republican polling. Recent CNN poll has it this way: Trump 27, Carson 22, Marco Rubio 8, Jeb Bush 8; everyone else 5 percent or below. NBC/Wall Street Journal: Trump 25 percent, Carson 22 percent, Rubio 13 percent, Ted Cruz 9 percent, Bush 8 percent, Carly Fiorina 7 percent; everybody else below 5 percent.</p>                \n                \r\n\n            \n                <p>It's obvious many Americans are fed up with politics as usual and want to crush the current system. Both Trump and Carson support Kate's Law and would not play games with it.</p>                \n                \r\n\n            \n                <p>There comes a point where the American people are going to have to take back their government when a 32-year-old woman can be gunned down by an illegal felon who had been deported five times, and you can't get a strict law punishing illegal alien felons passed? When that happens, you don't have a functioning government.</p>                \n                \r\n\n            \n                <p>It's hard to believe but the far left in America actively opposes Kate's Law. Recent editorial in the New York Times actually sympathize with the man charged with killing Kate, quote, \"Mr. Lopez Sanchez was a homeless man with drug convictions but no record of violent crime. The bullet he fired was found to have ricocheted off the pier, suggesting that he had not targeted anyone. The suggestion that it was a horrific accident could well be true,\" unquote.</p>                \n                \r\n\n            \n                <p>Well, here's the truth. Juan Lopez Sanchez Was convicted of seven felonies in the U.S.A. including selling hard drugs. He was deported five times. He came back six times. He broke into a car in San Francisco. He stole a gun. He recklessly fired that gun in a public place. And Kate Steinle died. Yet, he is portrayed as a homeless man who just might have committed an accident.</p>                \n                \r\n\n            \n                <p>It's unbelievable -- unbelievable is too gentle a word.</p>                \n                \r\n\n            \n                <p>Finally, I'm not going to give up. Senator Charles Grassley, a hero on Kate's Law, is trying to get a stand alone vote.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. CHUCK GRASSLEY (R), IOWA: </b>Thanks to many people, including TV's Bill O'Reilly, for keeping this issue constantly before the people of this country. This part of the bill then named by Bill O'Reilly commonly referred to as Kate's Law has become so important to many Americans.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, we will see if Grassley's quest will finally lead to justice in the United States Senate. But, if it does not, hear me well, we will confront the villains no matter which party harbors them.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Kate's Law, Donald Trump and Ben Carson", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/20", "date": "2015-10-21T12:20:09Z"}