{"vcmId": "1eba4ba8-2316-4b6f-8d09-3b2500d7a9b7", "url": "http://www.foxnews.com/transcript/2015/04/20/suzanne-somers-enters-no-spin-zone.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 17, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Back of the Book\" segment tonight, as you may know, actress Suzanne Somers has written a number of books on health. She wants everyone to live longer including me. When I heard that I was flattered, so I talked with Ms. Somers, the author of the brand new book \"Tox-Sick\" yesterday.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So I asked Suzanne Somers to come in here because she has written like 95 books on how to be healthy, right?</p>                \n                \r\n\n            \n                <p><b>SUZANNE SOMERS, AUTHOR, \"TOX-SICK\":</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, I'm going to go down my regimen of the day and you're going to tell me what I should do and not do.</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, I get up pretty early in the morning.</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>You need eight hours for all the repair work to happen. And if you can sleep eight hours without drugs.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, I don't use any drugs.</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> Me neither.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, I don't.</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> Then you are so ahead of the game.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, I wake up sometimes in the middle of the night, all right? Because I have brilliant thoughts that come to me and I go, wow that's a good thought. All right?</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>But you know what turns that noise off if you take a supplement called Gaba, g-a-b-a.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> And it just sort of takes the lists away.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Isn't that a drug?</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> No.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's a supplement?</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> Just a supplement.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So then -- from breakfast I have Japanese tea.</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>Great.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right?</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> A lot of genistein (ph) in that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. Japanese tea. And then I have maybe a piece of gluten- free toast.</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>Perfect.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>A little butter on it because I have to flavored up. No problem.</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> Absolutely. Ever since we went on the low fat movement, we've gotten fatter and sicker. Actually, with this new book I have, \"Tox-Sick,\" you actually helped me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>I was watching you one day and I went, yes, because there were 80 different strains of wheat and engineered down to five so the gluten content --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> And so that's kind of started me on the journey of writing this book of why are there so many allergies, why so much brain, ADD, ADHD --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Because it's in everything.</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> And everything.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. Then a lunch I have maybe a tuna sandwich or ham and cheese and some soup.</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>Uh-mm. Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You know, chicken with rice, something like that.</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> Great. But what kind of bread?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Some of the bread isn't that good. But, I don't eat a lot of the bread, I kind of take the croissant. I'm a sissy. But that's okay?</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> Yes. Well -- see, our fish is kind of wrecked. You have an amazing brain. And mercury settles up in the brain. You might try an egg sandwich.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. For supper, I eat anything I want now. All right? So, I can go for a steak or a hamburger. I have a sweet tooth. A little dessert.</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>Okay.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I try not to eat too late.</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>Yes. Well then start to digest. But your stake, do you ask for a grass fed?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Grass fed?</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, I ask.</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>You do?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And then the guy who cooks the steak laughs and gives me what he has. See, again this is New York, it's not the west coast. So, if it's grass fed, it's better.</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>If your cow ate corn which is what they're feeding the cows now, they go with corn fed which is against their natural evolutions, and then they get infection and E. coli and then they have to give that cow antibiotics.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So I'm not a fanatic about anything. I do eat some sugar. I think sugar is bad --</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> Bad. Bad.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>-- because it puts weight. But I have a little --</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But life expectancy is around 80 years old in America.</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> The future is saying 110.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But who wants to live to be 110?</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>What if you get to 110 and your brain is still sharp, and you don't have any bone loss?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No bone less?</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>No bone loss.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How I do prevent bone loss?</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> Well, testosterone.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Testosterone?</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I have plenty of that.</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>Yes, do you. You do. But it has to be declining. And so you take a blood test and see where your levels have dropped. And then you fill the tank.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How about DHEA?</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>Absolutely, that is a precursor to testosterone.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. All right.</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>I take estrogen, progesterone, DHEA, I take -- I don't --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>A lot of people they say, you know, too much of that and your toes are going to fall out.</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> Five blood tests, exactly what I need, not too much, not too little. I'm like goldilocks.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You're a happy person, right?</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> I'm a happy person. Yes. And seen, you would have been like a freshman in high school when I was a senior. And I would have been that happy girl in school.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And you would have been mocking me.</p>                \n                \r\n\n            \n                <p><b>SOMERS:</b> I would have dated you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Dated? You'd be lucky if you even pass me in the hallway. Get him out of here!</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>All right. Congratulations on trying to make the American population more healthy. And we always tell people, you know, read the books. But check with your doctor beforehand what's best for you. Thanks for putting up with me Suzanne Somers.</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>I get who you are.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>One of the very few.</p>                \n                \r\n\n            \n                <p><b>SOMERS: </b>I went to Catholic School.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Once again, Miss Somers book is called \"Tox-Sick\" from Toxic to not sick, that rhymes</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Suzanne Somers enters the 'No Spin Zone'", "description": "Actress weighs in on health and her new book", "date": "2015-04-20T13:38:37Z"}