{"vcmId": "1eed7dd5-42a7-4364-b939-115f0b78e061", "url": "http://www.foxnews.com/transcript/2016/06/22/more-far-left-propaganda-concerning-radical-islam.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 21, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact\" segment tonight. More propaganda from the far left concerning radical Muslim terrorism.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JONES</b>: You are seven times more likely to be killed by a right wing extremist, racist or antigovernment nut job. Seven times more likely to be killed by that person than a Muslim. If a Christian shoots somebody we don't say a Christian shot them. But if a Muslim shoots somebody we say a Muslim shot them. I think that's starting to muddy the waters.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Muddy the waters. Well, Mr. Jones got that phony statistic from the liberal Think Progress organization which is ridiculous to say the least. According to the new America group, a liberal think tank which studies terror deaths in the U.S.A., Van Jones is not even close. Not counting the attack on 9/11, 94 people have been killed on U.S. soil due to violent jihadist attacks including Orlando. Forty eight have been killed on U.S. soil due to far right wing attacks. Doing the math nearly twice as many people have been killed by the Jihadists compared to far right nuts.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington, Kirsten Powers. So, are you as fed up with this propaganda as I am?</p>                \n                \r\n\n            \n                <p><b>KIRSTEN POWERS, FOX NEWS ANALYST</b>: Well, I wouldn't call it propaganda. I think it's something that people do believe and I think that -- but I do think the issue of the fact that people on the left side of the political spectrum and I'm going to put myself on this category. I did my column on in this week, actually, do tend to look at these attacks like the one in Orlando and don't immediately go to saying that this is Islamic terrorism and are more inclined to look at the underlying factors such as he possibly was mentally ill, perhaps he was self-loathing gay person and these other things rather than immediately saying this was a terrorist attack.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What the record showed and what his computer showed and all of that and his background and his father and everything. But look, but you just said something, you said, I say propaganda and you said it wasn't propaganda because people believe it?</p>                \n                \r\n\n            \n                <p>Propaganda is distorting the truth. No matter people what people believe it or not. Van Jones gets on CNN and he spouts this nonsense that you have a seven percent higher chance of getting killed by some right wing nut than you do from a jihadist. Not true not even close to being true and that's propaganda.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> No. Propaganda. You're having the intent to deceive people essentially to make them --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>-- believe something. I don't think that that's what Van Jones is telling --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: We found that stat, we found that stat in 15 minutes, Kirsten.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Okay. Bill, but you know, is it possible that he read that study and believed it was true?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Then he shouldn't be on television. You don't just read something and spout it as fact.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: You know, Bill, sometimes you say things that don't end up nothing right too.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's not true. You just made a false statement. Every time I say something, if it's proven to be false I apologize and I can't even remember the last time we did that. The only mistake we have ever made here of any note was a secretary of agriculture when we took a piece of tape off a right wing website that had been edited which we didn't know ran it, made the woman look bad and I apologized for that. I don't say things through my hat and you must know.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: I didn't say through your hat.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You work for the FOX News Channel.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> You do say things sometimes that I don't think are true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, what you think doesn't matter. You have to prove that they are not true if you are going to make that accusation.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: I don't even know why are we going down this road?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Because propaganda is what I'm putting forth as being put out.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: I don't think, no, propaganda is the idea that he is trying to spread some falsehood to convince people that it's not true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's what he just did.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: But I think he believes that it's true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It doesn't matter if he believes it's true. He is spreading a falsehood.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Okay. Whatever. This isn't -- okay, I don't want to argue about it anymore.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. That's the crux of the story that the left so desperately wants to avoid the truth that the Islamic Jihadi is killing as many Americans as possible. The far left does not want to acknowledge it. But they Trump up phony stuff like that. That's the crux of the whole matter.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: I don't think that's what's going on. I think that people -- it's true that people on the left are less inclined to immediately want to say that it's caused by a Muslim terrorism.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Why? Why?</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Well, I can't get into the motivations of people. But I can tell you that certainly people on the left are always very concerned about historically marginalized people and I think that they would see, you know.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So they don't want to marginalized the jihadists?</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Well, no. So, the point, the reason I'm saying is because that flip side of it is, if a Christian did something, if a Christian blows up abortion clinic, then of course --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. When is the last time a Christian blew up an abortion clinic?</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Bill, you are missing my point. My point is that, from the people on the left that if that happens, they have no problem attaching religion to it. Okay?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, Jones just said that --</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: When a Muslim does it and they actually pledge allegiance to ISIS, then there still isn't some trepidation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. But I don't know of any Christians and this is Jones said this.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: You are not getting my point.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes, I am. But I am trying to get across to you what Jones did is intentional, all right? It's an intentional dissemination of propaganda that people believe.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: No it's not.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, it is. And I will tell you, and I will prove my case and I will give you 10 seconds to reply or whatever.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: When is the last time we heard that a Christian kill somebody in the name of John Calvin who started Presbyterianism or in the name of Pope Francis. I'm going to kill all those people because I love Pope Francis. When is the last time that happened?</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Well, certainly there are Christians who have attacked abortion clinics and said that they felt God told them to do that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: When? When was the last time that happened?</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: A long time ago. I mean, it has been a long time. But you are asking me if it ever happen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And they didn't do it in the name of any Christian saint or anything.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Right. That's what I'm saying. But I don't think that that person is doing it as a Christian. I think the person is probably mentally ill and obviously has some problems. But they're doing --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Christian religion doesn't preach violence.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: -- any Christian would denounce it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The Christian religion doesn't preach Jihadi or Holy War and the crusades were an embarrassment for Christianity. And that's -- I think President Obama referenced that back in the day.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Kirsten Powers, everybody. Always lively.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "More far left propaganda concerning radical Islam", "description": "Kirsten Powers examines Van Jones' controversial comments on 'The O'Reilly Factor'", "date": "2016-06-22T12:05:04Z"}