{"vcmId": "20252d2d-b9ee-45df-9c06-189f43678f49", "url": "http://www.foxnews.com/transcript/2017/03/29/bill-oreilly-congresswoman-attacks-president-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>For years Maxine Waters, a Democrat from California, has been an outspoken left-wing voice, highlighting the oppression she believes black Americans experience.</p>                \n                \r\n\n            \n                <p> Talking Points believes Ms. Waters is totally sincere in her belief system and although many Americans disagree with her extremism at times, she deserves a hearing and should not be marginalized by political opponents.</p>                \n                \r\n\n            \n                <p> In fact I made that mistake this morning on Fox &amp; Friends. I said in a simple jest that the congresswoman's hair distracted me. Well that was stupid, I apologize. It had no place in the conversation.</p>                \n                \r\n\n            \n                <p> Now, it&#8217;s not necessary to poke fun at anyone who is speaking from the heart in the public arena in my opinion.</p>                \n                \r\n\n            \n                <p> But it is necessary to analyze what is being said:</p>                \n                \r\n\n            \n                <p> <b>REP. MAXINE WATERS (D-CA)</b>: &#8220;Despite the fact that America has not always been there for us, we&#8217;ve always been there for America. We have fought in America&#8217;s wars. We have suffered discrimination, we have suffered isolation and undermining, but we stand up for America, oftentimes when others who think they are more patriotic, who say they are more patriotic, do not. When we fight against this president, and we point out how dangerous he is for this society and for this country, we&#8217;re fighting for the democracy.&#8221;</p>                \n                \r\n\n            \n                <p> Now it would be instructive for Ms. Waters to come on The Factor to define her beef. What&#8217;s bothering her about President Trump?</p>                \n                \r\n\n            \n                <p> But of course she will not do that, way too risky, because she would be challenged by and she doesn&#8217;t want to be challenged.</p>                \n                \r\n\n            \n                <p> The record shows that President Trump has put forth a philosophy that would certainly help the poor, including African-Americans in that category.</p>                \n                \r\n\n            \n                <p> The more jobs that are created, the higher incomes will be on every level.</p>                \n                \r\n\n            \n                <p> The more Americans hired, the easier it will be to get a job.</p>                \n                \r\n\n            \n                <p> The more companies expand, the more demand there will be for labor.</p>                \n                \r\n\n            \n                <p> The more discipline imposed in public schooling, the more the kids will learn and education is the most important anti-poverty program there is.</p>                \n                \r\n\n            \n                <p> So what exactly is Maxine Waters talking about when she says Mr. Trump is dangerous for America?</p>                \n                \r\n\n            \n                <p> I have no idea, and I do not think Ms. Waters has any clue either.</p>                \n                \r\n\n            \n                <p> She is just spouting the left-wing company line, and anyone who disagrees with her &#8230; well, she doesn&#8217;t brook disagreement.</p>                \n                \r\n\n            \n                <p> That's not patriotism madam, that's demagoguery.</p>                \n                \r\n\n            \n                <p> It would take a miracle, but I really wish liberal advocates like Congresswoman Waters would stop the ideological nonsense and really focus on what America offers every responsible citizen --opportunity, a variety of ways to success, freedom of expression that Ms. Waters makes good use of and a real chance to help yourself and help others in your life.</p>                \n                \r\n\n            \n                <p> But in order to succeed in this country, you must be self-reliant, not dependent on the entitlement system that Maxine Waters loves so much.</p>                \n                \r\n\n            \n                <p> You must work hard.</p>                \n                \r\n\n            \n                <p> You must learn and develop a skill off the knowledge that you acquire in school.</p>                \n                \r\n\n            \n                <p> And you must be honest.</p>                \n                \r\n\n            \n                <p> That's the message Congresswoman Waters and others should be spreading.</p>                \n                \r\n\n            \n                <p> Patriotism comes in many forms.</p>                \n                \r\n\n            \n                <p> Questioning the patriotism of others and bashing a new president isn&#8217;t patriotic.</p>                \n                \r\n\n            \n                <p> It is useless.</p>                \n                \r\n\n            \n                <p> And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: A Congresswoman Attacks President Trump", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/28", "date": "2017-03-29T12:02:00Z"}