{"vcmId": "21849f81-6553-4345-82f9-5b37d8089ee1", "url": "http://www.foxnews.com/transcript/2015/02/03/confronting-anti-semitism-and-jihadists.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 2, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Back of the Book\" segment tonight, let's bring in Charles Krauthammer joining us from Washington. So, you read my talking points memo about how to beat ISIS and the other terror groups in comparison to the Nazis, what do you think?</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, FOX NEWS CONTRIBUTOR:</b> Well, I like your idea of the great coalition. The problem is it's been tried and it has failed. We actually did try that in Afghanistan. That's the first time that the NATO alliance has operated outside of the area, in Asia of course, Afghanistan. And we saw what happened. A new president comes in 2009, he obviously telegraphs that he's tired of the war, he pledges he's going to end the wars. Our allies look around and say we're not going to be suckers, we're not going to hang around here. And they're gone. They essentially --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> There's a big difference now though because ISIS is so much worse than -- or the perception anyway. I mean, Taliban killing the kids, I think that woke a lot of people up. But ISIS is so much worse. Now, did you see the documentary on HBO? Did you watch it?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> I don't watch documentaries on holocaust, I know a little bit too much about it already.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. And that's about it. But it was good because there are a lot of people who don't know anything.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> I understand. But for me it's a personalized well historical thing. So, I know a lot about it. And I know, look, everyone knows what Germany did. But the difference is, the reason that the world mobilized against the Nazis was that Hitler invaded and concur all of Europe.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>While he was rising, while he was threatening everybody went for appeasement.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But there isn't a difference between the ISIS guys that are beheading people on camera and Hitler and his thugs. There's no difference. It's the same thing. And I'm trying to get this across because once you get nukes running wild, all right? Then the mass murder that Hitler engaged in is possible again. And the nuke thing is like this far away. And we have people in America have no clue, no concern, don't know what's going on. You have a president who fails to engage. You know, we'll stop their advance, we're not going to go get them. And I'm not really going to do anything proactively, I think it's just off the chart dangerous.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> But look, we're looking at is, which is a terror group in control of some territory. But nowhere near a nuclear weapon. We are now -- this is not a theoretical issue. Iran is a jihadist state, happens to be Shia run by a fanatical apocalyptic regime. Intensely and fanatically anti-American, anti-Semitic, et cetera. And also against a lot of Sunni Arab neighbors, it is on the threshold of going nuclear. This is not a theoretical issue.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, I know.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> It's not a long grange issue. We have a president who is in the middle of negotiating a deal where as it's been reported and I think it is rather true, we've already conceded 80 percent of our starting position where if we get what we are supposedly asking for, Iran is on the threshold of a nuclear weapon a few months away at any time it wants and into the indefinite future. So we are looking at allowing nuclear weapons into the hands of radical jihadists in Iran, a major state with 80 million people. And that is an existential threat to the region, to the Gulf Arabs, to the Israelis and ultimately, not today, not tomorrow, but they're working on intercontinental ballistic missiles. The only reason Iran wants to have them is to reach the United States. Not to reach Israel, which is just a stone's throw away.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Look, what I'm trying to do is nip this thing down. Look, if the world had mobilized against Hitler in 1935 or six, okay, he would have been crushed. He couldn't have defended himself.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> That is true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And the evidence was there. The evidence is there now. The jihadists will slaughter you if you are an infidel. Even if you're another Muslim, if you are a Shia, the Sunni ISIS will cut your head off. If you are a Sunni, the Iranians will blow you to kingdom come. So now is the time where the world has to mobilize. There's no leadership. There's nothing. There isn't even a spectrum --</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> But the reason there's no leadership is because it doesn't come from the United States. You do not expect a decadent Europe to actually rise up against its enemies. It didn't in the '30s. It's not going to do it today. Think of the gulf war, the war against --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you think we can lead them though? I mean, Japan saber rattling now for the first time since the World War II because they had the guys beheaded, they too soon. Do you think we could lead them into a coalition of 20 nations --</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>We can lead them. We showed in 1990 that we can lead them. We had a president who said the invasion of Kuwait, this will not stand whether I have allies or not. What happened? Everybody lined up behind the United States. Now we have a president who says the war is over, I pledged I'm going to end the war. There is no war. And there's no leadership. The only thing -- the only way the world will rise is if the United States leads and there's none of it in this administration.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The only way that's going to happen is if we get another 9/11 or 3,000 dead or more. Charles as always.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> We're going to need unfortunately a new president. That's what I'm afraid.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Confronting anti-Semitism and the Jihadists ", "description": "Charles Krauthammer on whether Islamic terrorists can be compared to the Nazis", "date": "2015-02-03T13:25:41Z"}