{"vcmId": "21bdc254-dcb0-4363-bf94-21062c855a34", "url": "http://www.foxnews.com/transcript/2015/08/21/assessing-black-lives-matter-agenda.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 20, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BILL O'REILLY, FOX NEWS HOST:</b> Personal Story segment tonight, the Black Lives Matter movement. As you may know, they are disrupting political events by confronting candidates of both parties over perceived white supremacy. Now, it's hard to tell what the end game is here. But from what I have seen the Black Lives Matter crew is really about money, reparations for past and injustice.</p>                \n                \r\n\n            \n                <p>Earlier this week, our pal, Dr. Cornell West, very sympathetic to Black Lives Matter, talked with me about race.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right, Professor, I want you to react to something Thomas Sowell wrote. You know him, right?</p>                \n                \r\n\n            \n                <p><b>CORNEL WEST, PH.D., UNION THEOLOGICAL SEMINAR PROFESSOR:</b> Very sophisticated economist.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He says, quote, \"A salute to Bill O'Reilly for being one of the few people in the media to talk plain common sense about the disintegrations of the black family and the resulting social problems that follow.\"</p>                \n                \r\n\n            \n                <p>So, I want you guys in the Black Lives Matter movement to join me all right. Instead of directing your ire toward the large societal problem of African-Americans, let's get into the family fabric first, try to solve that and then go back to the other thing.</p>                \n                \r\n\n            \n                <p>Are you on board?</p>                \n                \r\n\n            \n                <p><b>WEST: </b>Well, we do have to begin with the system. Certainly, the internal challenge, black self-love, black self-respect, of sustaining a family, sustaining community, jobs with a living wage with decent housing, with quality education.</p>                \n                \r\n\n            \n                <p>But you can't overlook the vicious legacy of white supremacy, Brother Bill, you know it's coming.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>See, I don't buy that. You know I don't buy it. The white supremacy movement --</p>                \n                \r\n\n            \n                <p><b>WEST:</b> The legacy of it I'm talking about, the legacy of white supremacy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Irish have legacy.</p>                \n                \r\n\n            \n                <p><b>WEST:</b> Arbitrary --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You can do that with every race.</p>                \n                \r\n\n            \n                <p><b>WEST:</b> Oh, no, no.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Every color --</p>                \n                \r\n\n            \n                <p><b>WEST:</b> Ethnicity. We had a civil war over white supremacy. Didn't have civil war over Irish brothers and sisters.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The Irish were brutalized by the British and to this day that resonates. But we have to look forward. Are you a socialist? Are you like Bernie Sanders you are a socialist? You want the government to basically seize assets and to redistribute? Is that what you want?</p>                \n                \r\n\n            \n                <p><b>WEST: </b>I am a revolutionary Christian who looks at the world through the vantage point of the weak and the vulnerable. So, it's not a matter of - isms. I want to make sure each person made in the image of God is able to live a life of decency and dignity.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But that takes resources to do.</p>                \n                \r\n\n            \n                <p><b>WEST: </b>You can't do it when 40 percent of your children living in poverty.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK.</p>                \n                \r\n\n            \n                <p><b>WEST: </b>Black and brown. Twenty-two percent of all children, no matter what color living in poverty. Yes, we've got to eliminate poverty.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So, by elimination of poverty you want to take from those who have and then give to those who have not, correct?</p>                \n                \r\n\n            \n                <p><b>WEST: </b>Well --.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is that correct or not, professor?</p>                \n                \r\n\n            \n                <p><b>WEST:</b> You know, we have got to put it in context, there's already been a redistribution of wealth from poor and working people --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> This is just justice you want?</p>                \n                \r\n\n            \n                <p><b>WEST:</b> No. We want --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Do you want to take from me and I'm totally innocent about the historical stuff. I'm totally innocent. You want to take my stuff and give it to other people because of what may have happened in the historical past.</p>                \n                \r\n\n            \n                <p><b>WEST: </b>The government has already taken from you in terms of taxes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They have. They take a lot.</p>                \n                \r\n\n            \n                <p><b>WEST:</b> Goes to the military rather than to quality education, quality jobs and so forth.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We live in a dangerous world. You have to protect all people.</p>                \n                \r\n\n            \n                <p><b>WEST:</b> But we don't need 54 percent of every dollar.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's what you see but I know danger.</p>                \n                \r\n\n            \n                <p><b>WEST: </b>You talk about the waste.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I hate the waste.</p>                \n                \r\n\n            \n                <p><b>WEST: </b>We agree this that regard.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you like Cuba? Do you like that system over there?</p>                \n                \r\n\n            \n                <p><b>WEST:</b> No Cuba is too authoritarian. I heard you say the other day when you talked about Bernie Sanders he wants to take your house away and leave you with the flag. That sounds like in 2008 in terms of the financial catastrophe and capitalist greed on Wall Street.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I hate capitalist greed. Bernie is a socialist. You don't admit to being one, but I know you are.</p>                \n                \r\n\n            \n                <p><b>WEST:</b> I am a Democratic socialist.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You are.</p>                \n                \r\n\n            \n                <p><b>WEST:</b> But my identity is revolutionary Christian who looks at the eyes through the poor and working class.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I want to help the poor and working class.</p>                \n                \r\n\n            \n                <p><b>WEST:</b> But Bernie isn't (INAUDIBLE) combat and that's it. You want to help the class after it trickles down with the 1 percent.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, no. I want a dual process of fair economic system. I'm for the raising of the minimum wage.</p>                \n                \r\n\n            \n                <p><b>WEST: </b>I agree.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But personal responsibility has to be taught.</p>                \n                \r\n\n            \n                <p><b>WEST:</b> I agree personal responsibility is very important. I agree with that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's right. You can't continue to have 75 percent of black babies being born out of wedlock. You can't.</p>                \n                \r\n\n            \n                <p><b>WEST: </b>Thirty-five white babies out of wedlock.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That doesn't matter. You are deflecting the big problem.</p>                \n                \r\n\n            \n                <p><b>WEST: </b>I'm talking about it's a systemic problem. But if all you want to talk about --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Not all --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>WEST: </b>But you started the dialogue with brother Sowell personal responsibility, family. You say, wait a minute, you have got is percent of the population have 42 percent of the wealth. They used to have 20 percent. That's redistribution of wealth upwards, upward, upward.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>As African-Americans become more educated and become more sophisticated in the marketplace, that gap will shrink. You forcing it to shrink will never work. It never has worked.</p>                \n                \r\n\n            \n                <p>Last word.</p>                \n                \r\n\n            \n                <p><b>WEST: </b>What evidence do you have in terms of the free market functioning inequality is reduced? You don't have evidence of that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Because poor in America live better than most other middle class in the world.</p>                \n                \r\n\n            \n                <p><b>WEST: </b>The history of Irish brothers and sisters in America is, what? Tied to the public fear, policemen, firemen, moving into mayorship, moving into politics.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. But I want that for African-Americans, too. The same thing.</p>                \n                \r\n\n            \n                <p><b>WEST:</b> You want free market.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure, it was. It was education. It was family structure. It was a sense of responsibility, and that's how the Irish American moved up.</p>                \n                \r\n\n            \n                <p>Last word?</p>                \n                \r\n\n            \n                <p><b>WEST:</b> We've got still got Irish brothers and sisters locked in poverty.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> In the bible, the poor will always be with us.</p>                \n                \r\n\n            \n                <p><b>WEST:</b> What Jesus said is what you do for the least of these you do for me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's right. And we all try to do what we can.</p>                \n                \r\n\n            \n                <p>Always a pleasure to talk with you, professor. Nice to see you.</p>                \n                \r\n\n            \n                <p><b>WEST: </b>Stay strong.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>OK.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i><br> &#160;</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Assessing Black Lives Matter's agenda", "description": "Cornel West on the movement disrupting political events", "date": "2015-08-21T12:22:29Z"}