{"vcmId": "2251f239-00ca-4a85-b2f8-9728039d1354", "url": "http://www.foxnews.com/transcript/2015/06/17/donald-trump-running-for-president.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 16, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Hi, I'm Bill O'Reilly. Thanks for watching us tonight. The \"Talking Points Memo\" a bit later on about how liberal policies are actually keeping low income Americans down.</p>                \n                \r\n\n            \n                <p>But, first, \"A Factor Exclusive\". Donald Trump running for president.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Ladies and gentlemen --I am officially running for president of the United States, and we are going to make our country great again.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Along with that announcement, the 69-year-old Trump released his net worth today about $9 billion with a \"b\". He spoke for the better part of an hour basically saying that current politicians are wimps who will never solve the intense problems America currently has. Trump says is he can solve them.</p>                \n                \r\n\n            \n                <p>Now, I have known the man for almost 30 years. I have done some business with his jet fleet and occasionally we go to sporting events together. So he wanted his first post announcement interview to be on The Factor. Good for us.</p>                \n                \r\n\n            \n                <p>Here it is.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEOTAPE)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So this is like the lightening round here.</p>                \n                \r\n\n            \n                <p>You just tell me how you're going to solve these problems.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> OK.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> ISIS. How are you going to defeat ISIS?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I would hit them so hard. I would find you a proper general. I would find a Patton or a MacArthur. I would hit them so hard your head would spin.</p>                \n                \r\n\n            \n                <p>Now remember, and I sent you the document. I said in '04 we should not go in and do that whole thing with Iraq, it was a disaster, because I said Iran will take over and it will totally destabilize the Middle East.</p>                \n                \r\n\n            \n                <p>There's nobody bigger or better at the military than I am.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Are you telling me you are going to send American ground troops into Syria?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I'm not telling you anything. And the reason I'm not is because if I run and I win, I don't want them to know the game plan. Let me just say something --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. But you have to if you want to hit them hard you have to --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Bill, I agree. I'm probably going to have to say - I have a way that would be very effective with respect to ISIS. But when I watch Obama get up and talk about in two weeks we're doing this, and in three weeks we're doing that --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Are you going to put American ground troops in to chase them around?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>-- take back the oil. Once you go over and take back that oil they have nothing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But how do you take it back?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>You know right, you have to go in, you have to go in.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>With ground troops?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well you bomb the hell out of them and then you encircle it, and then you go in. And you let Mobil go in, and you let our great oil companies go in. Once you take that oil they have nothing left.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You're going to have unintended consequences. You're going to have Iraq not wanting you to do this. Syria not wanting you to do that.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>There is no Iraq, there is no Iraq.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So you don't respect them. You don't --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I don't have any respect for them, no.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right, so they're out.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I don't respect --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Syria, are you going to violate their territory?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No, interestingly Syria's supposed to be our enemy. Iran and Russia are protecting Syria and it's sort of amazing that we're in there fighting ISIS in Syria so we're helping the head of Syria who is not supposed to be our friend although he looks a lot better than some of our so-called friends.</p>                \n                \r\n\n            \n                <p>It's really rather amazing, maybe Syria should be a free zone for ISIS, let them fight and then you pick up the remnants.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. In order to defeat ISIS you're going to have to invade Syria. There's no way you can defeat them without invading. And I guess you're willing to do that.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I disagree. I say that you can defeat ISIS by taking their wealth.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Their wealth is the oil</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You mentioned Iran. Would you make a new deal with Iran? I mean they're obviously playing games over there.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I would make a deal but I wouldn't make that deal. That deal allows them to do practically whatever they want. The inspections -- wait -- the inspections are going to be a disaster.</p>                \n                \r\n\n            \n                <p>If we look and if you look at what's going on with this lack of negotiation right now. As sure as you're sitting there, Iran is doing nuclear. They're going nuclear.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So what do you do with them?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> You've got to either make a deal -- personally I'd put on the sanctions big league. I'd double and triple up the sanctions and make a deal from strength.</p>                \n                \r\n\n            \n                <p>Look, the biggest problem that the world has right now is nuclear weapons. Global warming is not our big problem. Our big problem is the maniacs that are controlling weaponry that has never been like it is today.</p>                \n                \r\n\n            \n                <p>It's very important to make nuclear deals but you have to make them from strength, not from weakness. And once they have the weapon it's all over (ph)-- then we don't have the strength any more.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok, the problem with the sanctions is that you're not going to get cooperation from Germany and these other countries.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Yes, you have to get them, that's what leadership is all about. You have to get them to work with us.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But they haven't worked with us.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> You have Obama that wants to play golf instead of deal with people. You know part of being a leader is to get everybody in line and get them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And you think you could convince?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Yes, I think I could. I really - that's what I've done. I've made a fortune with foreign countries.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Putin. What do you do to Putin?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Well, Putin has no respect for our president whatsoever. He's got a tremendous popularity in Russia. They love what he's doing, they love what he represents.</p>                \n                \r\n\n            \n                <p>So we have a President who is absolutely, you look at him -- the chemistry is so bad between those two people.</p>                \n                \r\n\n            \n                <p>I was over in Moscow two years ago and I will tell you - you can get along with those people and get along with them well. You can make deals with those people. Obama can't. He's not --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So you could make a deal with Putin to stop his expansion?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I would be willing to bet I would have a great relationship with Putin. It's about leadership.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Based on what? You're two macho guys? I mean, you know --</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>No, no, no I mean based on a feel. OK, you know deals are people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You sound like George W. Bush. He looked into his soul and said he was a good guy. Come on.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Bush didn't have the IQ. Let me just tell you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You know what I'm picking up from this. You'd buy Putin. You'd buy him almost.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I wouldn't buy him. I wouldn't buy him at all. I would be able to get along, in my opinion with Putin. Now it's possible not. I'm not saying 100 percent but I think I would have a very good relationship with Putin.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>And I'll tell you what. It's actually important for this country to do that.</p>                \n                \r\n\n            \n                <p>You can't have everybody hating you. The whole world hates us. And one of the things that I heard for years and years, never drive Russia and China together. And Obama has done that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>OK. I actually laughed when you said you're going to build this giant wall from San Diego to Brownsville and the Mexicans are going to pay for it. The Mexicans aren't going to pay for the wall.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Let me tell you. The Mexicans are the new China. What they are doing to this country --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They're not going to pay for the wall.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> You have to let me handle that, ok.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well tell me how you're going to make them pay for the wall.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Because they are ripping us so badly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok, ok.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No, no I'll tell you how.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Tell me.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Because I'll cut off all -- I'll start charging for their product coming into this country. Mexico is living off the United States.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So you'd try to strangle them economically unless they paid for the wall?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>They will pay for the wall. And the wall will go up and Mexico will start behaving. Mexico is not our friend.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Or you'll break them economically.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I will do something that they will not be thrilled.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right.</p>                \n                \r\n\n            \n                <p>The Chinese hacked into our Federal Government system. What do you do to them for that?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Well you're going to have to do something with China economically also.</p>                \n                \r\n\n            \n                <p>China, the power we have is that we have rebuilt China. They have taken our jobs, they've taken our manufacturing, they've taken everything from us --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Why give it back?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> They've taken money. Do you know that right now we owe China $1.3 trillion?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>We're paying them interest.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What do you do to China? Their powerful.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> What you do to China is you say if you don't behave we're going to have to start taxing your goods coming into this country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. A tariff.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> They charge us tariffs. We don't charge them because we're stupid. They charge us. And the largest bank in the world is right under this floor.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now you realize Congress is going to have to ok all this. They're going to have to ok you destroying Mexico. They're going to have to ok you for the tariff on China.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And you really think you're going to get it through?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Absolutely. I've been dealing with politicians all my life.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They're going to fold under you?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Not fold. They're going to make -- that's just what they do Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So just like Putin you're going to make him your friend, you're going to be able to make Congress your friend, too you think?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I think so absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I think so.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right.</p>                \n                \r\n\n            \n                <p>Now let's turn to domestic issues. The reason that we have income and equality, why you make an enormous amount of money and other people don't is because you're very well-educated. You look out of your window here in Trump Tower, you look over to Harlem you've got kids who don't know anything with bad parents and terrible public schools.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Big problem.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How are you going to fix it?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Big problem.</p>                \n                \r\n\n            \n                <p>The African American kids are in worse shape now than they've ever been and we have a black President. This was not supposed to happen. You have to create incentives for people to work. You have to create jobs. We have to create the kind of an economy where people can go out of work where they're making more money than sitting back and doing nothing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But that's the federal government creation. You know you've got to get the private sector to do that.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No you can - you can stimulate through incentives. You can do tax free zones. You can --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But to make the kids learn in school how -- what incentive are you going to give them?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well you've been saying it. You need parents. Nothing like parents -- ok. Nothing like parents.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But your government can't mandate a good parent.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No, it's a huge problem.</p>                \n                \r\n\n            \n                <p>I would sit down with the best and the brightest. I also happen to think it's one of the most difficult problems that we have. But we have a President that in theory should have been focused on this and I'm sure he cares about it but he certainly did a poor job. Because if you're an African-American youth right now you're in worse shape than you practically ever were in the history of this country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The culture is driving that.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> It's a tough culture.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Hillary Clinton first woman President -- war on women. You going to - you're going to walk right into that.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Well I laugh when I see it. I was watching her talking about income and equality. That can be beaten. That can be beaten. All you have to do is take a look at her donor list.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But if you attack her you're going to be anti-women.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>It's all right. And you know what, and maybe I don't win for that reason. But maybe I do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Final question. Your Republican rivals. They're going to come after you, you know that.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>That's ok.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You don't really take criticism all that well. You lash back --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I can take it. Yes I lash back, why wouldn't I lash back, you know?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well now the President is supposed to have some kind of elevation, you know, where you have to overlook some things. You're not real good at that.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Well, I get things done, better than anybody.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Are you going to slash and burn through this Republican field?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Well I don't have a lot of respect for many of them. And I can tell you --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Anybody you respect?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No I don't want to say that but yes I do a couple. But I will tell you I've been dealing with politicians all my life. They are all talk, no action. Never going to get done. They're controlled by the lobbyists. They're controlled by donors. And they're controlled by special interests.</p>                \n                \r\n\n            \n                <p>When I tell somebody to do something I'm not going to get a lobbyist calling me the next day to say please don't do that even though it's good for America.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You've got to go through --</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>You're right and I've been going through them all my life.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, you're telling me you could do it.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I've been dealing with them all my life.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I mean this building was not supposed to get built. This building was supposed to be 18 stories tall and it's 68 stories tall. I dealt with politicians.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. The first debate is Fox and in the top 10 on the polling average you're going to get in. So you may very well get into that debate.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>All right. Fine.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, so you're going to be looking at the other nine. Are you going to slash them? Are you going to get up there and --</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Honestly Bill -- I won't be the nicest. I'm just going to be honest. I'm not going to slash and burn. I'm going to be honest. They don't have it. They're never going to bring this country back --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So you're going to look Jeb Bush in the eye and you're going to go common cause of disaster, you're this, and you're that.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well I'm not a big fan. Sure. I'm not a big fan of Jeb Bush. The last thing we need is another Bush -- ok. Believe me. The last thing we need is another Bush.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So you're going to slash and burn.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>All of my life they're all talk, they're no action and they're totally controlled by their donors and by the lobbyists. This country if we have another politician, that includes Hilary, we have another politician this country's going down.</p>                \n                \r\n\n            \n                <p><b>(END VIDEOTAPE)</b></p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump running for President", "description": "Real-estate magnate announces 2016 White House bid", "date": "2015-06-17T12:18:33Z"}