{"vcmId": "2306f826-0f89-4c2a-a7ad-be5533c1d85b", "url": "http://www.foxnews.com/transcript/2017/01/05/bill-oreilly-tale-two-cities.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As we have been reporting, the city of Chicago is the most violent place in America and little is being done about the incredible murder rate in some black neighborhoods.</p>                \n                \r\n\n            \n                <p>A quick look at the stats: last year murders in Chicago were up 57% from 2015, shooting incidents up 46%, shooting victims up 47%.</p>                \n                \r\n\n            \n                <p>On New Year's Day, 28 more people shot in Chicago.</p>                \n                \r\n\n            \n                <p>It is obvious that Mayor Rahm Emanuel and Governor Bruce Rauner will not protect innocent people and solve the problem.</p>                \n                \r\n\n            \n                <p>But what is the problem?</p>                \n                \r\n\n            \n                <p>The vast majority of shootings are being done by low-level gang members who are running wild in the streets.</p>                \n                \r\n\n            \n                <p>An investigation by the Chicago Sun-Times shows that even if the cops do find a gang member with a gun, that person is given a very light sentence - maybe a year in prison.</p>                \n                \r\n\n            \n                <p>So the justice system in Chicago is not punishing the thugs convicted of carrying illegal weapons with any severity.</p>                \n                \r\n\n            \n                <p>That's problem number one.</p>                \n                \r\n\n            \n                <p>Secondly, there's policing.</p>                \n                \r\n\n            \n                <p>Here in New York City, shooting incidents are at a record low. &#160;And this is a tougher town than Chicago.</p>                \n                \r\n\n            \n                <p>The reason shootings are down is because the New York police target the gangs and arrest them for any and all violations.</p>                \n                \r\n\n            \n                <p>They hound gang members, truth be told.</p>                \n                \r\n\n            \n                <p>But in Chicago, the opposite is true. &#160;The police do not want any part of engaging violent gang members.</p>                \n                \r\n\n            \n                <p>Why? &#160;Because the liberal politicians in Chicago are making it impossible for street cops to do their jobs.</p>                \n                \r\n\n            \n                <p>In fact, the ACLU is now running street crime in the Windy City.</p>                \n                \r\n\n            \n                <p>Mayor Emanuel has instituted an ACLU-suggested policy that mandates a two-page police report each time a cop stops someone for questioning.</p>                \n                \r\n\n            \n                <p>That means the cops are spending hours filling out paperwork if they even ask anyone what they're doing on a street corner at four a.m.</p>                \n                \r\n\n            \n                <p>How insane is that?</p>                \n                \r\n\n            \n                <p>And then there is the racist angle.</p>                \n                \r\n\n            \n                <p>Most of those shot in Chicago are poor black people.</p>                \n                \r\n\n            \n                <p>If the mass murder were happening in Chicago's business district, believe me, it would be stopped cold.</p>                \n                \r\n\n            \n                <p>So Mayor Emanuel and Governor Rauner can be accused of racism because they allow the madness to continue.</p>                \n                \r\n\n            \n                <p>In San Francisco, it's property crime.</p>                \n                \r\n\n            \n                <p>Since 2010, crimes like arson, car theft, and larceny are up a whopping 64%.</p>                \n                \r\n\n            \n                <p>Why? &#160;Because San Francisco politicians have stopped the police from enforcing quality of life crimes.</p>                \n                \r\n\n            \n                <p>Therefore homeless people are all over the place - urinating and defecating in the streets, panhandling, and, when they need money to buy booze or drugs, committing crimes.</p>                \n                \r\n\n            \n                <p>The situation is out of control and a disgrace. &#160;And that's what happens when liberal politicians demand that the police stop enforcing laws.</p>                \n                \r\n\n            \n                <p>Look, there's a civility factor in this country.</p>                \n                \r\n\n            \n                <p>With nearly 325-million folks living here, there have to be standards of behavior.</p>                \n                \r\n\n            \n                <p>But in San Francisco, there are not. &#160;You can do whatever you want and therefore a beautiful city has now become blighted.</p>                \n                \r\n\n            \n                <p>Add to that insane social policies, like San Francisco's General Assistance policy.</p>                \n                \r\n\n            \n                <p>Ready? &#160;The city gives indigent people - homeless, those roaming around - three hundred bucks a month cash and benefits.</p>                \n                \r\n\n            \n                <p>And where does that money go? &#160;Many times to purchase drugs and alcohol.</p>                \n                \r\n\n            \n                <p>So if you are a West Coast drug addict, where would you go?</p>                \n                \r\n\n            \n                <p>San Francisco of course - where the free money is.</p>                \n                \r\n\n            \n                <p>Summing up, terrible laws, cowardly politicians, and apathetic voters all lead to chaos.</p>                \n                \r\n\n            \n                <p>People continue to die in Chicago. &#160;And San Francisco is a chaotic mess.</p>                \n                \r\n\n            \n                <p>But, unless voters wise up, nothing will change.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: A tale of two cities", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/4", "date": "2017-01-05T13:00:59Z"}