{"vcmId": "2358d435-cf5d-46c0-9ca1-5e54d6252b2b", "url": "http://www.foxnews.com/transcript/2017/04/19/north-korea-unleashing-new-threats-against-us.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 19, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p> <b>PERINO</b>: Thanks for staying with us, I'm Dana Perino in for Bill O'Reilly. And in the FACTOR \"Follow-Up\" segment tonight. \"The Showdown with North Korea.\" The rouge state is turning up the temperature, yet again as his vice foreign minister threatens to keep conducting missile tests on a weekly basis. As you know, the missile they tested over the weekend failed and in an interview that aired earlier today, FOX and Friends Ainsley Earhardt asked the President if the U.S. had anything to do with that failure.</p>                \n                \r\n\n            \n                <p> <b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> UNIDENTIFIED FEMALE:</b> Did we sabotage the North Korean strike?</p>                \n                \r\n\n            \n                <p> <b>TRUMP</b>: I don't want to comment on this.<br> <b><br> UNIDENTIFIED FEMALE</b>: Okay. What happens if North Korea launches another missile?<br> <b><br> TRUMP</b>: Will find out.</p>                \n                \r\n\n            \n                <p> <b>UNIDENTIFIED FEMALE:</b> All right.<br> <b><br> (END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> PERINO</b>: Joining us now to analyze from Los Angeles, Ric Grenell, former U.S. spokesman to the U.N. And from Washington, Gillian Turner, former staffer on the National Security Council.</p>                \n                \r\n\n            \n                <p> Ric, now that the weekend is behind us and the missile failed to fire and you have comments from the Vice President, what is North Korea's play next? What you think based on your experience that they will do in the coming days?</p>                \n                \r\n\n            \n                <p> <b>RIC GRENELL, FORMER U.S. SPOKESMAN TO THE UNITED NATIONS</b>: Well, first of all, they're looking at 175,000 troops on their border. Chinese troops. So they've gotten the message very loud and clear that something is different, something has changed. I have to go back to that meeting between President Trump and President Xi at Mar-A-Lago because that to me that a game changer. We saw President Xi leave that meeting, go back to China, and really create action, put those troops right on the border.</p>                \n                \r\n\n            \n                <p> We haven't seen that in a very long time. We haven't seen diplomacy work that fast and while there's a whole bunch more that needs to be done, I see that as an amazing moment where we finally have China understanding when they look at President Trump that this is a credible threat of military action. This isn't just a threat of military action, this is incredibly credible.</p>                \n                \r\n\n            \n                <p> <b>PERINO</b>: Gillian, there have been some changes but you see some things that kind of look similar. What would that be?</p>                \n                \r\n\n            \n                <p> <b>GILLIAN TURNER, FORMER WHITE HOUSE NATIONAL SECURITY COUNCIL STAFFER:</b> Well, I like to sometimes be a steadying hand and calm people down a little bit. We've definitely reached a kind of rhetorical apex on this issue over the last few days. But tensions between the U.S. and North Korea as you know Dana are not new. Over their missile defense program. This is really something that's been on the slow burn and ultimately kind of boiling and simmering for the better part of three and a half years now.</p>                \n                \r\n\n            \n                <p> There's been this kind of covert war going on between the two countries. We didn't hear about it all the time during President Obama's second term I think on purpose. He didn't want it to be the focus of its foreign policy by any stretch. But he was the one that really started this program targeting this electronic cyber warfare program targeting their missiles at home. And I think we are really seeing a continuation of that is what we're seeing.</p>                \n                \r\n\n            \n                <p> <b>PERINO:</b> Ric, what about behind the scenes maybe at the United Nations? What kind of communication will they be having because obviously there's been a lot of activity with the bombing, the Tomahawk missiles in Syria, the Moab in Afghanistan, that activity that happened all in quick succession. And also, I want to ask you both about the fact that we're even talking about our cyber warfare capability to me seems -- I mean, I understand that Ensley had to ask a question absolutely but Ric, isn't it, like maybe we shouldn't be talking about this at all?</p>                \n                \r\n\n            \n                <p> <b>GRENELL</b>: Well, I think journalists are going to ask, but certainly U.S. government officials should not be talking about it and I think that the Trump administration has deferred to comments.</p>                \n                \r\n\n            \n                <p> <b>PERINO: </b>Yes. They shut it down.</p>                \n                \r\n\n            \n                <p> <b>GRENELL:</b> Yes. They shut it down. But you know, to go to your point about the U.N. and Gillian's point, look, I think that the slow burn and all the resolutions at the U.N. that have been happening for more than three and a half years, we've had Security Council Action on North Korea for a long time. None of that has worked. The six party talks have been a total failure. So while all the diplomats have been kind of talking and putting us on a slow burn through the Obama administration, the North Koreans put a rocket into orbit.</p>                \n                \r\n\n            \n                <p> What that means is for us here in Los Angeles, there's a very real possibility that if they could just get the other piece is right, which they're testing, they could get all three pieces together, they're going to hit the West Coast where they can hit the West Coast. That's a scary thought. I think we have to take it seriously and we need to pressure China to really do something for once.</p>                \n                \r\n\n            \n                <p> <b>PERINO:</b> So, it's not just China that is being at least more cooperative I guess you could say, Gillian, but what about the rest of our allies, Japan and South Korea? What are you hearing?</p>                \n                \r\n\n            \n                <p> <b>TURNER</b>: Yes. Absolutely. Well, President Trump himself -- them up today. It's interesting that Ric mentioned the six party talks because as much as that seems kind of like a passe thing, you know, dredging up old foreign policies from the Bush administrations, it seems like that's very much in play. His language was very reminiscent of that. He was talking about working in concert with Japan and South Korea and China to hedge against the north nuclear ambitions. I mean, this is all language we've heard before.</p>                \n                \r\n\n            \n                <p> <b>PERINO:</b> Yes.</p>                \n                \r\n\n            \n                <p> <b>TURNER:</b> So, it was kind of interesting to see that in the midst of these like very dramatic shows of military force over the last week in Syria and Afghanistan, the degree to which I think the Trump administration is leaning on diplomacy here because they realize obviously the nuclear capabilities, everything is very essential.</p>                \n                \r\n\n            \n                <p> <b>PERINO</b>: Ric, if I could throw last question to you, Ben Rose, the former deputy national security advisor for President Obama tweeted this today. \"Every day, the situation in North Korea makes clear just how preferable it is to have the Iran deal in place.\" What do you think of that?</p>                \n                \r\n\n            \n                <p> <b>GRENELL</b>: Wow! I mean, it's a crazy analogy to think that somehow the North Koreans are going to all of a sudden give up their ambitions just simply because we're going to give them something. They've made so many promises and broken so many promises in the past, this not situation that is even remotely the same.</p>                \n                \r\n\n            \n                <p> <b>PERINO:</b> All right. That is what I thought you might say. Ric, Gillian, thank you so much.</p>                \n                \r\n\n            \n                <p> <br> <i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "North Korea unleashing new threats against US", "description": "Can the crises be brought back from the brink? 'The O'Reilly Factor' investigates", "date": "2017-04-19T12:11:00Z"}