{"vcmId": "26bc5bcb-c586-43fd-9f36-bf8ee6b5f024", "url": "http://www.foxnews.com/transcript/2016/05/17/how-will-trump-campaign-against-hillary-clinton.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" May 16, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thanks for staying with us, I'm Bill O'Reilly in the \"Campaign 2016\" segment tonight, number of reports are saying that Donald Trump is not, not going to hold back in his personal attacks on Hillary Clinton. If that's true, this might be the nastiest presidential campaign in American history, Jefferson, Adams aside.</p>                \n                \r\n\n            \n                <p>Joining us now from Austin, Texas, Karl Rove. So, I want to open with when you were working with President Bush, the younger, against Al Gore in 2000, things got nasty, but it was mostly policy. Right? It wasn't a lot of personal stiff. I don't remember, was there?</p>                \n                \r\n\n            \n                <p><b>KARL ROVE, FORMER SENIOR ADVISOR TO PRES. GEORGE W. BUSH</b>: Yes, no. There wasn't. We made certain, for example, that when we commented on Bill Clinton's indiscretions in the White House, we did so without ever mentioning it directly and did so by responding affirmatively saying we would restore -- President Bush would restore honor and dignity to the White House. We found out back then that if the -- that the Republicans had damaged themselves in 1998 and 1999 by going after Clinton's infidelities to the point that American people said enough is enough. But they did want to know that somebody would do something different. So, they wanted to hear another change but they were just fed up with being reminded about Monica Lewinsky and the goings on.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. If you guys found that out, does it still hold today in 2016 that if you go after the Clintons on the personal stuff that will turn voters off? Do you still believe that?</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Well, let's define personal stuff. If by personal stuff you mean she boggled Benghazi.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No, no. That's all policy.</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: That's all fair. That's all fair.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But if you want to go after Bill Clinton's infidelities, my advice would be first of all, this plane would dynamite. So, the first one who brings up this kind of stuff in my opinion is going to be the person who loses the issue. Now maybe he needs to counterpunch but he has got vulnerabilities of his own. Nothing on the scale of Clinton but he is on the record talking about his prowess with women and about his prowess with dating and so forth. So, you have got to be a little bit careful about this. She wants to be a victim. And she has been successful in life when she has made herself a victim.</p>                \n                \r\n\n            \n                <p>She took Rick Lazio, let him come across the stage and their Senate race. Thrust a piece of paper under her nose and demand she sign it and she turned herself into a victim. And the last thing Donald Trump needs to do is turn her into a victim. Go after her but go after on the things that people consider to be reasonable, prudent and go to the heart of what he said in -- but he made a wise remark. He said, one of her weaknesses is she is not seen as sincere and authentic. Anyway he can go after that great, but to just sort of gratuitously reach out there and bring Monica Lewinsky and Bill Clinton's indiscretions into this campaign in my mind would be a mistake.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. But he counterpunches of the fact that she says that he's anti-women and he is a bully and then he comes back. But the situation is that there is a line of thinking that says that says if you tell the truth as you see it about the Clintons, that will galvanize people to vote for you because you will be a straight talker. Nobody else wants to say it but you will say it you are a straight talker and then so the voters will come to you. Do you reject that entirely?</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: No, no. But there are limits. Look, if he goes on and says, you lied about Benghazi.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know what I'm talking about. You know what I'm talking about.</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: Well, that's fine. What I'm trying to point is to the things that he ought to go after. There is plenty of ammunition there. Going after her on the Clinton Foundation and using it to flesh up their lifestyle and reward their friends. That's entirely legitimate legal. Going after the emails, that is all legitimate and effective. What I worry about is picking on things to say, look, these people, I've seen a number of them on television, don't tone it down. It's worked for him so far. Well, it's worked for him so far and driving up his negatives. From here on out, he better be very careful and go out on her on the range of things that people consider to be reasonable for discussion and where she is dead wrong and be careful about playing with dynamite.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Final question. Hillary Clinton's history is not to use surrogates. You know them.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> And they are pretty --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They are killers. You know, the people that she has on the payroll. They are killers.</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I expect those surrogates to try to provoke Trump into what you are talking about. Do you expect that?</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: Right absolutely and he shouldn't take the bait. When they come after him, go back after her but go back after her in a way that makes it clear he is holding her responsible for the ugly things that they're saying and does she stand by them? And again this gets back to -- do we all know the Clintons we see them. We know how they are twisty and we know how they're, you know, they're not sincere, they are not authentic as he said in it, that they're nasty and campaigners who will do anything and say anything and do anything to win.</p>                \n                \r\n\n            \n                <p>And he ought to play on that by saying, are you standing by it? When you said that ugly thing about me, when your agents went out and attacked me like that and go back out after her. Wherever you can by linking it to what she thinks is her strength. She thinks her strength is, I was secretary of state. With Benghazi and lied about the video and lied to the parents.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: There's plenty of stuff in this arena on both sides. I want them both to keep it in the arena of policy. That's what I would like to see. I don't like the personal stuff but I'm not sure it's as ineffective as some people think it is in this climate today.</p>                \n                \r\n\n            \n                <p>Mr. Rove, thank you as always.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "How will Trump campaign against Hillary Clinton?", "description": "Reports say GOP candidate would leave little off limits in campaign against the Democrat; Karl Rove reacts on 'The O'Reilly Factor'", "date": "2016-05-17T12:22:15Z"}