{"vcmId": "2981564d-5683-4dea-a5e6-4f36ff306a8f", "url": "http://www.foxnews.com/transcript/2016/11/14/bill-oreilly-anarchy-in-streets.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>About 4,000 protesters took to the streets in Portland, Oregon last night. More than 20 arrested as radicals turned the demonstration into a disgraceful spectacle.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>(EXPLOSION)</b></p>                \n                \r\n\n            \n                <p><b>(SHOUTING)</b></p>                \n                \r\n\n            \n                <p><b>(CHEERS)</b></p>                \n                \r\n\n            \n                <p><b>(PROTESTERS CHANTING)</b></p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, I lived in Portland, it's a beautiful place, but run by permissive progressive people. They have allowed the downtown area to become a squatter's haven full of drug addicts and alcoholics who lay about sometimes menacing passersby. Tough place to take kids. So, it comes as no surprise that the city of roses has become ground zero for anarchy. The solution to violent protest is to charge anyone who destroys property or hurts another person with rioting. That is a class C felony in Oregon carrying a prison term up to five years. But I can tell you that will not happen. Will not happen in Portland. Most of those anarchists will receive no punishment whatsoever.</p>                \n                \r\n\n            \n                <p>And therein lies the very dangerous situation in this country. The election of Donald Trump has shaken the progressive community. In the space of four days, they have gone from having some power to nothing. President Trump is not going to pander to the far left and they know it and that's the way democracy goes. If the people believe political policies are not working they change the structure. And then we have the race component. In Chicago, 49-year-old David Wilcox beaten by two men while a crowd screamed don't vote Trump.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE</b>: You voted Trump! You voted Trump! Yes! He voted Trump.</p>                \n                \r\n\n            \n                <p><b>(INAUDIBLE) (BLEEP) (BLEEP)</b></p>                \n                \r\n\n            \n                <p>Beat his ass!</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE</b>: Don't vote Trump! Don't vote Trump! Don't vote Trump!</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now that is a definite hate crime. But Illinois does not categorize political violence in that way. And based on Chicago's record, those thugs who beat that innocent man will receive very little punishment. That's why the windy city is the most violent place in the country. The progressive structure will not stop the madness. That display should cause every state in the union to classify political violence as a hate crime because that's what it is. California, Iowa, West Virginia, D.C., Louisiana, and South Carolina have already done that.</p>                \n                \r\n\n            \n                <p>Everybody else should get on it. Summing up, a free election should be respected. Those who harm other people and destroy property in the name of protests are criminals and society should punish them harshly. And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Anarchy in the streets", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/11", "date": "2016-11-14T12:58:00Z"}