{"vcmId": "298c148f-c116-41ee-8730-e6e94f396ce0", "url": "http://www.foxnews.com/transcript/2017/01/23/bill-oreilly-donald-trump-now-president.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>So, here's what we're going to do over the next hour. We have our correspondents spread out across the city, ready to report on President Trump's evening. He's expected to attend three galas including the liberty ball where he will do the first dance with the First Lady.</p>                \n                \r\n\n            \n                <p>That may happen shortly and will take you there live, of course. But first, Mr. Trump's inaugural address. It was a militant speech. About 60 minutes long, very political. That is somewhat of a departure as many new presidents are very diplomatic at the inauguration, not Donald Trump. He did complement President Obama for being cooperative in the transition calling him, quote, \"magnificent.\" But then, he hammered Mr. Obama's policies.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Mothers and children, trapped in poverty in our inner cities. Rusted out factories, scattered like tombstones across the landscape of our nation. An education system flushed with cash, but which leaves our young and beautiful students deprived of all knowledge. End the crime, end the gangs, end the drugs that have stolen too many lives and robbed our country of so much unrealized potential. This American carnage stops right here and stops right now.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, with Mr. and Mrs. Obama's sitting just a few feet away, Mr. Trump basically said that the last eight years have been a catastrophe. And it wasn't an anti-Democratic screed. Mr. Trump criticized both parties.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> We've defended other nation's borders while refusing to defend our own.</p>                \n                \r\n\n            \n                <p><b>(CHEERING AND APPLAUDING)</b></p>                \n                \r\n\n            \n                <p>And spent trillions and trillions of dollars overseas while America's infrastructure has fallen into disrepair and decay. We've made other countries rich while the wealth, strength and confidence of our country have dissipated over the horizon.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The reference to trillions of dollars spent overseas of course encompasses the Iraq and Afghan wars that were begun by President Bush the younger and George W. Bush were seated just a few feet away from President Trump. So, it's clear that Donald Trump has no sensitivity to the politics of the past no matter who was in office. His message was directed to his supporters, to the folks were fed up with a political process they believe is not helping them. It was fascinating to watch as President Trump pretty much dismantled the entire Washington establishment in 16 minutes.</p>                \n                \r\n\n            \n                <p>It was more like a campaign speech than a presidential address marking the beginning of a new administration. Now, whether Mr. Trump's speech was good or bad, pretty much up to you. Doesn't really matter what pundits say, he was speaking directly to the American people telling them there's a new power structure in place. One that is going to break down the entrenched political policies. Whether Donald Trump can accomplish that is impossible to predict.</p>                \n                \r\n\n            \n                <p>He does have to work through Congress and he does have to convince powerful people all over the world to cooperate with him. No president, no president can institute vast change alone. By the end of his speech which was clearly meant to send a message, Donald Trump pleaded all on the line.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> From this day forward, a new vision will come govern our land. From this day forward, it's going to be only America first, America first.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, there you have it. Again, it's up to you the American citizens to evaluate the effectiveness of President Trump's speech. Some other quick impressions of this very historical day. First time the camera found Hillary Clinton, she looked absolutely miserable. And you can understand that. She thought she had the presidency locked up. When the camera found Donald Trump first off, he looked a little tense. Again understandable, it's the biggest public moment of his life.</p>                \n                \r\n\n            \n                <p>As usual President Obama, he looks relaxed, he's an accomplished political actor, really showing what he's thinking and he always, always ask appropriately in public. After the big show, Mr. and Mrs. Obama flew up to Palm Springs, California, for vacation. Talking Points does not expect to hear much from the former president at least for a while. One of the most touching moments was when First Lady Melania Trump straightened her son's tie. I can tell you from personal knowledge, Mrs. Trump is an excellent mother who will not move to Washington immediately.</p>                \n                \r\n\n            \n                <p>So, the 10-year-old Barron can continue his schooling in New York City. Finally, 92-year-old former President Jimmy Carter, he didn't have to come to the inauguration, everybody would have understood if he stayed back in Georgia. But Mr. Carter is a patriot and stood in the damp cold to watch America's peaceful transition of power. Whether you like Jimmy Carter or not, you should respect this man because he is a good man.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Donald Trump, now president", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/20", "date": "2017-01-23T13:02:24Z"}