{"vcmId": "2a4497b9-ad05-4eec-b632-11d0b02b5d87", "url": "http://www.foxnews.com/transcript/2016/12/14/bill-oreilly-christmas-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>You may remember about 10 years ago the Factor began spotlighting companies that refused to say the words \"Merry Christmas.\"</p>                \n                \r\n\n            \n                <p>In fact, some of those businesses actually ordered their employees not to say that. Well, that culture war issue ignited. And we won. Most companies stopped the nonsense and Merry Christmas became a common greeting once again. For me, it was interesting to go through that because some on the far left actually denied there was any controversy at all that I fabricated it. More lies from a crew that is incapable of telling the truth.</p>                \n                \r\n\n            \n                <p>Anyway, this year the American family association based in Tupelo, Mississippi, Elvis' hometown has issued its annual naughty or nice list. That tells the public which businesses are Christmas friendly and which are not. This year the following companies are rated five star nice. Cracker Barrel, Hobby Lobby, Kirkland's, Lowe's, Michael's Stores, Wal-Mart. I remember at one time Lowe's was a problem. But obviously that's turned around.</p>                \n                \r\n\n            \n                <p>Also on the Christmas friendly list -- Ace Hardware, Banana Republic, Bass Pro Shops, Bed Bath and Beyond, Books-A-Million, Dick's Sporting Goods, Home Depot, J.C. Penney, Kmart, L.L. Bean, Marshalls, Neiman Marcus, Proflowers.com, Rite Aid, Sam's Club and Toys R Us.</p>                \n                \r\n\n            \n                <p>Again, all those companies use the word Christmas in their advertising and promotion. Now, the naughty companies. That kind of marginalized Christmas. Barnes and Noble, Best Buy, Foot Locker, The Gap, The Limited, Nordstrom, Office Depot, Office Max, Petsmart, Staples and Victoria's Secret.</p>                \n                \r\n\n            \n                <p>According to the AFA, those companies are not in the Christmas spirit. Kind of bad news for them because Donald Trump is on the case.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENT-ELECT: </b>We're going to start saying Merry Christmas again.</p>                \n                \r\n\n            \n                <p><b>(CHEERS AND APPLAUSE)</b></p>                \n                \r\n\n            \n                <p>How about all those department stores they have the bells and they have the red walls and they have the snow but they don't have Merry Christmas. I think they're going to start putting up Merry Christmas.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Or they will be deported. Now, does the Christmas deal really matter? Since the war has basically been won, this is a clean-up operation. But the information is valid. Many Americans celebrates Christmas because they believe that Jesus is the savior and his birth should be honored. And because it's a federal holiday, there is no reason to diminish Christmas or insult those who believe in it. Don't like Christmas? Ignore it.</p>                \n                \r\n\n            \n                <p>So, companies and stores that embrace Christmas obviously will attract folks who feel the same way. As for talking points, we're just happy that most Americans see Christmas as a positive experience. And we're happy we could contribute to that. And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Christmas in America", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 12/13", "date": "2016-12-14T13:20:38Z"}