{"vcmId": "2ac63729-89c7-41e1-be36-1a1630b3d4c9", "url": "http://www.foxnews.com/transcript/2015/12/24/deportations-drop-dramatically.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 23, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Thanks for staying with us, I'm Eric Bolling in for Bill O'Reilly. And in the \"Unresolved Problems\" segment tonight. A surprising revelation from the Department of Homeland Security. As we reported last night, the southern border has recently seen a huge surge of unaccompanied minors trying to get into the United States. But paradoxically, we are now learning that this year the Obama administration deported the fewest number of illegal immigrants since 2006. What's behind all this?</p>                \n                \r\n\n            \n                <p>With me right now is Republican strategist Evan Siegfried and from Long Island, New York Chris Hahn, a democratic strategist. Evan, let's start with you. A lot of people are pointing to President Obama's executive order allowing dreamers to stay in the country.</p>                \n                \r\n\n            \n                <p><b>EVAN SIEGFRIED, REPUBLICAN STRATEGIST: </b>Yes. What it really is, is, you know, there are less illegal immigrants coming into the country because Obama's economy is so bad for them. But when the reality is that you have got the President is enforcing policies that make it amnesty.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Sure. I have got to push back on you.</p>                \n                \r\n\n            \n                <p><b>SIEGFRIED:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>The economy is so bad so Mexican immigrants aren't coming? Okay, it was a joke?</p>                \n                \r\n\n            \n                <p><b>SIEGFRIED: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Okay. Thank you. Chris Hahn, the reality is President Obama signed his executive orders a lot of people in the country.</p>                \n                \r\n\n            \n                <p><b>CHRIS HAHN, DEMOCRATIC STRATEGIST</b>: Right. Hey, look, and I think that's a good thing. These are people who have brought here with -- and this is the only country they have ever known. It was not their choice to come here. Their parents came here. We should make them -- we should give them -- take them out of the shadows and make them part of our society.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Not their choice to come. It's not their choice to come.</p>                \n                \r\n\n            \n                <p><b>HAHN</b>: It was not --</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: OK.</p>                \n                \r\n\n            \n                <p><b>HAHN:</b> You are a child and your parents bring you here.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Chris, no spin zone, all right. I mean, not their choice to come here. Do you think they -- in poverty in Mexico and Latin America to come here?</p>                \n                \r\n\n            \n                <p><b>HAHN</b>: Well, the DACA which brings the dreamers here, it's for children that were brought here. People who are brought here as infants. Sometimes you know as young as babies carried in their mother's arms. It's not their choice to come here. This is the only country they have ever known.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>HAHN: </b>We should find a way to incorporate them into our society so that they could come out of the shadows and be a part of our economy.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: All right. Let's talk a little bit about the southern border, Evan. ISIS, it tears on everyone's minds. Number one concern of Americans right now. Our southern border is wide open. How long or why isn't ISIS planning to infiltrate the country through the southern border?</p>                \n                \r\n\n            \n                <p><b>SIEGFRIED</b>: I'm sure they already are. It's a porous border which anything can get through at this point. Right now you have illegal immigrants who are coming over and 30 percent of them are criminals. And that happened by the border patrol who said that in 2010 in Tucson. They arrested 212,000 illegals. Thirty percent of them already had criminal records in the United States. You get tremendous problems such as Kate Steinle's law and God forbid, what happened in San Bernardino. And that was legal immigration we couldn't even stop it.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Chris, 136,000 convicted criminals were deported in 2015. How may weren't?</p>                \n                \r\n\n            \n                <p><b>HAHN</b>: That's a good thing.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: How many weren't?</p>                \n                \r\n\n            \n                <p><b>HAHN</b>: Well, look, I mean, obviously we have got to make sure that we are doing everything we can to get rid of people who are here or doing illegal things. We need to crack down on crime whether it's done by immigrants or non-immigrants in this country. But I think yes, you are right there. Look, there could be people in this country that came here for nefarious purposes, that's always a risk.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Could be?</p>                \n                \r\n\n            \n                <p><b>HAHN</b>: After the terrorism --</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Could be? You just said could be.</p>                \n                \r\n\n            \n                <p><b>HAHN:</b> I'm sure there are. I'm sure there are, Eric. But you know, I think that, you know, the terrorists' argument which we often hear, I think it's a little bit of a red herring. Every time we have the terrorist attack performed in this country, it has been done by people who were here legally whether they come to -- they're desperate.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: By illegal immigrants. That's so comforting, so far every terror attack in America is done by illegal immigrant. Go ahead, Chris.</p>                \n                \r\n\n            \n                <p><b>SIEGFRIED: </b>Yes. So far. If you are going to -- I think we have given great incentive clearly for terrorists to come in legally. Because the screening process at this point is, are you a terrorist? Check yes, check no. And of course they are going to check no. It's so ridiculous that my dog could write up a better proposal to deal with the terrorist problem. The Obama administration had been serious about terrorism or illegal immigration, in fact, Democrats.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Absolutely, they are. You have got Democrats trying to incentivize like Hillary Clinton and the presidential debate in October proposing giving free college tuition to illegal immigrants. That's sanctuary universities. What is going on here?</p>                \n                \r\n\n            \n                <p><b>SIEGFRIED: </b>You know what, Evan -- Evan, I know it's the first day of festivities and you want to air your grievances against the Obama administration tonight. But that is not just true. The President has been the toughest on illegal immigrants of any president in the history of this country.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: How do you figure? How do you figure?</p>                \n                \r\n\n            \n                <p><b>SIEGFRIED</b>: He has deported more people than any other president in the history of the United States of America.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Chris, because he is counting border stops as deportations.</p>                \n                \r\n\n            \n                <p><b>HAHN</b>: Every president is counting border stops as deportations, every single one of them.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> -- President Obama has. And therein lies part of the problem is the accounting. If you honestly think that President Obama has deported more illegals than other presidents, you are grossly mistaken. And it's how they are accounting for them.</p>                \n                \r\n\n            \n                <p><b>HAHN: </b>Yes. Well, you know what? It's very tough to be the president of the United States. Because people on the Left are criticizing him for deporting too many. People on the right are criticizing him for deporting too few.</p>                \n                \r\n\n            \n                <p><b>SIEGFRIED</b>: Well, it's about time we replace the President with a tough person who can handle the job and show real leadership on issues of immigration and terrorism and the economy. And, you know, to get to what you said, that the President is being serious, he is not serious whatsoever. We have an immigration system that broke and allowed somebody to come in legally who is a terrorist in San Bernardino. And he -- pardon me, she then was able to go out and kill 14 people.</p>                \n                \r\n\n            \n                <p><b>HAHN</b>: And that's a horrible thing. It's a horrible thing. And situations like that need to be rectify, they need to be addressed. But I think this President has done a good job to protect this country, I think he will continue to do so for the rest of his term.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: All right. We're going to have to leave it right there. Gentlemen, thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Deportations drop dramatically", "description": "'The O'Reilly Factor' examines the latest deportation figures", "date": "2015-12-24T13:55:50Z"}