{"vcmId": "2b61599e-5835-4b6c-9bca-bd701cb4f0f4", "url": "http://www.foxnews.com/transcript/2015/02/24/bill-oreilly-giuliani-versus-obama.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As you may know, last Wednesday, former New York City Mayor Rudy Giuliani questioned whether President Obama loves America. In the mayor's opinion, he does not. That's ignited a firestorm but the mayor is not backing down. He points to the President's background.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> I'm talking about a man who grew up under the influence of Frank Marshall Davis who was a member of the communist party who he refers to over and over in his book who was a tremendous critic of the United States. This is a man who worked under Saul Alinsky who was a tremendous critic of the United States.</p>                \n                \r\n\n            \n                <p>I believe his initial approach is to criticize this country and then afterwards to say a few nice things about us.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Giuliani saying in the last sentence that President Obama's tendency to run down the U.S.A. and then offer tepid endorsement at the end of the criticism.</p>                \n                \r\n\n            \n                <p>Now, no one, no one can know what's in the heart of any individual. But let's look at the two men both of whom I know. Rudy Giuliani was deeply affected by the attack on 9/11. Day after day after day he had to console the families of those who were killed. That ordeal has redefined Mr. Giuliani. He takes terrorism very personally. You might say the mayor was a casualty himself of the terror attack because he experienced so much pain.</p>                \n                \r\n\n            \n                <p>Put yourself in the mayor's position. You don't have a minute without someone in deep anguish, asking you for help. Rudy Giuliani did a tremendous job leading the city and perhaps its worse crisis ever. Thus, Mr. Giuliani despises the terror killers who murdered all those innocent people.</p>                \n                \r\n\n            \n                <p>So, if you are not aggressively fighting those savages, Rudy Giuliani does not approve of you. Therefore his opinion of President Obama is negative.</p>                \n                \r\n\n            \n                <p>On the President's side, he is not deeply emotional about fighting terrorism. We all know that. We saw that demonstration demonstrated. Hours after condemning the beheading the journalist James Foley, the President took to the golf course. That was a mistake and Rudy Giuliani certainly noticed it.</p>                \n                \r\n\n            \n                <p>President Obama is a man who lives in his head. As I said he is largely unemotional. Rudy Giuliani is the opposite. He takes wrongdoing very personally. So you can see that these two men have a drastically different view of live.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" believes President Obama does love his country. It has certainly been kind to him. I have had conversations with the President about helping wounded vets and American history. And I don't doubt his patriotism.</p>                \n                \r\n\n            \n                <p>But if Barack Obama were here today on this set, I would tell him that he needs to stop equivocating about terrorism. On his watch, ISIS has grown from a nothing organization to a powerful terror threat. That's not a good thing to have on your resume.</p>                \n                \r\n\n            \n                <p>So right now, right now the President needs to begin taking ISIS and other jihadists somewhat personally. The way Giuliani does. He needs to step it up. In a smart way and realize his theoretical strategy is no longer effective. That doesn't mean dropping U.S. forces on the ground all over the place. But it does mean devoting most of your time, Mr. President, to this clear and present danger.</p>                \n                \r\n\n            \n                <p>If Barack Obama would do that -- would take a leadership role in defeating the jihad, Mayor Giuliani and the other critics would begin to support him. I firmly believe that.</p>                \n                \r\n\n            \n                <p>And one more thing. Those haters who called Rudy Giuliani a racist are absolutely despicable. As mayor of New York City, Mr. Giuliani saved thousands of black lives devoting much of his time to making poor neighborhoods safer. That's what the man did. He took crime and murder in the black precincts personally and he succeeded in driving those crimes down making the folks safer.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Giuliani versus Obama", "description": "Talking Points 2/23", "date": "2015-02-24T13:11:04Z"}