{"vcmId": "2c3744d9-964c-4c99-a8c3-69e4ff6d1916", "url": "http://www.foxnews.com/transcript/2015/12/16/bill-oreilly-another-republican-debate-coming-up-in-about-60-minutes.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>There are five Republicans really in contention right now: Trump, Cruz, Rubio, Carson and Bush.</p>                \n                \r\n\n            \n                <p>On the national level, the average of all the polls breaks down this way in round numbers. Trump the standards at 33 percent, Cruz 16 percent, Rubio 13 percent, Carson 12 percent, Bush 4 percent.</p>                \n                \r\n\n            \n                <p>In Iowa here's out it shakes. The consensus is that Cruz is ahead with 26 percent, Trump 25 percent -- so that's a tie, 13 percent for Rubio, 12 percent for Carson, 6 percent for Bush.</p>                \n                \r\n\n            \n                <p>New Hampshire clocks in this way. Trump 29 percent, Rubio 12 percent, Christie -- Chris Christie 10 percent, Cruz 10 percent, Kasich and Jeb Bush 7 percent each.</p>                \n                \r\n\n            \n                <p>So the numbers obviously favor Donald Trump. But things can change fast.</p>                \n                \r\n\n            \n                <p>In a stunning new poll out today from the \"Wall Street Journal\", President Obama's approval rating on the job has fallen to 43 percent. Get this -- 70 percent of the American people believe the country is heading in the wrong direction, 70 percent.</p>                \n                \r\n\n            \n                <p>Talking Points predicted this would happen after the San Bernardino terrorist attack. The nation is jittery. Just today the entire Los Angeles school system shut down because of a threatening e-mail.</p>                \n                \r\n\n            \n                <p>It's clear to any sane person no matter what your political bent that President Obama is not confronting the terrorist threat effectively. Add to that a soft economy and crude PC culture and you have deep, deep anger in America. We went over that last night. The \"Talking Points Memo\" from Monday is posted on BillOReilly.com.</p>                \n                \r\n\n            \n                <p>Now all of this favors Donald Trump who is a political outsider, a bomb thrower. And if you go after Trump, he is going to come back at you viciously. Very few politicians have the stomach for that kind of fight.</p>                \n                \r\n\n            \n                <p>Tonight, some of the contenders you would have to think are going to have to try to marginalize Trump. He's simply too far ahead he has to be challenged or his lead will hold. So that's the headline, who will take on Mr. Trump?</p>                \n                \r\n\n            \n                <p>Again we will be back at 11:00 and we will see. That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Another Republican debate coming up in about 60 minutes", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 12/15", "date": "2015-12-16T13:22:11Z"}