{"vcmId": "2c38ddb8-8d45-40d1-b7ac-b0ab63a4f1a4", "url": "http://www.foxnews.com/transcript/2015/05/22/bill-oreilly-president-obama-military-and-climate-change.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Speaking to the graduating class at the Coast Guard Academy in Connecticut yesterday, President Obama said this --</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> I'm here today to say that climate change constitutes a serious threat global security, an immediate risk to our national security. And make no mistake it will impact how our military defends our country. So we need to act, and we need to act now.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The President believing that events such as the drought in Nigeria, for example, create instability, and make it easier for groups like Boko Haram to gain support. If folks don't have enough water or food, they become disenchanted and may turn to harmful groups that promise change. That's what Mr. Obama believes. But I think it's fair to say that theory surprised a lot of military people.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. JOHN MCCAIN (R), ARIZONA:</b> The President of the United States today says, well, it's climate change that we have to worry about. I'm worried about climate change. Do we give a damn about what's happening in the streets of Ramadi?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> As for ISIS taking Ramadi, Mr. Obama contends the U.S.A. continues to downgrade that savage group. But he does acknowledge there have been setbacks. With ISIS now controlling about half the country of Syria, I'd say setbacks might be a little too gentle.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" believes that all presidents should deal with problems in the here and now. I mean, it's fine to want a cleaner planet - - I do. It's good to explore ways to eliminate harmful emissions. Every sane person supports that. But to tell a group of military graduates that climate change is a defense priority borders on delusion.</p>                \n                \r\n\n            \n                <p>Are not people being burned to death and beheaded by savages bent on destroying America and the rest of the civilized world? And the President is presenting climate change as a military priority? That's like George Washington telling his troops at Valley Forge to concentrate on making wax candles and apple cider. Good grief.</p>                \n                \r\n\n            \n                <p>Most Americans understand Barack Obama has an aversion to using U.S. power to right wrongs in the world. Yes, he gave the order to get bin Laden, and he uses drones kill terror leaders. I give him credit for that. But the Middle East is aflame. Yet there's the President urging the Coast Guard and other military branches to contemplate climate change. I hope everybody got some cider after that speech.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: President Obama, the military, and climate change", "description": "Bill O'Reilly's Talking Points 5/21", "date": "2015-05-22T12:16:33Z"}