{"vcmId": "2c3fa163-22dd-4f0e-bbef-2287ad6373c5", "url": "http://www.foxnews.com/transcript/2017/03/02/mike-pence-on-problems-facing-country.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 1, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Now, for the top story, we are pleased to have Vice President Mike Pence joining us now from Washington. Let's get some specifics tonight, Mr. Vice president. Let's start with problem solving. You did it that very well as governor of Indiana, you solved a lot of problems in that state.</p>                \n                \r\n\n            \n                <p><b>VICE PRES. MIKE PENCE (R), UNITED STATES: </b>Thank you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, let's start with sanctuary cities. What do you think the solution to that is?</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> I think it is taking a strong stance of the rule of law in this country, it was the centerpiece of the President's message, that you just said is resonated all across this country about respecting the rule of law. It begins with building a wall, border security, but internal enforcement, and rejecting sanctuary cities -</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But how do you reject?</p>                \n                \r\n\n            \n                <p><b>PENCE: </b>-- as the policy of the United States is key.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know the Governor of California, the Governor of Washington state, all right? They are not going to cooperate with you and Homeland Security, they are not. So now, that you have your Attorney General in place, is there a plan to convince the sanctuary city people to cooperate?</p>                \n                \r\n\n            \n                <p><b>PENCE: </b>Well, I think you could just rest assured that the agenda that President Trump laid out last night, including all of the elements that he has committed to end illegal immigration and bring sanctuary cities to an end as a part of that agenda is we're going to use the broadest range of methods and resources of the federal government to bare, to make that happen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I am taking you, you are speaking generally, but I assume you're talking about federal money being denied, states and cities that don't cooperate with Homeland Security, I assume you're talking about that. You can't send tanks in, you can't force them to do it, but you can hurt them financially. So, I assume that's on the table.</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> Well, look, we will going to work closely with the Congress in moving legislation to fill out the President's commitment for border security and internal enforcement and sanctuary cities is going to be part of that. But look, I know the President is going to evaluate every option that we have in terms of the authority of the federal government to end a practice that is really not contributing to the well-being of the nation and the safety and security of our people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. There was a lunch yesterday in the White House, you were not there, I was not there, so, the two most charismatic people in the United States were not invited. So, it was anchor people and President Trump. And the anchor people came out and they were talking amongst themselves, saying, gee, it was a kinder, gentler president, who may now give law-abiding illegal aliens, that is people who, yes, they crossed here illegally, but they have since been here, not caused trouble. Maybe he will give them a break, maybe there will be a pathway of immigration. We didn't hear that in the speech but is that a possibility in a Trump administration?</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: We are focusing, as the President has said repeatedly, on removing criminals who represent a threat to our family, who also are illegal immigrants from this country. And then, as the President said in Arizona last summer, then, we'll see about some of these other issues and the remaining population. But we are going to enforce the law, uphold the rule of law, and he is going to continue the vigorous efforts to do that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So, what I am hearing is, it is possible, once the border wall in the enforcement kicks in, that an examination of people who are law-abiding, they might get some kind of break.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: Well, you know, you could ask the President what his perspective is on that next time you all visit. But what I can tell you is that before we get to any of that, President Trump and our administration are committed to following through on the things the American people agree on.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. The President mentioned Chicago last night as a violent crime situation.</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Again, are there discussions, specific discussions, because the local authorities in Chicago, Cook County and Illinois are not going to be able to stop this. It is quite apparent.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: Well, I think the President has expressed himself over the last year about his deep concern about the tragic loss of life through violence and gang violence in Chicago and he expressed that last night before the Congress. We, as Americans, should recognize that the men and women who serve in uniform and law enforcement are not a force for division. They are the best of us, they deserve this support of the rest of us. So, we're also going to look for ways to continue to support law enforcement with the resources and the training that they need to accomplish their mission to protect our families and go home safe to theirs.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Has there been any discussion of a specific thing in Chicago, the federal government might do?</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: You know, not to my knowledge, Bill. But I can tell you, I have heard the President again in public and in private expressed his deep concern and frustration.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But when you get specifics, that is what everybody is waiting for now. We are all waiting for, okay, specifically, what is going to happen.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Finally, our pal Putin has been kind of quiet since I called him a killer in the interview with the President.</p>                \n                \r\n\n            \n                <p><b>(LAUGHS)</b></p>                \n                \r\n\n            \n                <p>I think you should go over there and talk to Putin.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: No plans on my part. But we made a strong commitment to NATO. We also made it very clear that two things are true. We're going to hold Russia accountable. For ending violence in Eastern Ukraine, but in the same breath, our president continues to believe that if there is a way that we can find common ground with Russia particularly in the fight against ISIS, he is determined to pursue that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You know everybody is talking about the widow of the Navy SEAL and what a fine moment that was in a myriad of different ways. And we are going to have a segment on that coming up here on this program. But then, today, you heard some people saying that Mrs. Owens was being used as a political pawn. Things like that. Does that make you angry? You seem like a calm guy. That made me angry. Does that make you angry?</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: It is a great disservice to a great American family. You know, I was in the Oval Office the day that the President called Carryn Owens and expressed his condolences with her. He traveled to Dover Air Force base and was there to comfort the family when Ryan's remains came home and the President felt very strongly that they should be given the opportunity to be there in the well of the Congress.</p>                \n                \r\n\n            \n                <p>But also, what was really special, I thought, was that in that moment, the same applause, the likes of which I have never saw when I was in Congress for 12 years, watch that family saw, and all of our servicemen and women saw, is that while we may have divisions on policy, we may argue an awful lot on the issues, that when it comes to standing with the men and women who serve and their families, we are united as a nation and I have to tell you, Bill, it was deeply moving to me to see that fitting tribute.</p>                \n                \r\n\n            \n                <p>And that family and all of our Armed Forces will remain in our prayers and our grateful hearts. And we will never forget the courage and the sacrifice of Ryan Owens.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. Very diplomatic. But when I saw that today, that was just, because I think you are right. I think 99 percent of Americans believe the way you do, the way President Trump does, the way that that I do. Ninety nine percent, but that one percent, you know, just gets me. But you are very diplomatic, Mr. Vice President. And we appreciate you taking the time to talk with us tonight.</p>                \n                \r\n\n            \n                <p><b>PENCE: </b>You bet, Bill. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Mike Pence on problems facing the country", "description": "Vice President joins 'The O'Reilly Factor' to discuss President Trump's vision for the US", "date": "2017-03-02T12:57:21Z"}