{"vcmId": "2ccc21db-fea0-496c-abce-d02a2bd62ce3", "url": "http://www.foxnews.com/transcript/2014/12/24/president-remarks-about-racism-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 23, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Continuing now with Charles Krauthammer. So, Charles, you heard the President's remarks about racism in America. What say you?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Look, I also heard in your earlier segment where people were saying to you we need to have a conversation about race. And whenever you hear that, you say to them, well, we are having one right now. What is it that we ought to be talking about that we're not? And they get vague. You know, we have to have a conversation where we listen to each other. I have no idea what that means. We have been having one for 50 years in this country. You could argue 150. You could argue the entire history of the republic. If there's been one subject that's been a constant in the national discourse, it's been race. The idea that we haven't discussed it enough is preposterous. What is usually implied is that whites ought to be confessing their racism and that should be the starting point. I refuse to accept that premise. I think if you want to have an honest argument, let's talk about honest discussion, argument, whatever, let's talk about what's going on and what can be done.</p>                \n                \r\n\n            \n                <p>And for example, let's look at the case that has sparked the new demand for a conversation. The Staten Island event where a man was killed by the police in apparently what looked like a chokehold. Is there the slightest evidence anywhere that this had anything to do with race? And if the man involved had been Hispanic or white or Asian this would not have happened? There's no evidence of that at all. Indeed, I think his wife has spoken about that and said this wasn't -- and then all of a sudden it becomes -- and I think here's where the demagogues step in. It becomes a racial issue. The policemen who were shot were not white as defined by statistics or by the census department. One was Hispanic, the other was Asian-American. So this idea of imposing a black and white frame around this I think is the work of cynical demagogues who want to inflate this into a racial issue.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Charles, President Obama has said regarding Trayvon Martin, if he had a son he would look like Trayvon. Eric Holder has said, he was followed in a department store. Bill de Blasio said he talks to his own son, a son of color, a young man of color about being treated properly by the NYPD. Al Sharpton, you know, the history of Al Sharpton. Race in America, can race in America get better if these leaders continue to talk the way they talk?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Well, look, I don't think there's anything wrong with what -- if someone says here's how I talk with my son of a mixed race. But I do think if you are going to say that, which leaves the impression that there is something inherently racist about the police, you ought to then follow that by saying, I'm not implying that. I'm simply talking about statistical realities. I'm talking about respect. I'm talking about safety. And then you reiterate your support for the police, the vast majority of whom are acting heroically every day going out. You know, after 9/11, they were the heroes of the country, as they should be regarded. As we said, they're the ones who run into a building on fire when everybody is running out. And if you reiterate that and you balance it, I think that would have made a difference. And I think that's what was missing, the lack of balance, and that's why I think the police in New York City, for example, were so upset. It looked as if the mayor was saying I'm with the demonstrators, I support the grievance, I believe it, and that expressed a lack of confidence and support for his own police department.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Charles, there's no question that Al Sharpton is a race baiter. He makes a living off more and more racial tension. But do you have a problem, I think it was released this week that Al Sharpton or Albert Sharpton, whoever that Albert might be, probably Al Sharpton has visited the White House 81 times?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> I do think it's a problem. I think this is sort of -- I think Al Sharpton is not someone the President ought to be sort of consulting at the highest level in the White House giving him that kind of respect. This is a man who does live off racial conflict, who does inject himself and injects race wherever he can. He's got a terribly checkered history beginning with the Tawana Brawley case, which was a hoax brought against a totally innocent white man accused of rape who then sued Sharpton for libel. He won the case. Sharpton to this day has never apologized. In a case where a court found him guilty of libeling a white man. There were two other racial incidents, one in Brooklyn, one in Harlem where there were actual deaths in which he was one of those stoking the racial tension. He is not a man who ought to be honored. And it goes way back.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Not a guy you want visiting the White House 81 times over the past few years.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> The wrong message from the President of the United States.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Got to leave it right there. Charles, thank you so much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The President's remarks about racism in America", "description": "Charles Krauthammer weighs in", "date": "2014-12-24T14:03:40Z"}