{"vcmId": "2dc0c654-3d58-49c6-b183-f6501126c8cc", "url": "http://www.foxnews.com/transcript/2016/01/07/bill-oreilly-hillary-clinton-and-your-money.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The stats are grim: about half of all-American workers currently earning less than $30,000 a year. Median income in America peaked in 1999. 2015 median income more than $1,000 below the '99 level -- incredible. In the seven years President Obama has been in office, the median income has fallen. So obviously the American economy is not good no matter how the politicians try to spin it.</p>                \n                \r\n\n            \n                <p>Enter Hillary Clinton who defined herself politically in September then contradicted herself yesterday.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> You know, I get accused of being kind of moderate and center. I plead guilty.</p>                \n                \r\n\n            \n                <p><b>CHRIS MATTHEWS, MSNBC HOST:</b> What's the difference between a socialist and a Democrat? Last question.</p>                \n                \r\n\n            \n                <p><b>CLINTON: </b>Well, I can I tell you what I am. I am a progressive Democrat.</p>                \n                \r\n\n            \n                <p><b>MATTHEWS:</b> How is that different than a socialist?</p>                \n                \r\n\n            \n                <p><b>CLINTON: </b>I'm a progressive Democrat who likes to get things done and who believes that we are better off in this country when we are trying to solve problems together, getting people to work together.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Obviously Mrs. Clinton dodged the question about socialism. But I can tell you this. She is not a socialist. Everybody knows the Clintons live very well with two lavish homes, private jet flights and an enormous income stream. Speeches and the Clinton Foundation afford Bill and Hillary an affluent lifestyle which they embrace.</p>                \n                \r\n\n            \n                <p>Meantime, Mrs. Clinton's competition Bernie Sanders really is a hard core socialist. He doesn't live high at all. He walks the walk. Unfortunately the walk is lame. Socialism doesn't work and Sanders promoting a guaranteed income for all Americans is living in a galaxy far, far away.</p>                \n                \r\n\n            \n                <p>The Democrats should listen to their icon John F. Kennedy.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOHN F. KENNEDY, FORMER PRESIDENT OF THE UNITED STATES: </b>To help those least fortunate of all, I'm recommending a new public welfare program stressing services instead of support, rehabilitation instead of relief, and training for useful work instead of prolonged dependency.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What President Kennedy espoused very clearly was government help in helping yourself -- not handouts, not socialism, not progressive politics.</p>                \n                \r\n\n            \n                <p>The truth is Hillary Clinton is masquerading as a far left person so Sanders will not embarrass her in Iowa and New Hampshire. However, by doing so she loses credibility on all fronts. How would Hillary Clinton improve the economy? Nobody knows.</p>                \n                \r\n\n            \n                <p>And the economy definitely needs to be improved. A new study by BankRate.com surveyed 1,000 American adults -- 1,000. 63 percent say they are unable to handle a $500 car repair or a $1,000 emergency hospital room bill.</p>                \n                \r\n\n            \n                <p>And according to the Pew Organization, 59 percent of all-American households experienced a financial shock in 2014. That doesn't mean they won the lottery. That means they couldn't pay their bills. It's clear many American homes are living week to week -- an extremely dangerous situation.</p>                \n                \r\n\n            \n                <p>And there comes a point, and \"Talking Points\" has said this before, when people get the government they deserve.</p>                \n                \r\n\n            \n                <p>Terrorism and the economy are the two big issues in this year's presidential election. Hillary Clinton is a lock for the Democrat nomination and now she says she is a progressive Democrat. But she is not.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Hillary Clinton and your money", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/6", "date": "2016-01-07T13:15:54Z"}