{"vcmId": "2e25e7b4-56a4-4177-abf6-e5984948f8f0", "url": "http://www.foxnews.com/transcript/2015/11/24/bill-oreilly-real-story-about-syrian-refugees.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Because in politics, you are not -- you are not being told the true story about the Syrian refugee situation.</p>                \n                \r\n\n            \n                <p>The Democratic Party wants the world to believe republicans are mean spirited and anti-immigrant. Republican Party wants the world to believe democrats are soft on terrorism and sympathize more with Muslims than other people. So, let us get to the truth of the matter.</p>                \n                \r\n\n            \n                <p>According to recent ABC News poll, 54 percent of Americans oppose taking in Syrian refugees, even after they have been screened for security. 43 percent of Americans are OK with admitting those refugees. Now, the reason most Americans do not want to accept Muslim refugees is not based on ethnicity or religion. It is based on security.</p>                \n                \r\n\n            \n                <p>The cold truth is, the majority of Americans have no confidence at all, that the Obama administration can protect them from harm. That is the crux of the matter. That president Obama and the Democratic Party are so liberal, so frightened and so chaotic, they cannot provide security for we, the people.</p>                \n                \r\n\n            \n                <p>Talking points believes the majority of Americans firmly believe that and my opinion is based on fact. The southern border of the United States is still insecure. According to a border patrol statistics, nearly 5,000 unaccompanied children were apprehended in October alone trying to cross the border illegally.</p>                \n                \r\n\n            \n                <p>In the first half of November, 3,000 more were caught. That is a record number for that period of time. Again, highlights the fact that the southern border remains porous. So, after seven years, the Obama administration has not been able to secure the southern border, despite the deadly terror threat facing America. Want more? Here we go.</p>                \n                \r\n\n            \n                <p>According to a document obtained by the Center for Immigration Studies, the Department of Homeland Security freed 36,000 convicted criminal aliens in the year 2013. Among those 36,000 freed, 193 had homicide convictions; 426 sexual assault convictions; 1075 aggravated assault convictions. More than 9,000 convicted of dealing dangerous drugs.</p>                \n                \r\n\n            \n                <p>All tolled, the 36,000 criminal aliens freed by ICE had 88,000 criminal convictions in the U.S.A., 88,000, and they let them go. That is simply disgraceful. A danger to all of us. And is directly on the President of the United States who could not care less. Instead, Barack Obama chastises the Republican Party and others who oppose allowing Syrian refugees into the country.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>PRES. BARACK OBAMA, (D) CURRENT U.S. PRESIDENT:</b> Apparently, they are scared of widows and orphans coming into the United States of America as part of our tradition of compassion. Now, first they were worried about the press being too tough on them during debates, now they are worried about 3-year-old orphans. That does not sound very tough to me.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What president Obama does not understand is that he has lost all credibility in matters of security. Allowing 10,000 Syrians into America would not endanger us any more than we are already endangered. The bad guys are already here, waiting to do their damage.</p>                \n                \r\n\n            \n                <p>Ten thousand Syrians languishing in refugee camps overseas, not really the issue. The signal being sent to the president is, \"We do not trust you, to protect us. So, no more generosity to overseas visitors.\" That is the deal.</p>                \n                \r\n\n            \n                <p>Talking points would allow certain Syrian refugees to come here, but I am certainly appalled by what is happening in Washington. The Democratic Party completely ineffective in fighting terrorism.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>REP. NANCY PELOSI, (D-CA) HOUSE MINORITY LEADER:</b> We are prepared to defeat ISIS by any definition. The president has engaged with more than 65 other countries to defeat ISIS. The president knows better than any of us the threat that they pose to security of the world and to the American people. So, I have confidence and in the president's take on what is out there.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Congresswoman Pelosi is an intellectual zombie. No sane person -- no sane person could think America is policy towards ISIS has been effective. No sane person could put forth that 65 countries are united to defeat ISIS. It is a myth. A dangerous deceit. But, That is what the leadership of the Democratic Party is saying.</p>                \n                \r\n\n            \n                <p>When you have a man like Senate Minority Leader Harry Reid blocking a bill that would require a mandatory five year federal prison term for any convicted foreign aggravated felon who defies deportation, gets sent away, comes back; when you have Harry Reid saying no to that law, you have anarchy.</p>                \n                \r\n\n            \n                <p>The fact that President Obama and the Democratic Party will not support Kate's law says it all. Again, these people are not interested in protecting us from harm, and the folks know it. When asked in the Fox poll to describe the Obama administration's policy on ISIS, 65 percent say it is not aggressive enough. 26 percent about right, 4 percent too aggressive. They all live with Bernie Sanders.</p>                \n                \r\n\n            \n                <p>Therefore, you would think the Republican Party would be in a superior position to defeat Hillary Clinton in 2016. You would think. But, republicans must convince the majority of Americans, not people like themselves, that they are reasonable and all of this talk about religion, Christians versus Muslim, registries, all of that is counterproductive for the G.O.P.</p>                \n                \r\n\n            \n                <p>What Americans want is security, not demonization. Republican Party should understand that liberals will attempt to paint them as extremists, as sons of Joseph McCarthy. And, that kind of marginalization can work, especially in minority communities.</p>                \n                \r\n\n            \n                <p>So, if the republicans want to win, and actually protect the country, they have to be very precise in their language, very strong in saying exactly how they defeat ISIS, how they would secure the border, and how they would deal with the illegal alien criminals. Keep it simple. Keep it clear. Use the facts to promote your case.</p>                \n                \r\n\n            \n                <p>According to all the polls, Americans well understand how weak President Obama is in foreign affairs. They know the U.S.A. is no longer considered an effective force against evil. The folks get it, yet many still fear the other side, the republican side. And if the G.O.P. candidates do not allay some of those fears, Hillary Clinton and her party will be very happy come election day. And, that is &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The real story about Syrian refugees", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/23", "date": "2015-11-24T13:15:48Z"}