{"vcmId": "2e7ceacb-8bad-4b17-a9fc-404eef1f8f04", "url": "http://www.foxnews.com/transcript/2015/01/19/bill-oreilly-barack-obama-kareem-abdul-jabbar-and-islam.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Many Americans who pay attention to their country continue to be perplexed by the White House and its apparent apathy toward the threat that radical Islam poses. To be fair, President Obama and his advisers are doing what they can to protect the homeland from attack but they have no strategy to defeat the jihad overall and are confused about the true nature of the threat.</p>                \n                \r\n\n            \n                <p>A new Reuter's poll out today shows President Obama continuing to take a huge hit in job approval. You have to think that's because of his response to the Paris terrorism and to the jihad in general. Just 37 percent of Americans now approve the way Mr. Obama is doing his job; 55 percent disapprove.</p>                \n                \r\n\n            \n                <p>Also in New York, a new Fox News poll I should say, shows Americans strongly disapprove of the way the President is waging the war on terror.</p>                \n                \r\n\n            \n                <p>Enter basketball legend Kareem Abdul-Jabbar who converted to Islam 47 years ago. Mr. Abdul-Jabbar is a smart and honest man and his column in the Time magazine this week well worth reading.</p>                \n                \r\n\n            \n                <p>He is appalled that his religion is being debased by thugs -- his word. He wants America to understand that Islam is not the problem -- vicious individuals who have perverted the religion are the problem.</p>                \n                \r\n\n            \n                <p>I believe that is what President Obama believes as well. But that theory has major problems. First of all, Muslim theocracies like Iran and Saudi Arabia routinely commit atrocities in the name of Islam. The Iranian Mullahs and the house of Saud are doing awful things and using the name of Allah to justify them. Just this week a blogger who criticized Islam in a small was given 50 lashes by the Saudi government. He's set to receive 1,000 for his Internet posting -- 50 each week until the sentence is completed. Now after complaints from human rights organizations, the sentence is being re-evaluated.</p>                \n                \r\n\n            \n                <p>Also the Iranian prisons are full of people who simply spoke out for freedom. So the problems in the Muslim world are not just caused by individuals. They run much deeper than that. But Mr. Abdul-Jabbar is not convinced writing, quote, \"Knowing that these terrorist attacks are not about religion, we have to reach a point where we stop bringing Islam into these discussions. I know we aren't there yet because much of the Western population doesn't understand the Islamic religion.\" That is true.</p>                \n                \r\n\n            \n                <p>But here's what Mr. Abdul-Jabbar is missing. Much of the Muslim world does not understand the Islamic religion. Take Pakistan, for example. It allows the Taliban, major human rights violators, sanctuary. Is that permissible under Islam? Apparently the government of Pakistan believes it is.</p>                \n                \r\n\n            \n                <p>How about Turkey? It will not assist the West in fighting the ISIS killers on its own border. Does Islam condone the beheading of innocent people? Doesn't the Koran state that a good Muslim protects the innocent and fights against injustice? Apparently the Turkish government does not understand the Islamic religion either.</p>                \n                \r\n\n            \n                <p>I could give you dozens of other examples from wealthy Islamists funding al Qaeda in ISIS to Sharia law being used to abuse women on a massive scale. If you're a female in Saudi Arabia, you cannot even drive a car.</p>                \n                \r\n\n            \n                <p>So Kareem Abdul Jabbar should understand that Islam is being presented to the world in a way that is dubious, to say the least. He continues, quote, \"When the Ku Klux Klan burn a cross in a black family's yard, prominent Christians aren't required to explain how these aren't really Christian acts. Most people already realize the KKK doesn't represent Christian teachings. That's what I and other Muslims long for, the day when these terrorists praising the Prophet Mohammed or Allah's name as they debase their actual teachings are instantly recognized as thugs disguising themselves as Muslim.\"</p>                \n                \r\n\n            \n                <p>Mr. Abdul Jabbar's wish would come true a lot faster if all the Muslim nations would confront the jihad the way the U.S.A. confronted the KKK. The FBI, largely comprised of Christians, wiped the Klan out, destroying its leadership by vigorously prosecuting the crimes they were committing.</p>                \n                \r\n\n            \n                <p>What Muslim nation on this earth is doing that to the jihadist? The answer is none with the possible exception of Jordan.</p>                \n                \r\n\n            \n                <p>President Obama and his acolytes on the left believe it is not right to hold the Muslim world, in general, accountable for the terrorism that is putting the entire planet in danger. That view is echoed by the MSNBC network which has emerged along with the \"New York Times\" as the principal downplayer of the jihad.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>EVAN KOHLMANN, MSNBC CONTRIBUTOR:</b> If our agenda is to promote peace and reconciliation and understanding, you know, saying bad things about Islam is not going to solve that problem. So, you know, again -- once again, freedom of speech is a great thing and it should be absolutely respected and there should not be prior restraint but let's also remember we have to respect people if we want that respect back.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>A lot of people think that what is being called Islamic terrorism perhaps shouldn't be called Islamic terrorism because it is actually a bastardization of Islam which is a global peaceful religion.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Thankfully the American people are rejecting that nonsense because they understand that there is a strain of Islam that does preach violence and that strain is not being challenged in any meaningful way by good Muslims. There is some anti-jihadist talk but little overt action.</p>                \n                \r\n\n            \n                <p>President Obama has a responsibility to we the people to engage himself in the destruction of the jihad. As Talking Points has demonstrated time and again, the U.S.A. has no overall strategy to defeat the jihadists and simply reacts to the latest atrocities, sometimes in a weak and confusing way.</p>                \n                \r\n\n            \n                <p>Europe is finally waking up to the fact the continent has lost control of the radical Islam movement and chaos is beginning to reign. We in America don't have that problem as American Muslims like Kareem Abdul-Jabbar are generally good people and good citizens. Yes, there are some crazies, but not many.</p>                \n                \r\n\n            \n                <p>But the U.S.A. is supposed to be the leader of the world so the question then becomes are we mobilizing the world against the jihad? And the answer is no, we are not. President Obama will not even say the word.</p>                \n                \r\n\n            \n                <p>And that is &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Barack Obama, Kareem Abdul-Jabbar and Islam", "description": "Talking Points 1/16", "date": "2015-01-19T13:23:36Z"}