{"vcmId": "2f147969-46b7-4463-a5f3-aa98b6f19ef9", "url": "http://www.foxnews.com/transcript/2016/03/23/bill-oreilly-destroying-isis-does-america-have-will.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Shortly before 8:00 a.m. Belgian Time, two suicide bombers attacked the Brussels airport setting off two explosions. Then a short time later, another bomb exploded in the Brussels subway system. At this point tonight, more than 30 people are dead, more than 200 injured. And ISIS claiming responsibility. Ironically just last night on The Factor, my Talking Points Memo partially dealt with that terror group.</p>                \n                \r\n\n            \n                <p>Right now, the Jihad is on the move in Africa, Asia and the Middle East. President Obama has deterred allowing ISIS and other groups to grow stronger. It's got to stop.</p>                \n                \r\n\n            \n                <p>Now, I have been saying for years that President Obama's strategy of containing ISIS is dangerous and puts the entire world at risk. The solution is to mobilize the NATO alliance against the savages and take the fight to them. Right now many Muslim extremists believe the jihad is working. That they are winning an armed struggle against the infidels of the west. And it's not hard to see how that kind of propaganda takes root when ISIS and other Muslim extremists continue to kill at will. The U.S.A. and other powerful western nations basically fighting a war of reaction allowing ISIS to commit atrocities and then reacting to those atrocities often with words, not action.</p>                \n                \r\n\n            \n                <p>That strategy has failed dismally. Here's the proof. Listen to what happened just last year alone. January 7th, Muslim killers murdered 12 people in a Paris magazine office. Eleven others injured. Two days later four people killed by Islamic terrorists inside a kosher grocery in Paris. On March 18th, 22 people murdered by terrorists in Tunisia. June 26th, 38 people murdered, again in Tunisia. On July 16th, a Muslim killer murdered four U.S. Marines and a sailor in Chattanooga, Tennessee. October 31st, ISIS claimed responsibility for bombing a Russian airline killing 224 people in Egypt.</p>                \n                \r\n\n            \n                <p>November 13th, ISIS savages attack ad concert hall in Paris, killing 130, injuring 368 human beings. December 2nd, 14 people killed, 22 seriously hurt when two ISIS-inspired killers gunned them down in San Bernardino, California. And just three days ago in Istanbul, Turkey, a suicide bomber killed five people, wounding 35. So, we can see how aggressive ISIS is. And we haven't even talked about the Muslim killings in Sub-Saharan in Africa. Hundreds perhaps thousands have been murdered there. And what has President Obama done about it? Very little. ISIS is not afraid of him. Today the presidential contenders reacted.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON (D), UNITED STATES</b>: We have got to tighten our security. I have talked about a visa system and our passenger main record system. But it's unrealistic to say we are going to completely shut down our borders to everyone.</p>                \n                \r\n\n            \n                <p><b>SEN. BERNIE SANDERS (I-VT), DEMOCRATIC PRESIDENTIAL CANDIDATE: </b>We need to forge a coalition of the Muslim countries in the region including some that have not been as active as they should be with the support of the United States and other major powers to finally destroy this barbaric organization.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What Senator Sanders is really saying is we should abdicate our responsibility to defeat ISIS transferring it to Muslim countries. Apparently, the man believes it's not our fight despite the worldwide carnage. On the Republican side reaction also came quickly.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL CANDIDATE:</b> You need surveillance. You have to deal with the mosques, whether we like it or not. I mean, you know, these attacks aren't coming out of -- they're not done by Swedish people, that, I can tell you.</p>                \n                \r\n\n            \n                <p><b>GOV. JOHN KASICH (R-OH), PRESIDENTIAL CANDIDATE</b>: I think we have been too lax, not aggressive enough against this kind of radicalism.</p>                \n                \r\n\n            \n                <p><b>SEN. TED CRUZ (R-TX), PRESIDENTIAL CANDIDATE:</b> The attack in Brussels is in many ways the fruit of a failed immigration policy in Europe that has allowed a massive influx of radical Islamic terrorists into Europe.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Senator Cruz will be here in just a few moments. Now, as far as President Obama is concerned, I hate to use a cliche but it's same old same old.</p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> We must be together, regardless of nationality, or race or faith, in fighting against the scourge of terrorism. We can and we will defeat those who threaten the safety and security of people all around the world.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: For seven years, Mr. Obama has been saying stuff like that. And for seven years, Islamic terrorism has grown in ferocity even though the President himself will not use those words, Islamic terrorism. Talking points has put forth a solution that the North Atlantic Treaty Organization, the most powerful military alliance on the planet declare war on the Muslim jihad. After doing that, NATO forces would attack selected sites where ISIS is based. And it would also set up safe zones in places like Syria and Libya so refugees would not have to chaotically migrate to other countries.</p>                \n                \r\n\n            \n                <p>NATO would ask all the Muslim nations on earth to contribute forces as well. Then the world would see which Muslims are interested in justice and which are not. It is simply incredible that on this planet a jihadist group comprised of about 30,000 savages can wreak this much destruction and still sit down to dinner tonight without any fear of reprisal. Think about it. We all know where the ISIS thugs are. Syria, Iraq, Libya, Pakistan and now Afghanistan. Their movements are not secret. They wage active military campaigns. And, yet, President Obama and the leaders of the NATO nations have done little to neutralize this threat to the world.</p>                \n                \r\n\n            \n                <p>Again, the jihadists believe they are winning. And that leads to more recruits, more terrorists willing to blow themselves up in the pursuit of murdering innocent people in order to impose Islamic culture. It is long past time for the American people to demand responsible leadership in Washington. Yes, President Obama is a weak leader against the jihad. But Congress is not exactly following in the steps of General George Patton either. And the blather coming out of the Democrat Party in general is stunning. As mentioned Bernie Sanders has absolutely no clue or even an interest in defeating the jihad.</p>                \n                \r\n\n            \n                <p>And Hillary Clinton the architect of the Libya mess doesn't seem to have a strategy either. On the Republican side no, candidate has outwardly called for a NATO involvement. And the U.S.A. cannot do this alone, nor should we. The world needs to be mobilized. But in order to do that, a strong leader must sound the alarm. Barack Obama is not that person, nor is Angela Merkel or David Cameron or any of the other European chiefdoms. Right now there is no one willing to stand up to this ISIS scourge. No one. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly:  Destroying ISIS, does America have the will?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/22", "date": "2016-03-23T12:28:33Z"}