{"vcmId": "2f267184-bde8-4426-988e-787080936d7f", "url": "http://www.foxnews.com/transcript/2014/10/29/bill-oreilly-president-obama-in-big-trouble.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Most polls are simply snapshots in time. And don't mean very much in the long run. However, with the midterm election just one week away, a new \"The Washington Post\"/ABC News poll devastating for the President of the United States.</p>                \n                \r\n\n            \n                <p>Question: do you think things in this country are generally going in the right direction or the wrong track: 28 percent right direction; whopping 68 percent wrong track. Do you think the nation's economy is getting better, worse, or staying the same: 28 percent getting better; 31 percent getting worse; staying the same 40 percent.</p>                \n                \r\n\n            \n                <p>Would you describe the economy as excellent, good, not so good or poor: one percent excellent -- they must have called Colmes and Carville; 26 percent good; 44 percent not so good; 28 percent poor. That means only 27 percent of Americans have positive for the economy and they are right. That should be crushing for the Democrats in the upcoming election.</p>                \n                \r\n\n            \n                <p>But not so fast. Which party the Democrats or Republicans do you trust to a better job of the nation's problems: 39 percent Democrats; 37 percent Republicans; 14 percent neither; four percent both. So it's not a slam dunk for the Republicans next Tuesday.</p>                \n                \r\n\n            \n                <p>Bernie Goldberg and Charles Krauthammer have more on that coming up.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" believes the American people are largely confused and that there will be a low turnout in the upcoming vote. There are two primary reasons for the confusion. Apathy is first. We're living in a narcissistic time where individual pursuits override the collective good.</p>                \n                \r\n\n            \n                <p>And secondly, poor education -- as \"Watters World\" proves every week, many American citizens are simply dumb. They don't know anything. And when you don't know anything, you'll buy anything -- propaganda rules. Both parties know that. And, therefore, it is very hard to get clarity when analyzing important issues.</p>                \n                \r\n\n            \n                <p>Now, here's a warning. If America continues down this road of electing incompetent people, which we are doing now, there will be a major disaster in the country. We have so many problems that are being ignored. It's frightening. Yet the folks continue to look away, addicted to the net, passionate about their own pleasure.</p>                \n                \r\n\n            \n                <p>Here's the truth. The economy is awful. American workers cannot earn the money they need to prosper. That's because technology is eliminating jobs. And private companies are being taxed to the point where they are not expanding. Bulletin: Obamacare is a tax on business so fewer high- paying jobs are being created and workers are at the mercy of the take it or leave it economy. The folks have no bargaining power at all.</p>                \n                \r\n\n            \n                <p>President Obama and the Democrats continue to say that big government will provide and a record amount of American homes are receiving welfare. But that road is a dead end. We need prosperity in this country, not giveaways.</p>                \n                \r\n\n            \n                <p>The election next Tuesday will be very telling. Will the folks wise up? I don't know.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: President Obama in big trouble", "description": "Talking Points 10/28", "date": "2014-10-29T12:15:37Z"}