{"vcmId": "30b3031c-62c8-4ae1-ba23-ca6cbf87f375", "url": "http://www.foxnews.com/transcript/2015/07/01/bill-oreilly-why-conservatives-are-losing-ground-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>All the polls say the same thing. Americans who identify themselves as conservative outnumber liberals by about two to one. Yet, social power has shifted to the left wing precincts. The reason? Organization. The far left is dominating the Internet, the entertainment industry, including the journalistic media. Outside of talk radio and Fox News there are few non-liberal voices heard nationwide.</p>                \n                \r\n\n            \n                <p>The intensity of the far left is almost frightening. Many of these people will do almost anything to destroy their opposition. So conservative Americans find themselves somewhat demoralized as they see the Supreme Court siding with the left and the national news media promoting liberal causes on a daily basis.</p>                \n                \r\n\n            \n                <p>But some of the blame for all of that falls on conservatives themselves. On right wing radio, you often hear about RINOs, Republicans in name only. Moderates like Jeb Bush are crushed by more conservative commentators. There is a deep division between the far and moderate right.</p>                \n                \r\n\n            \n                <p>You don't see that on the left. Moderate liberal people not usually scorned by the Media Matters crew, for example. They concentrate solely on defaming traditional Americans. That's very important when you have a division among conservatives and a consolidation among the left -- the power shifts to the liberal precincts.</p>                \n                \r\n\n            \n                <p>Did you know that in the last presidential election 82 percent of self-identified conservative voters cast a ballot for Mitt Romney. That means 17 percent voted for President Obama. In 2008 election, 20 percent of self-identified conservatives voted for Mr. Obama. Believe me you are not going to get that kind of flexibility on the left. They stay true to their school as the Beach Boys once sang.</p>                \n                \r\n\n            \n                <p>And then there are the giant media companies which are overwhelmingly staffed by liberal thinkers. Yesterday's announcement that NBC has terminated all business with Donald Trump was instructive. Talking Points believes that decision was based on dollars, not politics. NBC needs young Hispanic viewers and Donald Trump is now very controversial with them.</p>                \n                \r\n\n            \n                <p>However, as Brit Hume pointed out last night, NBC employs Al Sharpton, probably the most polarizing media figure among white Americans. So, there is that. The hard truth is that unless traditional Americans begin to unite, they will continue to lose power in this country.</p>                \n                \r\n\n            \n                <p>In the last election, of the Democrats and liberals lost because President Obama's policies have not been successful and there was conservative unity about that. But now with the Presidential sweepstakes of 2016 underway, division has crept back in.</p>                \n                \r\n\n            \n                <p>Hillary Clinton's moving sharply to the left. She is actually engaging far left smear merchants to help her campaign. Meantime, there are about 20 Republicans who want to run against Mrs. Clinton. And there is absolutely no unity at all other than Democratic policies are bad.</p>                \n                \r\n\n            \n                <p>The left knows that. And they know they can attack people like Donald Trump with impunity. Few media outlets will defend him or Cruz or Huckabee and on and on. So that's the picture.</p>                \n                \r\n\n            \n                <p>Summing up, if the right wants to regain momentum in this country, they had better stop bickering among themselves. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Why conservatives are losing ground in America", "description": "Bill O'Reilly's Talking Points 6/30", "date": "2015-07-01T12:11:07Z"}