{"vcmId": "318f7757-b5f0-4a13-b8c2-9304c75da5d4", "url": "http://www.foxnews.com/transcript/2015/09/08/mounting-trouble-in-hillary-clinton-email-investigation.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" September 3, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Back with the book segment tonight. More bad news for Hillary Clinton, a man name Bryan Pagliano who set up Mrs. Clinton's server in her New York home called to testify in front of a house panel investigating the assassination of the American ambassador in Benghazi, Libya. But Pagliano's lawyers says, he will take the fifth and will not testify.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington, FOX News correspondent James Rosen and Catherine Herridge who is covering the story. Catherine, why is this important?</p>                \n                \r\n\n            \n                <p><b>CATHERINE HERRIDGE, FOX NEWS CHIEF INTELLIGENCE CORRESPONDENT</b>: Well, Bill, maybe I'm old fashioned but when you're low level I.T. guy takes the fifth, I mean, that is not good. And then on top of that today, we had this nine-hour deposition with this long time Clinton ally, Cheryl Mills who was her chief-of-staff. And it was clear that after that deposition there was some kind of agreement between the Republicans, Democrats and Mills on the committee that they would come out and just give one statement to the press, which wasn't extremely professional. She answer all of the questions. Nothing was sort of left in question. But it's all classified so now there's like a lid on it. And you've done big investigations. You know how this works. They start with the little people on the outside and they start moving in and building a paper trail so that they can see who's being truthful and who's not and kind of lay the traps for the big people which is going to be Clinton and Aberdeen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, Lois Lerner got away with it, took the fifth on the IRS investigation, and Pagliano is going to do the same thing. As he said, he's a low level guy, he's a tech guy, he's not an editorial guy. But he did see things or he wouldn't be taking the fifth, correct?</p>                \n                \r\n\n            \n                <p><b>HERRIDGE:</b> Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: He had to.</p>                \n                \r\n\n            \n                <p><b>HERRIDGE:</b> Yes. He's got a lot of inside information. But the setup of that server, who was involved, who signed off on it, what kind of additional security provisions were put into place because one of the questions we're hearing increasingly is whether there was some kind of compromise by an intelligence service or hackers. There are reports that wants to sale all these e-mails. So, this guy was in on the ground floor and he is not really a political appointee. So, he doesn't have a lot of cover with the Clintons, necessarily.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. Now, what is the committee trying to get Rosen in the big picture on Benghazi? It's gone on for years and year and years now. How do you see the big picture here?</p>                \n                \r\n\n            \n                <p><b>JAMES ROSEN, FOX NEWS CHIEF WASHINGTON CORRESPONDENT:</b> Let me comeback to that Bill. We should point out the Clinton campaign says, it encouraged Bryan Pagliano to testify freely. I just want to encourage you to step back for a second and see this in broader terms if we can. With Bryan Pagliano signaling his intention to plead the fifth and thereby withhold what he knows from Congressional investigators, the story of Mrs. Clinton and her server takes on still another feature of an epic scandal on the motive Watergate as we were discussing earlier this week, namely the low level figure who served in both the campaign and on the government whose name means nothing to the general public but it was a center for the maintenance of the secretive operation and who if presented with some form of immunity could conceivably be flipped to testify about the higher ups with whom he interacted. When you marry that to the pending court cases, the FBI investigation and this periodic release of still more e-mails you have in structural terms, checked just about every box for the making of a scandal with real legs in the presidential campaign setting.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We don't want to speculate on it, but learn I was not offered any deal. I don't think she would have taken it anyway. Pagliano, I don't know a thing about it.</p>                \n                \r\n\n            \n                <p><b>ROSEN: </b>The irony here Bill, the irony is that Edward Snowden would have us believe that the NSA can recover literally every key stroke that you and I type. The only people on planet earth -- every centipede is recoverable except if you're Lois Lerner or Hillary Clinton. Then your stuff is just gone.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, it's gone.</p>                \n                \r\n\n            \n                <p><b>ROSEN:</b> In terms of your other question about Benghazi --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ahah!</p>                \n                \r\n\n            \n                <p><b>ROSEN: </b>What this committee hopes to achieve, this committee as a select committee is a little unusual and that it was formed some two years after the events in question. So it started kind of behind the eight ball as opposed to other famous select committees like Watergate or Iran contra. In this case what they're trying to determine is, why was systemic -- were the requests for more security by the folks on the ground in Benghazi almost systematically rebuffed. What exactly happened during the eight- plus hours of the attacks themselves? And then why did the White House and other aspects of the administration --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Mislead.</p>                \n                \r\n\n            \n                <p><b>ROSEN:</b> -- press a patently false explanation of what occurred.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. I want to give Catherine the last word. Rosen is speculating that this is Watergate, you know, bubbling up. Do you see it that way as well?</p>                \n                \r\n\n            \n                <p><b>HERRIDGE:</b> Well, I think there are real serious questions about whether there were efforts to cover up the extent of the classified. And that took place at the State Department. We uncovered new information this week, along with Senior Executive Producer Pamela Brown, that there was a lot of monkey business with the codes. So, e-mails that were marked as classified and then went to the lawyer's office and the coding was change to something called B-5 which makes it impossible for the public and for Congress to see. And the key thing here Bill, is the lawyer in that office was the same lawyer who was handling the Lois Lerner e-mails at the IRS.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>HERRIDGE: </b>And whistleblowers sort of like, whoa, like --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>HERRIDGE: </b>Are you trying to -- I mean that's an internal thing. And that' key.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's a tight little dirty circle.</p>                \n                \r\n\n            \n                <p><b>HERRIDGE:</b> Yes. Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And I think it is dirty. I think that, you know, but I don't know if it's going to come out before the election. We'll see. Catherine, Rosen, thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Mounting trouble in Hillary Clinton email investigation", "description": "Former Clinton aide who helped set up server pleading Fifth Amendment to avoid subpoena", "date": "2015-09-08T12:20:43Z"}