{"vcmId": "33c4c200-80d6-4b62-be85-1386ae7d507d", "url": "http://www.foxnews.com/transcript/2015/03/17/bill-oreilly-what-will-happen-to-hillary-clinton.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>There are really just two main dilemmas for the former secretary of state. Did she sign an exit statement from the State Department saying she turned over all public information to the government? Did she sign it? Yes or no? Today Ed Henry put that question to Mrs. Clinton.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>ED HENRY, FOX NEWS CHIEF WHITE HOUSE CORRESPONDENT: </b>Hello Madam Secretary. Did you sign the separation statement before you left State? Did you sign that statement?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, I'm confused, why did she not answer Ed's question? I'm also confused because the State Department itself surely knows the answer but is stonewalling.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Last week I think a couple times you were asked about whether the department has a record of former secretary Clinton signing the separation form.</p>                \n                \r\n\n            \n                <p><b>JEN PSAKI, STATE DEPARTMENT SPOKESPERSON:</b> I don't have an update on this matter. We're still working on it. I understand.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> I mean, you know, a human resources department presumably has a file on every employee. It can't be that difficult.</p>                \n                \r\n\n            \n                <p><b>PSAKI:</b> I don't think former secretaries are --</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> They don't have files.</p>                \n                \r\n\n            \n                <p><b>PSAKI:</b> Standard employees.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> They might not be but I mean how hard can it be to find --</p>                \n                \r\n\n            \n                <p><b>PSAKI:</b> -- I understand why you are asking. We are looking to get an answer. I don't have an answer today.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Why not? Why not? This has been going on for 14 days. Here is another question. Who is telling Miss Psaki to stonewall? Somebody is. John Kerry is in charge but he's negotiating nukes with the Iranians. Why would he care about the exit document? I mean, this is so strange. Everybody knows the State Department is dodging. Why are they doing it?</p>                \n                \r\n\n            \n                <p>It's similar to the Bowe Bergdahl situation. Everybody knows the army knows exactly what Sergeant Bergdahl did in Afghanistan. So why delay the announcement? The fallout is going to be the same, now or in two months. Why embarrass a proud institution like the army by playing games? None of this makes any sense at all.</p>                \n                \r\n\n            \n                <p>There is no way that Hillary Clinton can avoid the separation agreement deal with the State Department. She either signed it, or she didn't. So say it already. All of this is insulting to we, the people. We pay Hillary Clinton's salary. We pay Jen Psaki's salary. Public officials answer to the folks. Only they don't.</p>                \n                \r\n\n            \n                <p>I'm teed off here. This game playing at our expense is horrendous. However, the separation agreement is the least of Hillary Clinton's problems right now. The e-mail deletions will make that look like small change. Sooner or later, most likely later, Mrs. Clinton will have to testify under oath about her e-mails. That will be high drama.</p>                \n                \r\n\n            \n                <p>It may be true she is not guilty of anything and that presumption should be stated. But Hillary Clinton is now a star witness in the court of public opinion, which is a rough place for folks who evade legitimate questions.</p>                \n                \r\n\n            \n                <p>Americans should want powerful people to be held accountable for what they do on the public's dime -- enough with the evasions. Let's have some straight talk.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: What will happen to Hillary Clinton?", "description": "Talking Points 3/16", "date": "2015-03-17T12:22:01Z"}