{"vcmId": "3411401c-5575-48b7-acf5-bf7f04fd0e4b", "url": "http://www.foxnews.com/transcript/2016/06/02/surge-illegal-aliens-crossing-border.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 1, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Unresolved Problem\" segment tonight. New analysis of data from the census bureau says that in 2014 and 2015, 3.1 million new illegal immigrants settled in the U.S.A. 1.1 million of those are illegal. Those numbers analyzed by the Center for Immigration Studies represent a 39 percent increase in new immigrants from the prior two years.</p>                \n                \r\n\n            \n                <p>With us now here in New York, Eboni Williams and Monica Crowley. So, what are the unintended consequences, do you believe, of over a two-year period, 3.1 million immigrants? That doesn't seem like a terribly high number, does it?</p>                \n                \r\n\n            \n                <p><b>MONICA CROWLEY, FOX NEWS CONTRIBUTOR</b>: Well, but when you add that number on top of all of these subsequent years or previous years of illegal immigration and legal immigration, the system can only absorb so much.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You don't think the system.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Enormous strain on education and healthcare in this country and so on by the influx of illegal immigrants.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You don't think our system here could absorb 1.5 million immigrants a year?</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> The point is to have control over it. I'm not sure that it can. Because we are seeing enormous strain particularly in the Border States, okay? That they can't absorb the numbers --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. People coming across needing services. What say you Eboni?</p>                \n                \r\n\n            \n                <p><b>EBONI K. WILLIAMS, FOX NEWS CONTRIBUTOR</b>: I certainly think the administration is aware that this is an issue. I think that's why President Obama is going to remain the nickname deporter-in-chief. He has actually deported more immigrants than any other sitting U.S. president.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. That's a bogus stat because the deportations takes place at the border. You catch them and then you turn them around and then they put it in as a deportation.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> 2.5 million? Throwing them out?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. But look, if you have a million one over a two year period.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Coming in here and establishing residence, illegally, that's a lot of people.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: As Monica pointed out, you got 15 others that have done that in the past. So, it doesn't seem that the immigration system is working here.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> I agree with that. Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I want to know what the unintended consequences are. Because that number over a two year period isn't crazy number. Like it was maybe five, 10 years ago.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Yes. And two million are legal. So certainly the number, they got here the right way. So we have to as a country kind of fix the broken system and absorb at least some of them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I think the wall would go a long way. I have always been a proponent of the wall. To stopping that traffic coming across.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Of course. Of course.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And at least making it easier for the authorities to know who is here and who isn't.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Your question, Bill, is about unintended consequences.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Let's talk about the intended consequences because both political parties have refused to enforce our immigration laws and they want open borders.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't think the Republicans want open borders, do they?</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: On the right you have groups like the U.S. Chamber of Commerce. You have other people in big business who want the open borders. They want the amnesty because they want the cheaper labor. On the left, it's all about power. It's not about labor costs, it's about power. On the left, they want to flood the zone, they want to lock as many illegal immigrants into dependency on government programs. And the ultimate objective of that is to lock in a permanent Democratic liberal majority.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I see it a little bit differently but I want Eboni to reply.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: I actually agree that there are two competing interest for the reasons -- these relaxed border on the situation on both political sides. And it's no incentive, Bill. Neither side has incentive to fix this thing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: And that's why every opportunity to fix it, they fall.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The bulk of the Republican Party, I believe, does not want illegal immigration and would vote for a wall tomorrow.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> That's grassroots. That's not big business.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't care about that. I'm talking about the fannies on the seats on Capitol Hill. All right? So the Republican Party, the elected officials most of them want to stop it, I think that's a fact.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Well then why haven't they, Bill?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They haven't because why didn't they pass Kate's law?</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Because they are hearing from big money interests who don't want that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. You can say they are bought. I can't establish that as a fact. But if the vote comes up tomorrow for the wall, the Republicans vote for it. However, something that neither of you mentioned, the open border people, yes, they may be a political component in. Registered on the Democratic Party. But they want open borders. The \"New York Times\" wants open borders.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Of course.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They feel that it's inhumane to have any border. You heard John Kerry over giving that speech at the graduation. We're living in an open border world.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You know?</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> But first of all, that's globalization. That's one part of it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They want it.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: -- Left for decades couch their arguments in emotional arguments like we need to be compassionate and so on. That's bull. They are all about establishing a permanent Democrat voting majority.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's some of it. Go ahead.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Achieved that in California and they are achieving it across the country.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: I'm going to defend the position but I'm going to agree with you 100 percent. It's politically motivated completely. But this is what we need to understand, the GOP giving up on the base of the Hispanic community. There was a time in this country with Hispanics, yes, they absolutely go for George Bush significantly and there is an opportunity there for the GOP.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Bush the younger did it and did it successfully.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Very successfully.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And I'm telling you, you guys are under estimating this open border movement.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Not me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Look how well it worked in Europe. Look at Europe. Look how chaotic that whole continent is.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: And speaking.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That will happen here.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> By the way, this has been a silent conspiracy on both sides, damaging the American worker. Damaging our national security. Speaking of Europe, Roger Daltrey of the who blasted the British labor party on the Left for their mass immigration policy --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. Roger Daltrey.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: And he's said, damaged my mates and blue collar jobs and --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Who are you?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: But we're not underestimating it because of the politicians, they are underestimating.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. That's right.</p>                \n                \r\n\n            \n                <p>Thank you, ladies.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Surge of illegal aliens crossing the border", "description": "'The O'Reilly Factor' examines new immigration statistics", "date": "2016-06-02T12:06:37Z"}