{"vcmId": "34ac0e76-b7b0-4042-b4a5-dd5622441695", "url": "http://www.foxnews.com/transcript/2016/06/23/where-is-wife-omar-mateen.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 22, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Factor \"Follow-Up\" segment tonight. How is the Justice Department handling the Orlando terror investigation? Yesterday, Attorney General Loretta Lynch surprised some people.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> Has the shooters wife left the state of Florida?</p>                \n                \r\n\n            \n                <p><b>LYNCH</b>: Right now I do not know exactly the answer to that. I believe she was going to travel but I do not know exactly her location now.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, the wife Noor Salman is under investigation by the FBI for possibly aiding her husband the terror killer Omar Mateen.</p>                \n                \r\n\n            \n                <p>With us now here in New York City, Monica Crowley and Eboni Williams. Eboni, you are an attorney. Are you surprised when the Attorney General of the United States doesn't say I don't know where the woman is?</p>                \n                \r\n\n            \n                <p><b>EBONI WILLIAMS, ATTORNEY:</b> No I wasn't, Bill. Because when Loretta Lynch says, she didn't know where she was, actually you have to believe she is lying.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Lying?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Absolutely. Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Wow!</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> Let me tell you something. Seriously, the culture of the DOJ is operate with discretion in secrecy. It's the way they do things. They have plea bargains that are sealed. They have grand juries they convened that we never know about. It's the way they do things that a --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Why would she lie about an innocuous question like that?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Because there is a public need and understandable, Bill for people want answers. People want to know why is this woman not in custody. Why has she not been arrested? It's insatiable. And it's understandable. She has got to give the people --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>-- not compromise her integrity in a discussion like that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I said to somebody, doesn't Attorney General Loretta Lynch know that I'm in the country? Don't you know that when you say something like that it's going to be front and center?</p>                \n                \r\n\n            \n                <p><b>MONICA CROWLEY, FOX NEWS CONTRIBUTOR</b>: Yes. Well, I don't fault her for this, actually.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You don't?</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Actually may know where he is.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> She.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Where she is, right. The wife. Because the standard operating procedure of surveillance not to tip off the target.</p>                \n                \r\n\n            \n                <p>O'REILLY: So you agree with Eboni that she is not telling the truth?</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> That she may be tracked.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But I don't think Attorney General -- look, look, if you ask a question the Attorney General doesn't want to answer it, because look I'm not answering any questions about the woman. This is investigation.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Here is why she is not going to say this because --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, you both agree that Miss Lynch mislead, all right? The people when asked about Miss Salman and you both think the FBI knows exactly where she.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> I hope that that's the case.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: I believe they do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, this is almost unconceivable but not impossible.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Something for another segment.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What if Miss Salman is an ISIS operative and bang she shows up in Raqqa somewhere? Come on.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: They have to have eyes on her, Bill. Because look --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They have to.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS: </b>Criminal intent. That is what they're looking to around this conviction right now.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> And they're going to get that not from direct evidence, circumstantial evidence --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Don't they have her on video?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> That's not enough, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know it's not enough. But it's certainly enough to launch an investigation. Not enough for a conviction.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> Right. Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And then Ms. Lynch goes on to say something that caught my attention as well. Roll it.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>LYNCH: </b>This Department of Justice and your country stands with you in the light. We stand with you to say that the good in this world far outweighs the evil. That our common humanity transcends our differences and that our most effective response to terror and to hatred is compassion, unity, and it's love.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All we need is love, ba-ba-ba-ba-ba-ba. Again, I mean, the sentiment is fine but this is the Attorney General and I like Loretta Lynch. When she was announced because she did good work here in New York City. But I'm going, wait a minute, I mean, is Yoko Ono now inhabiting her body?</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> That statement was far more disturbing to me than her statement about Mateen's wife. Because it tells you what the culture of thinking is. This is the chief law enforcement officer of the nation under the President of the United States.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>She doesn't have to be callus.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Love is not a strategy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Hug Hitler was not a strategy. The only way to defeat barbarians is to annihilate them. Talk about love and compassion, that's something that you should hear in church on Sunday morning. But this is the approach that they have taken to the Islamic threat from the very beginning.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. But now you are lumping Lynch in with the President. Let Eboni reply. Go.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Of course, she serves under him.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS: </b>I respectfully disagree with that, Monica. She is the face of the DOJ --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS: </b>-- whether she wants to be or not. She has got to present something. That's the best she can give the American people right now. She can't tell them where this woman is. She can't tell them the details of this investigation. She cannot compromise the integrity of what many people want to be justice on this case.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, wait, wait, wait, wait, wait, Eboni. So you think she was now doing this to --</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Apiece.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Morale?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Apiece people?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Make them feel better?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> Give them something. People want something.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: This is not satisfactory to these people.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> This is what I give them. These SOB's are going to pay for this crime no matter where they are, no matter who helped him, no matter what he had, we will going to track them all down.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS: </b>They want the suspect relax and leading them to the evidence.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I would relax them. All right, ladies. Thank God I'm not Attorney General, all right?</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Where is the wife of the Omar Mateen?", "description": "'The O'Reilly Factor' examines how the Justice Department is handling the Orlando terror investigation", "date": "2016-06-23T12:14:28Z"}