{"vcmId": "351fca5b-71a1-4019-9a7e-e593e7e1a4cc", "url": "http://www.foxnews.com/transcript/2017/02/28/bill-oreilly-war-between-president-trump-and-press.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Critical mass has now been reached as the Trump administration is denying access to certain news organizations he believes are out to get the President.</p>                \n                \r\n\n            \n                <p>Also, in an act of defiance, the President announced he will not show up to this year's White House Correspondents' Dinner in April. He does, however, want everybody to have a good time. If this political controversy were a legal case, and if I were the judge, I would have to recuse myself. That is because for the past 20 years, I've watch the liberal media in America scorch the FOX News Channel and the people who work here, including me.</p>                \n                \r\n\n            \n                <p>The attacks are personal, relentless, and often dishonest. Just last week after Alan Colmes passed, a far left smear website vilified him as a weak liberal, a calculated pond for this network. Does it get any worse than that? No, it does not. So, there is no question that if the national media does not like your politics, it will try to hurt you. Even if you are deceased. Anyone denying that is a deceiver.</p>                \n                \r\n\n            \n                <p>Of course, the Trump administration is well aware of this. It knows the media is desperately trying to link the Trump campaign to Russia and will use anonymous sources to drive that narrative in the hope the election will be perceived as invalid. By the way, we do not, do not use anonymous sources here. I have been told plenty of bad stuff about Hillary Clinton and Donald Trump. But without attribution, it is not going to be reported.</p>                \n                \r\n\n            \n                <p>The President also understands that certain news organizations despise him to the point that employees actually fear for their jobs if they say positive things about him. Many left-wing editors and executives believe Mr. Trump's positions on illegal immigration, Muslim terrorism, global warming, abortion, crime, and just about every other issue, define the President as a dangerous man. Who must be destroyed.</p>                \n                \r\n\n            \n                <p>If for anyone supporting him, cannot be tolerated. There will be no detente. The gulf is too wide. It will be one nasty media competition after another until the President leaves office. Now, it is difficult to see how this awful situation benefits anyone. The country is not helped by all the acrimony. \"Talking Points\" believes the President has a right to defend himself, but should do so using facts. If a report is wrong, fake news, have Sean Spicer vividly reputed in detail. If access is denied to certain press organizations, again, specifically spell out why.</p>                \n                \r\n\n            \n                <p>If you don't, you come off as petulant. Facts will always win the debate. Always. As we proved on this program every night. As for the Correspondents' Dinner, the President is smart for not going. Like him or not, he is not big on hypocrisy. Yakking it up with an industry that obviously wants to hurt him would be bizarre. So, send the Vice President and a nice donation to the dinner scholarship fund that helps students.</p>                \n                \r\n\n            \n                <p>The cold fact is, the presidential election of 2016 defined the free press in America. He is actively, actively left-wing, not objective. But now, things have become so much worse than just ideology. Now, it is war. And that is \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: War between President Trump and the press", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/27", "date": "2017-02-28T13:11:36Z"}