{"vcmId": "35448cfc-ba57-4ee2-b47e-e604596400bc", "url": "http://www.foxnews.com/transcript/2016/06/23/bill-oreilly-donald-trump-seeking-to-destroy-hillary-clinton.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Speaking in New York City this morning. Mr. Trump delivered a major address, accusing Hillary Clinton of corruption and incompetence.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Hillary Clinton wants to bring in people who believe women should be enslaved and guys put to death. Maybe her motivation lies among the more than 1,000 foreign donations Hillary filed disclose while at the State Department? Hillary Clinton may be the most corrupt person ever to seek the presidency of the United States.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Mr. Trump reading from a teleprompter scorched the former secretary of state for wanting to admit to Syrian and Iraqi refugees, some of whom he believes are jihadists, thus the reference to enslaved women and guys. A broad rhetorical stroke but one that his supporters relish hearing. Trump then got specific about the terror attack in Benghazi that killed a U.S. ambassador.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Ambassador Stevens and his staff in Libya made hundreds and hundreds of requests for security. They were desperate. They needed help. Hillary Clinton State Department refused them all. She started the war that put them in Libya, denied him the security he asked for. Then left him there to die. To cover her tracks, Hillary lied about the video being the cause of death.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Trump's speech lasted about 40 minutes and featured something new.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Bill Clinton gave her a number of speeches that were underwritten by the Chinese government and its supporters. These funds were paid to the Clinton's bank account directly while Hillary was negotiating with China on behalf of the United States. Tell me folks, does that work? She sold out our workers and our country for Beijing.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, The Factor checked out that allegation and it is based solely, solely on a book unfavorable to the Clintons. FOX News cannot confirm the data Mr. Trump used. We cannot confirm that independently. For her part, Mrs. Clinton pounded Trump yesterday. You saw some of that on The Factor last night and continued today in North Carolina.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON (D), PRESUMPTIVE PRESIDENTIAL NOMINEE:</b> I guess my speech yesterday must have gotten under his skin because right away he lashed out on Twitter with outlandish lies and conspiracy theories and he did the same in his speech today. Now, think about it. He going after me personally because he has no answers on the substance.</p>                \n                \r\n\n            \n                <p><b>(CHEERS AND APPLAUSE)</b></p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Summing up, the opening campaign salvo is harsh and likely will get even more intense as we move toward November. That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Donald Trump seeking to destroy Hillary Clinton", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 6/22", "date": "2016-06-23T12:05:17Z"}