{"vcmId": "3587f002-fa24-4d55-b88f-b3e980f35341", "url": "http://www.foxnews.com/transcript/2014/10/20/will-republicans-win-control-senate.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 17, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Thanks for staying with us. I'm Bill O'Reilly in the \"Unresolved Problem\" segment tonight. Midterm election 17 days away. Right now, many are predicting the Republicans will win the Senate and thus control Congress.</p>                \n                \r\n\n            \n                <p>However, new FOX News poll asks registered voters what they thought about both parties.</p>                \n                \r\n\n            \n                <p>Republicans, 36 percent favorable. That's low. Fifty-four percent unfavorable.</p>                \n                \r\n\n            \n                <p>Democrats, 43 percent favorable, 50 percent unfavorable.</p>                \n                \r\n\n            \n                <p>Here now to explain this complicated situation, Ann Coulter who is a Republican.</p>                \n                \r\n\n            \n                <p>So, were you surprised at that? I was.</p>                \n                \r\n\n            \n                <p><b>ANN COULTER, CONSERVATIVE COLUMNIST:</b> Not really, I mean, the country has changed. And we keep thinking this is the same country that it used to be. Democrats have been bringing in ringers since the 1965 Immigration Act.</p>                \n                \r\n\n            \n                <p>And it's not -- you think it's the same people voting. It isn't. The Democrats get basically every immigrant group to bloc votes for the Democrats.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's true that that has helped them. But the performance of the Obama administration the last two years.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right. So, you would think that even people who were incline to vote for a party --</p>                \n                \r\n\n            \n                <p><b>COULTER:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- take a step back and say you know what? All of this stuff really isn't working.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>You would think so, but you also have the massive issue of election frauds.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But that is -- a FOX News poll doesn't have anything to do with election fraud. The folks clearly are not liking the Republican Party.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>They're not pushing the issues Americans care about. They aren't the populist party. They are allowing themselves to be painted as the party of Wall Street and not the party of the people.</p>                \n                \r\n\n            \n                <p>If the Republican Party is going to win they are going to have the populist party and bring up immigration which they won't touch.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Here's what I said earlier, you need a face. You know, each other party needs a face. You got the Clintons for the Democratic Party. You got Barack Obama for the Democratic Party.</p>                \n                \r\n\n            \n                <p>Who do you have for the Republican party?</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No one.</p>                \n                \r\n\n            \n                <p><b>COULTER:</b> No, you're right. Republicans are totally self-starters. It's being done election to election. I mean, Scott Brown is running one of the best campaigns this year as is Tom Cotton. But they are --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But he is making gains. Brown is making gains up there in New Hampshire.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>Yes, he is. And he is in a tough election.</p>                \n                \r\n\n            \n                <p>Meanwhile, I mean, I will predict now, Cory Gardner will lose in Colorado because he's the worse on immigration. Meanwhile, it's it not helping him, he is 30 points behind.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, when he says he's the worse on immigration, what do you want them to say? Everybody should be deported?</p>                \n                \r\n\n            \n                <p><b>COULTER:</b> No. But how about we have a border? A fence would be nice.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But I think Gardner -- I don't know Gardner but I think he is for that. I mean he wants the border to be patrolled in a responsible way.</p>                \n                \r\n\n            \n                <p><b>COULTER:</b> Look, Americans are out of work. No more guess workers. We need a little time to consolidate.</p>                \n                \r\n\n            \n                <p>Instead of constantly sucking up to a group of people who will never vote for you, how about appealing to the other voters who are just going to stay home and say, screw you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. I mean, strategizing that way maybe. I don't know.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>They're not getting that vote anyway.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Now, there are things and again I just want to make one more point. I think Mitt Romney is going to be the nominee.</p>                \n                \r\n\n            \n                <p><b>COULTER:</b> I hope so. Oh, I hope so.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I do believe is he going to do it because nobody else getting any traction.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>I would say it has to be either Ted Cruz or Mitt Romney.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, Cruz, I don't think he has the constituency. But we'll see.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>He's very, very smart, the only issue whether he can run for president.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He is a Harvard guy. He is smart.</p>                \n                \r\n\n            \n                <p>Now, Minnesota, you've been there, right?</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I mean, I go to Minnesota and it seems like a very, very common sense place.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Al Franken, votes for Obama 97 percent of the time is a shrill, dishonest hack. Anybody looking at his record knows that, all right. Nasty individual. Nothing good about him. All right?</p>                \n                \r\n\n            \n                <p>He might -- he is going to get he reelected it looks like. Why?</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>I can explain that very easily. A few things in a microcosm to the rest of the country, again immigration. He gets 90 percent of the Somali vote.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How many Somalis can there be.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>About hundred thousand. And he won by, quote, \"300 votes\".</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> There is 100,000 Somali registered voters in Minnesota? I don't think so.</p>                \n                \r\n\n            \n                <p><b>COULTER:</b> Registered voters, OK, fine, it's 50,000. He won by 300 votes. That was -- let me finish.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>I'm answering your question. One is, I even mention, the (INAUDIBLE), and the Hispanic vote out there. This isn't the voters of Fargo who had been won over to Al Franken.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Fargo is in North Dakota.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>Again --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I get you. It's not the Scandinavian immigrant. They're new people.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>These are voters coming in that I'm think about and they are block voting, they are being bused into the polls. That's point one.</p>                \n                \r\n\n            \n                <p>Point two, yes, do you get to election fraud there and we know that, what, like 500 of Al Franken voters turned out to be felons, he won like two months after the election. Hollywood closed ranks around Franken.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They are funding his campaign, right?</p>                \n                \r\n\n            \n                <p><b>COULTER:</b> He was on Comedy Central talking about Rob Reiner having anal sex with his son. Did you see that? No, we saw a tape Christine O'Donnell in \"Politically Incorrect.\"</p>                \n                \r\n\n            \n                <p>And now, we have the biggest war chest in America. You are right on obnoxious and bullying. But that is not how he has been behaving. You will see the real Al Franken after this election.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Fifty-three percent of Minnesotans disapprove of Barack Obama. Yet, they're going to reelect Al Franken? I just don't get it.</p>                \n                \r\n\n            \n                <p>Ann Coulter, everyone.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Will Republicans win control the Senate?", "description": "Ann Coulter on why the GOP remains unpopular even though the Democratic Party is in disarray", "date": "2014-10-20T12:13:20Z"}