{"vcmId": "37268257-df44-4105-83bd-e9fa60303a34", "url": "http://www.foxnews.com/transcript/2015/01/28/bill-oreilly-presidential-race-is-on-very-early-this-time-around.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>In Iowa last weekend Nine Republicans showed up to present themselves to potential voters. Romney, Jeb Bush, Rand Paul were not there but the gathering got a bunch of attention signaling the start of a very intense election cycle which is liable to be exhausting before it is all over.</p>                \n                \r\n\n            \n                <p>Early polling really doesn't matter because some of the GOP hopefuls are not all that well known yet. Remember the rise of Barack Obama. But Wisconsin Governor Scott Walker recently caught a break.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>RUSH LIMBAUGH, RADIO HOST: </b>Scott Walker has the blueprint for winning and winning consistently and winning big in a blue state with conservative principles that are offered with absolutely no excuses.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Rush Limbaugh's positive words give Governor Walker some momentum. He is a proponent of smaller government, has restricted the power of labor unions in Wisconsin, generally defeated the far left at every turn in a state where the Democratic Party is strong. Scott Walker will have to go up against populist folks like Chris Christie and Ben Carson who effectively speak directly to the voters. But Walker and fellow Governors Perry and Kasich have very positive economic stories to tell.</p>                \n                \r\n\n            \n                <p>Senator Rand Paul remains somewhat of a mystery to me. We've asked him on the program a number of times. He always declines. Why -- I don't know. It could have to do with his foreign policy outlook.</p>                \n                \r\n\n            \n                <p>Senator Ted Cruz and former Senator Rick Santorum are conservative guys who must break through quickly in order to race money.</p>                \n                \r\n\n            \n                <p>Senator Marco Rubio seems to have a bit more momentum as he espouses conservative principles from a minority viewpoint. The Senator's Cuban heritage gives him a unique perspective into the American minority situation so Mr. Rubio can certainly launch a vibrant campaign. But that might put him up against his former mentor Jeb Bush who will run as a moderate Republican with a record of achievement in Florida.</p>                \n                \r\n\n            \n                <p>Mitt Romney, of course, best known Republican able to raise a lot of money; the former governor of Massachusetts will run again as an economic stimulator but his road will not be easy.</p>                \n                \r\n\n            \n                <p>Other folks like Sarah Palin and Donald Trump will certainly liven up the proceedings but they need effective organizations in 50 states and that will be a major challenge for them.</p>                \n                \r\n\n            \n                <p>All in all, the race is already interesting and that's a good thing. Charles Krauthammer will make a prediction a bit later on. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: the Presidential race is on very early this time around", "description": "Talking Points 1/27", "date": "2015-01-28T13:26:54Z"}