{"vcmId": "3765fe63-ad44-4122-87e5-487dde407be1", "url": "http://www.foxnews.com/transcript/2015/11/18/celebrities-and-pundits-react-to-paris-terror-attacks.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 17, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Weekdays with Bernie Segment\" tonight, some of the most dubious things said after the Paris terror attack.</p>                \n                \r\n\n            \n                <p>We begin in Stockholm, Sweden where Madonna said this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MADONNA, SINGER</b>: There are people who have no respect for human life and there are people that do atrocious, degrading and unforgivable things to other human beings. But we will never, ever, ever, ever change this world that we live in if we do not change ourselves. If we do not change the way we treat one another on a daily basis.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Joining us now from Miami, the purveyor of BernardGoldberg.com Mr. Goldberg. So, Bernie, if only you would be a nicer guy, ISIS would retreat, come on.</p>                \n                \r\n\n            \n                <p><b>BERNARD GOLDBERG, FOX NEWS CONTRIBUTOR: </b>Stop being sarcastic it, I think Madonna makes a very good point. If we behave well towards each other, good things can happen. Here's my advice to Madonna, tell it to the terrorists.</p>                \n                \r\n\n            \n                <p>I mean, she is a savvy business woman. I will grant her that. She is a smart business woman. But this idea all we have to do is tell people to play nice and that will change the world and somehow I'm not clear how will combat terrorism makes Madonna sound at best naive and at worst idiotic.</p>                \n                \r\n\n            \n                <p>But here's the problem, you deal with deranged individuals and that's what ISIS is comprised of -- deranged individuals. Seven guys blow themselves up so that they can slaughter innocent civilians and they think they are going to heaven.</p>                \n                \r\n\n            \n                <p>No matter how nice you are, Goldberg or I am and God knows we are very nice -- that's not going to change deranged individuals. The only thing that changes deranged individuals is incarceration, taking them off, taking them out, so they can't harm others.</p>                \n                \r\n\n            \n                <p>So that's the message. And you can do it a variety of ways, yes. Everybody should be nice to each other, goodwill toward men. But when you hear a pop icon like that spout this gibberish, I'm just going my god. All right.</p>                \n                \r\n\n            \n                <p>We have another piece of tape and this one is a journalist on CNN. Go.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>FAREED ZAKARIA, CNN HOST:</b> Coming up it's an all too familiar pattern of well-planned attack on the west followed by a swift and violent response that further stokes the fire of jihad. Will the west make these mistakes again? That's next on GPS.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So the response stokes the fires of jihad. The response.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Listen, Fareed Zakaria is a bright guy. Maybe he's right. Maybe the response is a mistake. Maybe violent responses are a mistake. So, here's a better idea that maybe Fareed would go along with. Instead of a violent response to the terrorist, maybe the French should send the terrorists flowers and croissants and a thank you note.</p>                \n                \r\n\n            \n                <p>I would ask Fareed who is a bright guy and I mean that. He clearly is a bright guy. If a violent response is the wrong response, what's the proper response for people who killed over 100 innocent people?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Madonna just gave it to you -- Goldberg. Madonna just gave you the proper response. And Fareed I'm sure would agree that we must be nicer to each other.</p>                \n                \r\n\n            \n                <p>But, look, you keep saying that this guy, I don't know him, is a smart guy and intelligent guy. I have got a question.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>That wasn't smart. I grant you that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And that's why he is in the \"Dumbest Thing Said Segment\", Goldberg. That was just dumb -- just dumb. You have to respond. If you don't respond, you get killed just as those poor people in Paris got killed and 3,000 people on 9/11 got killed. You have to respond.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>But what these two examples and the two more that we're going to do in a bit, they fit into a pattern. These aren't conservatives who are thinking this way. These aren't army, military generals who are thinking this way.</p>                \n                \r\n\n            \n                <p>This is a liberal mind set. It's a liberal mind set that suggests that violence isn't necessarily the answer. Playing nice is a response to terrorism. The only problem is terrorists didn't get the memo on any of this. That's the problem.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. And I have to tell everybody that there is a rumor going around Washington, D.C. that President Obama is going to appoint Yoko Ono as secretary of defense. That is not true.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Celebrities and pundits react to Paris terror attacks", "description": "Bernie Goldberg on the most dubious comments; 'The O'Reilly Factor' investigates, Part I", "date": "2015-11-18T13:15:54Z"}