{"vcmId": "39192f8e-dc2a-45ca-8f93-a3169bd201b9", "url": "http://www.foxnews.com/transcript/2016/03/08/nancy-reagan-legacy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 7, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Continuing now with Charles Krauthammer who is in Washington this evening. So, Nancy Reagan has passed. Funeral will be in California Friday morning. What is her legacy to you, Charles?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>Well, I think for one thing, she was a model of elegance, style, and steel, all at the same time. I thought she brought a certain dignity to the office of first lady. But, behind the scenes, as everyone who knows who followed the Reagan administration, she was the backbone. She was the one person he listened to in the end.</p>                \n                \r\n\n            \n                <p>In fact, it was said of Reagan that he had only one friend in the world and that was Nancy. We all know that in the second term, she helped to engineer the firing of Donald Reagan as his chief of staff. She felt that he was ill-served by that. That was one of the titanic battles.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, Reagan denies that. In, you know, \"Killing Reagan\" we have a letter that Ronald Reagan actually wrote, saying that Nancy did not have anything to do with Donald Reagan's firing though our research shows that you are correct, that she certainly did.</p>                \n                \r\n\n            \n                <p>But, you know, what was interesting about my research into Nancy Reagan? I believe she is the most fascinating character in the book, even more fascinating than the president is close, because she evolved into this great hero when president Reagan became ill, after he left the White House. And, what she did in the latter part of his life was very quiet but so stunningly noble. And, I am glad I had the opportunity to bring that to people.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Well, really it is sort of a book end-effect, because she was also noble and steely when he was shot, the very beginning of his presidency.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes, that is for sure.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Can you imagine you spent all these years running campaigning, sacrificing. You get into office. You are ready to act. You are ready to do things and then he almost -- is killed.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> So, I thought she showed that very early on. And, then, I thought her ex-first ladyship, the later years when he was in decline was truly a display of heroism.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> That is really hard to do. Anybody who has had to live with the decline, essentially you are losing your soul mate as the personality, it disappears. That is the story of Alzheimer's. And, the pain of that is sort of incalculable. And, I thought she handled it with exceptional dignity. And, that is why I think people admired her so.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And, you know, she had the breast cancer situation, and became public with that as did Betty Ford. And, she had the just say no, which I thought was -- I wish they had continued that with the kids and the drugs.</p>                \n                \r\n\n            \n                <p>So, I think that she is a great American patriot, who lived her life in a totally unique way. And, her evolution from kind of a shallow person in the beginning to a true hero at the end is really worth noting. Last word on her.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> I think she had that same effect on her husband. He was sort of aloft and adrift when he met her. She sort of helped put his life together.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>She was the force he could rely on when he became the governor of California; then when he ran, when he lost in 76 when he ran again. And, then, through a difficult presidency starting with assassination attempt. And, she was there all the way. I think history is going to attribute quite a lot of his success and his perseverance to her influence on him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Charles, thank you as always. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Nancy Reagan's legacy", "description": "Charles Krauthammer joins 'The O'Reilly Factor' to discuss the former first lady", "date": "2016-03-08T13:33:12Z"}