{"vcmId": "397fe83b-f16e-4d9a-a3dd-15aed7381bb7", "url": "http://www.foxnews.com/transcript/2017/04/05/bill-oreilly-trump-surveillance-story-explodes.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Tonight we will give you just the facts. No speculation, no hysteria. The latest from FOX News correspondents Adam Housley and Malia Zimmerman is this, quote, \"Multiple sources tell FOX News that Susan Rice, former National Security advisor under then President Barack Obama requested to unmask the names of Trump transition officials caught up in surveillance,\" unquote.</p>                \n                \r\n\n            \n                <p> Apparently Miss Rice was doing this for more than a year leading up to the November election. That's very troubling. And if it can be proven, Susan Rice is in major trouble. Also because the National Security advisor was so close to President Obama, he is going to have to answer questions as well. So you can see an enormous story is developing and it really doesn't matter whether the liberal mainstream media ignores it, Congress and the FBI will not. To be fair to Miss Rice and we do want to do that, she denies all wrongdoing and should be given the presumption of innocence because that's the American way.<br> <b><br> (BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> SUSAN RICE, FORMER NATIONAL SECURITY ADVISOR TO PRESIDENT OBAMA:</b> There were occasions when I would receive a report in which a U.S. person was referred to, name not provided, just U.S. person. And sometimes in that context, in order to understand the importance of the report, and assess its significance, it was necessary to find out or request the information as to who that U.S. official was.<br> <b><br> UNIDENTIFIED FEMALE</b>: Did you seek the names of people involved in -- to unmask the names of people involved in the Trump transition. The Trump campaign. People surrounding the President-elect?</p>                \n                \r\n\n            \n                <p> <b>RICE</b>: Let me be clear.</p>                \n                \r\n\n            \n                <p> <b>UNIDENTIFIED FEMALE:</b> In order to spy on them?</p>                \n                \r\n\n            \n                <p> <b>RICE:</b> Absolutely not for any political purposes to spy, expose, anything.<br> <b><br> UNIDENTIFIED FEMALE:</b> Did you leak the name of Mike Flynn.</p>                \n                \r\n\n            \n                <p> <b>RICE</b>: I leaked nothing to nobody.</p>                \n                \r\n\n            \n                <p> <b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> O'REILLY:</b> Nothing to nobody should be nothing to anyone. Now, here's my question. If Susan Rice did surveil the Trump people, big if, for a year, what was her motive? Why did she do it? I mean, think about it. This woman is a National Security advisor to the President. She has got a lot of work to do. So why would she be running over to the National Security Agency or the CIA reviewing wiretaps?</p>                \n                \r\n\n            \n                <p> Summations of all intelligence are delivered to the White House every morning. And why, if a Trump person was involved, would she want the name? The key question to this big story is motivation. Now, I know many cable news programs will speculate, will convict Susan Rice without a trial or attempt to cover for her as we saw last night. We, at THE FACTOR are not going to do that. We're in business to report the truth and give opinion based upon facts. So let's sum up.</p>                \n                \r\n\n            \n                <p> Talking Points believes reporting from Adam Housley and Malia Zimmerman is accurate. Other news agencies are getting information as well. So at this point you, the viewer, can assume that Susan Rice took an amazing interest, amazing interest in what the Trump people were doing well before the folks voted. Why did she do that? We don't know. What we do know is that both the House and Senate Intelligence Committee should subpoena Susan Rice immediately and both committees should send written questions to President Obama.</p>                \n                \r\n\n            \n                <p> Also the FBI should interview Ambassador Rice and conduct a very thorough investigation of her behavior. That's reasonable, is it not? Because if the Trump campaign or the Trump transition team were spied upon by the Obama administration, again, a big if, that has to be uncovered. And that's \"The Memo\".<br> </p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The Trump surveillance story explodes", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 4/4", "date": "2017-04-05T12:27:00Z"}