{"vcmId": "3a7a0984-1399-42a6-bd5f-3cf9dceac891", "url": "http://www.foxnews.com/transcript/2016/09/20/donald-trump-reacts-to-terror-attacks.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" September 19, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>So I have your statement on the terror over the weekend. He is going to read one sentence, quote, \"I will bring an end to the senseless acts of violence wrong to say that we are in a fight about narratives. These terrorists pose an existential threat to our country our values and our way of life.\" I don't know if anybody can bring an end to individual acts of violence. You know, I mean, I don't think it's possible. Am I wrong?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, one thing you have to do is degrade. What's happening is they are going around. They feel emboldened and they feel wonderful. And all of these young people in our country and other countries are looking up to ISIS. Because ISIS continues to taunt the United States. They started off on a small area. They are now in 28 countries. Bill. Twenty eight countries. Think of it. This is during Hillary Clinton's tenure. Twenty eight countries and it was just reported. And I would tell you, that is disgraceful.</p>                \n                \r\n\n            \n                <p>So, you have to bring them down and you have to bring them down fast. You know that the young people in our country and other countries. They are looking up to these people. They have respect for these people. It's like -- let's put it this way, they are getting good public relations because it looks like they are beating the United States or certainly like the United States can't beat them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. And it certainly is a psychological war as well as the physical war. But Western Europe hasn't really helped out and I mean that's going to be a part of the equation for the next president because Mr. Obama really doesn't. Mr. Obama said today, I don't know whether you are aware, that his strategy is fine. You know, just wear them down, wear them down. We don't need really any, any more action. What he is doing. It's the -- we defined here, the strategy of acceptable losses. Now, another thing you said that was very controversial is that you want to profile. You want to profile Arab or Muslim men. How would that work?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, we have no choice. Look, Israel does it. And Israel does it very successfully.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They do it at the airports. They do it at the airports.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, they do it. They do it. And when they see somebody that they would like to talk to, that they would like to look at, that they would maybe like to open up their satchel and take a look inside, they do it. And they don't like to do it. I don't like to do it. But we have to be, you know, you have a woman who is 87-year-old in a wheelchair from Sweden and we have to look at her. We have to look at somebody else. It's ridiculous what's going on there.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, what would you do though?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> If you want to be so politically correct --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Do you have a vision of how that profiling would work?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> It works. And we see somebody that we think there could be a problem. At airports and other places. You talked to them and you see what's going on.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But I think they do that now.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> We don't do that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You know, look, the alleged bomber here in New York lived over a chicken stand his father owns in New Jersey. I mean, come on. And the guy out in Minneapolis, who are in that area, Saint Cloud, he is a 20-year-old college student. So he needs to just people who are loons. They just lose it and I don't know if we could ever stop that.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: The guy over the chicken stand brought litigation a lot of litigation against different people. And I bet you that's why he was on the list. You know, he was on the list. His father didn't want to put them because they don't want to get sued. So, they probably saw he is a litigious guy, and they don't want to get sued so they left him alone. Who knows what the reason is but whatever the reason is, it's no good. We have to end this. It's horrible. And one thing I will say.</p>                \n                \r\n\n            \n                <p>I mean, I think they have gained great respect for ISIS and the leaders of ISIS and you see it all the time. And they are becoming, they are being radicalized. And Bill, it's going to get worse with this administration certainly with the way it's gone and with Hillary Clinton. So I get a kick where Hillary Clinton says, I will this, and I will that. What's she been doing for the last 30 years? Remember when she voted for the war. What's she been doing for the last 30 years? Number one, she voted for the war. What she been doing for the last 30 years.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, I'd like to know too. I would like to know what her strategy or how it departs for President Obama. Now she said today because of your profiling comment. She said that you are a, quote, \"sergeant of recruitment\" for Muslim fanatics that once they hear you say, we are going to come get you and profile you and doing it. Then they want to sign up. How do you answer that?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> It's just words, Bill. You know, it's words given by Madison Avenue, advertising agency. She is spending hundreds of millions of dollars. I mean, tremendous vast amounts of money in advertising against me. They are using, they're talking about, my strongest thing is my temperament. And they talk about my temperament. They put things on the board. And then they say, let's go after temperament. It is my strongest thing according for the people that know me best. I won't even say it myself. I think maybe even if I was going to say, my temperament is the best, I don't have a win.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: But the fact is --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But I want a little more definition. When you say my strongest suit is my temperament, what does that mean to you?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, I know how to win. I know how to win. I have been winning. I do win. Even in sports. I win. And we don't win. Our country doesn't win. We don't win at trade. We don't win. We can't beat ISIS. Can you imagine General Douglas MacArthur or General Patton? Can imagine they are spinning in their grave right now when they see the way we fight. We announce that we are sending certain people over here at a certain time. Everything is political. It's very, very sad. Then we bomb the Syrian troops. You saw that over the weekend. We bombed, I guess we killed more than 80 troops. And now Russia is absolutely furious at us. But we bomb the wrong people. I mean, we are like the gang that couldn't shoot straight. Our country, with this leader, is the gang that couldn't shoot straight. That's what it is.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. That's an old Jimmy Breslin book. Final question in this segment and then I want to talk to you about the debates. When you say that you're going it profile certain Muslims, are you ever worried that the peaceful Muslims, and there are millions of American -- you know, we don't have a big problem here with Muslims like they do in Europe and France. We don't have that big problem where they are ghetto wise and they don't like their country and police can't go into the neighborhoods. You know the problem in Europe. We don't have that. Are you worried that sometimes when you say these things like peaceful Muslims will be the victim of backlash, the victim of people just lumping everybody into the terror jar?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, first of all, I never said that they were Muslims. You did. You told me Muslims. I didn't say that. I am saying, you go into profile, people that maybe look suspicious. I didn't say they were Muslims.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But how do they look suspicious? I mean, how?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I don't know. These are experts. That's what they do. They profile. You go to Israel and they should study it because Israel has done a phenomenal job about this. And they profile. And they are not happy about it but they do it. And people aren't complaining about it but we have to profile.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But it's almost 100 percent of the terrorism now is Muslim fanatics, almost 100 percent. You are not going to be profiling leather jackets who, you know, with blue eyes at this point.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Honestly whatever it is. But I'm not using the term Muslim, I am saying, you're going to have to profile.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> We will going to have to start profiling. And it's, you know, I don't know if it's that bad. But certainly it's not a wonderful thing. But, we have a country to keep safe. And we're not going to keep our country safe. You see this happening. And you know and I know it's going to get worse.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. We're going to hold Mr. Trump over against his will.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Unless I'm president.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: We'll going to hold him over against his will to talk about the debate. One week from tonight. Big night. Right back.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump reacts to terror attacks", "description": "GOP candidate lays out policy for protecting America on 'The O'Reilly Factor'", "date": "2016-09-20T12:09:20Z"}