{"vcmId": "3b41895a-7013-4f7c-917f-5ab265d36e51", "url": "http://www.foxnews.com/transcript/2015/07/01/is-america-racist-nation.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 30, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Factor Follow up Segment\" tonight, millions of folks watched the lively debate last week where Kirsten Powers, Monica Crowley and I discussed racism.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>POWERS: </b>This idea that there is something crazy about talking about the fact that slavery was part of this country's history. That there are people out there that believe this. That we believe this? This is what happened?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So what? I mean we have tried and tried and tried as a society to overcome that. And I acknowledge that it's still in play.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> We have a legacy from that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. But we are trying to overcome the legacy.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> With us now here in New York City Monica Crowley and from Washington Kirsten Powers, author of the big new book \"The Silencing: how the left is killing free speech\". So we're not killing it here, that's for sure. You know, in the break, Kirsten had a good line. Remember we were having trouble with her audio. Powers' audio is a little low. She says \"Don't worry about it, when you start yelling at me I will be able to hear you.\"</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Oh yes, that's how I talk. I talk like that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You sounded just like Lily Tomlin.</p>                \n                \r\n\n            \n                <p>All right. Now, you're going to start.</p>                \n                \r\n\n            \n                <p><b>MONICA CROWLEY, FOX NEWS ANALYST:</b> Ok.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So last week Miss Powers said quote, \"a lot\", unquote of Americans are racist. Do you believe that?</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> I disagree with that statement. Of course there are individual racists in the country. Sadly that's true. And sadly that will always be true. It's true in this country, it will be true because it's human nature.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, why don't you believe it? Why don't you believe a lot of Americans are racist?</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Because if you define racism as a measurable act of violence or discrimination -- those things have been outlawed for decades. This is the United States --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So it's just not a negative opinion.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Well -- wait a minute. Wait a minute. If you define racism as a measurable act of discrimination or violence. Those things have been outlined outlawed for decades. Ok, so you don't have racism caused anymore by government action, codified law or social acceptance.</p>                \n                \r\n\n            \n                <p>If however, you define racism as somebody's internal personal thoughts about race or feelings about a particular race, that is something you cannot control because, unless you are willing to go back to the Garden of Eden, pre-snake.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And you can't codify it unless you're --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> But this is the problem with the left and what we have been talking about here in the broadest context of this. The left has been trying to regulate that. You cannot fix it by legislation. The left, what they really want to do is use it as a weapon. Kirsten just wrote a whole book about this. Use it as a weapon to intimidate and silence people.</p>                \n                \r\n\n            \n                <p>And if you go down that road, bill, then you are in Orwellian territory of the thought police. And that's very dangerous.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And you say, Powers?</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Well, I would just distinguish since I just did write a whole book about people misusing certain labels for people, I think. For example, calling somebody racist for opposing Obamacare. I don't think that that's an accurate use of that word. But, I wouldn't use what we are talking about right here I wouldn't fit into the paradigm of my book. But, what I would say is that first of all, I would define racism as the second definition which is people having animus towards other races. And in that sense I think that does exist.</p>                \n                \r\n\n            \n                <p>But I also think institutional racism exist. I think that was a big disagreement that I have with both of you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Can you back that up -- institutional racism?</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>I don't know if I can back it up to the extent that the two of you will agree with it. I think if you look at the criminal justice system and you look at the types of sentencing that proportionately black people have gotten. If you look at the UCLA did a study on how black youths get longer punishments when they are thrown out of school -- there are things that happen that are sort of institutional legacies.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You know in that system a lot of it depends on how many times you are in court or you are in the principal's office. It isn't no tolerance first time you get whacked. It's time after time.</p>                \n                \r\n\n            \n                <p>All right. Let's advance --</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>No. That's not what happened.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>-- unless you can get hard data that says the American criminal justice system.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> There's hard data. I mean California passed a referendum last year basically trying to change the sentencing. And it's not just -- it can happen to you for very low level -- if you have a very low level offense and it gets characterized as a felony.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You think that the criminal justice system put that in place because they don't like black people. They want to get them off the streets? That's why you think they put them --</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>Well, I could never prove the motivation but I could prove the effect of it. And the effect of it is it disproportionately affects black families.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> When you ladies hear Louis Farrakhan say black people are devil -- white people are devils, white people are this and white people are that -- that's racism. Would you agree that's racism?</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Would you agree it's racism?</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. So Farrakhan draws thousands of people, almost 100 percent black to hear him speak -- thousands. Go. Would they all be racist, Kirsten? All the people that go to hear Farrakhan and applauding what --</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>I think anybody who would say things like, you know, white person is white people are the devil or whatever is racist.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How about people who go see him?</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>He is not -- no one is going to see him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Thousands though -- thousands.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> The point is we don't have a legacy of anti-white racism.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm just trying to get across --</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> But it doesn't matter.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It cuts both ways.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> No. White racism in this country and black racism actually are not equal. We don't have a legacy of black people oppressing white people in this country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I disagree, it's not a matter of oppression, it's a matter of mind set.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> It is a matter of oppression.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It's a matter of mind set to me because oppression as Miss Monica pointed out pretty much gone.</p>                \n                \r\n\n            \n                <p>I have got to go. It's just the way it.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Well, it makes a big difference that people have power to oppress people. It really does.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Ladies, thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Is America a racist nation?", "description": "Monica Crowley and Kirsten Powers on whether racism remains a serious issue in the US", "date": "2015-07-01T12:15:51Z"}