{"vcmId": "3bcde31c-838c-460d-9649-3a8f6f9f87a0", "url": "http://www.foxnews.com/transcript/2015/07/23/bill-oreilly-human-life-and-left-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Many of my ancestors were Democrats, coming here from Ireland with little education. They worked as laborers and eventually in public sector jobs. My paternal grandfather was a New York City police officer. My maternal grandfather a train conductor.</p>                \n                \r\n\n            \n                <p>So my people often voted for Democrats. In fact, in the election of 1960, my mother voted for Kennedy. My father voted for Nixon. Back then liberal Americans did not, did not reject traditional values, generally speaking. The liberal philosophy was an economic one, getting fair treatment for workers.</p>                \n                \r\n\n            \n                <p>Today, that has changed drastically. Here are two stark examples. The left embraces abortion and supports Planned Parenthood which actively promotes the destruction of unborn children until they are birthed. To me, that's an extreme position. Partial birth abortion.</p>                \n                \r\n\n            \n                <p>Enter the Center for Medical Progress, a pro-life group. It conducted a number of undercover stings designed to get Planned Parenthood executives talking about the selling of body parts taken from aborted fetuses, or babies, as your belief system dictates.</p>                \n                \r\n\n            \n                <p>Those under cover videos have badly damaged Planned Parenthood. On one tape senior director of medical services, Deborah Nucatola talks about selling body parts.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DR. DEBORAH NUCATOLA, PLANNED PARENTHOOD: </b>You know, I won't throw a number out. I would say it's probably anywhere from $30 to $100 per specimen depending on the facility and what is involved.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> $30 to $100 price range. That's per specimen that we're talking -- right.</p>                \n                \r\n\n            \n                <p><b>NUCATOLA: </b>Per specimen. Yes.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> How much a difference can that actually make if you know kind of what's expected or what we need versus --</p>                \n                \r\n\n            \n                <p><b>NUCATOLA:</b> It means a huge difference. I'd say a lot of other want liver. And for that reason, most providers will do this case under ultrasound guidance, so they'll know where they're putting their forceps.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, it's clear Dr. Nucatola is strategizing how to harvest body parts from a dead baby in the womb. Gruesome? You bet.</p>                \n                \r\n\n            \n                <p>Then there is a Planned Parenthood medical director, Dr. Mary Gatter. She is also on tape discussing the sale of organs.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>Gatter: </b>Write me a three to four paragraph proposal, which I will then take to Laurel and the organization to see if want to proceed with it. And then if we want to pursue this, mutually, I'll mention it to Ian and see how he feels about using a less crunchy technique to get more whole specimens.</p>                \n                \r\n\n            \n                <p>It's been years since I've talked about compensation. So let me just -- figure out what others are getting. If this is in the ballpark then it's fine. If it's still low then we can bump it up.</p>                \n                \r\n\n            \n                <p>I want a Lamborghini.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>Pardon.</p>                \n                \r\n\n            \n                <p><b>GATTER:</b> I said I want a Lamborghini.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Planned Parenthood says it is donating the organs of aborted babies to help medical research. But the cavalier attitude shown by the Planned Parenthood executives, doctors is appalling. Using the word \"crunchy\". Talking about acquiring a luxury car in a joking way? These unborn babies have human DNA and you are making jokes about their destruction -- off the chart.</p>                \n                \r\n\n            \n                <p>It is long past time for the left in America to admit the abortion business is grisly and immoral to many Americans, perhaps most. Planned Parenthood should be defunded, period. I don't want my tax dollars going to them.</p>                \n                \r\n\n            \n                <p>Now, let's examine another life/death situation. The murder of Kate Steinle allegedly by a criminal illegal alien who had been deported five times. We have proposed a law that would make it more difficult for alien felons to roam the streets of America. We've reported extensively on Kate's Law and it was introduced by the Senate Judiciary Committee yesterday.</p>                \n                \r\n\n            \n                <p>But believe me there will be liberal Democratic lawmakers and perhaps some Republicans who oppose mandatory prison sentences for aggravated illegal alien felons who are deported and come back. It's shocking. But people like Senator Dick Durbin are likely to oppose the law.</p>                \n                \r\n\n            \n                <p>Talking Points believes human life is no longer a priority for many on the left. They often live in a world of theory and avoid the key issues. The calculated harvesting of infant body parts is an atrocity. And so is allowing criminal alien felons to walk free in America.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Human life and the left in America", "description": "Bill O'Reilly's Talking Points 7/22", "date": "2015-07-23T12:14:22Z"}