{"vcmId": "3c18cbce-b198-4ec3-8fbf-07e9a145dcc2", "url": "http://www.foxnews.com/transcript/2015/09/15/bill-oreilly-why-americans-are-so-angry.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>In one of the strangest political ironies ever Bernie Sanders and Donald Trump are now dominating their respective parties even though they are both hammering the establishment.</p>                \n                \r\n\n            \n                <p>Trump could not careless about the Republican platform because he is a Trumpian, a man who has created his own political movement. Sanders, now polling better than Hillary Clinton in both Iowa and New Hampshire is an independent socialist, not even a member of the Democratic Party. Both men are surging because they have tapped into the anger of many voters who believe they are being abused by politicians.</p>                \n                \r\n\n            \n                <p>Let's take Trump first. Despite promising to bring the country together, Barack Obama has been one of the most divisive presidents in history. His signature achievement, Obamacare, passed without a single Republican vote. That's because it's an entitlement, free health insurance for the have-nots paid for by the haves while most working Americans will pay more for good healthcare.</p>                \n                \r\n\n            \n                <p>Likewise, the nuke deal with Iran -- no Republican votes. Does the President care? I don't believe so. Thus, conservative, traditional Americans realize Mr. Obama is not looking out for them. He is a far left leader who has never even tried to be inclusive.</p>                \n                \r\n\n            \n                <p>The anti-Obama folks strongly believe that illegal aliens get better government treatment than they do, that abortionists and anti-religious groups have more rights than they do. That American economic power is being eroded in order to create a massive welfare state. And finally that evil people overseas want to kill Americans are not being challenged effectively.</p>                \n                \r\n\n            \n                <p>Trump has tapped into all that angst with one simple word. He calls American leadership stupid.</p>                \n                \r\n\n            \n                <p>For Senator Sanders the word he uses is \"corrupt\". His crew is furious that Barack Obama has not fully embraced socialism. The Sanders surge is built around his belief that every American should receive free healthcare, free education through college, a guaranteed job and salary, subsidized housing and child care if you are poor, and guaranteed retirement income.</p>                \n                \r\n\n            \n                <p>Bernie's mantra is pretty much cradle to grave entitlements and don't worry if you don't want to work, Bernie will take care of you anyway. And those who are working will pay for it.</p>                \n                \r\n\n            \n                <p>It's interesting, for every nativist American who despises a diverse society, you have a socialist American who wants Bernie to take over the economy and dole out the cash. Both extremes are angry. And now they have been joined by millions of regular folks who recognize that the change President Obama has brought has weakened the nation but strengthened secular groups who are hell bent on destroying traditional American values, especially those in the Judeo-Christian tradition.</p>                \n                \r\n\n            \n                <p>Conventional candidates like Jeb Bush and Hillary Clinton have no answer to the citizen fury. No answer at all. Mrs. Clinton would continue the Obama vision. Governor Bush intellectualizes the anger rather than feeling it.</p>                \n                \r\n\n            \n                <p>So Trump and Sanders have the stage. And the curtain is not even close to coming down. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Why Americans are so angry", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 9/14", "date": "2015-09-15T12:18:55Z"}