{"vcmId": "3c838f0e-e004-4e0e-9c19-8aa2526cff75", "url": "http://www.foxnews.com/transcript/2015/02/10/bill-oreilly-is-president-obama-most-polarizing-chief-executive-in-american.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>According to a new survey by the Gallup organization, President Obama has seriously divided the country. 79 percent of Democrats approve of the job Barack Obama is doing, just 9 percent, 9 percent of Republicans approve.</p>                \n                \r\n\n            \n                <p>According to Gallup, Mr. Obama is on pace to be the most polarizing president in history, surpassing George W. Bush.</p>                \n                \r\n\n            \n                <p>There are two main reasons for that. First, the economy -- after six years, take home pay is down 4 percent on the President's watch. And secondly, the jihad -- a situation that is rapidly getting out of control.</p>                \n                \r\n\n            \n                <p>Over the weekend, Lieutenant General Michael Flynn who retired last year as the director of the Defense Intelligence Agency said this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>FLYNN:</b> The strategy that we have had is not -- it's not working. I mean it's clearly not working. Just look at the kinds of things that we are facing. I mean you know, in my world, what I have grown up to have to do is define the enemy that we are facing. And, like I have said; if you - - you can't defeat an enemy that you don't admit exists.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>General Flynn was a top advisor to President Obama and joins former secretaries of defense Panetta and Gates in lamenting America's poor strategy to counter Muslim extremism. With ISIS committing atrocities on a daily basis President Obama's lack of urgency stands out. General Flynn is not happy about it.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>FLYNN:</b> I think what the American public is looking for they are looking for moral and intellectual courage and clarity and not a sense of and I just say as passivity or confusion. I mean I think that there is confusion about what it is that we are facing. It's not just what has been defined as 40,000 fighters in the Islamic state in Iraq and Syria. It's also a large segment within this radical version of Islam that is actually threatening our way of life.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> To be fair, some Americans do not believe Gen. Flynn. They do not see a threat to our way of life from the jihadists. But most Americans do understand the threat according to all the polls. So Barack Obama who once promised to unite the country finds himself a divider. Not good for America.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Is President Obama the most polarizing chief executive in American history?", "description": "Talking Points 2/9", "date": "2015-02-10T13:14:24Z"}