{"vcmId": "3c88e9b5-9933-4d04-9c0a-38ba9d74ce59", "url": "http://www.foxnews.com/transcript/2015/01/15/bill-oreilly-real-reason-obama-administration-will-not-define-islamic-jihad.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>This is day four of the jihad controversy whereby the President and his acolytes will not say the world is threatened by, quote, \"Islamic terrorism\".</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOSH EARNEST, WHITE HOUSE PRESS SECRETARY: </b>These terrorists are individuals who would like to cloak themselves in the veil of a particular religion. But based on the fact that the religious leaders of that religion have roundly condemned their actions, those religious leaders have indicated that their actions are entirely inconsistent with Islam.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But what Mr. Earnest and his boss, the President, refused to acknowledge is that there are thousands of Muslim imams all over the world who do support the violent jihad and some of them are considered leaders in their communities.</p>                \n                \r\n\n            \n                <p>But let's get right down to it. Here's the real reason the he Obama administration avoids the Islamic jihad label.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DAVID IGNATIUS, \"WASHINGTON POST\": </b>I think the White House and Attorney General Holder are right to caution about that kind of rhetoric and the whole mind set that goes with it. You need to be smarter this time around and understand much of the work is not military. It's not even going to be done by governments. It's going to be done by people in these communities. And the question is how do you facilitate them without delegitimizing or stigmatizing them?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Wow. Mr. Ignatius is generally very sympathetic to President Obama and apparently believes that only the folks who believe in Allah can stop the jihad. The military can't do it. The government can't do it according to Mr. Ignatius. That point of view is naive and somewhat frightening.</p>                \n                \r\n\n            \n                <p>We are now in year 14 on the war on terror. And if the so-called Muslim street, the folks, were going to take action against the jihadists they would have done so a long time ago. What does take? The world saw 9/11, the beheadings of innocent people on the net and we have seen thousands of innocent Muslims murdered by jihadists. What else do you need to see?</p>                \n                \r\n\n            \n                <p>The truth is that while many Muslims don't like the jihad, there is not an organized effort to combat it in the Muslim world. Some nations like Egypt, Jordan and Morocco help the U.S.A and the West in fighting the jihad but they do so very quietly. They don't want to stir up the radical Muslim element in their countries.</p>                \n                \r\n\n            \n                <p>President Obama, David Ignatius, all the other people who think the jihad will be defeated from within are putting the rest of us in grave danger. The Muslim world is as frightened of the jihad as the Western world and they have fewer protections. If you are a poor Muslim sitting in Yemen and you say something against al Qaeda, you are a dead man or a woman.</p>                \n                \r\n\n            \n                <p>So let's stop the nonsense. Radical jihadists threaten the world, much like the Nazis did in the 1930s. Responsible nations, not individuals, must confront and destroy the jihadists in a methodical worldwide campaign. Do you get that Mr. Ignatius? More importantly, do you get that, President Obama?</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The real reason the Obama administration will not define the Islamic jihad", "description": "Talking Points 1/14", "date": "2015-01-15T13:07:37Z"}