{"vcmId": "3da97e31-52b7-4c3b-8967-ec3003109f51", "url": "http://www.foxnews.com/transcript/2016/10/09/bill-oreilly-happy-20th-birthday-fox-news.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><b>O'REILLY:</b> \"Personal Story\" segment tonight. Happy 20th birthday FOX News. And that is the subject of this evening's Talking Points Memo. Quick two decades that, I can tell you to quote one Donald Trump. From nothing, FOX News has risen to become a powerful force in America as well as a billion- dollar a year franchise on-air talent and smart management have driven the success. In prime time, Hannity and I have been here from the beginning. Steve Doocy a legacy guy in the morning. Jon Scott as you just heard in the afternoon.</p>                \n                \r\n\n            \n                <p>Without a doubt, FNC has made its mark with robust debate and the point of view that traditional conservative thought deserves a hearing alongside liberal thought. But this is no ideological monolith here as the presidential campaign proves. There is just as much anti-Trump sentiment in this building as pro-Trump sentiment. Sometimes even causing differences between anchors. Now, you will never see that in any other American TV news operation. All the others, pretty much despise Donald Trump across the board.</p>                \n                \r\n\n            \n                <p>So, that's what makes us more interesting to watch. We are not predictable. The Factor has been on top for 16 consecutive years. Johnny Carson knew how that felt. But few others will ever experience it. Three factor staff members have been with the network for 20 years with me. Amy Sonan, Rob Monaco and the indispensable Makeda Wubneh. The rest of my staff are the Navy SEALs of broadcast journalism, professionals who never waiver. So, happy birthday FNC. Party on. And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Happy 20th Birthday Fox News", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/7", "date": "2016-10-09T21:37:26Z"}