{"vcmId": "3e11f0db-f5ea-4c73-962b-f1885e04208f", "url": "http://www.foxnews.com/transcript/2017/01/17/evaluating-president-obama-syria-legacy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 16, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Impact Segment\" tonight, last night on \"60 Minutes,\" President Obama talks with Steve Kroft, as usual, Mr. Obama is very much in control, except when it came to Syria. You may remember that in 2012, about a year before the cruel tyrant Assad used poison gas on civilians, Mr. Obama threatened him.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>KROFT:</b> Redline.</p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>KROFT</b>: You have to say that.</p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>KROFT</b>: And there have been reports that it wasn't in your speech.</p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>No, it wasn't.</p>                \n                \r\n\n            \n                <p><b>KROFT</b>: That you just sort of ad-libbed it.</p>                \n                \r\n\n            \n                <p><b>OBAMA</b>: Yes. Look. If you are putting all the weight on that particular phrase, then, in terms of how it was interpreted in Washington, I think you make a legitimate point. I have got to tell you, though, I don't regret at all saying that if I saw Bashar al-Assad using chemical weapons on his people, that that would change my assessments in terms of what we were or were not willing to do in Syria.</p>                \n                \r\n\n            \n                <p><b>KROFT</b>: But you didn't say that.</p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> Well --</p>                \n                \r\n\n            \n                <p><b>KROFT:</b> You said, you drew the redline.</p>                \n                \r\n\n            \n                <p><b>OBAMA</b>: Look.</p>                \n                \r\n\n            \n                <p><b>KROFT</b>: I don't want to make too big a deal out of this.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Once again, Charles Krauthammer joins us from Washington. The President obviously had trouble with that question. But the most important part of all of this is what happened after Mr. Obama didn't do anything to Assad, correct?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>And it is not just what happened in Syria. Where the Russians came in and appeared to pull chestnuts out of a fire, did this phony deal, where supposedly chemical weapons were all evacuated, they weren't. Chemical weapons were used later in the war. Obama did nothing. It's not even just Syria. Now when Obama says it was missing, it was interpreted in Washington, no, it was interpreted in Beijing, in Moscow, in Tehran, by allies all over the world. When the United States president says the word \"redline,\" that has a meaning.</p>                \n                \r\n\n            \n                <p>Obama says it is a phrase, as if it was some kind of random phrase. It has a meaning and diplomacy. You cross, we act. They cross, he didn't act. And that as a result, you see all the aggressive actions around the world. People understood that this is fundamentally a week and feckless president who will not resist, hence, the South China Sea. Hence Ukraine. Hence Crimea. Hence the threats even today to Western Europe. And hence Iran's essentially taking over Syria and Lebanon, as well.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, that's the worst part for me. The worst part for me is, and I said this at the time, so this isn't Monday morning quarterback. As soon as Assad dropped that gas killing those babies and the children and all of that, the next day, the U.S. Air Force should have just bombed his Air Force to smithereens. And that is easy to do, as you know, they only have one big air base. We could have taken it out in an hour. Okay? And that was it. And then we don't need a ground troops, we don't need a big war occupation.</p>                \n                \r\n\n            \n                <p>Bang! You don't put another plane up there. But since the United States didn't do anything. Russia, as you rightly said, came in, and Iran came in, and the slaughter began. And what did the slaughter lead to? Millions of migrants leaving the area, flooding the zone in Europe. Terrorism on the march. ISIS rising in power because of the chaos. All of these things came from President Obama's failure to do anything. But I don't think the President would ever admit that.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>No, I don't think he has admitted that to himself at all. I mean, you look at the victory tour he has been at for the last, I don't know, two weeks or so, celebrating all of the great things his presidency has accomplished. His presidency is going to be remembered as a historical parenthesis. He is not willing to admit that, I kind of understand, he spent eight years of his life as president of the United States, you don't want to admit that your achievements are written on sand, but you look at ObamaCare, that is written on sand.</p>                \n                \r\n\n            \n                <p>He never got the buy-in from the opposition or from the country. He never got cap and trade. He had to go through executive orders. They are all going to be canceled, the majority of them are going to be canceled. He tried Iran through immigration reform, did not succeed. Try to do it by his pen. The executive order stop by the courts. This was a failed presidency. And I think the reason is the overreach. And he also sort of overestimated himself. His supreme self-confidence that you see even to this day and that \"60 Minutes\" interview the other night, is what I think was the downfall.</p>                \n                \r\n\n            \n                <p>He thought, I know more about this than anybody else, I am smarter, I understand the Middle East, and if I just say the words, \"redline\" and I go back on it, people are still going to respect me. And this belief he has and what he calls the international community, which is a fiction, international norms, a fiction, and he adhered to that. I mean, the model is, what is it, the moral arc of the universe as long but it tends towards justice. Something he got from Martin Luther King. The problem is that doesn't apply to the so-called community of nations.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, it absolutely doesn't apply. Now there is a lesson here for Donald Trump.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: There is no guarantee of justice at the other end.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: There is a lesson here for Donald Trump, and a big, big lesson. Because the President-elect has a tendency to speak off-the-cuff, as Obama did on the redline thing, and to say, whatever he wants to say on his mind. But if you say it as president, you better back it up, correct?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Well, that is where I think we are going into very, very stormy waters with Obama. With Donald Trump. Obama understood what he was doing. He meant what he said. And then, he backed off. With Trump, he said so many things, many of them outrageous, just look at the interview he did today with the German and the British newspaper, talking about NATO in offended ways, talking about the EU, talking about obsolescence. In every word he says has an impact. The problem is, he does so many of these things that are outrageous, never heard before, I think they cancel each other out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. So do I. But I am talking about big things. He is going to be tested and he is going to be tested quick, Donald Trump.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Well, let me give you, talking about a big thing --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Real quick.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Taiwan. You don't screw around with the Chinese in Taiwan.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. Loved China.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> They have said the Carrier, the Chinese are saying that the Carrier near into the Taiwan strait, if you are looking for one area where this could be his redline, and he may be challenged, you should start worrying about that now.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. The Chinese certainly are going to do that. Because the Chinese are worried economically. So, they are going to see how far they can push it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Evaluating President Obama's Syria legacy ", "description": "Charles Krauthammer joins 'The O'Reilly Factor' to discuss the 'red line' foreign policy", "date": "2017-01-17T13:12:31Z"}