{"vcmId": "3f26f134-499c-48af-8b90-3aa822bed23b", "url": "http://www.foxnews.com/transcript/2015/04/14/how-will-hillary-clinton-defend-her-record.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 13, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Back of the book segment tonight, as we told you in the talking points memo, Hillary Clinton has some problems she must deal with in her campaign for the presidency.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington Charles Krauthammer who follows these things very closely. Do you expect Mrs. Clinton to win?</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, SYNDICATED COLUMNIST:</b> I expect her to win the nomination hands down. It won't be a coronation, it will be a worship service at the democratic convention. But I don't expect her to win the general election.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Really?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> I think it's close. I would give her somewhere under a 50 percent chance. But I think if the republicans can put up a dynamic candidate, they can -- I think she is easily beaten.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. She is easily beaten, why? What is it about Hillary Clinton, known by every voter, doesn't have to establish herself as far as who she is, why do you feel that she will be defeated?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>That's a problem. Doesn't have to establish herself as to who she is. People know who she is. Bloomberg did a poll just a few days ago. Thirty nine percent of the electorate said they will definitely not vote for her about 17 percent say definitely yes. Eighteen percent say probably yes. So you do the math. Thirty nine, no, 35 yes. Probably. That means --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's a bit deceiving. Because the 39 percent that said they're not going to vote for him, they're not going to vote for everybody. So, you can't do math based upon somebody who is a phantom. But what is the -- in your mind, you have watched this woman as have I since she entered politics. What is her number one deficit? What is it about her that voters the 39 percent don't like?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> I think it's two things, actually. The first is the glaring authenticity. When people hear her speak, they go way back to the '90s. They hear all the parsing of words, they hear the whole Clinton litany. And they get instantly fatigued. That's for 39 percent. The other thing is she's old. I don't mean chronologically. I mean politically. She's been around longer than anybody in the field. And there's a sense that the country wants renewal. Particularly after eight years of one party in power. Historically, if you go back to Eisenhower, only once has a party held the White House for two terms, and then won it again in the third.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, that was Reagan and Bush the elder.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>That was a reward -- that was a reward for the most success presidency of the half century. I would not categorize the Obama presidency as the most successful.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No. But here's the most fascinating question. How does Hillary Clinton handle Barack Obama on the campaign trail? \"A\" she needs him, he has to get out there. But \"B\" she can't really run on his record particularly overseas. She can't run on it. So, she has got either repudiate his record, which will tee him offer and he'll stay home, or she's got to embrace his record which is chaotic overseas. So, what does she do?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> She will hug the middle.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Hug the middle?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>She will do neither. She will -- she's a very clever politician. She knows how to use words. She will say that we're in the right direction. Things -- some things have not gone well. They need to be improved upon. She started her campaign yesterday talking about helping ordinary Americans, middle class, the fall in medium wages. It's been catastrophic under Obama. She is going to do this head-on. It's not that if she's the first person to run on the coattails of a president who is not popular. Hubert Humphrey, 1968. Al Gore, 2000. It's very hard to do. The only one who's really successfully navigated that was George Bush, Sr. in 1988.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But it's going to be fascinating.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> It was a successful presidency.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't expect her to do much media. I don't. I don't expect her to put herself into the tough, you know, answer the question, madam. I expect her to run on she's a grandma, touchy feely, first woman in the White House, it's her legacy, come on, gals, let's get out there. For the old gender, give me a G, give me an E, give me an N, give me a D, give me an E, give me an R. I expect all of that. But when it comes down to brass tax, you know, policy, she can't answer the questions because it will run right up against as you rightfully point out the failed policies of Barack Obama. And you know, hugging the middle is not easy, Charles. You ever try to hug the middle? It's hard to get your arms around the middle particularly when the middle is expanding here so much. Because we have such chaos.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>I don't hug the middle because I don't like the middle. But I'm not running for the presidency after a president who hasn't been successful. Look, I think this election, the general is going to hinge far more on the conduct of the republican than on Hillary. Hillary is predictable. She will be applauding campaign. She will not make egregious errors. She'll make the occasional error. The press will cover for her as it does always.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>It will be a huge attack on republicans but it will depend not on her. She can't --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Not the republican that has got to take it to her. That's for sure. Charles Krauthammer, everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "How will Hillary Clinton defend her record?", "description": "Charles Krauthammer reacts to the former Secretary of State announcing her 2016 presidential bid", "date": "2015-04-14T12:28:57Z"}