{"vcmId": "3fabf80d-fdee-4d44-9451-bd2657040e54", "url": "http://www.foxnews.com/transcript/2015/06/10/did-red-cross-mismanage-millions-donated-dollars.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 9, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Unresolved Problem Segment\" tonight, keeping charities honest.</p>                \n                \r\n\n            \n                <p>A group called Pro-Publica which investigates things for National Public Radio among others has issued a scathing report criticizing the Red Cross. Pro-Publica alleges the charity raised a half billion dollars for Haitian relief and promised to build at least 700,000 homes for those affected by the 2010 earthquake in Haiti. The problem is only 6 homes were built. So where did the half billion go?</p>                \n                \r\n\n            \n                <p>Joining us now from Washington Suzy deFrancis, chief public affairs officer for the American Red Cross.</p>                \n                \r\n\n            \n                <p>So walk through this, ok? First of all, Pro-Publica, was that an honest report they did on you guys?</p>                \n                \r\n\n            \n                <p><b>SUZY DEFRANCIS, CHIEF PAO, AMERICAN RED CROSS:</b> Well, Bill, I think it was a terrible mischaracterization of all the work that the Red Cross has done in Haiti. We have been there five and a half years. We are still there and we certainly did more than build six homes.</p>                \n                \r\n\n            \n                <p>And I think it was a disservice to our staff and volunteers, 90 percent of whom are Haitian.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>DEFRANCIS: </b>And the problem with the report is --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>-- your documents though -- your documents because we had to back some of this up -- said in the initial fundraising that you were going to build at least 700 homes. This was in late 2011. Six homes is what you built, six out of 700. I mean can you explain that?</p>                \n                \r\n\n            \n                <p>Well, sure. I mean, we wanted to build brand new communities in Haiti. We had plans to do so. But those plans had to be cancelled when we found out that we could not get clear title to land. I mean that's been a problem from the get-go with Haiti.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So, let me stop you again. You wanted to build the 700 homes but you couldn't because the Haitian government wouldn't give you the title to the land. Do I have that correct?</p>                \n                \r\n\n            \n                <p><b>DEFRANCIS: </b>Well, what they did was they allowed us to come in and build temporary, temporary homes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But not permanent homes.</p>                \n                \r\n\n            \n                <p><b>DEFRANCIS:</b> Right -- which is what the Pro-Publica story focused on. But the temporary homes we built thousands of.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. Did Pro-Publica say that the Haitian government wouldn't give you the titles to build these permanent homes? Did they say that?</p>                \n                \r\n\n            \n                <p><b>DEFRANCIS:</b> No.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. All right. So that's one for you.</p>                \n                \r\n\n            \n                <p>Secondly, if you can't build the homes shouldn't you have immediately issued a press release saying we know we promised 700 homes, at least, we raised $500 million. We can't build the homes but here is what we are doing so that it would have been transparent. Why didn't do you that?</p>                \n                \r\n\n            \n                <p><b>DEFRANCIS: </b>Well, we have released numerous reports about our work on Haiti. I mean you can go to our Web site --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But you didn't do that specifically.</p>                \n                \r\n\n            \n                <p><b>DEFRANCIS:</b> -- and find all of them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You didn't do that specifically.</p>                \n                \r\n\n            \n                <p><b>DEFRANCIS: </b>We talked about the number of temporary homes we did build. And the other solutions that we found this land problem. I mean remember a lot of people in Haiti didn't have homes before the earthquake. They were renters. The rented their homes. So we paid their rent for a long period of time to get people out of the camps they were living in and into a place where they could have a roof over their head.</p>                \n                \r\n\n            \n                <p>We also taught them how to repair their homes which was important to them and that was kind of, you know, mocked in the story.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know the Red Cross partnered up with Habitat for Humanity which does that. Out of the 500 million, and here is the crux of this matter because Americans donated generously as we always do. Out of the $500 million you raised for Haiti, how much have you spent?</p>                \n                \r\n\n            \n                <p><b>DEFRANCIS: </b>Well, we had spent and committed all of it probably 80 percent of it is spent the rest is committed to projects that are still ongoing. We are still there. So, and all of the money that was donated, 91 cents of every dollar that was donated was put in a segregated account and used specifically for Haiti.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. If you go to Haiti, Miss DeFrancis -- have you been there lately.</p>                \n                \r\n\n            \n                <p><b>DEFRANIS:</b> Yes -- not lately but I have been there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. I donate to a fund called the Haitian Health Foundation. I can tell that you country is probably worse off now than it was before the earthquake of 2010. And $500 million should have been an improvement but it doesn't seem to improve over there. Just an observation.</p>                \n                \r\n\n            \n                <p><b>DEFRANCIS:</b> Well, Bill, I would say was about $13 billion poured into Haiti in money. Of the Red Cross' share, we were about 4 percent of that. We did not raise enough money to rebuild Haiti.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, I know you didn't.</p>                \n                \r\n\n            \n                <p><b>DEFRANCIS:</b> But we did do was make it a lot better than it been.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, Miss deFrancis. And we appreciate you stepping up and answering the questions tonight.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Did the Red Cross mismanage millions of donated dollars?", "description": "Charity scrutinized for spending a half billion dollars on six houses in Haiti following the 2010 earthquake", "date": "2015-06-10T12:24:46Z"}