{"vcmId": "3ffdf3b5-c20d-4348-af5b-9f14ea1b8d8f", "url": "http://www.foxnews.com/transcript/2016/06/13/bill-oreilly-terror-in-orlando-florida.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>For the next hour this special edition of The Factor will analyze the worst mass shooting in American history.</p>                \n                \r\n\n            \n                <p>We will keep the politics at a minimum. &#160;We will deal with the political on Monday&#8217;s Factor when Donald Trump will be here. &#160;We've also invited Hillary Clinton.</p>                \n                \r\n\n            \n                <p>Tonight we are going to tell you exactly what happened with a sharp perspective. &#160;Believe me, this hour will not waste your time.</p>                \n                \r\n\n            \n                <p>Let's begin with the killer.</p>                \n                \r\n\n            \n                <p>Twenty-nine-year-old Omar Mateen was shot dead by Orlando police officers after invading a nightclub shortly after 2:00 a.m. this morning.</p>                \n                \r\n\n            \n                <p>Mateen used an assault rifle and a pistol, and while he was gunning people down he called 911 to say he was committing mass murder in allegiance with ISIS.</p>                \n                \r\n\n            \n                <p>Police say that Mateen, a private security guard, held a number of people hostage and the entire incident lasted for about three hours before Mateen was killed.</p>                \n                \r\n\n            \n                <p>Over that period of time the casualty count was horrific, fifty people dead, fifty-three people wounded.</p>                \n                \r\n\n            \n                <p>Again, this is the worst mass shooting in American history.</p>                \n                \r\n\n            \n                <p><b>MAN</b>: &#8220;Oh my God! People are getting shot dude! Oh my God!&#8221;</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>ORLANDO MAYOR BUDDY DYER: </b>&#8220;It is with great sadness that I share - we have not 20 but 50 casualties in addition to the shooter. There are another 53 that are hospitalized.&#8221;</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>DOCTOR</b>: &#8220;All over the vast majority of the gunshot wounds were to the chest, the abdomen, and the extremities.&#8221;</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>WITNESS:</b> &#8220;This guy was pacing back and forth looking for a family member. He had a bullet sticking out and the bullet, I kid you not, was this big (measures 4 inches with his fingers) - half in his leg and half sticking out.&#8221;</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>BARTENDER WITNESS:</b> &#8220;After the second shot there was a pause and then it just started shooting, shooting, shooting, shooting. That's when we knew something was wrong. &#160;Everyone just dropped to the ground.&#8221;</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>WOMAN</b>: &#8220;My son.&#8221;</p>                \n                \r\n\n            \n                <p><b>REPORTER</b>: &#8220;Do you know if he's ok?&#8221;</p>                \n                \r\n\n            \n                <p><b>WOMAN</b>: &#8220;No.&#8221;</p>                \n                \r\n\n            \n                <p><b>REPORTER</b>: &#8220;He was shot?&#8221;</p>                \n                \r\n\n            \n                <p><b>WOMAN</b>: &#8220;We don't know. &#160;He was in the women's bathroom with the hostage.&#8221;</p>                \n                \r\n\n            \n                <p><b>REPORTER</b>: &#8220;How did you find out?&#8221;</p>                \n                \r\n\n            \n                <p><b>WOMAN: </b>&#8220;He was texting me and calling me.&#8221;</p>                \n                \r\n\n            \n                <p><b>REPORTER</b>: &#8220;What did he tell you exactly?&#8221;</p>                \n                \r\n\n            \n                <p><b>WOMAN:</b> &#8220;That the shooter has them in the women's bathroom hostage and he's going to die.&#8221;</p>                \n                \r\n\n            \n                <p>We do not know what happened to that woman's son, as authorities have not yet released all the information about all the victims.</p>                \n                \r\n\n            \n                <p>We do know more about the killer. &#160;He was an American citizen whose parents emigrated here from Afghanistan.</p>                \n                \r\n\n            \n                <p>He was married with a three-year-old son.</p>                \n                \r\n\n            \n                <p>His father told reporters he did not like gay people, and that might be why he targeted a nightclub that caters to homosexuals.</p>                \n                \r\n\n            \n                <p>But if Mateen did identify with ISIS, he's homophobic by association as every single jihadist on the planet hates gays.</p>                \n                \r\n\n            \n                <p>At the White House President Obama said this:</p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>&#8220;The FBI is appropriately investigating this as an act of terrorism. &#160;And I&#8217;ve directed that we must spare no effort to determine, what, if any, inspiration or association this killer may have had with terrorist groups. &#160;((EDIT)) Today marks the most deadly shooting in American history. &#160;The shooter was apparently armed with a handgun and a powerful assault rifle. &#160;This massacre is therefore a further reminder about how easy it is for someone to get their hands on a weapons that lets them shoot people in a school, or in a house of worship, or in a movie theater, or in a nightclub. &#160;And we have to decide if that&#8217;s the kind of country we want to be. &#160;And to actively do nothing is a decision as well.&#8221;</p>                \n                \r\n\n            \n                <p>Once again Mr. Obama putting the emphasis on guns rather than Islamic terrorism. &#160;I will analyze that situation tomorrow in Talking Points.</p>                \n                \r\n\n            \n                <p>For tonight, let's stay on point and analyze the terror act without pointing fingers at third parties.</p>                \n                \r\n\n            \n                <p>In the shootout inside the club, one Orlando police officer was shot in the head but his Kevlar helmet saved his life.</p>                \n                \r\n\n            \n                <p>No other police officers were injured.</p>                \n                \r\n\n            \n                <p>The FBI is investigating the case and apparently the bureau had Mateen in its file, as he was known to be sympathetic to jihadists overseas.</p>                \n                \r\n\n            \n                <p>Again, he was a security worker who held a legal firearms license in Florida since at least 2011.</p>                \n                \r\n\n            \n                <p>The ATF is saying tonight Mateen bought the weapons legally. &#160;No license is needed in order to own an assault rifle, an issue that will be closely examined after the terror attack.</p>                \n                \r\n\n            \n                <p>On balance this seems to be more about international terrorism than a gun-control situation. &#160;However, all aspects of the case should be investigated aggressively.</p>                \n                \r\n\n            \n                <p>Talking Points is fed up with the Islamic jihad. &#160;The world should have confronted it a long time ago and this containment garbage is getting people killed, as we have mentioned before.</p>                \n                \r\n\n            \n                <p>You don't contain evil; you destroy it or it will destroy you.</p>                \n                \r\n\n            \n                <p>There is no question all Americans are at risk because Islamic terrorists want to kill us just because we are Americans.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Terror in Orlando, Florida", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 6/12", "date": "2016-06-13T12:12:05Z"}