{"vcmId": "40da5a00-26a1-4c27-bd66-e4a204538512", "url": "http://www.foxnews.com/transcript/2015/01/22/national-debate-over-american-sniper.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 21, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Factor Follow up Segment\". There's a national debate over the movie \"American Sniper\". Some on the left like Michael Moore and actor Seth Rogen have trashed the movie leading to none other than Whoopi Goldberg defending it.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>So, you didn't like the movie? That's ok. We stood behind you, Seth, when you did your movie. And we said you had the right to make the movie you wanted to make.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Give them the same respect. Right?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Because we stood behind them. Give them the same respect. And Michael Moore, you know better.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And yet, you had Rosy going, yes, yes, yes. I thought I was hallucinating.</p>                \n                \r\n\n            \n                <p>With us now: Ian Tuttle who works for the \"National Review\" a conservative magazine founded by William Buckley. You've been tracking the \"American Sniper\" attacks. I was surprised by Miss Goldberg. Were you surprised by this sticking up there?</p>                \n                \r\n\n            \n                <p><b>IAN TUTTLE, \"NATIONAL REVIEW\":</b> I was surprised but -- and it's good that she's defending --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Artistic freedom.</p>                \n                \r\n\n            \n                <p><b>TUTTLE: </b>Creative license -- exactly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right, right.</p>                \n                \r\n\n            \n                <p><b>TUTTLE:</b> We can get behind that especially given what's just happened in Paris. But she misses the point a little bit which is that most of the criticism that's been leveled against the movie \"American Sniper\" is aimed at its subject, the real life Chris Kyle.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Chris Kyle.</p>                \n                \r\n\n            \n                <p><b>TUTTLE:</b> Exactly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And that's because in the book and on this program Kyle was unrepentant in killing the terrorists. And people have to understand that he wasn't shooting Iraqi civilians. And it was quite clear in the movie that he wasn't. He was shooting al Qaeda terrorists -- all right? And I would have shot them, too because his job was to protect the soldiers and marines who are on the missions and he was up and when he saw, he shot.</p>                \n                \r\n\n            \n                <p>Who's the worst offender in this? Who's the worst attacker?</p>                \n                \r\n\n            \n                <p><b>TUTTLE:</b> It's fierce competition but there's some writers at Salon, writers at the Guardian but I would have to say it's probably Max Blumenthal formerly of the \"Daily Beast\" now of the left wing blog Alternet and he took to Twitter right around Christmas to say that Chris Kyle was an occupier who mowed down faceless Iraqis. He was the best recruiter for ISIS. And in which I think was the worst he compared Chris Kyle to Lee Boyd Malvo one of the Beltway snipers that that terrorized D.C. in --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. But this is just a far left kook, this guy. I mean just the resume. So you're not surprised that he says this. He believes that America went into Iraq to kill Iraqis. And, you know, that's how he sees the world.</p>                \n                \r\n\n            \n                <p>Now, Michael Moore -- I believe that he has ruined his career by his far left musings to be kind. And this is just another one of them. Do you believe that?</p>                \n                \r\n\n            \n                <p><b>TUTTLE: </b>We can only hope. What I think -- what I think is important about Moore and Blumenthal and a number of others, though, is that they're indicative of viewpoints that is -- seems to be gaining traction on the left.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Do you think so?</p>                \n                \r\n\n            \n                <p><b>TUTTLE: </b>I do. I do think so.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Because this movie is huge and overwhelming the people who see it really like it.</p>                \n                \r\n\n            \n                <p><b>TUTTLE:</b> Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And they admire Chris Kyle and they admire what he did over there so I'm not so sure it's growing. I think it is loud. I think the mainstream media, the national media sympathizes with it so you hear about it.</p>                \n                \r\n\n            \n                <p>Do you know anything about this Seth Rogen guy? Do you know him?</p>                \n                \r\n\n            \n                <p><b>TUTTLE:</b> Not much. I've seen him in a couple of movies.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Because I was surprised. Again, this is a young guy. He's got some talent. I ran into him once at an event. He seemed to be fine. But to stake that kind of turf and now he's backtracking and says he really didn't mean it. I would like him to come on this program and explain that because if he doesn't I think he's damaged his career immensely.</p>                \n                \r\n\n            \n                <p>And that goes against what you were saying. I think if you stake these positions out that a guy like Chris Kyle was a murderer, a killer -- that you really hurt your own career. Last word.</p>                \n                \r\n\n            \n                <p><b>TUTTLE:</b> That might be true but the fact is that what you see, one of the reasons that Chris Kyle has garnered so much animus is because there remains a derangement when it comes to Iraq and the Bush years against which Chris Kyle stood when he was apologetic about facing true evil in Iraq. He complicated the narrative for people who wanted to believe the Iraqis --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's right. And Eastwood used the word \"evil\" applied to the al Qaeda twice. And I know what you're saying is correct. That just drives them crazy. They don't see the Islamic jihad as necessarily evil and, of course, sane people do.</p>                \n                \r\n\n            \n                <p>Mr. Tuttle, thanks for coming in. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "National debate over 'American Sniper'", "description": "Ian Tuttle on some in the media attacking the new film about America’s deadliest sniper", "date": "2015-01-22T13:23:07Z"}