{"vcmId": "435dcf9e-2a4e-47c3-8d1a-715e5b4745be", "url": "http://www.foxnews.com/transcript/2016/02/25/deportation-debate-on-campaign-trail.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 24, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Impact\" segment tonight. Both Donald Trump and now Ted Cruz have told us here on The Factor they believe as president if they were elected, they would be able to round up and deport most of the estimated 12 million illegal aliens currently living in the U.S.A. Not border people. Not people coming across the border. You can send them right back. The question, does the constitution allow a roundup like that?</p>                \n                \r\n\n            \n                <p>Joining us now from Berkeley, California, John Yoo who teaches at the University of California Law School. And here in New York City, Stephen Yale-Loehr, professor of Immigration Law Practice at Cornell. So, both Cruz and Trump on record saying, they believe they can round up illegal aliens who have residence, all right? Can they?</p>                \n                \r\n\n            \n                <p><b>STEPHEN YALE-LOEHR, IMMIGRATION PROFESSOR, CORNELL LAW SCHOOL</b>: They can. As long as they comply with the constitution. The due process clause of the constitution says that you cannot deprive someone of their life, liberty, or property interests without due process of law. And that says that applies to all persons in the United States. Not just U.S. citizens.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So what would happen then if President Trump tells his ICE officials to go and seek out and go in to people's homes, take them out, and put them into custody?</p>                \n                \r\n\n            \n                <p><b>YALE-LOEHR</b>: They can take them into custody. But they can't deport them on the very next day without any kind of hearing before an immigration judge. Procedural due process requires at least three fundamental things. Some kind of hearing before a neutral judge, and an opportunity of notice. So, you can gather evidence as to why you should stay in the United States. For example, about one percent of people who are in deportation proceedings are actually U.S. citizens. Other people like refugees have a constitutional and an international right to certain protections. So we have to sort of figure out for each individual --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So there would have to be hearings and I would assume bail. Then if they were taken into custody, they would have to be given bail, a chance to get out.</p>                \n                \r\n\n            \n                <p><b>YALE-LOEHR: </b>Actually not because this is a civil proceedings, so it's not a criminal proceeding. They don't have to be -- they could be detained while they are waiting.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, you could put them in the Krome Detention Center down in Miami where you could detain them.</p>                \n                \r\n\n            \n                <p><b>YALE-LOEHR</b>: You could detain them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Do you see it that way, Professor Yoo?</p>                \n                \r\n\n            \n                <p><b>JOHN YOO, PROFESSOR, UC BERKELEY LAW: </b>Yes, I agree. I think the constitutional text says that the due process clause applies to all persons in our territory not just citizens. And the Supreme Court has said several times that in order to deport someone, an illegal alien has a right to prove it's not him, that he doesn't qualify. For example, you were asking Mr. Trump a few days ago what if Bill O'Malley had been detained but he is really an American citizen and it's a mistake. Due process clause requires there be a chance that he explained that he has innocent and that the government has made an error. And so, I don't see how Trump and Cruz would be able to just unilaterally grab people and kick them out of the country without going through the courts.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So, you are both saying though that as president, all right? Trump and or Cruz -- Trump or Cruz could order ICE, all right? That's the agency that would be involved, to hunt down people that aren't in this country legally. Once they find them, they could knock on their door. They can say you have to come with us. You can take them to a detention center where they would sit until the judge could hear their case. And if they were in the country illegally, then they could deport them. Is that true?</p>                \n                \r\n\n            \n                <p><b>YOO: </b>Yes. That's the way the system works right now. I mean, we don't have, you know, Jack booted thugs running around the country breaking into people's doors.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK. But still we have fairly frightening scenario for people who are established and have children that they get a knock on the door and then they would be taken to a detention center. So, while they can't kick them out, they can certainly take them out of their day-to-day lives, right?</p>                \n                \r\n\n            \n                <p><b>YALE-LOEHR</b>: And they do that right now. I mean, it happens every day. Now, Trump or Cruz may do it in a larger way than under the current administration.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>YALE-LOEHR: </b>Currently ICE does go door to door and knocks on their doors, hauls people in to detention because they think that they are deportable because they entered illegally.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But is that a concerted effort now on the part of thousands of ICE agents doing that or is that a targeted thing for criminals and people who are disruptive?</p>                \n                \r\n\n            \n                <p><b>YALE-LOEHR</b>: It's targeted thing because the administration doesn't have the resources. No administration has the resources to do it for 12 or 11 million undocumented --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What is that mean though? Are there not enough judges? Would the detention centers -- they have to build new ones?</p>                \n                \r\n\n            \n                <p><b>YALE-LOEHR: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> There would be a backlog in cases for years and all of that?</p>                \n                \r\n\n            \n                <p><b>YALE-LOEHR: </b>Yes. Right now we have about 225 immigration judges. It current takes over 500 days for someone who is detain to get before an immigration judge --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now?</p>                \n                \r\n\n            \n                <p><b>YALE-LOEHR: </b>-- Because they are already so backlogged.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK. So, a year-and-a-half?</p>                \n                \r\n\n            \n                <p><b>YALE-LOEHR</b>: A year and a half. So, if we went to this mass detention and round up of, you know, illegal aliens, the backlogs would be even greater. So, we would have to have a lot more immigration judges, we have a lot more ICE agents to find these people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK. But, you know, some Americans say look, if that's what it takes, that's what it takes. But I believe Professor Yoo that the courts would get involved then. That there would be all kinds of lawsuits to block this on whatever actions. And those would have to be heard probably going up to the Supreme Court, right?</p>                \n                \r\n\n            \n                <p><b>YOO:</b> Sure, the Supreme Court has already decided several previous efforts to increase or ratchet up detention and deportation. I don't think it's a good answer because I think on the one hand, you know, I make it clear, this book that's just out, \"Liberty's Nemesis\" that President Obama has underreporting and refusing to use the full resources of his department to enforce deportation. But it's not answer on the other hand to say we are going to kick everybody out and we're going to send people into everybody's homes. Either way you will get Supreme Court cases and Supreme Court challenges on both sides at both extremes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But what do you say to the American people who say, you know what? These people shouldn't be here. They broke the law, and now they are being rewarded. They are taking jobs away from us and we don't like it. How do you answer that?</p>                \n                \r\n\n            \n                <p><b>YOO:</b> Well, I think the President, Cruz, Trump, Clinton, Sanders, they have to use the full resources that Congress provides too, to, you know, try to get the most dangerous ones out first, criminals. People who have been here who might be violent. There is a whole bunch of characteristics set out by statute. And then if the American people want more people deported then their representatives in Congress have to provide more money and more agents to ISIS. You said, they are the only agency that can do it --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>YOO: </b>And they are busting at the scenes as it is with all the people they have. Although, I think President Obama was deporting about 425,000 a year. And it's now down to like 280. So, you could bring it back up to 400 -- some thousand a year. But that's not close to 12 million people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It would take forever. All right. Gentlemen, thanks very much. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The deportation debate on the campaign trail", "description": "Are Donald Trump and Ted Cruz's strategies constitutional? 'The O'Reilly Factor' investigates", "date": "2016-02-25T19:54:31Z"}