{"vcmId": "4365b598-cee2-4a52-858a-82073807f0d7", "url": "http://www.foxnews.com/transcript/2015/01/21/bill-oreilly-fighting-terrorism-is-now-top-priority.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As you may know, we believe the Obama administration does not have an overall strategy to defeat the jihad. And things are getting worse overseas. In addition to the Paris massacre reports are ISIS executed 13 young boys, shot them to death for watching a soccer game last week. That took place in Mosul, Iraq which used to be controlled by Americans.</p>                \n                \r\n\n            \n                <p>Also ISIS apparently threw two men suspected of homosexuality off a building, killing them. In addition, ISIS is threatening two Japanese hostages with death. And the hits just keep on coming.</p>                \n                \r\n\n            \n                <p>There's no question that jihadists continue to wreak havoc all over the world. And there's no coordinated strategy to stop them. In fact, President Obama will not use the words \"Islamic terrorism\".</p>                \n                \r\n\n            \n                <p>Enter Kareem Abdul Jabbar who does not want his religion, Islam, linked with terrorism. He believes the jihadists have perverted Islam, thus, religion should not enter into the equation. The basketball legend is not alone. That's the opinion of many on the left including President Obama.</p>                \n                \r\n\n            \n                <p>Here is what I said about Mr. Abdul Jabbar last week.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He wants Americans to understand that Islam is not the problem. Vicious individuals who have perverted the religion are the problem. I believe that is what President Obama believes as well.</p>                \n                \r\n\n            \n                <p>But that theory has some major problems. First of all, Muslim theocracies like Iran and Saudi Arabia routinely commit atrocities in the name of Islam. The Iranian mullahs and the house of Saud are doing awful things and using the name of Allah to justify them.</p>                \n                \r\n\n            \n                <p>Just this week a blogger who criticized Islam in a small way was given 50 lashes by the Saudi government. So the problems in the Muslim world are not just caused by individuals. They run much deeper than that.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Talking Points\" believes there is a fundamental misreading of Islam throughout the world. Some Americans think all Muslims support violence because the Koran justifies it. That's false. Most Muslims are not violent people. But, at the same time, there is a strain of Islam that is destructive to the world and it's not just a few terrorists -- it's millions of Muslims who follow the teachings of extremist clerics, including the mullahs who rule Iran.</p>                \n                \r\n\n            \n                <p>Watch what happened after the satirical French newspaper \"Charlie Hebdo\" ran another cover featuring Mohammed, this time lamenting the massacre.</p>                \n                \r\n\n            \n                <p><b>(PROTESTS AGAINST \"CHARLIE HEBDO\")</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>At least 10 people were killed, 45 churches torched in Niger alone. So again, irrational violence is plaguing the entire Islamic community. But no matter how much evidence you present the liberal media here in the U.S.A. and good people like Kareem Abdul Jabbar will not accept the premise.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>KAREEM ABDUL-JABBAR, FORMER NBA PLAYER:</b> I can't be responsible for someone who I don't control. And that, to me, is the issue. I teach my children and I try to practice peace and co-existence and that is my duty as a Muslim. Now, I can't go and make other people behave rationally. That's up to them.</p>                \n                \r\n\n            \n                <p>It's up to law enforcement to deal with people who resort to criminal acts just to make a point.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Mr. Abdul Jabbar's appearance on CNN was very interesting. We had invited him on The Factor. He declined choosing to go to a soft venue. The CNN anchor did not challenge him and after a promotion saying she would ask him about me she did not do so. That was probably wise.</p>                \n                \r\n\n            \n                <p>The only reason I am even mentioning Kareem Abdul Jabbar is that he has the courage to stand up for his religion and state his case. But I believe is he desperately wrong and I am trying to convert him into seeing the danger that's apparent because Muslim nations will not confront the jihad.</p>                \n                \r\n\n            \n                <p>Simply if every good Muslim united against the bad Muslims, the problem would be solved. But that's not happening. So it is left to nonbelievers to confront and defeat the jihad.</p>                \n                \r\n\n            \n                <p>The leader of the effort should be President Obama because thousands of Americans have been killed by the jihadists. But the President is not leading. He is tentative in the face of Islamic atrocities, does not even want to define them clearly.</p>                \n                \r\n\n            \n                <p>The American people know. This and now 76 percent of them rate terrorism as the number one problem facing America according to Pew. So it will be interesting to see if Barack Obama even mentions the jihad in his address tonight. I don't think he is going to because he rarely uses the word \"jihad\".</p>                \n                \r\n\n            \n                <p>\"Talking Points\" doesn't expect clarity or new solutions to this extremely vexing problem. This has been a 14-year horror odyssey. We've spent trillions and lost thousands of military people, and still the terrorists reign. Jihad remains a terrible problem.</p>                \n                \r\n\n            \n                <p>It's apparent that if the Muslim world does not confront the savagery it will continue. There are simply too many jihadists for the U.S.A. to kill them all. And they are receiving aid -- the terrorists. Sanctuary and encouragement in places like Iran, Pakistan, Saudi Arabia, Libya, and Somalia -- just to maim a few countries.</p>                \n                \r\n\n            \n                <p>The truth is President Obama is looking away from the issue. But even President Bush who sought to confront it could not defeat it. The next President of the United States, whoever he or she is, will really inherit a problem of monumental proportions.</p>                \n                \r\n\n            \n                <p>It is about Islam because that's where the solution lies.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Fighting terrorism is now top priority", "description": "Talking Points 1/20", "date": "2015-01-21T13:26:59Z"}