{"vcmId": "43afa366-5706-426a-8003-70510244915d", "url": "http://www.foxnews.com/transcript/2016/01/11/can-ben-carson-make-comeback.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 8, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story Segment\" tonight, Dr. Ben Carson. Last fall he was competing well in the Republican presidential sweepstakes, but lately his poll numbers have fallen. The question tonight is can the doctor turn it around.</p>                \n                \r\n\n            \n                <p>He joins us from Charlotte, North Carolina. First of all, let's walk right through this. What do you think set you back in the court of public opinion?</p>                \n                \r\n\n            \n                <p><b>DR. BEN CARSON (R), PRESIDENTIAL CANDIDATE</b>: Well, I think there have been a lot of things. You know -- my integrity, my truthfulness -- all these things were attacked. And of course when all of those things were found to be true that I had said, nobody came back and said, oh, we found this and we found that.</p>                \n                \r\n\n            \n                <p>That coupled with the terror attacks and that very false narrative that someone who's nice and soft-spoken can't be the commander in chief, doesn't know anything about foreign policy.</p>                \n                \r\n\n            \n                <p>I have been challenging that. I've been out talking. I've been explaining to people the depth of knowledge that I have with foreign policy. And also, you know, we needed a shakeup in our campaign -- things were not getting done, things that are important. And when you're doing a campaign, you have to be proactive and you have to be energetic.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok. I think it was more the foreign policy than the spurious attacks -- spurious -- attacks on you because fair-minded people know you're a good guy. But I think the foreign policy after Paris was a big issue. And people are looking for an avenger, certainly an avenger to go take care of these ISIS thugs and, you know, other people who would hurt Americans.</p>                \n                \r\n\n            \n                <p>You don't come across as an avenger. You're too cerebral. You're too intellectual for that, where some of your competition -- Trump, Christie in particular -- do come across as avengers.</p>                \n                \r\n\n            \n                <p><b>CARSON: </b>Without comparing myself to anyone, I will tell you that Abraham Lincoln was pretty cerebral.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes, he was.</p>                \n                \r\n\n            \n                <p><b>CARSON:</b> Calm and nobody really thought that, you know, he was sort of a firebrand --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But they didn't have cable TV back then.</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: -- and yet look what he did.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Really, I mean our early politicians -- you bring up a fascinating point -- their personalities if people knew a lot of them never would have been elected. But they didn't know.</p>                \n                \r\n\n            \n                <p><b>CARSON:</b> That's for sure true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And now they do know everything you guys do is in a, you know, everybody sees it. So going forward --</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: But let me just -- can I just say --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Sure. Absolutely. Go ahead.</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: I think when people actually have an opportunity to challenge me and listen to what I have to say in terms of foreign policy and in terms of proposals for taking care of our people they will see that this is not superficial. This is not a 60-second sound bite you can use in the debate.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p>Latest polling in New Hampshire not great for you; Iowa, I'm not sure -- it looks like Cruz is going to take that. Anything can happen. Do you have a strategy for the long run? Like someone Marco Rubio is a long run strategy, Jeb Bush is one, or are you dependent on the early votes?</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Well, I am going to be very interested in what happens in the first four states. You know, I'm out there. You know, I've been out in Iowa for the last couple of days. Every single crowd was standing room only. Or we had to do a double duty because there's so many people waiting out in the rain.</p>                \n                \r\n\n            \n                <p>You know, there is a dynamic that is changing. And my challenge at this point is to make sure I get in front of as many people as possible so that they can actually see who I am and hear what my solutions are because there is nothing in this country that cannot be solved with common sense if we get politics and ego out of the way.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. Big debate next week on the Fox Business Network. Again, you know, because you are a calm man and cerebral, you're up against some flame throwers on the stage. Are you going to step it up and say a little bit more than you've said previously? And with a little more emotion?</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Yes. Well, you know, I'm much more energized right now because my whole campaign is much more energized. I have, you know, the right kind of support and backing right now. I think you're going to see a very energized person. You will not have a problem with that at all.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. I never had a problem with you anyway. But we are living in a time when, you know, you got a Donald Trump, you got a Chris Christie, you've got some of the other candidates that know they have to get attention. It's all about getting attention at the debate with so many people on the stage, Doctor, you know that. I'm just wondering whether you have a strategy.</p>                \n                \r\n\n            \n                <p>Are you going to bring on something to throw at them? You know, is there anything you can do?</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Let me tell you what my strategy is. My strategy is Thomas Jefferson. Thomas Jefferson said that we would reach this stage in our country where people, you know, were not paying attention, were not vigilant. The government would sort of take over, start to dominate. But that before we turn into something else, the people would actually recognize what was going on. They would stop being manipulated. They would stand up and they would do the right thing. I believe that is in the process of happening right now.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>CARSON: </b>I think right now what a lot of people are looking at the shiny object in the room and saying, oh, ga-ga, but I think when push comes to shove they're going to actually start thinking very seriously about the future for their children and grandchildren.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Doc, always a pleasure to have you on. Thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Can Ben Carson make a comeback?", "description": "GOP candidate joins 'The O'Reilly Factor' to discuss slipping poll numbers", "date": "2016-01-11T13:20:11Z"}