{"vcmId": "43e42d5c-70e3-4a24-8176-975dfa7a19da", "url": "http://www.foxnews.com/transcript/2014/12/05/bill-oreilly-what-eric-garner-case-says-about-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>First of all, we received some letters criticizing me, Charles Krauthammer, and other Fox News analysts for saying the grand jury's decision not to indict a New York City police officer in the death of Eric Garner may have been faulty. That's our position. Writing from Naples, Florida Larry Ayers says, quote, \"Regardless of the grand jury's verdict if Michael Brown and Eric Garner had not resisted and allowed themselves to be arrested they would both be alive today. Simple as that.\"</p>                \n                \r\n\n            \n                <p>But, of course it is not as simple as that. Yes, both deceased men should have cooperated with the police officers who confronted them. But as we all know people do stupid things. In the Ferguson case Mr. Brown did engage in violence so I have no trouble, no trouble with the grand jury's decision not to indict Darren Wilson, the police officer.</p>                \n                \r\n\n            \n                <p>But in the New York City case Mr. Garner clearly a low level offender was not a threat. American police are held to a very high standard because they have power. They have guns. They must control inflammatory situations not make them worse.</p>                \n                \r\n\n            \n                <p>As we proved on Monday, generally speaking, American police do a great job across the board. The charlatans who say police are targeting young black men are completely shut down by the statistics which we have posted on billoreilly.com. But in the Garner case excessive force may have been used.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> This had no connection with what happened in Ferguson. From looking at the video, the grand jury's decision here is totally incomprehensible. It looks as if at least they might have indicted him on something like involuntary manslaughter at the very least.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I will say that upon seeing the video that you just saw and hearing Mr. Gardner say he could not breathe, I was extremely troubled. I would have loosened my grip. I desperately wish the officer would have done that.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JUDGE ANDREW NAPOLITANO, FOX NEWS JUDICIAL ANALYST: </b>This ought to have been an indictment and it ought to have been an indictment for some form of manslaughter. It's not first degree murder. It's not second degree murder. But it's certainly reckless manslaughter.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Unlike Judge Napolitano, I'm unwilling to say that Officer Daniel Pantaleo committed reckless manslaughter. What I will say is there was a police overreaction to Mr. Garner. And that should have been adjudicated in a court of law.</p>                \n                \r\n\n            \n                <p>Now, on to the bigger picture, last night here in New York City, the NYPD did an amazing job of controlling protesters who wanted to disrupt the annual Christmas tree lighting ceremony in Rockefeller Center. The protesters were chanting \"no justice, no tree\". The New York police stopped the chaos, conducted themselves in a restrained and ultra professional manner, protecting property and the public.</p>                \n                \r\n\n            \n                <p>Missouri Governor Jay Nixon who totally botched the Ferguson situation should take notice. And so should Mayor de Blasio who continues to denigrate his own cops.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DE BLASIO:</b> If you talk about the last decade or so in the city, was race a factor and a problem in the relationship between police and community? Obviously it was.</p>                \n                \r\n\n            \n                <p>The relationship between police and community has to change. People need to know that black lives and brown lives matter as much as white lives.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What an amazing insult to the NYPD. Now, I can tell you with certainty that many police officers here in the city despise Mayor de Blasio. They believe he's intimidated by the likes of Al Sharpton and does not support them. So now we have a situation where the nation's largest city has a mayor who has lost the support of his 35,000-member police force. That's a recipe for disaster.</p>                \n                \r\n\n            \n                <p>So let's sum up. Many analysts here at Fox News believe the Staten Island grand jury made a mistake in the Eric Garner death. The mayor of New York City is putting all residents in jeopardy by alienating his own police department for political reasons. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: What the Eric Garner case says about America", "description": "Talking Points 12/4", "date": "2014-12-05T13:20:00Z"}