{"vcmId": "46f115c2-9eea-4bae-9e42-0b2dd3675420", "url": "http://www.foxnews.com/transcript/2015/12/01/climate-change-chaos-in-paris.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 30, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>And in the \"Impact Segment\" tonight, more than 150 world leaders meeting in Paris to discuss climate change. Greeting them, hundreds of anarchists who -- you know, pretty much all these international events to cause trouble. So far French police have arrested about 100 of them. So what is behind these violent demonstrations?</p>                \n                \r\n\n            \n                <p>Also, President Obama using the climate change conference to address terrorism.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES</b>: We salute the people of Paris for insisting this crucial conference go on. An act of defiance that proves nothing will deter us from building the future we want for our children. What greater rejection of those who would tear down our world than marshalling our best efforts to save it.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I'm not sure I understand that line of thinking. But joining us from Washington is a man who does -- Charles Krauthammer. So, before we get to that I know you want to comment on the debate I just had with Dr. Goolsbee about Planned Parenthood -- go.</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, SYNDICATED COLUMNIST:</b> Because this incident reminds me of the instant reaction after the Tucson shooter, remember the one that went to a shopping center, shot terribly wounded the congresswoman, killed a nine-year-old girl and within hours the explanation was that this Jared Loughner had been influenced and driven to kill by the, quote, \"climate of violence\" that had been aroused by none other than Sarah Palin. And people then cited her Web site where she talked about the targeting of certain Democratic districts for winning them over to the GOP and saying that that kind of language and image had influenced him.</p>                \n                \r\n\n            \n                <p>Of course, it was obvious from the first hour the guy was a paranoid schizophrenic. Anybody could see it. You talk to any of the witnesses who had known him in the past were afraid of him. The guy had this notion that the government was using grammar to control his mind. He had nothing at all -- he had internal world that had nothing to do with the external world. And, yet the \"New York Times\" had a front page analysis piece talking exactly about that within hours.</p>                \n                \r\n\n            \n                <p>So, I think we have got to be very careful. It's not as clear that this guy who did the shooting in the clinic in Colorado was a paranoid schizophrenic but there is a lot of evidence that he was a guy who was delusional and in many ways paranoid.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's the reportage.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> So before we blame anybody, learn about the mental history of this guy. I'm quite sure we will find that there was very little connection between the debate about Planned Parenthood and this guy's deranged shooting.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok, now, President Obama, you heard the sound bite. He seems to think that confronting global warming, climate change, is an anti- terror strategy.</p>                \n                \r\n\n            \n                <p>I've heard him say that, you know, around the edges before. Do you understand that?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> In fact, he said, Friday in his press conference, the President Hollande of France that it would send a powerful rebuke to terrorism if they had this conference.</p>                \n                \r\n\n            \n                <p>The idea that the terrorists struck Paris in order to prevent or have anything to do with climate change is really so out there that you have got to ask yourself what planet is the President living on? I think this is his way of fending off the fact or trying to distract attention from the fact that the Paris attack and all the other attacks, world terrorism going on for the last several months are a demonstration of the abject failure of his war on terror policy. Of course, he doesn't even believe it's a war on terror. He abolished the very term.</p>                \n                \r\n\n            \n                <p>And this is a way to distract. I mean --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. But he has always been heavily invested in climate change -- always. This is an issue that's I believe more important to him than defeating ISIS. It's more important than keeping Ukraine out of the soviet -- of the Russian orbit. I mean, I want a clean planet, I'm sure you do, too. But he is almost obsessed with this issue and I want to know why.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Well, here -- once again you're asking --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> A psychiatrist.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Yes. All right. So since I played it in the previous little segment, I guess I'm required to play it here.</p>                \n                \r\n\n            \n                <p>All right. I will give you one hypothesis which is the best I can do. He sees himself grandiosely, as he always has, as a kind of visionary. A man who sees so much further ahead than the ordinary plebeians who inhabit the United States. That he is now looking generations ahead. He is saving the planet. He knows that there is no honor to profits in their own time. But he will be honored for having seen so far.</p>                \n                \r\n\n            \n                <p>So whereas you and I and the little people with the blinkered vision are concerned about real problems -- terrorism, the threat of nuclear, the Russians on the march, the collapse of world order, particularly in the Middle with the retreat -- we're concerned with all this he can see so much farther.</p>                \n                \r\n\n            \n                <p>These problems in his view will work themselves out the way they always. Yes, there'll be casualties, a few hundred dead here, a few hundred dead there, but he is saving us from our own instincts and our own ignorance. That's what he sees. And that's why he has been absolutely committed to this idea for so many years.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, I see it a little bit differently and I see it as a professorial move. This is a theoretical situation where he doesn't have to take any action. All he has to do is talk and then, you know, impose some restrictions on coal or whatever he sees it to be.</p>                \n                \r\n\n            \n                <p>Whereas the other problems like ISIS and Putin, that takes a lot of risk and he is risk adverse. This guy is risk adverse. That's what I think it is.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Climate change chaos in Paris", "description": "Charles Krauthammer analyzes President Obama's comments on climate change and terror on 'The O'Reilly Factor'", "date": "2015-12-01T13:35:01Z"}