{"vcmId": "471a3781-d9d2-4651-8476-2a2928ee4828", "url": "http://www.foxnews.com/transcript/2015/07/22/bill-oreilly-anarchy-and-immigration-law.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>At least 110 American cities and counties are currently refusing to obey the federal government when it comes to enforcing immigration law -- 110. That, of course, leads to chaos and chaos leads to violence.</p>                \n                \r\n\n            \n                <p>This month, 32-year-old Kate Steinle murdered in San Francisco by a criminal alien who had been deported five times. As you may know, we have called for new legislation called Kate's Law which would mandate any convicted aggravated felon who comes back to the U.S.A. after being deported, would receive at least five years in a federal penitentiary -- no wiggle room.</p>                \n                \r\n\n            \n                <p>Today on Capitol Hill, the Senate Judiciary Committee held hearings on criminal alien violence.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>WILKERSON: </b>My son's name was Joshua Wilkerson. On November 16th, 2010 he was beaten, strangled, tortured until he died. He was tied up, thrown in a field and set on fire. His killer, Camilo Morales was brought here illegally by his illegal parents when he was 10 years old -- he fits the dream kid description.</p>                \n                \r\n\n            \n                <p><b>STEINLE:</b> Unfortunately due to disjointed laws and basic incompetence on many levels, the U.S. has suffered a self-inflicted wound in the murder of our daughter by the hand of a person that should have never been on the streets of this country.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And that is the heart of this matter: harshly punishing illegal alien felons who return here after being deported. Who could oppose that? Well, maybe Dick Durbin, senator from Illinois.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. DICK DURBIN (D), ILLINOIS:</b> So, the suggestion that we make a mandatory minimum five-year sentence for people who have been deported and come back across the border with, let's say, with no other criminal -- no criminal history and no other history from the government's point of view, that seems to me to be an invitation for a lot of prosecutions.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Simply disgraceful/ Durbin knows Kate's Law calls for the incarceration of felons, not chambermaids. He knows that. But attempts to distort Kate's Law by misdefining it.</p>                \n                \r\n\n            \n                <p>Why? Because Durbin and others like him do not care if convicted felons violate our immigration laws and kill people. That man does not care.</p>                \n                \r\n\n            \n                <p>But there was some outrage in the senate hearing today.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. TED CRUZ (R-TX), PRESIDENTIAL CANDIDATE: </b>There is a reason the American people are upset. If President Obama had the courage of his convictions, he would come and look in the eyes of these men and women who have lost their sons, their daughters, their mothers, their sisters, their brothers -- and the administration would stop releasing murderers and rapists.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now there comes a time when the American people must demand Congress and the President do the right thing. Kate's Law is the right thing.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Anarchy and immigration law", "description": "Bill O'Reilly's Talking Points 7/21", "date": "2015-07-22T12:12:07Z"}