{"vcmId": "47abf851-b306-46c9-b93c-a69c6886da97", "url": "http://www.foxnews.com/transcript/2017/02/13/trump-administration-battle-over-national-security.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 10, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>ERIC BOLLING, FOX GUEST ANCHOR</b>: Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching us tonight. Let's get straight to our top story. The Trump administration's battle over national security. During news conference with Japan's prime minister today, President Trump reacted to the ninth circuit's ruling against his temporary travel ban and its potential impact on America's security. Listen.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP, PRESIDENT OF THE UNITED STATES OF AMERICA</b>: We are going to keep our country safe. We'll be doing something very rapidly, having to do with additional security for our country. You'll be seeing that sometime next week.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Joining us now with reaction from the White House, Kellyanne Conway, a senior advisor to President Trump. So, Kellyanne, what's this all about? I think the president called them new steps and we will be seeing them very rapidly.</p>                \n                \r\n\n            \n                <p><b>KELLYANNE CONWAY, COUNSELOR TO PRESIDENT TRUMP</b>: Well, we have many different options in moving forward as you know, Eric, yesterday's decision did not affect the merits at all. We're very confident, fully confident that we will prevail on the merits.</p>                \n                \r\n\n            \n                <p>There is nothing that the Ninth Circuit did yesterday that calls into question the president's ability under the statute and under his Constitutional authority to keep the homeland safe, which is precisely his point.</p>                \n                \r\n\n            \n                <p>So there are a number of different steps. We can obviously go back to the district court. Some people said they can get all the way to the Supreme Court. He certainly always has the opportunity to put out new executive orders, but the president will make that decision in due course.</p>                \n                \r\n\n            \n                <p>I just want to make clear that the branches are equal under our Constitution. And in this case the court seemed to suspect plant the president's judgment about national security with its own and that's not an appropriate use of its power.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: You know, one of the other options available to the president is to continue the travel ban. He will could literally instruct his TSA, the border security to say, hey, we're going to continue the travel ban. Let the Supreme Court tell us not to do that.</p>                \n                \r\n\n            \n                <p><b>CONWAY</b>: Well, and what the president said today in that really remarkable joint press conference with Prime Minister Abe, they had a terrific day together here at the White House, meeting privately first, having lunch thereafter and then having that joint press conference for all to witness.</p>                \n                \r\n\n            \n                <p>What he said there is that extreme vetting was his idea, that Candidate Trump came off with that idea when he was running based on the information that he had received, based on the agencies that tend to these matters.</p>                \n                \r\n\n            \n                <p>And since then as president, as commander-in-chief, he, of course, receives his daily presidential briefing. He has access to information that you and I don't.</p>                \n                \r\n\n            \n                <p>And he is that much more convinced that in the interest of keeping this nation safe, that he will take the steps necessary and we know constitutionally and statutorily he is within his rights to do that.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Does the administration think the courts are playing politics?</p>                \n                \r\n\n            \n                <p><b>CONWAY: </b>Well, more broadly speaking, we believe that judges should not play politics at all and we respect the fact that the three branches are separate and independent and also equal. One is not supreme over the other.</p>                \n                \r\n\n            \n                <p>If there are politics in any particular judicial decision, then the president and his spokespeople have a right to call that out. What really concerns us here is that a fare reading of the statute and the Constitution, none of which were affected at all by a very narrowly prescribed TRO ruling.</p>                \n                \r\n\n            \n                <p>The president is well within his authority and I would add he has a duty and responsibility to do this and also, Eric, it's something that he put front and center in his campaign.</p>                \n                \r\n\n            \n                <p>Donald Trump beat a former secretary of state, a former United States senator who was United States senator in New York on 9/11, who at a former first lady, he beat that individual based on his much more clear and robust and tough position on these matters.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: I don't want to cut you off but you mentioned 9/11. Is there any initiative? Are we going to look forward to maybe the next couple days, next couple of weeks on some sort of Gitmo strategy going forward?</p>                \n                \r\n\n            \n                <p><b>CONWAY</b>: Well, the president has said he will address any number of the issues that he talked about during the campaign. But remember, first and foremost, this man that I work with every day, he is focused on the nation's security and, you know, in that regard, he has stated in the past his position on Guantanamo Bay.</p>                \n                \r\n\n            \n                <p>He has stated his position on terrorism. He has stated his position on ISIS. They are not to be contained or, you know, ignored. They are to be eradicated off the face of the earth.</p>                \n                \r\n\n            \n                <p>Even in his joint press conference and his meetings today with Prime Minister Abe, of course, they are talking about how their relationship, the Japan-U.S. relationship is one of the corner stones of freedom and prosperity and democracy. But it also goes to national security interests, security interests internationally.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Let's talk about this also today it's been resonating \"The Washington Post,\" Kellyanne, as you know claims that Secretary Flynn had talked to the Russian people about sanctions prior to Donald Trump being sworn in as the next president, 45th president of the United States which would violate some laws, some rules. Governor Mike Pence responded this way.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MIKE PENCE, VICE PRESIDENT OF THE UNITED STATES:</b> I talked to General Flynn about that conversation. They did not discuss anything having to do with the United States' decision to expel diplomats or impose censure against Russia.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> We're at a standstill here. Flynn says he doesn't recall making those comments with the Russians regarding sanctions. \"The Washington Post\" claims they have nine sources. Your thoughts? Where is the administration on that?</p>                \n                \r\n\n            \n                <p><b>CONWAY: </b>My thought is it's not for me to comment any further on that at this time, Eric. I will repeat that Vice President Pence's office or his spokesman has said that the vice president in that TV interview was basing his comments on a conversation that he had with General Flynn. All of that is out in the public domain. So I will just repeat that and leave that there.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Do you think \"The Washington Post\" got it wrong?</p>                \n                \r\n\n            \n                <p><b>CONWAY:</b> I think that these are very highly sensitive matters and I would prefer not to comment any further.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>OK. One the other topics bubbling up all week as you know the offhand comment, the remark you made about Ivanka Trump's clothing line. You said you would support it. It created quite a stir. Can we take a little to a little sound from Jason Chaffetz's town hall? Take a listen.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>We sent a very candid, very direct letter to the White House and the Office of Government Ethics. They need to investigate it what Kellyanne Conway was wrong. It should never happen again.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: All right, Kellyanne, tell me the president, I think he gave you some words of support?</p>                \n                \r\n\n            \n                <p><b>CONWAY</b>: He did, indeed. That part I will reveal. He said he backs me 100 percent and that he knows that -- and that we will leave it at that in other words, as I said before, I'm very blessed to work for a man who has been pro-woman his entire career.</p>                \n                \r\n\n            \n                <p>He has hired and promoted women in the Trump Corporation, the Trump campaign, the Trump cabinet, the Trump west wing. It's just natural for him to do that. I appreciate the fact that he understands I meant no malice and that he backs me 100 percent.</p>                \n                \r\n\n            \n                <p>He understands the fire that we all take here as well. I just hope sometime soon, Eric, that the president, forget me, the president of the United States who was elected will get the credit he deserves for in just first short three weeks, boosting wages, helping to create jobs, protect jobs, keep them here.</p>                \n                \r\n\n            \n                <p>Taking meaningful steps towards tax reform, we are going to have tax relief and tax reform in this country that we have never seen before. Blow the wheels off the 1986 repeal and replace Obamacare.</p>                \n                \r\n\n            \n                <p>He is doing amazing things for this country. I don't want to be a distraction. I just want him to get the credit. I'm very happy he supports me.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Do you think Jason Chaffetz is going a little too far with this? Is this water under the bridge already?</p>                \n                \r\n\n            \n                <p><b>CONWAY:</b> I'm not going to comment on Congressman Chairman Chaffetz' particular comment about me. I just know it was a really rough town hall because I watched did on TV. I know it's a district that he won with 75 percent of the vote, but there seemed to be a lot of folks there trying to make their point on opposition party certainly.</p>                \n                \r\n\n            \n                <p>The Democrats, I think the political left more generally is very animated and hysterical these days. Look what they have done to our Supreme Court and cabinet nominees over seven now.</p>                \n                \r\n\n            \n                <p>What were all those sleepless nights for obstructing and trying to embarrass and humiliate and we have Betsy DeVos and Tom Price and Jeff Sessions and the rest of them in our cabinet now and will continue to.</p>                \n                \r\n\n            \n                <p>I think all of our nominees will be confirmed. This president has put together the most conservative and qualified, brilliant cabinet in modern memory and he deserves to have them all confirmed. We need secretaries of commerce and treasury.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> All right.</p>                \n                \r\n\n            \n                <p><b>CONWAY:</b> And agriculture.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Kellyanne, I appreciate your time. We're up against a break. Thank you very much.</p>                \n                \r\n\n            \n                <p><b>CONWAY:</b> Thank you, Eric.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The Trump administration's battle over national security", "description": "Kellyanne Conway joins 'The O'Reilly Factor' to discuss the ruling on the travel ban and its potential impact on security", "date": "2017-02-13T13:02:53Z"}