{"vcmId": "4832ad7d-d3c0-4005-9647-678acec3213f", "url": "http://www.foxnews.com/transcript/2015/08/04/first-republican-presidential-debate.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 3, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight, the Republican presidential debate this coming Thursday right here on Fox News. There are three new polls out today, all of them showing Donald Trump surging. Jeb Bush, Scott Walker are competitive; the other candidates well behind. Rejoining us now with an assessment -- Charles Krauthammer.</p>                \n                \r\n\n            \n                <p>Let's tidy up the first segment -- do you want to say anything before we get to the Republicans.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>Yes, I think there is an honest division of opinion the country between people who believe as you do that life and personhood begins at conception and others who believe it is a gradual process. And one of the arguments is if life or personhood begins -- I believe that life, of course does, that's not an issue but personhood, all the attributes and protections. If it does, why is it that we don't have a funeral at a miscarriage?</p>                \n                \r\n\n            \n                <p>There are legitimate arguments that the very early embryo is not enjoy the kind of protections that a nine month old fetus and certainly a child does. You are working with a small clump of cells and deciding whether you should divide stem cells?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I'm erring on the side of caution -- ok. I'm erring on the side of potential human beings. It's a major deal to destroy it and should be taken seriously and the state has an obligation to make sure when people do that they know what they are doing. That's all.</p>                \n                \r\n\n            \n                <p>I have got to get to Republicans. All right. Now, it looks like the only battle is between Perry and Christie to see who gets in and it looks like Christie is going to get in with the latest polling here because Perry is at 1 percent in the Fox News poll. But it's the Trump show. It's the Trump show. It's his to win or lose. He comes in with a huge momentum behind him. How do you think that's going to play out?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Well, I would think from his point of view, when you have the kind of lead he does, and the others have no particular incentive to attack you because it might hurt the two of you and leave the rest of the field unmolested, you have got a pretty good shot at just playing statesman or being quiet.</p>                \n                \r\n\n            \n                <p>And I don't see Trump coming in, throwing around insults. But what I do see is maybe one of the candidates on the lower rung who has got a lot less to lose and more to gain might take a shot at Trump. And then knowing -- I mean --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That would be Rand Paul.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>It could be. It could be.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No that's who --</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>-- it would have been Rick Perry but probably is he not going to be there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Perry might not but Rand Paul, I think if you are going -- if this were a betting thing in Vegas you would say I'm going to put chips on Paul and he is going to go in there right after Trump.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> What will happen is Trump will probably react. However much he may have told himself I will take it easy, that's --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He hasn't told himself that.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> I know.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Don't you understand? He relishes this. He believes he is on a populist bent that he has been designed to do this. He relishes the confrontation. He will lose interest if he isn't involved with that.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Well, he knows that he is playing so far the game he has played is a winning hand.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Every time he gets attacked, it only strengthens him. Therefore, I think he has shown there is no doubt that the month he has been in the race has shown that he is going to be a durable candidate. All those who thought as I did in the beginning that this would come and go, but I mean I do think at some point it will probably be later in the year. He's going to come up with a winnowed field, up against a winnowed field where you have one or two very serious candidates who have specific --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The whole dynamic is going to be -- buy you know what I call this it's the \"Jane, you ignorant slut\" syndrome. He is going to do it. That's why he is going to get huge ratings. And he knows that's why the people are coming in to see it.</p>                \n                \r\n\n            \n                <p>Last word.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> It's more like network. I'm mad as hell and I'm not going to take it anymore.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And it's working because millions of Americans are mad as hell as well. And believe me there is good reason to be mad as hell in this society.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> There is no question about it. And the way he has survived you would have to say he is Teflon Don up to now.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Charles Krauthammer -- everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The first Republican presidential debate", "description": "Charles Krauthammer weighs in on the candidates and the latest polls", "date": "2015-08-04T12:57:26Z"}