{"vcmId": "48ca2386-aa88-462d-9192-e23149d9a9e4", "url": "http://www.foxnews.com/transcript/2014/12/12/bill-oreilly-achieving-american-dream.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>When I was a kid growing up in modest circumstances, my parents told me that I could succeed in life. They didn't say much more than that, only that I could be successful. From my vantage point the American dream meant that I would have a happy life and contribute to society but each one of us has our own definition of the dream.</p>                \n                \r\n\n            \n                <p>A recent \"New York Times\" poll asked do you think it is still possible to start out poor in this country, work hard and become rich. 64 percent of Americans say it is possible; 33 percent say it is not; 3 percent don't know.</p>                \n                \r\n\n            \n                <p>Second question: do you think the economic system in the U.S.A. is basically fair? 52 percent say it is; but 45 percent say it's unfair; 4 percent don't know. For this poll, money was a basic theme and for this memo we will stay on that subject.</p>                \n                \r\n\n            \n                <p>As someone who started out with little. I was flat broke when I began my first broadcast job in Scranton, Pennsylvania. I know you can become wealthy in America with no assets to begin. So the 33 percent who say it's not possible are wrong. You are looking at the proof. But there are things that you have to do to succeed economically.</p>                \n                \r\n\n            \n                <p>Number one, must get educated unless your athletic and music skills are so enormous you can make a living that way.</p>                \n                \r\n\n            \n                <p>Number two, you must be willing to work hard and conform to levels of performance. That means you have to learn how to speak properly. You have to learn how to groom yourself. You can't have a face covered with tattoos unless you punch like Mike Tyson.</p>                \n                \r\n\n            \n                <p>Basically succeeding economically is being about smart, working hard and presenting yourself in a way that leads to making money. That's it.</p>                \n                \r\n\n            \n                <p>Now, some Americans do work very hard. They are smart and they don't succeed economically. That's why life is not fair. You never know how it's going to shake down. But, remember, the poll question was is it possible to start out poor and become wealthy?</p>                \n                \r\n\n            \n                <p>Now, here are some the things that you absolutely cannot do. First, if you feel America is a rotten, awful country, you will not succeed. And that's what's being peddled by the far left.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>What's the next institution that you think needs to be isolated and then challenged?</p>                \n                \r\n\n            \n                <p><b>ROSA CLEMENTE, ACTIVIST:</b> The economy, capitalism -- I think that's the institution that all over this country, right, it is really what is the oppressive force. And the police are actually, in my opinion and I think we have a lot of theory that proves this, are that fourth that are keeping us as particularly working class people from achieving this idea of, you know, economic justice.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Miss Clemente will never succeed in America because her concept of economic justice is basically communism. And we're not going to convert to that. You want communism, Miss Clemente, Fidel and Raul Castro are just 90 miles from Florida.</p>                \n                \r\n\n            \n                <p>Two, you cannot walk around with a sense of entitlement -- that people owe you things. In our system nobody owes you anything.</p>                \n                \r\n\n            \n                <p>Three, if you do want to succeed, really want to succeed, you can't portray yourself as a victim of white privilege of slavery or any other historical injustice. May be wrong, but the free marketplace doesn't want to hear it.</p>                \n                \r\n\n            \n                <p>Finally, if you behave badly, if you are disrespectful, if you act foolishly on a consistent basis, if you refuse to develop your God-given talent, if you have three children by the time you are 20, if you abuse drugs and alcohol and do other self-destructive things you will never succeed.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" laments that our leaders will not tell you the things I'm saying right now. Our political parties do not level with the folks. Instead both Democrats and Republicans pander to them.</p>                \n                \r\n\n            \n                <p>Capitalism is tough -- very competitive but the American dream is still achievable and I know what I'm talking about.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Achieving the American Dream", "description": "Talking Points 12/11", "date": "2014-12-12T13:56:21Z"}