{"vcmId": "49f581a4-8aad-4aea-8058-23e75ce723d6", "url": "http://www.foxnews.com/transcript/2016/05/05/bill-oreilly-why-trump-won.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>In the beginning, there were 17 contenders for the GOP nomination. Now, Donald Trump has emerged victorious. It's a given that all the Republican candidates oppose the progressive policies of President Obama. But what separated Donald Trump from the pack was his disdain for the Republican establishment, a contempt that reflected the feelings of many GOP voters. One issue crystallizes that loathing. The murder of Kate Steinle in San Francisco by an illegal alien felon who was allowed to kill her. I addressed this on the Colbert program Monday night.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Thirty two-year-old Kate Steinle. Do you know this story?</p>                \n                \r\n\n            \n                <p><b>STEPHEN COLBERT, HOST:</b> I do know this story. This is very sad, tragic story.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> In San Francisco.</p>                \n                \r\n\n            \n                <p><b>COLBERT</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Out in judo square with her father, walking and she is killed and shot in the back of the head and she is dead. Who killed her? An illegal alien, aggravated felon with six felony convictions in the United States who had been deported five times and who came back six times. All right? The girl is dead. So, I say we need Kate's law, which means that if an aggravated felon defies deportation, that person gets mandatory five years first offense, 10 second offense just for being in the country. You pick him up, he goes to federal's prison. Kate's law, simple, right? Can't get it passed. Why? Because the Republican leadership wouldn't get behind it. Now Harry Reid.</p>                \n                \r\n\n            \n                <p><b>COLBERT</b>: Why not? Because -- I'll tell you. A very successfully on anti- illegal immigrant platform.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. But it's all b.s. and the folks know it.</p>                \n                \r\n\n            \n                <p><b>COLBERT</b>: Trump is b.s.?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The anti-illegal alien stuff is b.s. because you shouldn't be anti-illegal aliens, that doesn't solve any problems.</p>                \n                \r\n\n            \n                <p><b>COLBERT</b>: You should be anti-criminal.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. Exactly. So --</p>                \n                \r\n\n            \n                <p><b>COLBERT:</b> You and I are agreeing all over the place.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No we are not.</p>                \n                \r\n\n            \n                <p><b>COLBERT:</b> All over the place.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You are actually listening and that's a good thing. So Harry Reid, the Senator, the Democratic senator kills this in the Senate. But Mitch McConnell, the Republican leader does nothing. And then in the House they do nothing. Why? Because they wanted to attach it to a sanctuary city bill that they knew President Obama would veto. So everybody knows.</p>                \n                \r\n\n            \n                <p><b>COLBERT: </b>Why would they do that?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's right. Why would they do that? All right? And I'm pounding the table. But it as a standalone.</p>                \n                \r\n\n            \n                <p><b>COLBERT:</b> Right. Brand new table.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Because President Obama would sign Kate's law, I believe. He wouldn't veto it but you can't attach it to 15 other things.</p>                \n                \r\n\n            \n                <p><b>COLBERT</b>: Okay. But --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Just listen to me for a minute.</p>                \n                \r\n\n            \n                <p><b>COLBERT</b>: Oh, boy.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>I have been very good.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know, you are absorbing.</p>                \n                \r\n\n            \n                <p><b>COLBERT</b>: I have been doing well.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You are learning. Now you have to live it.</p>                \n                \r\n\n            \n                <p><b>COLBERT</b>: I have to live it. I have to live this.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You have to learn and live.</p>                \n                \r\n\n            \n                <p><b>COLBERT:</b> Oh!</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. So the Republicans see this. They see their own party not doing the right thing. They expect Harry Reid to do it. He is corrupt. But they don't expect their leadership to not do anything. That's why they are furious.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Again, Donald Trump tapped into that fury being felt by millions of Republican voters. The other candidates could not match his ferocity. That's why Trump won. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Why Trump won", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 5/4", "date": "2016-05-05T12:20:37Z"}