{"vcmId": "4a2f72c7-91e5-4136-abcf-4e491d3a1de7", "url": "http://www.foxnews.com/transcript/2015/01/30/bill-oreilly-americans-not-happy-with-president-obama-take-on-terrorism.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Another rather painful exposition at the White House yesterday -- reporters asking spokesman Eric Schultz about negotiating with terrorists.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> The Taliban is still conducting terrorist attacks. you can't really say that, I mean, the war has ended as far as they are concerned.</p>                \n                \r\n\n            \n                <p><b>SCHULTZ:</b> I would also point out that the Taliban is an armed insurgency. ISIL is a terrorist group. So we don't make concessions to terrorist groups.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>You don't feel the Taliban is a terrorist group?</p>                \n                \r\n\n            \n                <p><b>SCHULTZ:</b> I don't think that the Taliban -- huh, the Taliban is an armed insurgency, this was the winding down of the war in Afghanistan and that's why this arrangement was dealt.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The arrangement, Mr. Schultz was referring to is the trade of five top Taliban commanders for Sergeant Bowe Bergdahl whom we will deal with in a moment.</p>                \n                \r\n\n            \n                <p>But what about Schultz parsing the terrorist description? Embarrassing, right? The White House really needs to stop this nonsense because it's become a national joke. Taliban slaughtered 132 Pakistani school children recently. It's an armed insurgency. Come on, that's just insulting.</p>                \n                \r\n\n            \n                <p>So I am going to send a chart to the White House by FedEx. The following are terrorists because they either kill or support killing civilians -- Al Qaeda, Isis, Boko Haram, Taliban, Iranian mullahs, Hezbollah, Hamas, the Muslim Brotherhood and every other jihadist group. It's going on the chart. Write them down. Send it down to the White House so they know.</p>                \n                \r\n\n            \n                <p>Now, there are also terror groups not aligned with radical Islam but they are insignificant at this point, thank God.</p>                \n                \r\n\n            \n                <p>A new Fox News poll shows Americans are getting fed up with the dumb dance the White House is doing. When asked if America is at war with radical Islam, 56 percent say yes, 37 percent no. When asked if President Obama over or under emphasizes the terror threat: 47 percent under; 43 percent about right; 6 percent over. Actually that poll is closer than I thought it would be. Must be weighted toward San Francisco people.</p>                \n                \r\n\n            \n                <p>The truth is that the Muslim world, most of it, would like to see the jihadis defeated. They're bad for business, bad for the soul. But America is not going to put the jihadis out of business because the commander in chief lacks the will.</p>                \n                \r\n\n            \n                <p>And the folks, we the people, have had enough. Why should we bear the brunt of the entire war on terror? If Muslim nations would declare war on the jihad, we and other allies would certainly help them big time. But that does not seem to be a possibility in a very cowardly world.</p>                \n                \r\n\n            \n                <p>And so the beheadings, the kidnappings, the bombings, the mutilations will all continue unabated until, until the U.S.A. gets hit again. Then everything will change.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Americans not happy with President Obama's take on terrorism", "description": "Talking Points 1/29", "date": "2015-01-30T13:21:26Z"}