{"vcmId": "4ac8f11f-cdea-475b-8040-baeebec0302e", "url": "http://www.foxnews.com/transcript/2015/08/04/bill-oreilly-problem-with-liberalism.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>No matter who wins the Democratic presidential nomination, they will toe the liberal line. That's because the Democratic liberal party has been taken over by the far left. Few moderate Democrats have any currency in the party.</p>                \n                \r\n\n            \n                <p>That was demonstrated once again today when only two Democrats voted to defund Planned Parenthood. The measure failed because the Senate could not get 60 voters to move forward. All but one Republican senator voted to defund on principle. That man is Mark Kirk from Illinois.</p>                \n                \r\n\n            \n                <p>Now, there is no question Planned Parenthood is an abortion factory and there is no question the group sells the body parts of dead babies or fetuses. Yet the Democratic Party doesn't care.</p>                \n                \r\n\n            \n                <p>So my question tonight is, what happened to liberalism? The liberal philosophy is based upon fairness for the underdog -- helping those who are down and out. Protecting the defenseless. Yet, unborn babies don't count. How does that work when the liberal line urges social justice?</p>                \n                \r\n\n            \n                <p>To those of you who deny life begins with human DNA on conception, what qualifies you to say that? It's a belief, that's all. And your belief may be wrong. Meantime, millions of potential human beings have been destroyed. And if you voice objection to that, then you are declaring war on women.</p>                \n                \r\n\n            \n                <p>Just ask Hillary Clinton.</p>                \n                \r\n\n            \n                <p>The decline of liberalism began with a real war, Vietnam. The left voiced major objections and they were right. The war was fought in a dishonest way and hundreds of thousands of American working men and women primarily were killed or wounded.</p>                \n                \r\n\n            \n                <p>That radicalized the left and many liberals turned Saul Alinsky mean, damming anyone who did not agree with them.</p>                \n                \r\n\n            \n                <p>Today we have the most liberal president in America's history, Barack Obama, elected twice. But his economic policies have not improved the lives of the poor or African-Americans. Every statistic tells the same story there are fewer good jobs, salaries are stagnant on Obama's watch. That's because the feds cannot run a free marketplace.</p>                \n                \r\n\n            \n                <p>Even in a country like Cuba population 11 million, the lack of free enterprise dooms people to poverty. Incredibly, even some left-wing commentators are now catching on.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MATTHEWS: </b>What is the difference between a Democrat and a socialist?</p>                \n                \r\n\n            \n                <p>I used to think there was a big difference. What do you think it is?</p>                \n                \r\n\n            \n                <p><b>DEBBIE WASSERMAN SCHULTZ, DEMOCRATIC NATIONAL COMMITTEE:</b> The difference between.</p>                \n                \r\n\n            \n                <p>Matthews: Between a Democrat like Hillary Clinton and a socialist like Bernie Sanders.</p>                \n                \r\n\n            \n                <p><b>WASSERMAN-SCHULTZ:</b> The more important question is what's the difference between being a Democrat and being a Republican.</p>                \n                \r\n\n            \n                <p><b>MATTHEWS: </b>But what's the bigger difference -- what's the difference between a Democrat and socialist. You are the chairman of the Democratic Party. Tell me the difference between you and a socialist.</p>                \n                \r\n\n            \n                <p><b>WASSERMAN-SCHULTZ:</b> The relevant debate that we will be having over the course of this campaign is what's the difference between a Democrat and a Republican.</p>                \n                \r\n\n            \n                <p>MATTHEWS: I think there's a big difference. I think there is a huge difference.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> She can't answer the question. She just simply can't answer it. And she is the head.</p>                \n                \r\n\n            \n                <p>Now, on the protection front, even a simple thing like Kate's Law which would mandate incarceration for illegal aliens who commit aggravated felonies in America then defy deportation coming back, back, back, back, back. Even a simple law like that rejected by many liberals.</p>                \n                \r\n\n            \n                <p>Later in the broadcast, Jesse Watters will confront senator Dick Durbin.</p>                \n                \r\n\n            \n                <p>So why, why are liberal politicians against the law that would protect Americans? Makes no sense at all. And would not impede the quest for so- called comprehensive immigration reform.</p>                \n                \r\n\n            \n                <p>Finally, let's take a look at three cities run by uber liberal mayors. Over the weekend here in New York City, 25 people shot, three of time died. Victims of perps -- mostly black.</p>                \n                \r\n\n            \n                <p>Same thing in Chicago, 40 people shot, three of them died.</p>                \n                \r\n\n            \n                <p>Baltimore 15 people shot, five of them died.</p>                \n                \r\n\n            \n                <p>African-Americans the victims and the perps primarily. So where is the group Black Lives Matter on that? I guess Black Lives Matter not so much in cities run by liberal politicians who cannot control the streets.</p>                \n                \r\n\n            \n                <p>No matter how many facts Talking Points presents on the economy, on crime, on foreign policy, on individual behavior, liberals will not admit their philosophy has gone off track. Thus, we have a presidential election coming up in 2016 that will once again pit the liberal philosophy against a traditional one. If facts matter, the election should not even be close. If facts matter.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The problem with liberalism", "description": "Bill O'Reilly's Talking Points 8/3", "date": "2015-08-04T12:51:50Z"}