{"vcmId": "4c2673a7-a63c-451e-a0f2-6b337d04ebe0", "url": "http://www.foxnews.com/transcript/2016/09/23/bill-oreilly-acceptable-behavior.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>For the past two nights protests over a police shooting in Charlotte have spiraled into chaos.</p>                \n                \r\n\n            \n                <p>Looting and violence have broken out, resulting in scores of arrests, at least five police officers injured and nine civilians hurt, as well one in critical condition.</p>                \n                \r\n\n            \n                <p>The controversy began on Tuesday after police killed 43-year old Keith Scott, shooting him to death after he allegedly brandished a hand gun.</p>                \n                \r\n\n            \n                <p>The police chief of Charlotte Kerr Putney has been adamant that Mr. Scott, who had previous run-ins with the law, was armed.</p>                \n                \r\n\n            \n                <p>But today the chief backed off that a little bit.</p>                \n                \r\n\n            \n                <p><b>CHARLOTTE POLICE CHIEF KERR PUTNEY</b>: \"I was very clear when I talked about this before, is the video does not give me absolute definitive visual evidence that would confirm that a person is pointing the gun. &#160;I did not see that in the videos I reviewed.\"</p>                \n                \r\n\n            \n                <p>But Chief Putney still insists Mr. Scott had a gun.</p>                \n                \r\n\n            \n                <p>Reaction from the black community came quickly.</p>                \n                \r\n\n            \n                <p><b>MINISTER CORINE MACK, NAACP CHARLOTTE BRANCH PRESIDENT</b>: &#160;\"But in my mind, and in most of the community's mind, it really doesn't matter if he had a gun. &#160;At the end of the day, we have the right under the 2nd Amendment to carry here in North Carolina. &#160;And their responsibility was to engage him in a more de-escalated way.\"</p>                \n                \r\n\n            \n                <p>Minister Mack is correct on one point and wrong on another.</p>                \n                \r\n\n            \n                <p>It certainly does matter if the dead man was carrying a gun, but she is right when she says that police do have an obligation to de-escalate confrontations if they can.</p>                \n                \r\n\n            \n                <p>But what every responsible American should agree with is that you cannot break the law by looting, setting things on fire and harming people under any circumstances.</p>                \n                \r\n\n            \n                <p>Fair-minded people know you let the investigation play out, you gather facts.</p>                \n                \r\n\n            \n                <p>In the Ferguson case, for example, once the facts were known the myth that Michael Brown had his hands up and was not causing trouble was dispelled.</p>                \n                \r\n\n            \n                <p>Now I am fully aware that some African-Americans do not trust the police or the investigative process in general.</p>                \n                \r\n\n            \n                <p>And some have good reasons not to trust.</p>                \n                \r\n\n            \n                <p>But that does not give you license to go on a rampage.</p>                \n                \r\n\n            \n                <p>Just today in Tulsa the police officer who shot an unarmed black man last week was charged with manslaughter. &#160;She will now stand trial -- that is our system.</p>                \n                \r\n\n            \n                <p>If you rejected the system and begin to commit crimes in the name of protest, you should be punished, not to mention that it hurts your own cause because mob violence will override any kind of singular injustice.</p>                \n                \r\n\n            \n                <p>Both presidential candidates reacted to not only the Charlotte situation but another police killing in Oklahoma.</p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON</b>: \"There is still much we don't know about what happened in both incidents, but we do know we have two more names to add to a list of African-Americans killed by police officers in these encounters. &#160;It's unbearable and it needs to become intolerable.\"</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP:</b> \"The people who will suffer the most as a result of these riots are law abiding African-American residents who live in these communities where the crime is so rampant. &#160;((EDIT)) There is no compassion in tolerating lawless conduct.\"</p>                \n                \r\n\n            \n                <p>Obviously a major contrast between Secretary Clinton and Mr. Trump.</p>                \n                \r\n\n            \n                <p>Summing up, the violence in Charlotte is deplorable, sincere protest is admirable.</p>                \n                \r\n\n            \n                <p>Looting and hurting other people unacceptable.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Acceptable behavior", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 9/22", "date": "2016-09-23T13:14:10Z"}