{"vcmId": "4cd752e1-b81f-40dd-888d-c4f939e1ebc5", "url": "http://www.foxnews.com/transcript/2014/11/04/bill-oreilly-midterm-election.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It's is very important obviously because America is not doing real well at the moment. \"Talking Points\" does not endorse political candidates because if I say vote for this one, three days later that person could be indicted. But the real reason I don't get involved with partisan politics is because it's my job to keep an eye on all the powerful people in America. If I have a rooting interest, that could skew my mandate. So I don't support political candidates. I never tell anyone for whom I vote and I try to keep it fair down the line.</p>                \n                \r\n\n            \n                <p>That being said, there is no question the Obama administration is having trouble almost everywhere, every fair minded person knows that. The President cannot even campaign for Democratic candidates because most of them felt he would be a detriment. When Mr. Obama did get out on the trail, he said things like this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>The Republicans are blocking immigration reform. That's one more reason why we need a Democratic senate. So I support you. I'm with you. I'm with you. And you need to go protest the Republicans.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do we have a Democratic senate now? Doesn't make any sense. And why would anyone protest the GOP when the Democratic Party holds power? It's clear President Obama's economic policies have not helped working Americans. The key indicator, your take-home pay has gone down since he's been in office. President Obama and the Democratic Party believe the federal government should essentially run the economy. The President and Congress have poured nearly $1 trillion tax payer dollars into the marketplace and all we have to show for it is a two percent growth rate per year on average -- two percent. It's simple the feds can't run the private economy it's not working. And that is a Democratic philosophy big government many regulations, high taxation. Again it's not working.</p>                \n                \r\n\n            \n                <p>Overseas things are a mess. We don't have to go through Putin, ISIS, Iran or any other problems again. U.S. foreign policy is in disarray. Finally the most important thing for the future, education, also not doing well. According to Cato Institute spending on American students is more than double since 1970 to almost $13,000 per student each year among the highest spending in the world. But SAT scores have declined three percent since the 1970's. Spending does not translate into good education. Discipline does. Both teacher and students must be held accountable in the classroom. By and large, the Democratic Party opposes that policy.</p>                \n                \r\n\n            \n                <p>Now there is little I can say about the Republican Party because there's no cohesive message the battle between conservatives and moderates continues to rage the GOP has no visible leadership, no unity and a terrible image among minority voters. But the failure of the Democratic Party overrides the inertia -- word of the day inertia -- of the Republican Party. That is why the GOP is favored to win tomorrow. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The midterm election", "description": "Talking Points 11/3", "date": "2014-11-04T13:09:03Z"}