{"vcmId": "4f7077b6-585b-4c17-bc92-483334b92ff0", "url": "http://www.foxnews.com/transcript/2015/10/28/american-law-enforcement-under-siege.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 27, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And in the \"Impact Segment\" tonight American law enforcement under siege. Here is FBI chief, James Comey.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JAMES COMEY, FBI DIRECTOR:</b> I spoke to officers in one big city at a precinct who described being surrounded by young people with mobile phones, video cameras rolling as they step out of the car taunting them. They described the feeling of being under siege and were honest and said we don't feel much like getting out of our cars.</p>                \n                \r\n\n            \n                <p><b>EARNEST: </b>I will say that the available evidence at this point does not support the notion that law enforcement officers around the country are shying away from fulfilling their responsibility.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Joining us now from Boulder, Colorado Republican presidential contender Senator Marco Rubio.</p>                \n                \r\n\n            \n                <p>So as we reported last night, violent crime -- murders, homicides, rapes -- going up in the 35 largest cities in this country. Why do you think that is?</p>                \n                \r\n\n            \n                <p><b>SEN. MARCO RUBIO (R-FL), PRESIDENTIAL CANDIDATE: </b>Well, that's a great question. It isn't because of laws, per se. It's illegal to do these things already.</p>                \n                \r\n\n            \n                <p>We have a societal issue in America that's very serious. The most important institution in society is the family and when the family breaks down and values aren't being taught the result is going to be expressed both economically through these circumstances that you are highlighting.</p>                \n                \r\n\n            \n                <p>And until we are honest about the fact that we have some significant societal breakdown in this country and family breakdown in this country we can't begin to address it. And of course, government is limited in what it can do about this. But if we have a president and we have leaders that are willing to tell us not to overeat because it causes diabetes and not to spoke because it causes cancer. We also need political leaders and people with a bully pulpit to be willing to tell us that at the end of the day it's what happens in our homes and our communities and what our kids are not learning from strong families.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. I mean that message certainly is muted in this age of fractured families and anything goes families. But there might be another component here. In a city like New York or Los Angeles community policing drove violent crime down. Here in New York they elected an uber-liberal mayor who immediately insulted the police, and the police really do not like this man de Blasio. So the crime -- violent crime has been inching up despite a good police commissioner in Bill Bratton.</p>                \n                \r\n\n            \n                <p>President Obama has been perceived as being on the side of the anti- police. Maybe it's unfair but he hasn't condemned Black Lives Matter and they are the leaders now of the demonizing police movement, hasn't condemned them -- all right -- and really hasn't been aggressively on the sides of the police in the situations like Ferguson and other controversial.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So how much responsibility does he bear in this in your opinion, Senator?</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Well, look there is a legitimate issue in this country with especially young African-American males, but minority communities in general, that feel like they are targeted or they have a bad relationship with local law enforcement. But there is another issue at play here and that is the overwhelming and vast majority of law enforcement officers in this country are just trying to do their jobs.</p>                \n                \r\n\n            \n                <p>They are the only thing standing between my family and danger. They are the first people we call when we get in trouble. And it is troubling that there are groups and rhetoric out there now that is encouraging people to demonize law enforcement, to target law enforcement or in some cases quite frankly to misrepresent what law enforcement is trying to do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But what role does President Obama play in that?</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>I think it's unfortunate that the White House has not acknowledged that enough. For example, we have had a number of police deaths here in the last few weeks, it hasn't received nearly as much attention from this White House or quite frankly from the media that some of the civilian shootings have received. And some of the civilian shootings raised strong questions about whether the police individual involved in that case did the right thing. There is no doubt.</p>                \n                \r\n\n            \n                <p>But what about the men and women in uniform across this country that are the thin blue line between us and danger? They are losing their lives, too. And there's not be enough attention paid to that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure. You know, four or five days ago a black New York City cop was shot and then Quentin Tarantino shows up and calls all the cops murderers.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>That's correct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We have an atmosphere now in this country that it's open season rhetorically on the police.</p>                \n                \r\n\n            \n                <p>Now, let's switch off --</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Well, and again I'm sorry -- I would say this is anecdotal but it's true. I have a number of friends in law enforcement I've interacted with in the last few weeks that do express the sentiment that there is now of violence towards them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I know the cops pretty well and they are \"inhibited\" is a minor word. They are really cautious about what they do now.</p>                \n                \r\n\n            \n                <p>Now, you have a big debate tomorrow night in Boulder, Colorado. You are already out there. Unfortunately you guys are going to be up against the World Series. So everybody is going to have to watch The Factor at 11:00 Eastern time tomorrow night live and we will, of course, have the highlights and everything.</p>                \n                \r\n\n            \n                <p>But my question to you is how do you prepare for something like this? Do you rehearse answers? Do you go over with your advisors, policy answers? Is that what you do?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Well, you know, we are out there every single day on the campaign. We're answering questions of voters. So that helps a lot. That's real preparation in a real world in real time.</p>                \n                \r\n\n            \n                <p>I do think you want to be up to date on what's been in the news lately. If some issues come up that you think might come up during the debate you want to be prepared to answer that. By and large what's made it easier for us -- not easy but easier -- is I know what I believe in.</p>                \n                \r\n\n            \n                <p>We have well-structured, well-outlined policy documents -- both foreign policy, domestic policy we have talked about extensively. And so when you have clear ideas about the issues before our country, I think it helps a lot in that preparation. And I think the most --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes and you're good at it.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> -- thing to do is just be up to date on them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You are glib, you are good at it -- you know, better than most. Tomorrow is going to be economics.</p>                \n                \r\n\n            \n                <p>But I was wondering like Ronald Reagan brought in a couple of good lines when he told Mondale I'm not going to let my opponent's youth and inexperience, you know, I'm not going to exploit it, and then there you go again. Those were rehearsed lines. Those were lines that he brought in.</p>                \n                \r\n\n            \n                <p>None of you guys have done that yet. And I'm wondering whether you have a line you are going to drop on Trump or Carson or anybody? Have you got anything? You don't have to tell me.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>No. Not really</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm just wondering if you have -- no. You are not going to do that?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> But, you know, when you have 11 people or 10 people on a stage it's a very different kind of debate than when you are one on one or one on three. It's very different.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Oh, absolutely. Yes. Very different.</p>                \n                \r\n\n            \n                <p>It is. After this debate though I expect some people will start to winnow out, Senator. And then it will become more intense --</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> -- we will see.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We appreciate you coming on in. Thank you.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "American law enforcement under siege", "description": "GOP presidential contender Senator Marco Rubio reacts to the rise in violent crime on 'The O'Reilly Factor'", "date": "2015-10-28T19:26:14Z"}