{"vcmId": "4fe8e1b2-d380-49d1-84e6-ff1455feb151", "url": "http://www.foxnews.com/transcript/2015/02/18/bill-oreilly-holy-war-begins.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The on camera beheadings of 21 poor Christian workers from Egypt by ISIS jihadists in Libya has shocked an apathetic world which has largely accepted barbaric behavior by militant Muslims.</p>                \n                \r\n\n            \n                <p>As we reported last night, the White House issued a press release condemning the atrocities but would not call the victims \"Christian\". Even though the killers openly said they were murdered because of their faith. The White House called them Egyptians.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>GEORGE WILL, FOX NEWS CONTRIBUTOR:</b> Wouldn't you love to be a fly on the wall in the room where the White House semanticists meet every morning and figure out how they could possibly describe what happened without offending those who did it. I think the phrase they should come up with is non-Islamic randomness.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Sarcasm aside President Obama's unwillingness to engage the ISIS savages on the ground is becoming a very serious story that may define his entire presidency if the terror group continues its expansion and the daily horrors that follow.</p>                \n                \r\n\n            \n                <p>According to a new CNN poll, 57 percent of American adults now disapprove of the way Mr. Obama is handling ISIS; 40 percent approve. When asked if the U.S.A. should send ground forces into Iraq or Syria to confront ISIS: 47 percent favor, 50 percent oppose. But \"Talking Points\" believes if the ground action is defined as raids and not occupation that number would go up quickly.</p>                \n                \r\n\n            \n                <p>Reaction to the beheadings in Libya was swift. Pope Francis saying, quote, \"Their only words were `Jesus, help me'. They were killed simply for the fact that they were Christians. The blood of our Christian brothers and sisters is a testimony which cries out to be heard.\"</p>                \n                \r\n\n            \n                <p>Leading Catholic cleric in America Cardinal Timothy Dolan said, quote, \"This is part of an orchestrated fanaticism, an ideology that sees Christianity, Judaism and religion of peace as the enemy. Fanatics want to take over and we can't let that happen. They threaten civilization, everything that is decent and noble about humanity. It is a worldwide crisis that cannot, must not, be ignored.\"</p>                \n                \r\n\n            \n                <p>This week there will be some meetings, meetings at the White House about the growing terror threat. We can expect a lot of speeches. \"Talking Points\" well understands that the wars in Iraq and Afghanistan have hurt America's ability to confront evil around the world. President Obama and many Americans do not have the heart for another global conflict after the intense loss of blood and treasure since the attack on 9/11.</p>                \n                \r\n\n            \n                <p>But the utter brutality that faces this country and the world today has to be confronted. And somebody has to lead that effort. It certainly won't be the Chinese leader or Putin or Merkel or David Cameron in Great Britain. The first three don't have the will, Cameron doesn't have the power. There is only one leader with the cache to lead the fight -- that reluctant warrior, Barack Obama.</p>                \n                \r\n\n            \n                <p>This is now a so-called holy war between radical jihadists and everybody else including peaceful Muslims. ISIS has murdered thousands of innocent people who follow the teachings of Allah. The terror savages will kill anyone at any time. What is especially frightening is the continuing nonsense we see from Washington.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MARIE HARF, STATE DEPARTMENT DEPUTY SPOKESPERSON: </b>We're killing a lot of them and we're going to keep killing more of them. So are the Egyptians, so are the Jordanians, they are in this fight with us.</p>                \n                \r\n\n            \n                <p>But we cannot win this war by killing them. We cannot kill our way out of this war. We need, in the longer term, medium and longer term to go after the root causes that lead people to join these groups, whether it's lack of opportunity for jobs --</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So Miss Harf who spooks for the State Department, John Kerry, is telling the ISIS killers themselves and the world that organized military opposition cannot defeat the terror group.</p>                \n                \r\n\n            \n                <p>That's just nonsense. If the world united against the jihad, it would be defeated. But, again, there is no effort to do that and so the atrocities continue. History will show that President Obama made an enormous mistake by failing to leave a residual force behind in Iraq. That could have quickly mobilized against the ISIS savages when they began infiltrating that country.</p>                \n                \r\n\n            \n                <p>As we know the President was slow in recognizing the threat initially labeling ISIS the JV, junior varsity. President Obama also told the world that Yemen was a bulwark against al Qaeda, a success story. Yemen has now been overrun by jihadists -- American marines having to flee that country without their weapons.</p>                \n                \r\n\n            \n                <p>So, on the President's watch the following countries have become safe havens: Syria, Iraq, northern Pakistan, eastern Nigeria, Libya, Somalia, Iran, parts of Algeria and parts of Afghanistan. That is quite a resume. We in America have been fortunate that our intelligence agencies and the FBI as well as local police have prevented another big attack like 9/11. Instead, we and other countries continue to absorb small blows from fanatical individuals.</p>                \n                \r\n\n            \n                <p>But with ISIS expanding its territory and recruiting thousands of fanatical killers from all over the world, no one is safe. Therefore it is imperative that President Obama stop living in the theoretical, even fictional world. America is not able to fix economies in third world nations. We are not able to force Islamic despots to respect human rights. We are not able to convince the Iranian mullahs to stop supporting and harboring terrorists and to cease with the nukes.</p>                \n                \r\n\n            \n                <p>We simply cannot do those things and to waste time throwing them out as possible solutions to dismantling the jihad is insulting and dangerous to the American people.</p>                \n                \r\n\n            \n                <p>The holy war is here. And unfortunately it seems the President of United States will be the last one to acknowledge it.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The holy war begins", "description": "Talking Points 2/17", "date": "2015-02-18T13:23:53Z"}