{"vcmId": "51e75e02-18e8-41b7-bb00-80ce73e90612", "url": "http://www.foxnews.com/transcript/2016/08/17/bill-oreilly-george-soros-democratic-party-and-hillary-clinton.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As you may know, the 85-year-old billionaire is a far-left fanatic whose Open Society Organization advocates no borders anywhere in the world.</p>                \n                \r\n\n            \n                <p>According to Soros, everyone should be able to go wherever they want for any reason and stay there.</p>                \n                \r\n\n            \n                <p>Recently hackers, believed to be backed by Russia, exposed more than 2,000 documents connected to Soros and his Open Society.</p>                \n                \r\n\n            \n                <p>The information is disturbing.</p>                \n                \r\n\n            \n                <p>Soros has given about ten million dollars to groups opposed to the policies of Israel.</p>                \n                \r\n\n            \n                <p>He has funded individuals accusing Israel of war crimes.</p>                \n                \r\n\n            \n                <p>He has given a variety of grants to people who literally hate Israel.</p>                \n                \r\n\n            \n                <p>In addition, Soros has funded investigations of individuals who are opposed to radical Islam.</p>                \n                \r\n\n            \n                <p>People such as Pamela Geller, Frank Gaffney, Liz Cheney and Cliff May.</p>                \n                \r\n\n            \n                <p>Mr. May will be here in just a few moments.</p>                \n                \r\n\n            \n                <p>Finally, Soros has donated about $13 million to the Democrats this election cycle.</p>                \n                \r\n\n            \n                <p>That includes seven million bucks to a Hillary Clinton Super PAC.</p>                \n                \r\n\n            \n                <p>Twelve years ago, here's what Mrs. Clinton said about George Soros.</p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON:</b> &#8220;We have been given an extraordinary blessing and at this moment in time our country needs us and we need people like George Soros who is fearless and willing to step up when it counts.&#8221;</p>                \n                \r\n\n            \n                <p>Now to be fair, that soundbite is dated. &#160;But the Clinton campaign is accepting money from Soros this year and that may present a problem for the secretary.<br> You may remember that Donald Trump got hammered by the media for not disavowing David Duke quickly enough.</p>                \n                \r\n\n            \n                <p>Duke, of course, a far-right hater.</p>                \n                \r\n\n            \n                <p>But now we have a far-left individual, Soros, bent on harming Israel - America's strongest ally in the Middle East.</p>                \n                \r\n\n            \n                <p>So how will the media cover that situation? &#160;Again, Soros is one of the biggest donors to the Democratic Party.</p>                \n                \r\n\n            \n                <p>Talking Points believes the mainstream press will largely ignore the Soros story even though it is very important.</p>                \n                \r\n\n            \n                <p>Does the Democratic Party advocate open borders worldwide?</p>                \n                \r\n\n            \n                <p>A situation that would make it easy for Islamic terrorists to kill at will?</p>                \n                \r\n\n            \n                <p>Does the Democratic Party support the enemies of Israel?</p>                \n                \r\n\n            \n                <p>Do Jewish voters even know this is all happening?</p>                \n                \r\n\n            \n                <p>Again, a major situation brought to you by Russian hackers and presented to a largely apathetic press when it comes to reporting the truth about the upcoming election.</p>                \n                \r\n\n            \n                <p>Summing up, the Democratic Party must comment on Mr. Soros and his activities.</p>                \n                \r\n\n            \n                <p>We have requested a statement from the DNC.</p>                \n                \r\n\n            \n                <p>We will let you know if they reply tomorrow.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: George Soros, the Democratic Party and Hillary Clinton", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 8/16", "date": "2016-08-17T12:17:20Z"}