{"vcmId": "52137b79-8ace-4d83-9ab8-ccc1109876b6", "url": "http://www.foxnews.com/transcript/2015/10/06/chris-christie-enters-no-spin-zone.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 5, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story\" segment tonight, as the new polling indicates Governor Christie of New Jersey is not in double digits anywhere. However, he is campaigning furiously. I talked with him late last week.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, I have been watching your campaign fairly close here. You are running a good campaign. You're feisty, you are you. You are not a phony politician. And I submit if Donald Trump were not in the race you would be much higher in the polls. Because even though you are a straight shooter and flamboyant, he is ultra-flamboyant. Am I wrong?</p>                \n                \r\n\n            \n                <p><b>GOV. CHRIS CHRISTIE (R-NJ), PRESIDENTIAL CANDIDATE</b>: I don't think you're wrong. You know, I think there's a lot of people who currently feel like they want to support Donald, that if he wasn't in the race they would be supporting me. But, you know, we will have to be working on that and trying to bring some of them over and I think we will over the course of time.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You have a debate coming up at the end of this month. How long you can hang in if that doesn't sort to rise significantly?</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> Well, I think you can hang in for a while. I mean, our fundraising has gone well. And that's one of the ways you hang in --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. Anyway, you have to have money.</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> Yes. And people continue to support me so that's good. And we're continuing to make traction. You know, the last debate went very well for us. I mean, people saw that we were trying to be the adult on the stage and actually talk about issues that they cared about.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Fiorina, Carson and Trump. They all are ahead of you. Does that surprise you at all?</p>                \n                \r\n\n            \n                <p><b>CHRISTIE: </b>Sure. Yes. I mean I think it surprises everybody. I don't think anybody went in -- and thinking like, okay, if Trump, Fiorina and Carson they will be one, two, and three. But, you know, again, it's so early, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What do you attribute that to?</p>                \n                \r\n\n            \n                <p><b>CHRISTIE</b>: Anger. I mean, and I think really most of the anger is directed to the President who has been, you know, an abomination and Congress which has gotten absolutely done nothing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: An abomination. Strong word.</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The thing that President Obama did that you object to the most is.</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> The Iran nuclear deal.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> On the domestic front?</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> ObamaCare. It should not be a federal issue. On the Tenth Amendment -- for being federal issue, it's wrong.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you think it's going to hurt working people? Because it does help some people to get free government subsidize health care.</p>                \n                \r\n\n            \n                <p><b>CHRISTIE</b>: It's already hurt working people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How?</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> Well, because premiums are going up and even greater rate than they're going up before. And they were given assurance by their president, their president looked into the camera and say, if you like your doctor you can keep them and it's not true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> People are angry on the republican with the President Obama. But on the democratic side, a lot of people still love him.</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Have you figured the President out? Do you know what kind of a man he is?</p>                \n                \r\n\n            \n                <p><b>CHRISTIE</b>: Hard to figure him out. He is not very transparent. He is not very emotional. He doesn't really show what he thinks or feels and he hasn't shown what he really was willing to fight for. I see him kind of a petulant child.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you think there is a racial component in President Obama?</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> You know, listen, I don't think so.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. So, a lot of Republicans do. I know him a little bit. I haven't seen it personally at all. Though he doesn't seem to stick for law enforcement than you do. He doesn't seem to do that. He doesn't seem to feel angry about Kate Steinle getting shot in the back of the head because federal policies can't stop convicted felons from coming back six times. He doesn't seem angry about any of that.</p>                \n                \r\n\n            \n                <p><b>CHRISTIE: </b>I think that has much more to do with being a law professor. You know, everything is theoretical to him. It's a theoretical argument. And when real life invades the theoretical argument, he falls back to the theoretical.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And now overseas his whole foreign policy is falling apart. You know, Putin is going to run Syria. And then Putin has allied himself with the Mullahs in Iran.</p>                \n                \r\n\n            \n                <p><b>CHRISTIE</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So with Putin in Iran, they are just going to wipe American influence out in the Middle East.</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> It's unbelievable that he has taken 40 years of American effort in the Middle East to be the dominant influence in the Middle East and its six and a half years given it away.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Why did President Obama do that?</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> Because he doesn't understand and he doesn't think strategically.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So you think it's just incompetence?</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Colonel Peters who works for us says it's cowardice. Do you think President Obama is a coward?</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> I don't think he is he a coward. I just think he does not like confrontation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He is a smart guy. You would admit that right?</p>                \n                \r\n\n            \n                <p><b>CHRISTIE</b>: Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He has to understand that his policy of pulling all- American troops out of Iraq led to the rise of ISIS and the current crises we have now in Europe with the migrants. Putin and Syria. All of it happens in a domino fashion because of his mistake.</p>                \n                \r\n\n            \n                <p><b>CHRISTIE: </b>Of course. Of course. But he doesn't believe that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Why does he not?</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> He believes it's based on George W. Bush's mistakes as he sees it --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>No I think he is partisan. And I think he never gets away from the idea, Bill. And this is the one way I do know him. I think he always believes he is the smartest guy in the room. That's a very dangerous thing when you are a leader. Susan Rice said his national security advisor a week and a half or so ago said that they were perplexed as to why Putin was going into Syria. Have you ever been perplexed about it?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No.</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> He wants to team with Iran to dominate the Middle East and end American influence and prop up Assad.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>CHRISTIE</b>: That's what he wants to do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's what he's doing.</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> How perplexing is that? The reset button with Russia is a mistake. His policy towards Iran is a mistake. He is abandoning allies in that area and is he weak.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Worst president ever.</p>                \n                \r\n\n            \n                <p><b>CHRISTIE:</b> He is getting there. Yes. He is getting there. I mean, I think he is right there. And I think really he has clinched it in the last 12 months, Iran, Syria. I think --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right Governor, thank you very much.</p>                \n                \r\n\n            \n                <p><b>CHRISTIE: </b>Thank you, Bill.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Chris Christie enters 'The No Spin Zone'", "description": "GOP presidential hopeful joins 'The O'Reilly Factor' to discuss his bid for the White House and campaign politics", "date": "2015-10-06T12:07:25Z"}