{"vcmId": "52a737a5-d1ea-4fb7-bd76-cb9ffbfc560d", "url": "http://www.foxnews.com/transcript/2014/11/12/bill-oreilly-mistreating-black-americans.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>A report today says that people who live in and around Ferguson, Missouri are buying guns at a record rate. That's because the decision on the police shooting of Michael Brown is due soon and there could be more rioting in that area.</p>                \n                \r\n\n            \n                <p>All over the U.S.A., liberal pundits continue to say that blacks are being mistreated by society in general, but especially by the police. They use phrases like white privilege, police racism, things like that.</p>                \n                \r\n\n            \n                <p>Now, there is no question that African-Americans are struggling in our competitive country. The black unemployment rate almost 11 percent; it's 4.8 percent for whites. Unemployment for blacks ages 16 to 24 an astounding 22 percent. Median household income for blacks, $34,600; for whites, $58,270. Poverty rate 27 percent for blacks, about 9.5 percent for whites.</p>                \n                \r\n\n            \n                <p>So you can see that economically African-Americans are suffering. There is no question about it. But why? Are we truly a racist nation or is there something else here? A college education is the ticket to economic success in America. But culture, culture is also a big issue.</p>                \n                \r\n\n            \n                <p>Enter, commentator Ben Stein who said this on News Max TV.</p>                \n                \r\n\n            \n                <p><b>(BEGIN AUDIO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>STEIN: </b>You would think if you read the liberal mainstream media the main problem with race in America was poor innocent black people being set upon and mistreated by the police. That's just nonsense. I mean the real problem with race in America is a very, very beaten down static, self- defeating black underclass. I mean it's an amazing thing. Blacks were on their way in this country, even after the horrors of slavery, and then drugs came in. The destruction of families came in, and the crisis in the black community is just absolutely unbelievable. And that, it seems to me is something that Mr. Obama could have addressed. He has ignored it completely.</p>                \n                \r\n\n            \n                <p><b>(END AUDIO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's not entirely true. President Obama has initiated the My Brother's Keeper program which is well thought out, providing mentors to young black males and getting corporations to help black youth. Because of history, America does owe blacks extra help.</p>                \n                \r\n\n            \n                <p>But \"Talking Points\" has said again and again that it's the collapse of the African-American family that has led mostly to the economic chaos. Stats are well known: 72 percent of all black babies now born out of wedlock -- 72 percent; 45 percent of black homes headed by a woman; the desertion rate for African-American men astronomical. That's the truth. And that is why the poorest precincts continue to suffer.</p>                \n                \r\n\n            \n                <p>As everybody knows, poverty leads to crime drug abuse, hopelessness. In Chicago, black gangs terrorize entire neighborhoods. Essentially brutalizing their own people. For some reason the white power structure in Chicago, which is very liberal, is not able to control the black gangs, for some reason. President Obama has not paid much attention to that problem, although we think he grieves about it because he used to work there.</p>                \n                \r\n\n            \n                <p>But there is only so much the feds can do. Throwing money at the situation doesn't work. Cultural violence and chaos is a local problem. And the combative African-Americans themselves have to rise up and demand protection. But more importantly, they have to condemn irresponsible behavior by their own.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Mistreating black Americans", "description": "Talking Points 11/11", "date": "2014-11-12T13:09:29Z"}