{"vcmId": "52dbab31-f145-4a67-8fa3-30a58109b4b8", "url": "http://www.foxnews.com/transcript/2015/04/16/truth-serum-entitlement-abuse.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 15, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Truth Serum\" segment tonight entitlement abuse. Study by the University of California Berkeley says, 73 percent of families getting some kind of welfare payments have at least one family member working. Also this moved by Maine and some other states to prevent food stamps to being used by nonfood items like cigarettes and booze.</p>                \n                \r\n\n            \n                <p>With us now in New York, Eric Shawn on the state situation. From Washington, Shannon Bream on federal welfare programs. I want everybody to know that we are not talking about Social Security or Medicare. We are talking about what they call means based entitlements which are giveaways.</p>                \n                \r\n\n            \n                <p>All right. So Shannon, what's the overall spending on means welfare these days?</p>                \n                \r\n\n            \n                <p><b>SHANNON BREAM, FOX NEWS ANCHOR CORRESPONDENT:</b> Well, Bill, it just continues to go up. We are talking about more than $600 billion out of the federal budget and now that's more than 17 percent of what we pay out from the federal coffers, our tax dollars is going specifically to these programs you mentioned. These are things like housing subsidies, food stamps, those kinds of things.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. How much has it rise under President Obama?</p>                \n                \r\n\n            \n                <p><b>BREAM: </b>Well, when you look at specifically overall all of those programs, it's more than 22 percent up since he took over. When you break down food stamps that's where we see some the biggest growth up 40 to 44 pierce since he took over in 2009. Millions of Americans, some, you know, in the neighborhoods of 46 million or more so the numbers are increasing. They are not slowing down.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. Now, the President will tell you it's because of the terrible recession that America has endured and a lot of people lost their jobs and got lower paying jobs. Does that stack up with the rise in payments?</p>                \n                \r\n\n            \n                <p><b>BREAM: </b>Well, it's interesting because if you look at some of what you mentioned on the front end, the fact that this study out of Berkeley. Said basically that 70 some percent of these payments that going are out is going to families that is working. So, that means somebody in the house is working.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. They are not making much money though. They have to work 10 hours -- in order to be working family you have to have 10 hours a week and 27 weeks out of the year. A little bit more than half year. Overall, some people say that the federal government is spending too much for entitlements and the republican candidates probably going to say cut that back. Do the stats bear that out?</p>                \n                \r\n\n            \n                <p><b>BREAM: </b>Well, it depends. Because people have to survive. They have to eat.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right, has to be a safety net.</p>                \n                \r\n\n            \n                <p><b>BREAM: </b>Yes. And if the economy is not healthy, of course that's what these GOP candidates are going to argue. That if the economy was more robust if there truly was a real recovery maybe the federal government wouldn't have to subsidized.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. But it's easier to get on means, entitlements now that it used to be. I mean, the -- is a lot easier.</p>                \n                \r\n\n            \n                <p><b>BREAM: </b>It absolutely is.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Let's go to the states. Now, Maine, Missouri, and Kansas are trying to reform this. Because unbelievably, you can use food stamps in most every state to buy booze, and cigarettes. Right?</p>                \n                \r\n\n            \n                <p><b>ERIC SHAWN, FOX NEWS ANCHOR AND SENIOR CORRESPONDENT: </b>Yes. Only 23 states have restrictions. And you are right, Bill. It's important to have it if you need it. But one of the bills in Kansas, for example, outlaws tattoos, massages, nail salons.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How can you use food stamps? Well, I guess you could, you could say, look, give me a massage, I'll give you this amount of food stamps and then you can go in and buy whatever you want.</p>                \n                \r\n\n            \n                <p><b>SHAWN:</b> Well, they include, psychics, swimming pools, movie theaters. In Missouri, they also have cookies, potato chips, energy drinks seafood and steaks. So, I guess --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But Missouri, I understand they are not going to pass that.</p>                \n                \r\n\n            \n                <p><b>SHAWN:</b> That's not out of the committee yet. Kansas bill is awaiting the governor's signature.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. And what would Kansas outlaw again?</p>                \n                \r\n\n            \n                <p><b>SHAWN: </b>Well, Kansas you have got a whole list, tattoos, massages, spa, nail salons, lingerie, arcades, cruise ships. I mean, critics, no one is not going on cruise ships if you don't have any money. That's just ridiculous. Swimming pools, psychics, movie theaters.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You can't barter the food stamps to get this kind of stuff.</p>                \n                \r\n\n            \n                <p><b>SHAWN:</b> That's correct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> In Maine when you go into a grocery store though, right now, and they are trying to change this. But I guess it's been voted down once already. You can buy whatever you want?</p>                \n                \r\n\n            \n                <p><b>SHAWN:</b> Well, they do have some restrictions. But Governor Paul LePage is quite a character.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. Do you like him?</p>                \n                \r\n\n            \n                <p><b>SHAWN:</b> Former mayor of Waterville so he knows city issues. He is adding to the list. LePage is adding gambling, lottery tickets, tattoos, tobacco, booze, imitation booze. I mean, does that mean odooze (ph). You know --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It should be -- food stamps should only be used for food and not booze, not substance. I wouldn't say cookies or anything like that. If you have got kids and they want a cookie, they should be able to have one.</p>                \n                \r\n\n            \n                <p><b>SHAWN:</b> Chips, seafood.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. I would allow seafood and chips, sure. But nothing other than food. All right, guys. Good segment as always. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Truth Serum: Entitlement abuse", "description": "Eric Shawn and Shannon Bream break down the welfare situation in the United States", "date": "2015-04-16T12:25:43Z"}