{"vcmId": "534676ad-7872-4438-ab2e-be428554d9ad", "url": "http://www.foxnews.com/transcript/2015/07/08/bill-oreilly-murder-kate-steinle.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As The Factor reported last night, 32-year-old Miss Steinle was murdered walking with her father in San Francisco, allegedly by a criminal alien who had been deported five times and had seven felony convictions in the U.S.A. That man, 45-year-old Juan Francisco Lopez Sanchez now charged with murder. He was arraigned today in a San Francisco courtroom.</p>                \n                \r\n\n            \n                <p>Talking Points said last night that the mayor of San Francisco Ed Lee and the 11 city supervisors are directly responsible for Kate's death. That's because San Francisco is a sanctuary city that does not cooperate with the federal government even on holding and identifying criminal aliens.</p>                \n                \r\n\n            \n                <p>Sanchez was in custody in San Francisco and the sheriff, Ross Mirkarimi let him out defying ICE officials.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Why not inform ICE when you have a felon in your custody? Why not draw the line at some place where maybe you are protecting the public?</p>                \n                \r\n\n            \n                <p><b>ROSS MIRKARIMI, SAN FRANCISCO SHERIFF: </b>They already know he is in our custody. They actually knew because he came from serving time in another prison.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Then why not work with them to make sure he doesn't get released?</p>                \n                \r\n\n            \n                <p><b>MIRKARIMI: </b>Well, because a detainer request is not a legal instrument.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Oh, bull. The sheriff should resign immediately. I mean what kind of law officer allows a known felon to walk free when the feds want him in custody? Asked him to keep him in custody. The sheriff is incompetent -- period. Out of there. And so are the folks who run the city of San Francisco, most of whom are now hiding.</p>                \n                \r\n\n            \n                <p>CBS News caught with San Francisco supervisor Julie Christensen.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> In the last 18 months more than 10,000 undocumented immigrants have been released from custody in California without immigration officials being notified. Since Kathryn Steinle's death San Francisco's elected officials have been avoiding speaking about sanctuary. Julie Christensen is a member of the board of supervisors.</p>                \n                \r\n\n            \n                <p><b>JULIE CHRISTENSEN (D), SAN FRANCISCO BOARD OF SUPERVISORS: </b>I'm not going to address that in detail.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>I mean the fact that if San Francisco wasn't a sanctuary city, would Kate still be alive?</p>                \n                \r\n\n            \n                <p><b>CHRISTENSEN: </b>I'm not going to go there.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Miss Christensen is a coward. The cold truth is Kate Steinle is collateral damage to the insane far-left politics that have long corrupted the city by the bay. Again, dangerous people are walking around because of political correctness. The mayor and the supervisors want to seem sympathetic to illegal aliens. That's what this is all about -- them and their liberal profile. The whole thing is absolutely disgusting.</p>                \n                \r\n\n            \n                <p>Now, there is some good news today as Kate may not have died vain. Senate majority leader Mitch McConnell told The Factor he is meeting with the senate leadership to discuss Kate's law. As we suggested last night Congress should pass legislation that would impose a mandatory minimum five-year sentence on any illegal alien that's deported and then comes back. The word \"mandatory\" is crucial.</p>                \n                \r\n\n            \n                <p>There are laws on the books now that are being ignored. Congress must write Kate's law so if officials do not enforce the mandatory sentence, they themselves, can be prosecuted. Congressman Matt Salmon of Arizona tells us he is writing Kate's law even as we speak. The congressman is looking for co-sponsors.</p>                \n                \r\n\n            \n                <p>We hope representatives from both parties will sign on. If they do, we will tell you who they are. If anyone opposes Kate's law, we will absolutely tell you who they are.</p>                \n                \r\n\n            \n                <p>Also, you can get involved. We have a petition on BillOReilly.com that supports Kate's law. We hope you will sign it and we will forward the petition to the House and Senate leadership as well as to the White House. More than four million people a night watch this program. If we get four million signatures on that, that would be quite something.</p>                \n                \r\n\n            \n                <p>It is long past time for the congress of the United States to protect the American people. Every president since Ronald Reagan has not done so. So Congress must act on illegal immigration. This sanctuary city business has got to end. Any American city, town, or county, not cooperating with Homeland Security should immediately lose federal funding. Enough is enough.</p>                \n                \r\n\n            \n                <p>That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The murder of Kate Steinle", "description": "Bill O'Reilly's Talking Points 7/7", "date": "2015-07-08T12:19:27Z"}