{"vcmId": "54dfeff0-9bc3-4328-8b7a-0bda74e8cc33", "url": "http://www.foxnews.com/transcript/2016/08/16/can-anything-be-done-about-race-motivated-hatred-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 15, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Thanks for staying with us, I'm Bill O'Reilly in the \"Unresolved Problems\" segment tonight. As we just reported. Violence in Milwaukee broke out after a black police officer shot and killed a black man, well, the cops say he had a gun. The Milwaukee County Sheriff David Clarke reacted this way.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DAVID CLARKE, MILWAUKEE COUNTY SHERIFF:</b> Here is what causes riots. Why have inescapable poverty in the city of Milwaukee. Milwaukee is like the sixth poorest city in America. You have massive black unemployment. I think it's at 32 percent. You have a failing K-12 public education system. It's one of the worst in the nation. You have questionable lifestyle choices.</p>                \n                \r\n\n            \n                <p>Some of this self-inflicted. All these kids with no fathers around. Father absent homes. When fathers aren't around to shape the behavior of young men, they oftentimes grow up to be unmanageable misfits. Those are the ingredients Milwaukee has all of them. All this police shooting did of an armed individual by the way when four other murders happened the night before and you didn't see this sort of reaction?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Joining us now from Washington, Charles Krauthammer. So, the sheriff went on to say that he believes the welfare system, the social entitlements that are encouraged by aggressive community and Democratic Party in particular have really eroded the social structure in the African- American community. First of all, do you believe that and, second, how has that happened?</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, SYNDICATED COLUMNIST: </b>Well, I don't believe it caused it. I do believe it exacerbated it in a very obvious way. The sheriff is absolutely right. The root cause of all of this is the breakdown of the community and the family and the black family. That's what he is talking about. That's what Pat Moynihan, and the famous liberal senator and professor of sociology at Harvard wrote in 1965, a report for which he was viciously attacked and even ostracized because he pointed to the breakdown of the black family.</p>                \n                \r\n\n            \n                <p>The major task of any society of any family overall, the organization of society is to socialize young men, to civilize them. That's what the family is for. That's what society is for. If you fail at that you fail at everything. And when Moynihan pointed out in 1965, was to an illegitimacy epidemic. Do you know what the number was at the time? Twenty four percent. You know what it is now among African-Americans? Seventy percent nationally and some of the cities 80 percent to 90 percent.</p>                \n                \r\n\n            \n                <p>The sheriff is absolutely right, fatherlessness, no one, not just to be the role model, but to be the disciplinarian. You saw that clip of the father of the guy who was shot in Milwaukee, that guy, Mr. Smith, the father saying, I'm at fault. I wasn't there. He was in and out of jail. He had a checkered.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>So, at that point the kid, the boy has so little chance. Add to that the schools that are corrupt, controlled by the Teachers Union. Give the worst education. No liberal in America would agree to have a child in that school. And they don't. There are always other things added on.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: How about the welfare system? How does that erode let me explain.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Let me explain.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Go ahead.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> When FDR instituted added aid to families with dependent children. It was intended to subsidized widows raising kids. It was never intended to what it ended up being in the 60's, 70's, and 80's to be a subsidy for illegitimacy. What was discovered was that if you had a child, you are unmarried in your late teens, early 20's and as long as you didn't have a man in the house, not just unmarried, people used to hide the boyfriends.</p>                \n                \r\n\n            \n                <p>They would run away when the social worker showed up because if there is a man in the house, you lost your payments. It was the worst incentive you could imagine well-meaning government trying to subsidize a single mother, trying to raise her kids very hard to do. But what it created was a cash payment system where essentially if you had illegitimate child, no one to help you out in the house, you were subsidized. The government essentially became your providing husband. And that created.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And the more kids you had the more money you got.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> And you created a new generation --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: OK.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> -- with no father, no role model, increasing poverty, desperation and all the pathology that we talk about today. It is a tragedy because it was all well intended.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But the progressive party will never, never admit that. They will never say gee, you know, we were well intended but it didn't work and now we have to look at another way.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> But Bill Clinton did. He signed the welfare reform in 1996 - -</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. But those based on work.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Yes. That attached it to work and that revolutionized welfare.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: This is based on something else. This is based on morality. Now, Clark, basically says, Sheriff Clarke that the Black community in America has to solve the problem itself. That the government can't. So if African-Americans want a better society, all right, they have to confront this growing problem of the deterioration of the family. Do you think that will ever happen?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Look, that has always been true. It's true for every community. It's been made worse by the policies of the government. The problem for us is everybody is aware of the problem, but no one knows there is no political solution to what would have to be a reformation, sort of a re-spiritualization if you like of these communities that are suffering so much. The sources of strength, of course, are the churches, some of the community organizations, and that where all that has to come from.</p>                \n                \r\n\n            \n                <p>But I think there are few things the government can do at the margins. The first was reforming welfare which Obama has largely undone the work requirement. And second what we need to talk about is to try to salvage at least some of the students by giving them educational choices.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. The vouchers and stuff like that.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: So, you can start by working from the outside.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>You can start by doing those things. But the rest, unfortunately is up to a community that is in very dire straits.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Charles. Thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Can anything be done about race motivated hatred in America?", "description": "Charles Krauthammer joins 'The O'Reilly Factor' to analyze how poverty, failing education systems and family structures contribute to violence in the US", "date": "2016-08-16T12:27:50Z"}