{"vcmId": "54dfd90f-66e1-4b95-94f0-2914be093fa1", "url": "http://www.foxnews.com/transcript/2016/01/27/ted-cruz-on-his-campaign-ahead-iowa-caucuses.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 26, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Now for the top story tonight. We're please to do have Senator Ted Cruz joining us from Iowa.</p>                \n                \r\n\n            \n                <p>let's start with the New York values deal. Do you think that was a mistake on your part to define Trump that way?</p>                \n                \r\n\n            \n                <p><b>SEN. TED CRUZ (R-TX) PRESIDENTIAL CANDIDATE: </b>Not remotely. And you know the interesting thing Bill thing is the term New York values didn't come. It came from Donald when he did a long interview with Tim Russert. He was explaining his views, explaining that he is very, very pro-choice. That he supports partial birth abortion. And his explanation for why he said, look, I'm from New York. I have lived my whole life in New York. Those are our values. Those are our views. It's not the same as if I were from Iowa. Iowa values are different.</p>                \n                \r\n\n            \n                <p>And so that's how he explained his world view. And I will tell you, here in Iowa, where I am today or for that matter in New Hampshire and a south Carolina -- all across the country, people know exactly what is meant by New York values and then --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But here is the problem. Here's the problem. When you did that at the debate you gave him an opportunity to look like a statesman because he brought up 9/11 and the courageous actions of New York during at that time. You even applauded him.</p>                \n                \r\n\n            \n                <p>And then after the debate his poll numbers went up. It seems to me that you were trying to make a point} based upon a fairly old definition of where he stood on issues, 1999 or so. And that point actually helped Tim. Would I be wrong?</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> You know, you would be wrong -- Bill. And if you want to look at what New York values are you can look at positions that are current. Right not today, Donald Trump supports taxpayer funding for planned. Those are New York values.</p>                \n                \r\n\n            \n                <p>Right now today, Donald Trump supports using eminent domain to condemn take private property to give it to giant corporations. That's New York values. And I would note that Donald Trump supported Barack Obama's big bank bailout, the TARP bail out of Wall Street and he also supported the Obama stimulus.</p>                \n                \r\n\n            \n                <p>Now listen, that he is entitled to have those positions. I disagree with him on every one of those positions. I think that's how we got into this mess. We're bankrupting this country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Don't you think --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>Cruz: And what I'm suggesting is those views and values are different from the views and values here in Iowa.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Don't you think though the reason that Trump has been successful isn't policy -- all right. It's attitude. His attitude is Washington is corrupt, broken, they are all losers and I can fix it. So policy, I know what you are doing. And it would work, I think it might work in Iowa. But I don't know if it will work nationally because he is running on attitude not policy.</p>                \n                \r\n\n            \n                <p>Now, I have a couple of questions about your attitude. You and Mike Lee, the Senator from Utah are considered the most conservative senators sitting today.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And I'm wondering if you do secure the Republican nomination how you're going to be able to persuade Independents, moderates Republicans, even moderate Democrats to vote for you with that kind of a conservative record.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Well, I'll tell you Bill, you know, you look at the past several elections and Republicans keep nominating moderate centrist Republicans and then getting clobbered in the general election. We saw that with Bob Dole, we saw that with John McCain, we saw that with Mitt Romney. It doesn't work.</p>                \n                \r\n\n            \n                <p>Millions of conservatives stay home. I believe the way we win this election is I think 2016 it's going to be an election like 1980. That we're going to win by painting in bold colors not pale pastels. By energizing and bringing back to the polls the millions of conservatives who stayed home. The millions of evangelical Christians and the millions of Reagan Democrats.</p>                \n                \r\n\n            \n                <p>You know, you were asking about Independents and Democrats. I'll tell you Bill at almost every event that we do on the campaign trail I had people come up to me and say I'm a Democrat. I've been a Democrat my whole life. I'm with you now.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: The core of our base are the Reagan Democrats, the working class, the union members, the truck drivers and the mechanics and the steel workers. And the working men and women who have gotten hammered over last seven years under the Obama-Clinton economy. They are looking for someone to stand with the working men and women of this country and that's what I have done every day I have been in public office.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But you, to your credit, in some people's eyes, are doctrinaire. You don't waiver. You are not a big compromiser. There are a lot of Republicans in the senate that don't like you because of that. You are considered a bomb thrower -- somebody you can't do business with.</p>                \n                \r\n\n            \n                <p>On the other hand, that's attractive to the conservative base. It doesn't want, as you pointed out, some kind of pastel milk toast.</p>                \n                \r\n\n            \n                <p>I see it a little bit differently. I think McCain and Romney lost because they didn't bring the fight to President Obama and he was able to put together a coalition --</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: No doubt about it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- a minority coalition that's going to be aligned against you, Senator. The minority coalition is going to be aligned against you. Ok. They're going to try. They may not succeed --</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Not necessarily.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Go ahead.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> They are going to try.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> But, you know, look, when I ran for senate in Texas in 2012 I got 40 percent of the Hispanic vote in the state of Texas at the same time Mitt Romney was getting clobbered with just 27 percent of the Hispanic vote nationwide.</p>                \n                \r\n\n            \n                <p>I ran unambiguously opposed to amnesty, fighting to secure the borders. But I also ran fighting for the millions of working men and women that want to achieve the American dream. You know, my dad came from Cuba in 1957. He was just 18. He had nothing. He had $100 in his underwear, washed dishes making 50 cents an hour. And that's the story of all of us.</p>                \n                \r\n\n            \n                <p>What we have seen under Barack Obama and Hillary Clinton is we have seen the power of Washington, the rich and powerful have gotten richer. The top 1 percent today earn a higher share of our economy than any year since 1928. And the most vulnerable --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You are starting to south like Bernie Sanders out there -- Senator.</p>                \n                \r\n\n            \n                <p><b>CRUZ: </b>You know what? Bernie, at least, is willing to stand up to the corruption of the Democratic Party. He is halfway there. And I'm --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, I'd say maybe he's about 15 percent of the way there. But look, the problem you are going to have if you get the nomination is the middle. Barry Goldwater got trounced because he ran as doctrinaire conservative.</p>                \n                \r\n\n            \n                <p>And we are living in a changing America. You know the demographics are changing. The attitudes are changing. We are not going to go back on gay marriage. We are not going to go back on a lot of these things. And they work against you in the general election.</p>                \n                \r\n\n            \n                <p>So, it will be very fascinating to see if you do win the nomination how you can persuade those people to go for you.</p>                \n                \r\n\n            \n                <p>Last word.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Well Bill, I will point out that the polling numbers are contrary to what you are saying. I'm beating Hillary Clinton right now and Donald Trump is losing to her.</p>                \n                \r\n\n            \n                <p>And if you look right now, we are 144 hours out from the Iowa caucuses. The Iowa caucuses are in a dead heat -- it's two man race between me and Donald Trump. And the men and women of Iowa are making the decision right now who they want to be the nominee.</p>                \n                \r\n\n            \n                <p>We are running a grass roots campaign. By Monday we will have done what's called the full Grassley. We have been to all 99 counties, answering the questions from the men and women of Iowa -- the hard questions. They don't want campaign rhetoric. They want someone with a record of standing and fighting for conservative principles, fighting for the constitution, leading the fight against Obamacare.</p>                \n                \r\n\n            \n                <p>You know, Donald Trump favors Bernie Sanders-style socialized medicine. He believes the government should take over healthcare, even more than Obamacare.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You know, I'm going to ask him about that.</p>                \n                \r\n\n            \n                <p><b>CRUZ: </b>I led the fight against Obamacare. As President I would repeal every word of it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We're going to have him on the program tomorrow. I'm going to ask him about his healthcare vision. Hey, Senator -- we wish you good luck as we wish all the candidates and we appreciate you taking the time. We will see you down the road, ok?</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Very good. Thank you -- Bill. God bless.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Ted Cruz on his campaign ahead of the Iowa caucuses", "description": "GOP presidential hopeful sounds off on his competition and the polls on 'The O'Reilly Factor'", "date": "2016-01-27T13:22:30Z"}