{"vcmId": "55c0c24e-43c1-4178-b5bc-3d9023bdbc16", "url": "http://www.foxnews.com/transcript/2014/12/04/bill-oreilly-another-grand-jury-declines-to-prosecute-police-officer-who-killed.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>On July 17th, New York City police confronted 43-year-old Eric Garner in Staten Island. Garner, a low level street dealer of illegal cigarettes, was not happy to see the police.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>GARNER: </b>Everybody standing here. I didn't do nothing. I did not sell nothing. Every time you see me, you want to harass me and stop me, talking about I'm selling cigarettes. I'm minding my business, officer. I'm minding my business. Just please, leave me alone. I told you the last time. Please leave me alone.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The officers wanted to place handcuffs on Mr. Gardner who and the officers were initially cautious. But when they moved in, the worst happened.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>POLICE OFFICER:</b> Hold on.</p>                \n                \r\n\n            \n                <p><b>GARNER:</b> Don't touch me.</p>                \n                \r\n\n            \n                <p><b>(EXPLETIVE DELETED)</b></p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>GARNER:</b> Do not touch me.</p>                \n                \r\n\n            \n                <p><b>(EXPLETIVE DELETED).</b></p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Damn, man.</p>                \n                \r\n\n            \n                <p><b>POLICE OFFICER:</b> Put your hands behind your back.</p>                \n                \r\n\n            \n                <p><b>GARNER: </b>I can't breathe. I can't breathe.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Gardner died at a hospital a short time later. The medical examiner calling his death a homicide. Thus, the grand jury.</p>                \n                \r\n\n            \n                <p>Mr. Garner had a record, mostly nonviolent offenses, was out on bail at the time of the confrontation. New York City police policy is that chokeholds are not allowed, and Mayor Bill De Blasio is clearly on the side of the Garner family. We'll get to that situation, which is volatile in the next segment.</p>                \n                \r\n\n            \n                <p>Now, the officer who used the hold, Daniel Pantaleo, was called before the grand jury and testified for two hours. He's now are free and clear of any local and state charges. But the feds say they will investigate the case.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" does not know what happened, and until we read the grand jury transcripts, which are sealed right now, nobody can know.</p>                \n                \r\n\n            \n                <p>But that does not stop some agitators from stirring up controversy. However, however, I will say that upon seeing the video that you just saw hearing Mr. Garner say he could not breathe. I was extremely troubled. I would have loosened my grip. I desperately wish the officer auto would have done that.</p>                \n                \r\n\n            \n                <p>Eric Garner was obese. He had asthma. He was no condition to absorb what befell him.</p>                \n                \r\n\n            \n                <p>Yes, he should not have resisted, but all Americans, every one of us should pity Mr. Garner and his family. He did not deserve what happened to him.</p>                \n                \r\n\n            \n                <p>And I think Officer Pantaleo and every other American police officer, everyone, would agree with me. He didn't deserve that. That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Another grand jury declines to prosecute a police officer who killed an African-American", "description": "Talking Points 12/3", "date": "2014-12-04T13:12:09Z"}