{"vcmId": "55fd9fae-3a15-4f52-8e0b-7ed4a6833677", "url": "http://www.foxnews.com/transcript/2016/04/12/donald-trump-on-winning-over-voters.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 11, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> In the \"Impact Segment\" tonight, winning over the voters both Donald Trump and Hillary Clinton who lead their respective parties in the primary voting have very high unfavorable ratings according to all the polls. Mrs. Clinton in the mid-50's, Mr. Trump in the mid-60's. So, how will the candidates turn that around?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Joining us now from his New York City headquarters is Mr. Trump. So, if do you secure the nomination, then you have to win over about 63 million Americans to vote for you in order to get the presidency. Are you going to change your political style?</p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL CANDIDATE:</b> Well, it's possible it will change a little bit, Bill. You know, we started off with 17 people. Sixteen of which were, you know, shooting at me. And they are almost all gone right now. And, you know, when you are hit by 16 different people that are accomplished people, senators and governors and, you know, very, very smart people like Ben Carson who endorsed me by the way a great guy. And you know, they are all going after you.</p>                \n                \r\n\n            \n                <p>You probably don't come off looking so good because you come after them much harder than they went after you. So I think so. You know, Ronald Reagan had very, very high unfavorables. And his favorable rating was at 30. And Jimmy Carter was I think 19 points, or 20 points ahead of him. And he ended up winning by six points. So, I think it's going to be very similar. I think -- it can focus on Hillary.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. You know from --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I think we are going to do great.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know from reading \"Killing Reagan\" that he and you were not in the same universe as far as personality is concerned. Ronald Reagan was probably the least confrontational guy in the country. You are very confrontational guy. So, what I'm trying to get at is this. Nobody knows what's going to happen at the convention in Cleveland. It's going to be a mess. It's just going to be a mess. But, if do you get the nomination, then your supporters are used to you, Donald Trump, the confrontational guy takes no guff from anybody. In order to get those unfavorable down, you will going to have to be the softer, kindler Trump. I don't know if you can do that. I don't know if you can.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, I think I am a softer, kindler person if you want to know the truth, Bill. Again, you know, this has been a very strong competition. If Jeb Bush was supposed to win and I hit him hard and I won and, you know, Walker was supposed to win. They were all supposed to win and they are all gone. And, you know, to be honest I think I will get along with people and I think I will be a unifier including for the party and we hope to get there some time prior to the convention. So that the convention can actually be a unification project if you want to know the truth.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It's going to be very difficult to do that.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, the Republicans need that. Well, you know, I'm leaving right now, Bill. I'm leaving for Albany right after this. And we have 20,000 people in Albany. Yesterday we had 17,000 people --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. Yes. I think you will win New York.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>-- in Rochester, New York.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. I think you win New York pretty handily.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Doing well.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But then you have to go out west again and it's a tougher territory for you out there. Now, the minorities, let's talk about the minorities. I defended you against Tavis Smiley last week. And I did it because I know you better than Tavis Smiley knows you. I don't even know if you know him.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: He doesn't know me at all.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Bill, I have never met him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Smiley brought in the fact that you were this racial arsonist. That's what he used. And I said, look, I have known the guy for 30 years and I have never seen any of that and you have got to give me an example and he really couldn't. But that's the perception in the African-American precincts that you are a racial guy you don't like them. Is there a strategy that you have or your staff has to negate that?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, I don't think it is the perception actually, Bill. I have tremendous numbers of African-Americans that work for me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, but the polls say --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I'm going to bring jobs back to the country. I don't think it's the perception at all I just don't. I think we are going to do fantastic with African-Americans and Hispanics.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What's your message to them? What's your message to African- Americans?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> My message is, I'm going to bring jobs back. My message is bringing jobs back to the country and they will going to have jobs. Because right now we don't have jobs. China has the jobs. Mexico has the jobs. Japan has the jobs. Everybody has the jobs. We don't have the jobs. The jobs have been taken out of the United States like we're a bunch of babies --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. So, it's an economic play. But what about the grievance industry ran by your friend Al Sharpton where, you know, not only do you have to bring prosperity to all Americans, not just Blacks, but we owe them. We owe the African-Americans because of the historical atrocities that they have had to live through, their families, their ancestors, how are you going to deal with that?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, I think we are going to do fine. Again, I think that --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What are you going to tell them what that comes up?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: You will going to start to see it, I'm telling you, it's an economic message. If you look at President Obama, he has been a president for almost eight years. Will be eight years. You have with black youth, with African-American youth, you have a 59 percent unemployment with people of prime age, it's much higher than --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But how are you going to get jobs for them? Many of them are ill-educated and have tattoos on their foreheads and, you know, how are you going -- and I hate to be generalized about it but it's true. If you look at all the educational statistics, how are you going to give jobs to people who aren't qualified for jobs?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: We're going to bring jobs back. We're going to have Apple computers made in this country. Not just --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But you have to have skills to make Apple computers and the educational system --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>What?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> We will get the skills. We will develop the skills. We have incredible population. And they don't have the jobs. Our good jobs are going to China.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: We all know that. But it's more challenging --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: They are going to Mexico every day. Well, wait a minute, Carrier and Nabisco and Ford and every company you can name, they are building in Mexico. They are not here because we have politicians that don't know what they're doing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I got it.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> They don't know what they're doing --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But it's more challenging in the African-American -- look, when we drive up to Yankee Stadium, we go through Harlem, alright? It's more challenging for a poor child in Harlem without parental guidance in a school that's falling apart than it is for some white kid out in garden city, all right? And you say you can bring jobs back. But, you know, if the kid isn't qualified to do the job and can't do the work. I mean, you have got to get into the infrastructure of the African-American community. Do you have any plan to do that?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, it is true. And it's about education. But it's also about spirit. A lot of people don't have spirit. Not only African-Americans, they don't have spirit in our country. I mean, I can tell you, plenty of white people that go to college, they borrow a lot of money, they get out and they can't get a job. The single biggest question I get it from young kids that are in colleges because I see them all over and they want to talk to me and I say what is it? And I said, before you even talk, I will tell you, you are borrowed up to the hilt and now you have graduated, you have done well in college, you can't get a job. They said, Mr. Trump, how did you know? It's a real problem that we have in this country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> We don't have jobs anymore. Our manufacturing is going to be gone if we keep it up. I mean, look at the numbers. Look at the recent numbers of manufacturing in the United States? It's going to be gone.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's all going to the service and high tech. Okay. I have to hold you over. I want you --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: We don't have spirit in this country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I want you to react to the media. You know what happened with the Boston Globe, we will discuss that. And we appreciate you coming on.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump on winning over voters", "description": "Can he turn his unfavorable numbers around? The GOP frontrunner weighs in on 'The O'Reilly Factor'", "date": "2016-04-12T12:18:05Z"}