{"vcmId": "5693344a-283c-48c8-9014-4628b1dedc13", "url": "http://www.foxnews.com/transcript/2016/05/03/what-do-donald-trump-and-barack-obama-have-in-common.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" May 2, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Personal Story\" segment tonight. Although both parties will feel aggrieved, President Obama and Donald Trump do have something in common. And that is their ability to market themselves.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>PRES. BARACK OBAMA (D), UNITED STATES: </b>Ted had a tough week. He went to Indiana. Hoosier country. Stood on a basketball court.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>And called the hoop a basketball ring. What else is in his lexicon? Baseball sticks.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>Football hats. But, sure, I'm the foreign one.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL CANDIDATE</b>: I built a great, great company. I built an amazing company. And, frankly, with some of the great assets of the world, very little leverage, very little debt. Tremendous cash flow. Some of the great assets of the world, Bill. And, you know, I'm very proud of it.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Joining us now from Washington is Charles Krauthammer. So the marketing aspect of Mr. Obama and Mr. Trump's political success is amazing. Do you agree?</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, SYNDICATED COLUMNIST</b>: Well, I'm sure their marketing is very good. But that's not what gets you the presidency. It has to be that you are the right man for the moment. And that you sort of get what's in the air. Obama understood in 2008 the country was looking for change after eight years. War weary, had the financial crisis. They wanted a smart guy, stable. Very cool. Emotionally. And he carried it all the way. He was unknown coming out of nowhere. But he had the personality. He had the moment. And he played it right.</p>                \n                \r\n\n            \n                <p>I think that Trump also understood the moment, that was the antiestablishment fear furor and in many ways resentment. He played it to the hilt. He denigrated all the other candidates. And I think one of the reasons that Cruz seems to be falling apart in Indiana is because he has been labeled. He ran as the insurgent and then all of the sudden after Wisconsin he goes around taking delegates which is okay according to the rules and Trump says this thing is fixed. Cruz is working under the rules of the establishment. And Cruz lost his status as the other insurgent.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: As the outsider. But you have got to -- don't have to but President Obama markets himself. The reason I showed that clip is because there isn't a better guy professional comedian, actor, whatever, to deliver lines the way he does. I mean, his time is impeccable. His facial expressions are appropriate. But it is all about him. He is marketing himself as he gives this speech, it's not about like when Bush gave his speech, Bush speech were funny. Bush the younger. They were funny.</p>                \n                \r\n\n            \n                <p>He wasn't marketing himself. He was just throwing the lines out. So, Obama I'm the foreigner. You know, just like okay. It always comes back. The same thing with Trump always comes back to Trump no matter what question you ask him. The answer is going to come back to him and what he has accomplished. And both of them are brilliant marketers. You don't cut through the fog in the crowd like they did without that.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Well, another way of saying it communicators. You know what Ted Kennedy said in 1988 about Reagan. He said yes, he was a great communicator, but he had something to communicate. That was a real concession to the substance behind Reagan. You know, Reagan was an actor, he knew how to deal with cameras. He had all the timing and he did that very well. When he said to Carter in the debate in 1980, there you go again. The election was over. A phrase that he hadn't obviously practiced but he was ready.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: He was ready. But he wasn't -- Reagan wasn't marketing himself. He was marketing an ideology. Obama and Trump market themselves.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Well, I think that is kind of the testament to the decline over politics. I mean, Reagan did represent an ideology. And I think it was a more coherent political system that we lived in when we actually had choices. I'm not sure it's healthy for democracy to go from an Obama who is a personality. I mean, I think it was McCain who said in the 2008 election he is the most famous man on earth. The biggest celebrity but what we need is a president. It looks like celebrity now trumps everything. And if you know how to play the role. Obviously Trump had practiced on television very successful reality show for 14 years or if you know how to do Obama out of extinct. Then you extremely succeed.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Absolutely.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: But you have to be in sync with --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You do. You have to be in sync with what the voters want.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But the brilliance of both men in their marketing abilities, I don't think has been matched in this country ever.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Thank you for the translation from the German.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i><br> &#160;</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "What do Donald Trump and Barack Obama have in common?", "description": "Charles Krauthammer analyzes the how the President and GOP frontrunner market themselves on 'The O'Reilly Factor'", "date": "2016-05-03T19:07:44Z"}