{"vcmId": "57ee0c52-b3b0-4aec-845c-7e605896c661", "url": "http://www.foxnews.com/transcript/2015/11/05/bill-oreilly-harry-reid-kills-kate-law-at-least-for-now.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>In a shocking move today in the Senate, Democrat Harry Reid refused to allow a vote on Kate's Law. As you may know, that proposed legislation would mandate a five-year federal prison term for any illegal foreign national convicted of an aggravated felony here in the U.S.A. who then returns after being deported.</p>                \n                \r\n\n            \n                <p>The majority of Americans support the bill because it is the right and moral thing to do. Recent Rasmussen poll asked 1,000 likely voters about Kate's Law -- 56 percent favor, just 27 percent oppose, the rest don't know anything.</p>                \n                \r\n\n            \n                <p>Now, you will remember 32-year-old Kate Steinle shot dead by an illegal alien last summer, who had seven felony convictions in the U.S.A. and had been deported five times. He came back six times. He was released from jail and protected from the feds by the sanctuary city of San Francisco.</p>                \n                \r\n\n            \n                <p>This morning Senator Ted Cruz, a hero on Kate's Law, again introduced the stand-alone bill in the Senate.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. TED CRUZ (R-TX), PRESIDENTIAL CANDIDATE:</b> I will note that Bill O'Reilly has been tremendous, calling over and over again on leaders of this body simply to pass Kate's Law. This is not a partisan issue. At least it shouldn't be.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But it is. In order for the bill to pass there could be no objection by any senator. Quickly Harry Reid objected.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. HARRY REID (D-NV), MINORITY LEADER</b>: The new mandatory minimum sentence this bill would create would have a crippling financial effect. This is yet another attack on the immigrant community.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Mr. Reid is a liar and a villain. This has nothing to do with the so-called immigrant community. This is about fixing a corrupt criminal situation.</p>                \n                \r\n\n            \n                <p>As far as cost is concerned, Reid has voted for trillions of dollars in government spending. His objection to Kate's Law is a cynical joke.</p>                \n                \r\n\n            \n                <p>Reid well understands that violent foreign thugs defy deportation all the time but Harry Reid does not care and has shamed himself and insulted the Steinle family by blocking a vote on Kate's Law. That's unacceptable because the senate would pass the law. So would the House and then President Obama would have to sign it.</p>                \n                \r\n\n            \n                <p>But Reid does not wanted the bill to get to the President's desk because apparently Mr. Obama doesn't want to sign Kate's Law. If the President did want to sign it he would say so would not and Reid would never go against Barack Obama. So ultimately the President of the United States could make Kate's Law happen. In fact, he could do so by executive order tonight.</p>                \n                \r\n\n            \n                <p>So we call upon President Obama to issue executive order mandating that Kate's Law take effect. If you care at all about justice, Mr. President, you will get Kate's Law done -- if you care at all about justice.</p>                \n                \r\n\n            \n                <p>Senate majority leader Mitch McConnell tells us that he will put Kate's Law up for a vote shortly that Reid can't block. But the country needs six Democrat senators to support the law, just six. Assuming all the Republicans support it and that means you, Rand Paul.</p>                \n                \r\n\n            \n                <p>And a personal note to you, Senator Reid, if you think this is over, you're nuts. We are going to hold you accountable -- you, personally.</p>                \n                \r\n\n            \n                <p>Finally, there was some good news on the Kate's Law front today. The despicable sheriff of San Francisco County Ross Mirkarimi was humiliated in an election last night. He is out. Good. He is another corrupt individual who refused to enforce federal law allowing Kate's alleged killer to be released from jail.</p>                \n                \r\n\n            \n                <p>We will have more on the entire situation tomorrow.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Harry Reid kills Kate's Law, at least for now", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/4", "date": "2015-11-05T13:33:18Z"}