{"vcmId": "592fac83-9a65-472a-b3da-6eb028a2b54b", "url": "http://www.foxnews.com/transcript/2014/10/24/bill-oreilly-more-isis-inspired-terrorist.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>32-year-old Michael Zehaf-Bibeau committed a terrorist act yesterday in Ottawa, Canada. He murdered a Canadian soldier and wounded three other people for absolutely no reason at all. Bibeau was shot dead for his trouble. That happened just two days after 25-year-old Martin Rouleau murdered another Canadian soldier running him down with his car. Mr. Rouleau was also shot dead by police. Both men were Muslim converts and authorities say devotees of the ISIS terror group.</p>                \n                \r\n\n            \n                <p>So now we have Canada, a relatively benign country, under assault by Muslim terrorists. This is obviously unsettling especially to people who do not want Islamic terrorism to be a topic of conversation. We all know President Obama has gone out of his way in the past to deemphasize Jihadist activity. Right now the USA and the world is doing the bare minimum against ISIS when the world should be crushing that barbaric group.</p>                \n                \r\n\n            \n                <p>Also the good Muslim controversy continues to rage. Actor Ben Affleck epitomized that when he became offended that verbal bomb thrower Bill Maher was condemning Muslims in general. In the liberal community there is sympathy for good Muslims.</p>                \n                \r\n\n            \n                <p>But right now we need some perspectives. Every sane person knows not all believers of Islam are violent people. I've been to many Muslim countries and never had a problem. However there are millions -- millions of Muslims who believe that harming non-Muslims is acceptable behavior and many of those people will commit violence themselves. That's a lot of folks and Muslim terrorism is now the world's number one problem. That's the hard truth.</p>                \n                \r\n\n            \n                <p>President Obama does not want to deal with the problem. Neither do other nations, with the exception of Israel which itself is directly threatened by fanatical Muslims. So the question becomes what will it take to wake up the world? To answer that question you have to have a scenario of a weapon of mass destruction used by Muslim terrorists which may of course happen.</p>                \n                \r\n\n            \n                <p>ISIS should have been crushed a long time ago. If NATO and the rest of the world will join together that could happen quickly. But it is not happening and the 60 nation coalition that President Obama touts is a farce, it is doing nothing. So we can expect more Muslim killers like those in Canada to cause destruction almost everywhere. This is not going to stop until the world, the entire world, unites against terrorism, generated by Muslims.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: More ISIS-inspired terrorist", "description": "Talking Points 10/23", "date": "2014-10-24T12:07:26Z"}