{"vcmId": "5ba190b0-eef0-497a-90f6-e44fddea9207", "url": "http://www.foxnews.com/transcript/2016/09/28/bill-oreilly-no-spin-analysis-last-night-presidential-debate.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Please keep in mind many folks only hear what they want to hear. And that's why most of the post-debate comments last night were a colossal waste of time. Partisan will never see things for what they are. It will always be what satisfies their agenda. So, many opinions on the debate are subject to rooting interests and to expunge that. You actually have to step back and think, putting aside the small machine attached to your hand.</p>                \n                \r\n\n            \n                <p>Talking Points has done that. And here is my assessment. Neither candidate broke out last night. The American people did not learn very much. Because both candidates stuck to what they have said in the past. There were few challenging questions put forth. Only general queries. Except for the birther and tax return stuff designed to hammer Mr. Trump. Let's begin with demeanor. Very important to Donald Trump. At the start, he was credible, speaking about the need to stimulate the private sector so jobs are created.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Under my plan, I will be reducing taxes tremendously from 35 percent to 15 percent for companies. Small and big businesses. That's going to be a job creator like we haven't seen since Ronald Reagan. It's going to be a beautiful thing to watch.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Strong point by Trump. As growth in America right now is awful. And this country needs an economic jolt. But as the debate wore on, Mr. Trump began to get a bit testy.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: No, no. You are telling the enemy everything you want to do.</p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> No, you are not.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: So, you're telling the enemy everything you want to do. No wonder you have been fighting -- no wonder you have been fighting ISIS your entire adult life.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, that emotional response led to a mistake. ISIS has only been around for a few years. Not a big mistake but it was noted. For her part Secretary Clinton stuck to the progressive script.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON: </b>I have heard from so many of you about the difficult choices you face and the stresses that you are under. So let's have paid family leave, earned sick days. Let's be sure we have affordable child care and debt-free college. How are we going to do it? We are going to do it by having the wealthy pay their fair share and close the corporate loopholes.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That fair share line offends many Americans who are not wealthy. Yes, there are some fat cats who dodge taxes. But this cat, the guy who is talking to you right now, pays an enormous amount of money in taxes. And so do millions of other successful Americans. So, that fair share myth is beyond annoying. Now, it's quite clear that Mrs. Clinton will govern by expanding the federal government. Perhaps even more than President Obama has. As for demeanor, the Secretary seemed somewhat smug, while not speaking. She seems very self-satisfied. A condition that carried over today in North Carolina.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON</b>: Did anybody see that debate last night?</p>                \n                \r\n\n            \n                <p><b>(CHEERS)</b></p>                \n                \r\n\n            \n                <p>Oh, yes. One down, two to go.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: To be fair, politicians must show confidence, but it is wise to avoid the gloating factor. Most -- one of the most, I should say, interesting parts of the debate was the racial aspect framed around stop and frisk.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> We have to bring back law and order. Now, whether or not in a place like Chicago, you do stop and frisk, which worked very well, Mayor Giuliani is here, it worked very well in New York. It brought the crime rate way down.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON</b>: We do always have to make sure we keep people safe. There are the right ways of doing it and then there are ways that are ineffective. Stop and frisk was found to be unconstitutional. And, in part, because it was ineffective.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's not true. Aggressive police monitoring in high crime neighborhoods does, does cut violent crime. Especially where guns are used. But stop and frisk also does alienate some law abiding folks who are subject to intrusion. However, there is no question that permissive local governments run by Democrats have failed dismally in places like Chicago and Baltimore. Mr. Trump missed a big opportunity to ask Mrs. Clinton to repudiate those administrations.</p>                \n                \r\n\n            \n                <p>Trump also missed chances to pin the Secretary down on sanctuary cities, violent protests, disrespect for the anthem, and vouchers to improve poor public school performance by instilling competition. Why Trump did not bring it on those emotional issues, is a mystery. So technically, technically, Hillary Clinton won the debate on points because she was able to keep Trump on the defensive. She used three effective grenades.</p>                \n                \r\n\n            \n                <p>His tax returns, the birther issue, and support for the Iraq war. Moderator Lester Holt helped Mrs. Clinton on the birther deal. Trump made the mistake of over explaining. He should have just shrugged off questions designed to trap him. Refocusing on Secretary Clinton's many ethical problems. But Trump felt the need to defend himself and that hurt him. For example, mentioning someone like Rosie O'Donnell in a presidential debate? Never a good thing. If Donald Trump really wants to be president, he must put frivolities aside.</p>                \n                \r\n\n            \n                <p>Concentrate on three in stone realities. First, that the federal government is hurting the poor and working class by punishing the private sector with crazy regulations and high taxation. Second, that Hillary Clinton's acceptance of Barack Obama's ISIS policy allows those savages to continue their terrorism at will. And, third, that the Democratic Party's embrace of grievance, embrace of grievance is pitting Americans against one another. Demonizing the police and creating an environment where the U.S.A. is portrayed as oppressive not the land of opportunity it really is.</p>                \n                \r\n\n            \n                <p>If Trump would hammer home those three themes, he might distinguish himself in a way that would attract voters currently skeptical of him. For her part, Hillary Clinton needs to stop doing this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> You know, he tried to switch from looks to stamina, but this is a man who has called women pigs, slobs, and dogs. And someone who has said pregnancy is an inconvenience to employers.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Those kinds of attacks, personal attacks diminish the Secretary. Trump would have been within fair decorum to respond with facts about the treatment of women when the Clintons were under siege in the White House. The fact that Mr. Trump did not do that last night is too his credit. Finally, Bret Baier had a wise comment today. He said that if polls continue to build for Trump after that debate, the Clinton campaign will be in serious trouble.</p>                \n                \r\n\n            \n                <p>Already many online surveys are boosting Trump's debate performance, including those from CBS, and \"Time\" magazine. But the truth is, both candidates can do much better. And to win the White House, they will have to. That's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: No spin analysis of last night's presidential debate", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 9/27", "date": "2016-09-28T12:31:30Z"}