{"vcmId": "5ba31e46-a34e-47d0-9b1c-d5339258da74", "url": "http://www.foxnews.com/transcript/2015/06/09/how-should-gop-approach-immigration.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 8, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Personal Story\" segment tonight. New book by Ann Coulter entitled \"Adios America: The Left's Plan To Turn Our Country Into A Third World Hellhole.\" Book documents Ms. Coulter's well known opinion that illegal immigration is changing America in destructive ways. Recent Pew Poll on immigration asks how should undocumented immigrants should be handled. Allowed to stay illegally. Seventy two percent. Should not be allowed to stay, 27 percent. Don't know two percent.</p>                \n                \r\n\n            \n                <p>What it comes to reducing illegal immigration at U.S. borders, do you think there's a lot more the government can? Yes, a lot. Fifty one percent, somewhat more 29, not much more 12. Question tonight, how should the republican presidential nominee handle the illegal immigration issue?</p>                \n                \r\n\n            \n                <p>Here now Miss Coulter. So, you know what I'm getting at here. Mitt Romney got his butt kicked in the Hispanic American precincts less than 30 percent of the vote. President Bush the younger did well and that put him over the top against Al Gore. So, now, what's your advice to the republican nominee?</p>                \n                \r\n\n            \n                <p><b>ANN COULTER, AUTHOR, \"ADIOS AMERICA\": </b>That is a total cliche, completely believed by the Republican Party and it is completely wrong. For one thing correction, not illegal immigration. I'm talking about all immigration.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All immigration?</p>                \n                \r\n\n            \n                <p><b>COULTER:</b> Yes, I am. In that poll you just cited is part of the media's effort to convince Republicans of what you just said which is how Republicans are going to keep losing. The way Republicans win is by driving up the white vote. It is not by women or Hispanics or Blacks. In fact, those groups are going to start fighting among one another.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, you would write off the Hispanic American vote.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>Not write off. But how about for once appealing to your base, the Democrats don't obsess on how do we get gun rights voters to support us? A tiny bit more? How do we get pro-lifers to support us? Let's get a slice of the evangelicals. The Republicans have been tricked to suicidal electoral strategy. If Romney had gotten 71 percent of the Hispanic vote, which, by the way, Bush didn't get. He got, what?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Forty eight.</p>                \n                \r\n\n            \n                <p><b>COULTER:</b> No, it was less than 40. But he didn't get 51. If you are not getting 51 percent, you are losing. And that was turning his entire White House over into an -- operation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. Here is how I see it.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>Wait a second. Wait a second. We'll just finish the Romney thing if he had won -- Romney had won 71 percent of the Hispanic vote he still loses. If he had got four pointers more of the white vote he would have won. What should Republicans be going for?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But do you think that white voters at this point because you may not like the Pew Poll but almost every poll says.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>They're all lying.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What do you mean they're all lying?</p>                \n                \r\n\n            \n                <p><b>COULTER:</b> I would tell you but it would be boring. I describe some of them in my book. These are all deceptive polls. They are not meant to quantify opinion.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How are they deceptive?</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>This one --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>I don't usually the way they do it is you have two options, neither of which exist in the world. Either we are putting illegal aliens in shackles and rounding them up at gunpoint --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. So, the questions are --</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>-- or all these hoops in this particular poll you get some of that, do you want to be a nice person or are you a jerk? But the most important way they did it was by polling all adults. That includes the people polled by Jesse Watters. This is a political question. Likely voters.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. It's not likely voters.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>We don't even want registered voters and they oversampled democrats and the questions were ridiculous. They never take an honest poll.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>If I'm running for president on the republican side here is what I do. You tell me where I'm wrong. Okay? So, I say in Spanish American community there is a big traditional wing among Hispanics, all right? Traditional people. People who would respond.</p>                \n                \r\n\n            \n                <p><b>COULTER:</b> That's a rumor.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Self-reliant, smaller government message. People work hard.</p>                \n                \r\n\n            \n                <p><b>COULTER:</b> No, that's the rumor. We will never going to get 51 percent that way.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm saying there is enough of those people to make it worthwhile for me to outreach.</p>                \n                \r\n\n            \n                <p><b>COULTER: </b>No, no.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You say no.</p>                \n                \r\n\n            \n                <p><b>COULTER:</b> Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He's walk away from the whole crew.</p>                \n                \r\n\n            \n                <p><b>COULTER:</b> That's what Reagan did and he won the biggest landslide in history. He got the smallest black vote of any president between LBJ and Obama. That is amazing anyone. And he won the largest electoral landslide in history.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Back then the Hispanics weren't as powerful.</p>                \n                \r\n\n            \n                <p><b>COULTER:</b> Not Hispanics. He was ignoring the only vote that counted the black vote.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Ann Coulter everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "How should the GOP approach immigration?", "description": "Ann Coulter on how the Republican Party can win the White House in 2016", "date": "2015-06-09T12:19:33Z"}