{"vcmId": "5bcadbbe-142c-4900-a6c5-d691fc35de29", "url": "http://www.foxnews.com/transcript/2016/01/21/bill-oreilly-building-up-bernie.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>There have been a number of articles saying that Senator Sanders no longer a fringe candidate but a real threat to Hillary Clinton. That's because the new Des Moines Register poll has Sanders only two points behind Hillary Clinton in Iowa. And the Real Clear Politics average has him just 13 points behind nationally. Finally in New Hampshire the Real Clear average has Sanders up by 11 points over Hillary Clinton.</p>                \n                \r\n\n            \n                <p>In just a few moments Ed Henry will analyze why Mrs. Clinton's campaign is tottering but I can tell you why Sanders is gaining some momentum.</p>                \n                \r\n\n            \n                <p>And by the way, \"Talking Points\" does not come to bury Sanders but to praise him -- kind of.</p>                \n                \r\n\n            \n                <p>In contrast to Mrs. Clinton, the senator is energetic, appears to be honest and is not the usual phony politician. The problem is Old Bernie 74, really is a hard core socialist.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SANDERS: </b>Democratic socialism means that we must reform a political system which is corrupt, that we must create an economy that works for all not just the very wealthy.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That doesn't sound too bad but here are the facts. According to analysis by the \"Wall Street Journal\", Sanders backs at least $18 trillion in new spending, federal spending over the next decade -- catastrophic because the nation already has a $19 trillion debt.</p>                \n                \r\n\n            \n                <p>According to analysis by the conservative \"Washington Examiner\" Sanders also wants to raise taxes in America by $20 trillion over ten years.</p>                \n                \r\n\n            \n                <p>As we pointed out Monday, if Sanders begins taxing American corporations more, many of them will simply leave the country taking thousands of jobs with them. Remember, the U.S.A. already has the highest corporate tax rate in the developed world.</p>                \n                \r\n\n            \n                <p>Sanders says he will close many tax loopholes and that's fine. But it all comes back to one thing. The more money you take away from individuals, the less they spend in the marketplace. The more money you take away from companies, the less they hire and the less research they will do.</p>                \n                \r\n\n            \n                <p>The goal of socialism is to basically flatten out the economy so everybody is pretty much same. Look as we said on Monday, if Sanders were elected president he'd never get this stuff passed in Congress but he could do a lot of damage by executive order alone.</p>                \n                \r\n\n            \n                <p>There's no way the Feds can run the economy and that's what Bernie wants. Now, why are millions of Americans buying into that? Two basic reasons. Some have no clue what Senator Sanders really stands for. They don't know anything about socialism or about him.</p>                \n                \r\n\n            \n                <p>For example, Bernie Sanders has been in the senate for 9 years. In that time, only one, one significant bill with his name on it has passed -- revamping the Department of Veterans Affairs. Before that he was in the House of Representatives for 16 years. The highlight of all those years was his brokering a deal with his pals in Venezuela to import heating oil to America. So you can see Mr. Sanders not exactly a major player in Congress for 25 years.</p>                \n                \r\n\n            \n                <p>But again, he is honest. And he is not afraid to say what he believes.</p>                \n                \r\n\n            \n                <p>Now, there is no question that the liberal mainstream media is getting very nervous about Hillary Clinton. It seems almost every day there is a new revelation about her ethical dilemmas, plural, dilemmas.</p>                \n                \r\n\n            \n                <p>On the campaign trail she is less than inspiring, trying to run as a continuation of Barack Obama. When many voters understand, especially with the stock market melting down that Mr. Obama's economic policies have not exactly strengthened America. The propaganda says Mr. Obama saved us from depression. But take a look at where we are.</p>                \n                \r\n\n            \n                <p>Your investments are getting hammered. Salaries are low for workers and the future, at least this year, very bleak. When stocks blow up, all of us get hurt. Do you understand that, Bernie? Do you understand that, Barack?</p>                \n                \r\n\n            \n                <p>So Hillary Clinton running on more Obama policy is folly and Sanders knows it. One more thing: if the senator does win the Democratic nomination, still not likely, that would be a GOP Dream. America will never go socialist.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Building up Bernie", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/20", "date": "2016-01-21T13:35:44Z"}