{"vcmId": "5c15b27d-9789-46aa-9442-1e524764cc8c", "url": "http://www.foxnews.com/transcript/2015/07/22/carly-fiorina-enters-no-spin-zone.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" July 21, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Personal Story\" segment tonight, the war on American women true or fabricated. It looks like Hillary Clinton will reprise the war on women concept that President Obama used in the last election.</p>                \n                \r\n\n            \n                <p>With us now Carly Fiorina, republican presidential contender. Let's get right to the Planned Parenthood thing. It's pretty outrageous. And I think Hillary Clinton is going to have to step up and say something.</p>                \n                \r\n\n            \n                <p><b>CARLY FIORINA (R), 2016 PRESIDENTIAL CANDIDATE: </b>Well, she hasn't said a word.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, nothing.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> You talk about a war on women. I mean, think about this, Democrats like Hillary Clinton, have argued against giving women a chance to look at an ultrasound before they have an abortion, but they are prepared to use ultrasound to figure out figure out how to best preserve the body parts of an unborn child that they have convinced women is not a life at all.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> The depravity is just unspeakable. And Hillary Clinton hasn't said a word.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. Now, if you go after Planned Parenthood, try to shut them down or defund them then you are declaring a war on women according to the liberal precincts. How would you answer that?</p>                \n                \r\n\n            \n                <p><b>FIORINA: </b>Well, you know, if that's really what they believe, then --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Look, they believe it, because how else could you operate that way -- look, unfettered abortion up to the moment that the baby.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> Yes. It's not a life until it leaves the hospital, that's their policy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right. Right.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> So, if they are not prepared to defund Planned Parenthood I don't know how you justify taxpayer funding for this kind of activity anymore. But I would ask the question of Hillary Clinton more fine and why don't you support an equal amount of federal funding for pregnancy centers for example so that -- right next to a Planned Parenthood. So, that a woman actually has some information about the options in front of her.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. Adoption and things like that.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> Exactly. But they don't do that either.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, because it's all politics and now the politics is going into body parts selling.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> Well, its identity politics which is even worse.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you believe that American women in general are not treated the same way men are in the workplace?</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> Well, I think there is some evidence of that. But I don't believe look, if you create a meritocracy, a real meritocracy where you pay for performance, pay for merit instead of say, time and grade and how long have you been there or what you look like. Then you are going to have an equal pay environment and of course, Democrats don't like that. They like seniority systems. That's what unions do. It's what federal government bureaucracies do. If you will give a woman the opportunity to contribute, then you'll have an environment that not only works better but that provides equality of women not all environmental because of that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But sometimes because of biology, women take time off from work to raise children.</p>                \n                \r\n\n            \n                <p><b>FIORINA: </b>Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Their priorities are different.</p>                \n                \r\n\n            \n                <p><b>FIORINA: </b>That's right. And that's why a seniority system disadvantages women.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. But my point is this. I think that in this country, particularly in the media, women have just as much chance to succeed as men here in where -- in my business.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> In your world.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't see it and I guess it's the same in Wal-Mart, if you are good, the Wal-Mart people it doesn't care whether you are a man or a woman unless there is some idiot in charge. But overall in our society, I think women in America do have equal opportunity. Am I wrong?</p>                \n                \r\n\n            \n                <p><b>FIORINA: </b>There is no question that women in America have more opportunity than anywhere else in the world. There is no question. I mean, I started out as a secretary. And I had the chance to become the chief executive officer of the largest technology company in the world and now I'm running for president. That's only possible in this country. It's also true that women are half the nation. And so women are half the potential of this nation. And if you look at the burdens of poverty, for example, it falls most heavily on women, if you look at the fact that women sometimes do leave the workforce for a time, when you have seniority systems that pay for time and grave, that disadvantages women.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, it does. But remember the poverty on women is driven by having children out of wedlock with no father and no provider there. Now, I have got to ask you about Kate's law. We didn't have you in the mosaic because I knew I was going to talk to you and you could tell the folks, you know, straight on, do you support Kate's law?</p>                \n                \r\n\n            \n                <p><b>FIORINA: </b>I do. Here's what I worry about though, Bill. We have seen this for how long, sanctuary cities have been around for 15 years.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You have got to get rid of them.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> The border has been insecure for 25 years. Politicians are great at giving speeches and they are great at passing laws. What they are not great at is challenging the status quo so something actually gets fixed.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ms. Fiorina, I have been doing this for 20 years. You have got to stair step it to get anything done. You can't do the whole package at once.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> Oh, I agree with you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> First you stop the violent felons from coming in here. Then you punish the sanctuary cities. Then a new president is going to have to secure the border. Because this president will not. He absolutely will not do it, no matter what Congress says.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> I'm not disagreeing with you at all. My problem is this, I think people are frustrated because professional politicians talk about reforming the V.A., securing the border. Passing laws.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And they don't do anything.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> And they don't do anything.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. That's how Trump has ignited his campaign.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> And that's why people listen when I go out and campaign, and I say I have a track record of leadership and producing results.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. I feel sorry for you the only lady and all these other guys are going to be sweating in those debates but we appreciate it.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> You know, I have been competing against men all my life.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And you do --</p>                \n                \r\n\n            \n                <p><b>FIORINA: </b>And I look forward to debating Hillary Clinton. Wouldn't that be fun to watch?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That would be a blast.</p>                \n                \r\n\n            \n                <p><b>FIORINA: </b>Wouldn't that be fun to watch?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And we appreciate you coming in. Good luck on the campaign.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Carly Fiorina enters the 'No Spin Zone'", "description": "Republican presidential contender on whether American women are being treated equally", "date": "2015-07-22T12:17:15Z"}