{"vcmId": "5c28341b-b6e7-458f-b9e4-e4cfe34e57b2", "url": "http://www.foxnews.com/transcript/2016/06/03/bill-oreilly-can-hillary-clinton-protect-us-from-villains-overseas.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>In San Diego this afternoon, Secretary Clinton laid out her foreign policy vision, much of it attacking Donald Trump as a primary enemy of the state.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> Donald Trump's ideas aren't just different, they are dangerously incoherent. They are not even really ideas. Just a series of bizarre rants.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>Personal feuds and outright lies.</p>                \n                \r\n\n            \n                <p><b>(CHEERS AND APPLAUSE)</b></p>                \n                \r\n\n            \n                <p>This is not someone who should ever have the nuclear codes because it's not hard to imagine Donald Trump leading us into a war just because somebody got under his very thin skin.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, on Monday, Mr. Trump will be here and I'm going to give him one free shot at Mrs. Clinton for running that sound bite. He will get 30 seconds. That sound bite ran 30 seconds. But I had to do it because much of Hillary Clinton's foreign policy speech today concentrated on Trump. A few times she veered off into other territory like ISIS.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> We need to take out their strongholds in Iraq and Syria by intensifying the air campaign and stepping up our support for Arab and Kurdish forces on the ground.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Same policy as Mr. Obama. Contain ISIS using air power and weak allied forces on the ground which can't possibly defeat the vicious terror group. It's impossible. They can't do it. There comes a point when American voters must recognize that policies, depending on foreign cooperation, rarely work. If we want ISIS defeated, we're going to have to lead the way. If we don't, the savages will continue to murder people consistently. Secretary Clinton also briefly discussed Putin and China. But, again, brought it back to Trump.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON</b>: Now Moscow and Beijing are deeply envious of our alliances around the world because they have nothing to match them. They would love for us to elect a president who would jeopardize that source of strength. If Donald gets his way, they will be celebrating in the kremlin. We cannot let that happen.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So today's foreign policy speech was not really that. It was an attempt to whip up anti-Trump feeling in California which the Clinton campaign believes will mobilize voters to choose her over Bernie Sanders next Tuesday. Hillary Clinton knows the world. No question about that. But so far I'm not seeing many innovative foreign policy pronouncements. She wants to run on what President Obama has done, fine. And voters will determine the wisdom of that approach. But, if Secretary Clinton has any new ideas, they are still being kept top secret. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Can Hillary Clinton protect us from villains overseas?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 6/2", "date": "2016-06-03T12:16:55Z"}