{"vcmId": "5c64750f-5012-4a1e-97dc-7f51cfc43dbe", "url": "http://www.foxnews.com/transcript/2016/07/27/bill-oreilly-countering-donald-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It's clear this convention is designed to portray Mr. Trump who will join us in just a few moments, as a man unworthy of political office. To me that's kind of a waste of time. Everybody knows Mr. Trump even the dimmest among us can formulate an opinion on his worthiness. What is important, however, is how the Democratic leadership is positioning the party. Last night, Michelle Obama said this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MICHELLE OBAMA, U.S. FIRST LADY</b>: That is the story of this country, the story that has brought me to the stage tonight. The story of generations of people who felt the lash of bondage, the shame of servitude, the sting of segregation but who kept on striving and hoping and doing what needed to be done so that today I wake up every morning in a house that was built by slaves. Don't let anyone ever tell you that this country isn't great. That somehow we need to make it great again.</p>                \n                \r\n\n            \n                <p><b>(CHEERS AND APPLAUSE)</b></p>                \n                \r\n\n            \n                <p>Because this right now is the greatest country on earth.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The First Lady directly repudiating the Republican mantra that the U.S. is in decline. By the way, I will deal with Mrs. Obama's slave White House analysis in the tip of the day later on. Senator Elizabeth Warren also spoke last night she had little to say other than Trump is bad and Hillary is good. Senator Warren continues to like socialism as well. But not as much as Bernie Sanders. A socialist standard bearer who is a bit disappointed the way the whole thing turned out.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. BERNIE SANDERS (I), VERMONT:</b> I understand that many people here in this convention hall and around the country are disappointed about the final results of the nominating process. I think it's fair to say that no one is more disappointed than I am. But to all of our supporters here and around the country, I hope you take enormous pride in the historical accomplishments we have achieved.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Talking Points is not quite sure what historical accomplishments have been achieved. But it is kind of stunning that about 43 percent of Democratic primary voters want a socialist in the White House. Again, that's not an accomplishment. That is a mystery. To be sure, Bernie Sanders is not a phony, he is a feisty, honest guy, but he would absolutely take over the private economy if he were president. Telling each and every American what they can earn, what they can keep.</p>                \n                \r\n\n            \n                <p>Anyway, Bernie Sanders history for the moment. And Hillary Clinton has received her party's nomination for president. The first American woman in history to do so. Like her or not, that is an accomplishment. But whether she can effectively counter Donald Trump is all that matters right now. And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Countering Donald Trump", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 7/26", "date": "2016-07-27T19:12:59Z"}