{"vcmId": "5e15e730-a611-4242-983d-df23243df24f", "url": "http://www.foxnews.com/transcript/2015/10/09/bill-oreilly-will-kate-law-ever-get-passed.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As you may know &#8216;The Factor&#8217; has taken the lead in trying to convince Congress and President Obama to pass Kate's Law after 32-year-old Kate Steinle was shot dead by an illegal alien felon who had been deported five times.</p>                \n                \r\n\n            \n                <p>Kate's Law would punish illegal alien criminals with aggravated felony convictions on their sheet, who would then come back to America after being deported. They would receive a mandatory five-year sentence in prison.</p>                \n                \r\n\n            \n                <p>Now the law is very simple. If you're an aggravated felon, you defy deportation you go to prison the moment you're caught here. But passing it is anything but simple.</p>                \n                \r\n\n            \n                <p>Later this month, Senator Mitch McConnell, the majority leader will introduce a bill on the Senate floor that contains Kate's Law. But here is the problem. It also contains a provision to take money away from sanctuary city. Same law -- they're coupled, twin. That dooms it because Democrats will filibuster in the Senate and a full vote will likely never take place. Everybody in the Senate knows that.</p>                \n                \r\n\n            \n                <p>So the American people, including Kate Steinle's family will not get the justice that Kate's Law demands. Now, I have spoken to many senators asking why Kate's Law cannot have a stand-alone vote. There are a variety of excuses but bottom line it's more about party politics than protecting the folks.</p>                \n                \r\n\n            \n                <p>For the record, Senator McConnell would not take my call. Neither would Senator Dianne Feinstein -- a leading Democrat. Those two Americans could make Kate's Law a reality if they have the will. McConnell and Feinstein are the folks we must persuade; we, the people, must persuade them if you can believe it.</p>                \n                \r\n\n            \n                <p>So you may want to contact their offices and tell them that Kate's Law deserves a stand-alone vote. We posted their information on BillOReilly.com please let them hear from you loud and clear.</p>                \n                \r\n\n            \n                <p>Now, I support defunding sanctuary cities but I know the Democrats will not do it and President Obama will not sign it.</p>                \n                \r\n\n            \n                <p>But Kate's Law is a far different story. Any politician opposing strict penalties for foreign felons who defy deportation is unfit to hold office -- unfit to hold office. You can't defend voting against that.</p>                \n                \r\n\n            \n                <p>Today, House Republicans are dealing with chaos as the new Speaker of the House situation devolves into uncertainty. But the American public is fed up with Congress getting so little done.</p>                \n                \r\n\n            \n                <p>If Congress can't even pass a simple piece of legislation that would protect innocent Americans from harm and give law enforcement a powerful tool to break up foreign gangs on American soil; if Congress cannot even do that the USA is in dire trouble.</p>                \n                \r\n\n            \n                <p>If Kate's Law is not voted on, just Kate's Law, then it's a disgrace because if you stand it alone it's going to pass. And if Kate's Law doesn't pass then the world will know which senators and congress people are truly villainous. Get the law to President Obama and let history record what happens.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Will Kate's Law ever get passed?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/8", "date": "2015-10-09T12:23:09Z"}