{"vcmId": "5e1c2120-00e6-4159-ba51-4856ec713bc7", "url": "http://www.foxnews.com/transcript/2015/02/23/will-american-imams-denounce-jihad-in-public-way.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 20, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight. As you may know I called for all American clerics to address the persecution of Christians, Jews and moderate Muslims by Islamic terrorists, the jihadis. Thousands of clerics have written to me saying they will do that this weekend, but not one imam has weighed in -- not one.</p>                \n                \r\n\n            \n                <p>Joining us now from Las Vegas, Imam Aslam Abdullah, director of the Islamic Society of Nevada.</p>                \n                \r\n\n            \n                <p>So first of all Imam, I understand you're going to deal with the jihadist issue today. Is that correct.</p>                \n                \r\n\n            \n                <p><b>DR. ASLAM ABDULLAH, ISLAMIC SOCIETY OF NEVADA:</b> Salaam and peace to you Mr. O'Reilly and thank you very much for having me on your show. And yes. Yes, I would not grace them by the term jihadist, they are evil and they should be treated as evil. They are a disgrace to humanity and they are a disgrace to Islam and any other religion. These are the people who we all should join to fight against.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And you're going to say that to your congregation today.</p>                \n                \r\n\n            \n                <p><b>ABDULLAH:</b> I have been saying it to my congregation for the last several years, especially when ISIS started attacking the people in Iraq and other places. And that's what have been the subject of at least ten of my sermons, not only at our mosque in Las Vegas but at different places in the country as well.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Have you been threatened or debated or had any scorn brought upon you for doing this?</p>                \n                \r\n\n            \n                <p><b>ABDULLAH: </b>I think Muslim Americans feel themselves as the first line of defense against terror against this country. And they tell me that they are as angry as anyone else over what is happening in Iraq and Syria. And they are determined to speak up and condemn every act of violence. They do not put a tag of Christianity and Islam and Judaism on human life. They believe that every human life is sacred and it must be protected and it is their covenant with God to protect that human life, even if it means sacrificing their own lives.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> At one time I suggested that perhaps someone, maybe you, should organize a march in Washington, D.C. There are a million and a half American Muslims, you're not going to get, you know, if you got 10 percent of them, that's 125,000 or whatever and to show other people -- because the American Muslim community is kind of isolated from the mainstream.</p>                \n                \r\n\n            \n                <p>People don't know what you're doing in the mosques. They don't know, as you said, and I believe you, that collectively American Muslims are outraged by this jihadi savagery. But wouldn't it be good if you could do that and organize so that the news media could cover and there could be a bunch of speakers and things like that? Wouldn't that be worthwhile?</p>                \n                \r\n\n            \n                <p><b>ABDULLAH:</b> Mr. O'Reilly since 9/11, Muslim Americans have organized at least 11 such events in Washington and other places. We are still trying and we will definitely take on your advice on that matter and we would communicate it to imams all over the country and Muslim organizations that we must pool our resources --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I think that would be very beneficial to show the world that, you know, you guys are not condoning this in any way, shape or form.</p>                \n                \r\n\n            \n                <p>Isn't it true, though, that in the Middle East, if you were to give your sermons, anti-jihadi sermons there, your life would be in danger?</p>                \n                \r\n\n            \n                <p><b>ABDULLAH:</b> Yes, yes. I think the life is in danger generally in the Middle East, for speaking the truth and speaking against the atrocities that are being committed by the rulers against their own people. These are the rulers who are responsible for the status quo that is taking place at the moment. They're the ones who are responsible for all those kind of atrocities that these people are committing. And it is their responsibility to stand up and take position.</p>                \n                \r\n\n            \n                <p>But unfortunately for the last 60 years, they have been the worst kind of rulers and worst kind of dictators toward their own people. And if anyone speaks against them, he certainly has found himself in the prison or he's dead.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. There's a lot of fear in the Middle East from both sides. The jihadis themselves and the corrupt government people as well. Look, I'm glad you came on, Imam. I'm glad you stepped up and came on and told us that, because --</p>                \n                \r\n\n            \n                <p><b>ABDULLAH: </b>Thank you very much.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You know who the jihadis kill the most? Muslims.</p>                \n                \r\n\n            \n                <p><b>ABDULLAH: </b>The Muslims, yes. I think it is not an issue of Islam and Christianity. It is a question of humanity and we all are one against that terror. Against that savagery.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We all have to organize.</p>                \n                \r\n\n            \n                <p><b>ABDULLAH:</b> Exactly.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Thanks again, Imam.</p>                \n                \r\n\n            \n                <p><b>ABDULLAH: </b>Thank you Mr. O'Reilly.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Will American imams denounce the Jihad in a public way?", "description": "Addressing religious persecution by Islamic terrorists", "date": "2015-02-23T13:31:59Z"}