{"vcmId": "5f170547-650e-4b19-9b02-fcb95f086095", "url": "http://www.foxnews.com/transcript/2015/10/01/is-pentagon-rebelling-against-president-obama.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" September 30, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Impact Segment\" tonight: military controversy. According to report by the Associated Press the top general in Afghanistan says he wants to keep American troop strength in that country stable. In light of recent Taliban gains General John Campbell wants to maintain several thousand troops in Afghanistan and not withdraw them next year as President Obama has ordered. Right now there are 9,800 U.S. troops in Afghanistan.</p>                \n                \r\n\n            \n                <p>Rejoining us now from Washington Charles Krauthammer.</p>                \n                \r\n\n            \n                <p>So is this the start of a -- we have an investigation on tomorrow night with our military guys. But do you think this is the start of a rebellion in the Pentagon against the President's awful policy now after Iraq goes down the drain now Afghanistan might go down the drain? Is there a rebellion going on?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: I think it's a recurrence of what's been going on through entire two terms of the Obama years.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But the generals themselves though are they finally reaching critical mass and saying you have got to do something? You can't continue this way.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Look, at the very beginning, the generals wanted to fly a far higher number of troops at the beginning of Obama years in Afghanistan. He gave them about half and now we see the result. The generals wanted to keep a residual force in Iraq. Obama said no, he pulled them out and we see what happened.</p>                \n                \r\n\n            \n                <p>The generals have asked for a lot of things. They actually recommended CIA as well. That we help the non-jihadist rebels in Syria to avoid what we are seeing now. Obama said no. I suspect he will say no again. And we have a system where the generals, however much they disagree, they salute and they obey.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Why?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: The problem -- because.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They can resign. They can resign and say this is insane. I think that might be happening.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: I think that would be very healthy because that almost never happens.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: We have -- I mean, the last resignation I think on principle was Cyrus Vance in 1980 when he resigned over the Iran rescue mission. We simply don't have a tradition of that and we should. Because I think what we're facing here Obama in Afghanistan cares only about his legacy. And his legacy as he wants it to be remembered is he got us out of the wars.</p>                \n                \r\n\n            \n                <p>He didn't care about winning the wars. He doesn't care how we collapse afterwards. He once had said that when he left office there were no American troops. He doesn't -- apparently he seems not to be influenced by the fact that the whole northern tier of Afghanistan is now in danger.</p>                \n                \r\n\n            \n                <p>And the reason that that is so worrisome is that the traditional Taliban strength has been in the south, not in the north. The north was always the pro-western side. When we unveiled in 2001, we were allied with the northern alliance.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know, but that's where the U.S. troops are, in the south. They are not in the north. That's why they are hitting there.</p>                \n                \r\n\n            \n                <p>But let's look at the big picture. You are right, I think, when it's all about the President's legacy. But now his legacy is tied in with millions of people invading Europe because of his failed policy in Iraq that led to ISIS that led to the Syrian catastrophe. And now they are all getting the hell out, and they are going to Europe.</p>                \n                \r\n\n            \n                <p>That is on President Obama. Not entirely but a lot of it, all right? You are going to see the same thing in Afghanistan if these Taliban come swooping down to Kabul. You are going to have another humanitarian disaster.</p>                \n                \r\n\n            \n                <p>Then you've got the Iranian thing. Then you've got Putin taking over Syria. Putin is taking over Syria. He is going to run that country. All right? And Obama is worried about his legacy? Are you kidding me?</p>                \n                \r\n\n            \n                <p>In a year from now we might be in another world war on his doorstep. And whoever the hell is the next president is inheriting all this mess. And that's what I'm saying. Americans don't get this?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Look, I appreciate your passion. And I agree with everything you have said. But it doesn't mean it's not happening. And it doesn't mean Obama will not continue in the same vein.</p>                \n                \r\n\n            \n                <p>You are absolutely right about Russia. What Russia has just swindled us in Syria. They have essentially returned in arm with their armed forces to Syria to the heart of the Middle East. We had kicked them out in 1972. This is a historic reversal. America being the dominant influence. The dominant power in the region. And we are now begging the Russians to negotiate with us so that we will have what they call a deconfliction agreement so they don't shoot down our own airplanes.</p>                \n                \r\n\n            \n                <p>In fact, the biggest humiliation of all is that the Russians today said they are the only air force flying legitimately in Syria because they have the permission and request of the legitimate Syrian government and we are violating international law with our missions over ISIS. That's the low point that we have reached.</p>                \n                \r\n\n            \n                <p>And what does Obama do? Yesterday, when the Russians began the air campaign, he led a meeting, a summit meeting so-called at the U.N., on violent extremism -- seminar to follow.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Listen, you and I both know -- Krauthammer and O'Reilly both know that what is happening in the world now is off the chart dangerous for this country, for Americans. It may be over there now. But with Putin taking over the Middle East in conjunction with Iran and with ISIS gaining power almost everywhere, including Afghanistan -- all right. The generals and the Pentagon know what's happening. And they either have to sit on it and on their conscience watch their country go down the drain or they have to resign and say \"enough\".</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Well, they sure have sat on a lot.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They sure have.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: They allowed the evacuation of Iraq which led to the collapse of a position that Obama himself said when we left.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, Leon Panetta got out.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: And he didn't resign on principle. He left at the change in administration.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: He was disgusted and he wrote about it and now.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: But writing about it afterwards is a little bit after the fact.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I agree. Charles Krauthammer, everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Is the Pentagon rebelling against President Obama?", "description": "Charles Krauthammer joins 'The O'Reilly Factor' to examine defense policy controversy", "date": "2015-10-01T12:25:56Z"}