{"vcmId": "6036399b-e4b8-4a9d-bd1e-fcfe1854214f", "url": "http://www.foxnews.com/transcript/2015/08/27/bill-oreilly-donald-trump-vs-jorge-ramos.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Yesterday in Iowa, Univision anchorman Jorge Ramos disrupted a press conference held by Donald Trump. The media has not, has not reported this story honestly but Talking Points will this evening.</p>                \n                \r\n\n            \n                <p>It all began when Mr. Ramos jumped the line and began asking Mr. Trump about his immigration policy when he had not been called upon. Trump had Ramos removed correctly saying that he had no right to ask his questions without being recognized.</p>                \n                \r\n\n            \n                <p>It is every political candidate's right to regulate Q&amp;A sessions and if they don't chaos will ensue. That's what happened with Mr. Ramos.</p>                \n                \r\n\n            \n                <p>That being said, if Trump was avoiding Ramos, the anchorman does have a right to ambush him, to try to get some answers to his questions. But that is a last resort.</p>                \n                \r\n\n            \n                <p>Donald Trump is suing Univision over it dropping his Miss Universe pageant so obviously he is not a fan. However, Ramos was admitted to the press conference. Now, I believe Jorge, had he been more patient, would have gotten his answers from Trump because Donald does not usually avoid confrontation as we all know.</p>                \n                \r\n\n            \n                <p>It looked like Mr. Ramos grandstanded the situation, hoping to generate publicity for himself. That's what it looked like. Again, he should have waited his turn. A few minutes after Jorge was removed, the Trump people brought him back. Then the Q&amp;A began</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Somebody on the other side of the border, a woman is getting ready to have a baby. She crosses the border for one day. Has the baby, all of a sudden for the next 80 years, hopefully longer, but for the next 80 years we have to take care of the baby.</p>                \n                \r\n\n            \n                <p>I don't think -- no, no, no. I don't think so.</p>                \n                \r\n\n            \n                <p><b>RAMOS:</b> -- deporting babies.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Excuse me, some of the greatest legal scholars and I know some of the television scholars agree with you but some of the great legal scholars agree that that's not true. That if you come across -- excuse me, just one second.</p>                \n                \r\n\n            \n                <p><b>RAMOS: </b>-- deporting babies. You're not answering Mr. Trump.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No, no -- I am answering. If you come across for one day, one day, and you have a baby, now the baby is going to be an American citizen. It's going to be tested. Ok?</p>                \n                \r\n\n            \n                <p><b>RAMOS: </b>So the question is how are you going to build on 1,900 miles wall?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Very easy, I'm a builder. That's easy. I build buildings that are.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Can I tell you what's more complicated? What's more complicated is building a building that's 95 stories tall.</p>                \n                \r\n\n            \n                <p><b>RAMOS:</b> But it's completely unnecessary, it's a waste of time and money.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: By saying the border wall is a waste of time and money as Mr. Ramos did at the end of that sound bite, he is editorializing -- not simply probing for answers. That's the key.</p>                \n                \r\n\n            \n                <p>Jorge Ramos has now become an advocate for people who enter the U.S.A. illegally. And that has superseded his job as a journalist. He is a man who wants amnesty for illegal aliens and not only that he doesn't really want to stop illegal border crossings.</p>                \n                \r\n\n            \n                <p>A case can be made that Mr. Ramos is an open-border guy, certainly a far left position. So let me ask you a question. What's the difference between Jorge Ramos on immigration and Black Lives Matter on race? What's the difference? Both are advocating policies from a distinct political point of view. Now, that's allowed in America. However, when an anchorman does it that becomes a problem.</p>                \n                \r\n\n            \n                <p>We have been trying to get Jorge Ramos on this program for months, especially after the Kate Steinle murder in San Francisco allegedly by an illegal alien felon who had been deported five times. Mr. Ramos would not speak to me about that. He hid under his desk.</p>                \n                \r\n\n            \n                <p>Isn't it interesting that when events like Kate Steinle's murder occur, the pro-illegal alien crowd disappears or deflects the security issue. I have a very simple question for you, Jorge, do you support Kate's Law? You can e-mail me the answer since you won't appear on The Factor. After the Trump deal last night, we asked Mr. Ramos to again, appear. No luck.</p>                \n                \r\n\n            \n                <p>Now, Donald Trump usually takes tough questions as you have seen here over the past few months. You may disagree with his position on illegal immigration and Talking Points has challenged it. But when you have a guy like Ramos who disappears after the Steinle murder, and a guy like Trump who stands up, that's a pretty stark comparison, is it not?</p>                \n                \r\n\n            \n                <p>Think about it. Jorge Ramos is the most influential Hispanic anchorman in the U.S.A. And Mr. Ramos is an amnesty guy. So how can he possibly report the immigration issue fairly? How? The answer is he can't. It's not possible.</p>                \n                \r\n\n            \n                <p>Jorge Ramos went to Iowa to try to debate and embarrass Donald Trump, not to get answers for his audience. If Mr. Ramos wants to be a commentator like me, that's fine. If Univision and Fusion are putting the man up as an objective purveyor of news coverage, that's fraud.</p>                \n                \r\n\n            \n                <p>So let's recap. Trump was right to control his press conference. Ramos has a right to ask his questions if they will not be considered. He has the option of ambushing any candidate. However, that should be a last resort.</p>                \n                \r\n\n            \n                <p>Talking Points believes Ramos has become a zealot. Advocating far left positions that most Americans reject. To be fair, Trump is advocating a hard right position on immigration and specifics are hard to get from him. But he does show up to address the questions. Those who despise Trump are trying to use the Ramos incident as another example of his immaturity and hostility to those with whom he disagrees.</p>                \n                \r\n\n            \n                <p>But if you step back, if you step back and look at it objectively, who is really being upfront with the American people? An anchorman who has become a political activist or a candidate who states his case and takes the heat? You make the call.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Donald Trump vs Jorge Ramos", "description": "Bill O'Reilly's Talking Points 8/26", "date": "2015-08-27T12:06:02Z"}