{"vcmId": "6052ca22-2e66-4eb0-9071-a7ef1abf8f65", "url": "http://www.foxnews.com/transcript/2016/04/28/bill-oreilly-why-voters-are-propelling-donald-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Much has been said about the feckless nature of the Republican leadership. As the primary reason why Mr. Trump is this close to the GOP nomination. That's an element but not the decisive factor. A broad disenchantment with the direction of America has fueled the Trump campaign and that can be laid right on the progressive doorstep. With his sweep yesterday, Trump simply needs only to win Indiana next Tuesday to secure the nomination. That will not be easy and he will still need some delegates but it's essentially over if he takes the Hoosier state.</p>                \n                \r\n\n            \n                <p>There are four, four main themes that Donald Trump is exploiting. First, illegal immigration. Many powerful progressives like Bernie Sanders and the \"New York Times\" are open borders people. They want a European Union situation where anyone can pretty much go anywhere they want. To the far left, borders are obsolete and anti-poor. Many Americans are horrified by that stance and watched with anger as U.S. immigration law has been disrespected and even mocked. Trump promises to end all that.</p>                \n                \r\n\n            \n                <p>Second, economic anxiety. Most Americans know someone who has gotten hammered in the marketplace. Most Americans do not have much money in the bank. Do the math. Trump says, he will punish concerns that steal American jobs and are unfair on the trade front. Economic justice is appealing to both the right and the left this primary season and both Trump and Sanders have capitalized. Third, U.S. weakness. Americans are appalled over the continuing atrocities coming out of the Muslim world. Yes, it is Islamic extremists who drive this, but, in country after country, horror is on display.</p>                \n                \r\n\n            \n                <p>President Obama's policy of containment and his refusal to define the Islamic Jihad as a true danger to the U.S.A. has lit a fuse of deep resentment in many American precincts. Trump is not at all sympathetic to the Muslim world. Thus, he has captured the resentment over our perceived weakness. Finally, political betrayal. It is widely perceived that the progressive American unit are on the March and traditional folks on the decline. The question where did my country go captures that. Trump portrays himself as an avenger, a man fed up with political correctness and the social fascism that often brings.</p>                \n                \r\n\n            \n                <p>His outspoken attacks galvanize Americans who are bitterly disenchanted by a society that puts grievance above achievement, permissiveness above order. After nearly eight years of the most liberal president in U.S. history, millions of voters have had enough of a social system that directly denigrates their values and caters to non-working individuals. They want someone to blow that system to hell. That's why Trump is winning. He pinpointed festering disenchantment long before anyone else. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Why the voters are propelling Donald Trump", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 4/27", "date": "2016-04-28T12:32:01Z"}