{"vcmId": "605af751-2204-47f8-8eb9-aeaa4e4b1b18", "url": "http://www.foxnews.com/transcript/2016/11/17/bill-de-blasio-speaks-with-trump-in-closed-door-meeting.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 16, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact\" segment tonight, Trump versus the uber liberal Mayor Bill De Blasio here in New York City. As you may know, the nation's largest town falling apart literally with construction projects clogging almost every road in Manhattan, beggars all over the place and a defiant mayor who says he will not cooperate with the federal government on illegal immigration. Something he told Mr. Trump today.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BILL DE BLASIO (D), NEW YORK CITY MAYOR</b>: I reiterate to him that this city and so many other cities around the country will do all we can to protect our residents and to make sure that families are not torn apart.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, what really happened in the closed door meeting.</p>                \n                \r\n\n            \n                <p>Joining us now from outside Trump Tower, FOX News correspondent Doug McKelway. And Mac King, a reporter for FOX 5 here in New York City.</p>                \n                \r\n\n            \n                <p>All right. What's the inside story on this meeting, Mr. King?</p>                \n                \r\n\n            \n                <p><b>MAC KING, FOX 5 WNYW REPORTER:</b> Yes. Well, we should be clear. The mayor was not surprised when he walked out on this building early afternoon to see a dozen TV cameras and 25 reporters. This was a news conference he called and wanted everyone to come to and what everyone know about seemingly for the sole purpose of telling all of us what he told Trump which were his concerns for the next four years. That we have not heard anything from Trump so we don't really know Trump's side of the story, what might have gone on in there.</p>                \n                \r\n\n            \n                <p>We do know that these two have a history of saying sort of nasty things about each other. Trump has called de Blasio the worst mayor in this city's history. De Blasio just two days ago encouraged the American people to continue protesting Trump's election. And in the past has said that he thought Trump was unfit to be president in his little news conference earlier, de Blasio acknowledged that they were very, very different people with very, very different beliefs and philosophies and governing. So it can't have been totally civil but he did say de Blasio did, that it was productive and he hopes that it continues because the ball is in Trump's court.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. Well, I think the ball is going to bounce off of the mayor's head. Because I know Trump is not going to allow a guy like Bill De Blasio to defy him. He's just not.</p>                \n                \r\n\n            \n                <p>Now, Doug, are you hearing anything about what might have come out of the Trump camp? We've tried all day to get something. They're really tight about this. They're not making any comments at all.</p>                \n                \r\n\n            \n                <p><b>DOUG MCKELWAY, FOX NEWS WASHINGTON CORRESPONDENT</b>: They are tight as a tick about this. No word is escaping from the inner circle about what this meeting happened. I wish I could have been a fly on the wall. That said, here's a fact for you Bill that you should take into consideration. I harken back to the WikiLeaks release from the late stages of the campaign, the John Podesta e-mails. This guy is considered insufferable even in his own party by many members of his own party.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You're talking about the mayor now. You're talking about the mayor.</p>                \n                \r\n\n            \n                <p><b>MCKELWAY</b>: Talking about Mayor de Blasio, yes. Quote, the Neera Tanden's e-mail to John Podesta reads, quote, \"I find him to be a bit insufferable.\" That from a May 2015 email. He said, \"Sorry if I let my extreme annoyance show.\" So, what is going on here? Is that old theory about keeping your friends close and your enemies closer. Look, I equate it in some respects to the whole system of micro-aggressions on college campuses today and they need to seek safe spaces. To Bill de Blasio, Donald Trump is one gigantic macro aggression and Bill de Blasio is the college counselor who is providing safe space to all of these progressives.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But he's going to pay a price.</p>                \n                \r\n\n            \n                <p><b>MCKELWAY</b>: The most progressive if not the most progressive city in the country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He's going to pay a price. Mayor de Blasio is. Because again, I do not believe the Trump administration is going to allow these mayors not only in New York but in Chicago, Los Angeles, San Francisco, Seattle to do what they want to do and defy. I don't believe that's going to happen.</p>                \n                \r\n\n            \n                <p><b>MCKELWAY</b>: One other consideration.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Go ahead. Real quick.</p>                \n                \r\n\n            \n                <p><b>MCKELWAY:</b> One other consideration if you've got time here. A very practical consideration. And the fact is that the city is incurring lots and lots of cost from the security, whether it be protecting this building here or following marchers through town to make sure that they don't turn into rioters. That's going to cause this city --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>MCKELWAY:</b> -- and an awful lot of money. And I suspect he may be seeking federal help.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Gentlemen, thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill de Blasio speaks with Trump in closed door meeting", "description": "What did the New York City Mayor and the President-elect discuss? 'The O'Reilly Factor' investigates", "date": "2016-11-17T13:29:55Z"}