{"vcmId": "606a7e1e-8cce-4aa9-ad16-82cf2d7ef7f1", "url": "http://www.foxnews.com/transcript/2015/04/02/bill-oreilly-religious-rights-vs-constitution.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It all began in 1973 when the Supreme Court ruled 7 to 2 that abortion should be legal in the U.S.A. That ruling contradicts the Christian tenet that all life is sacred and that man does not have the authority to decide when life begins outside of conception. So, Roe v Wade put the U.S. government directly against the Catholic Church and many Protestant churches. The battle is ongoing to this day.</p>                \n                \r\n\n            \n                <p>To be clear, it is a grave sin in Christian theology to abort a fetus. But it's perfectly legal under the U.S. Constitution. The gay marriage situation -- similar but not nearly as intense; some Americans oppose homosexual nuptials because of certain passages in scripture. However, being gay is not a sin in itself as any responsible theologian will tell you.</p>                \n                \r\n\n            \n                <p>In our secular country, religious belief is not a basis for civil law and indeed the Supreme Court will rule on gay marriage shortly. But no matter what the court decides, some Christians will continue to oppose gay nuptials on moral grounds and that is their right under the law.</p>                \n                \r\n\n            \n                <p>For example, I believe it's a violation of constitutional rights for the government to use tax money to fund abortion. I don't want that on my conscience and so far the feds have largely stayed away from that imposition. But some on the left are demanding tax dollars be used to destroy fetuses and they use terms like reproductive rights. And if you dissent, you are declaring war on women. Same thing with gay marriage, if you dissent, you are a homophobe, a bigot.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" believes the U.S. Government should be a secular concern. The founding fathers were quite clear in saying religious beliefs should not be imposed on the population. But the founders also said that we, the people, have the freedom to believe what we want without interference.</p>                \n                \r\n\n            \n                <p>And therein lies the argument for religious rights. Senator Marco Rubio defined it very well on Monday.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. MARCO RUBIO (R), FLORIDA: </b>No one here is saying that it should be legal to deny someone service at a restaurant or at a hotel because of their sexual orientation. I think that's a consensus view in America. But I think the flip side of all this debate is what about the religious liberties of Americans who do not want to feel compelled by law to provide a catering service or photography service to same sex marriage that their faith teaches is wrong?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Senator Rubio is correct. If a baker or photographer feels uncomfortable at a gay wedding that should be respected because there is no exclusivity -- other bakers and photographers will gladly accept the paycheck. It's long past time for the secular progressive movement to stop denigrating people of faith. I believe most fair-minded Americans get angry when they hear fanatics attacking folks who believe differently than they do.</p>                \n                \r\n\n            \n                <p>To be fair you get the same thing on the right once in a while but not nearly at the same level. That's because many celebrities and most of the media gladly side with the secular progressives against religious people.</p>                \n                \r\n\n            \n                <p>One final thing -- the big reason, the big reason the SP movement has succeeded so well is lack of religious leadership in America. I said that last night in the Laura Ingraham segment. There are few clerics of any statute who will go up against the secular lobby. They are simply afraid.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Religious rights vs. the Constitution", "description": "Bill O'Reilly's Talking Points 4/1", "date": "2015-04-02T12:11:49Z"}