{"vcmId": "6282d051-7a45-41f2-a63d-fbdcd223f141", "url": "http://www.foxnews.com/transcript/2017/03/08/bill-oreilly-investigating-national-security-leaks.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Coming out of all the chaos surrounding the Russian hacking and President Trump's allegation that President Obama somehow tapped the Trump Tower during the campaign should be indictment against those who leak National Security information. So out of chaos may come justice. Let's hope so.</p>                \n                \r\n\n            \n                <p>As we reported last night, there are only two stone cold facts that we can report in this entire debacle. First, that General Michael Flynn was captured on a wiretap talking to the Russian ambassador, perhaps from Flynn's office in Trump Tower. That tap happened, but we don't know who ordered it or how it went down. Obviously, the American people are entitled to know.</p>                \n                \r\n\n            \n                <p>Second fact, is twofold. Someone leaked the conversations between Flynn and the Russian ambassador to the press. That is a felony. Because we need to know who the leaker is. Associated with that, then-Attorney General Loretta Lynch working for President Obama ordered the rules about shared intelligence information changed just days before the President left office, just days before Mr. Obama walked out the door.</p>                \n                \r\n\n            \n                <p>So why did Miss Lynch do that? Did Mr. Obama order the change? Again, we need to know. It's very important because by National Security Agency sharing raw information, okay, unvetted, with the FBI, CIA, and other Intel agencies, you open up the potential for leaks. And that's exactly what happened. As soon as President Trump walked into the Oval Office, his phone calls to the Mexican president, to the Australian prime minister, and to other high-level officials were leaked to the press.</p>                \n                \r\n\n            \n                <p>So in effect, the Obama administration may have -- I emphasize \"may\" -- created chaos for the Trump administration by allowing unsubstantiated intelligence information to be spread across a number of agencies. This is big. If that were done intentionally to harm the incoming president, Mr. Trump, that is subversion. You can see that Congress must get to the bottom of the situation. Right now, there are investigations in the House and in the Senate to find out if Russian officials colluded with the Trump campaign.</p>                \n                \r\n\n            \n                <p>As we reported last night, so far, there is no evidence of that. We also don't know anything solid about the wiretaps and leaks concerning Donald Trump, and we need to know. And that is \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Investigating National Security leaks", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/7", "date": "2017-03-08T13:19:50Z"}