{"vcmId": "63e191f7-57cb-46d0-b9f6-2de1f93276f3", "url": "http://www.foxnews.com/transcript/2016/04/14/political-division-in-hollywood.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 13, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story\" segment tonight. Division in Hollywood. Show business is a Liberal Democratic concern these days. But there is deep division between those supporting Hillary Clinton versus Bernie Sanders. Here are some Clinton supporters in the show business industry. George Clooney, Jamie Foxx, Debra Messing, Ben Affleck, Robert de Niro, Will Farrell, Beyonce, Kim Kardashian. Just partial list.</p>                \n                \r\n\n            \n                <p>On the Sanders side, another partial list, Susan Sarandon, Danny Devito, Mia Farrow, Michael Moore, Neil Young, Spike Lee, Danny Glover. Side note, Donald Trump does have some Hollywood support. Kirstie Alley, Charlie Sheen, Gary Busey, Scott Baio, John Voight, Wayne Newton.</p>                \n                \r\n\n            \n                <p>Joining us now from Los Angeles, Janice Min, president of the Hollywood Reporter Billboard Media Group. I'm interested in the economic fallout here. Many Republican actors have told me directly that they don't talk politics because they are going to lose jobs if they do. They are not going to get hired. Because you know how subjective any hiring is in entertainment. Is this the case with Sanders-Clinton fissure? Is that going on there?</p>                \n                \r\n\n            \n                <p><b>JANICE MIN, PRESIDENT, THE HOLLYWOOD REPORTER-BILLBOARD MEDIA GROUP</b>: Listen, we're just beginning to see the effects of what's going to happen here. And it's getting personal and it's getting ugly at times. Twitter, of course, the new medium of the election is aflame with people having freak-outs and we saw this with this Susan Sarandon, Debra Messing twitter war last week when she said jokingly, we think said she would vote for Donald Trump over Hillary Clinton because she is a Sanders' supporter. I mean, these two are not going to be starring in any budding comment. There will be no Selma and sequel starring this two again.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, they were tweeting back, they were tweeting back and forth having a conversation that millions of people could see.</p>                \n                \r\n\n            \n                <p><b>MIN: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Um-huh.</p>                \n                \r\n\n            \n                <p><b>MIN: </b>Aha!</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It was about Sarandon wanting big change and messing saying no, Hillary Clinton is -- so why can't they both be friends and support either candidate. I don't understand.</p>                \n                \r\n\n            \n                <p><b>MIN: </b>Well, okay, in the end, in the general election they will. Hollywood will come together.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Sure.</p>                \n                \r\n\n            \n                <p><b>MIN</b>: And voted against whoever the Republicans.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>MIN:</b> But right now, like, listen, this is a town of people with high emotions. Lots of conviction. Everyone thinks that he or she is right. And there will be no consensus until the convention. None.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Now, does it play out though in the way jobs are secured? Do you believe that there is -- you know, if you are a director, for example, and you are a Bernie Sanders supporter, you are not going to hire Debra Messing to do a sitcom, I mean, is that possible?</p>                \n                \r\n\n            \n                <p><b>MIN</b>: Listen, there are people here who will take things to the extreme. There are people who hold long vendettas here. If you look though, Hillary Clinton is someone who, of course, has one of the longest memories and she is back making friends with the people who turned against her and supported Obama in 2008.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. Yes. And some of them are giving her money, right?</p>                \n                \r\n\n            \n                <p><b>MIN: </b>Yes. Listen, there are some people who are holding their nose and giving her money because they want a Democrat to win the White House. There are others who actually wholeheartedly support her. In terms of jobs being lost, maybe. The thing with Hollywood, Hollywood has mastered the skill of rejecting people with a smile on its face. So you will never -- actors say this all the time. You will never even know why you didn't get a job. Why you didn't get a role because no one will ever tell you the real reasons. And sure, some of that is personal at times. I don't know yet if the election will play a part in that. As far as Democrats go. But you are right about Republicans here. To get anyone to self-identify as a Republican here is nearly impossible.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. And on that note, it's probably --</p>                \n                \r\n\n            \n                <p><b>MIN:</b> On that note, one person, one famous performer came out for Donald Trump. Roll the tape.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>KIRSTIE ALLEY, ACTRESS: </b>Donald Trump, whether you like him or don't like him, is waking this country up. And for that alone, I am -- you know, if you hate him, then you are going to talk about how much you hate him. If you love him, you are going to talk about how much you love him. And I think that that's a really great step with this country because I think this country has gotten very complacent.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, will Miss Alley pay a price for saying that?</p>                \n                \r\n\n            \n                <p><b>MIN: </b>Okay. The thing with Kirstie Alley ism she has all that cheers money keep counting and counting and counting. It is very safe for her to say that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Surely she wants to have --</p>                \n                \r\n\n            \n                <p><b>MIN:</b> -- attacked and vilified.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure she wants to be --</p>                \n                \r\n\n            \n                <p><b>MIN:</b> Sure. Yes. Sure. Listen, there are people who don't -- who won't - - probably have -- because of Scientology. She is a scientologist. Who might ice her out a little because of this. You know, these are very like- minded people here in Hollywood. It's very clubby. And when people step out of line, they sometimes get their hands slapped. That is true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. Well, some of them try to slap my hands occasionally. And I enjoy that.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>MIN</b>: Yes. But you have done just fine, I think.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. Did Miss Alley pay price? Did anybody go after him?</p>                \n                \r\n\n            \n                <p><b>MIN</b>: There is a lot of reaction online. But, you know, we can't -- we live in a climate where among certain in certain conversations that even giving a positive nod to Donald Trump speaking his mind is seen as an endorsement.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, sure.</p>                \n                \r\n\n            \n                <p><b>MIN:</b> Is seen as -- there is nothing nice to say about him to some people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I do admire people like John Voight who, you know, he has the courage of his convictions. He is a tremendous actor. He still works. That's a good thing. I know there are a lot of people in Hollywood who would like to speak out but just don't. Last word.</p>                \n                \r\n\n            \n                <p><b>MIN</b>: Yes. I mean, yes. You know friends of Abe. Right? The Hollywood Association of Republicans here trying to get the member list of friends of Abe.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No.</p>                \n                \r\n\n            \n                <p><b>MIN: </b>I mean, you couldn't pay a million dollars and get anyone to disclose that here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. And they had their meetings in Guam. That's where they go to meet.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>Janice, I appreciate you coming on. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Political division in Hollywood", "description": "'The O'Reilly Factor' examines celebrity endorsements in the 2016 presidential race", "date": "2016-04-14T18:55:34Z"}