{"vcmId": "65dea062-8917-466a-a116-42e360847bca", "url": "http://www.foxnews.com/transcript/2016/03/10/bill-oreilly-fascism-and-donald-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As predicted here, some in the media -- both left and right -- are portraying Mr. Trump as a 1930s-type fascist and his supporters as budding Brown Shirts -- the Nazi Party's street army in Germany.</p>                \n                \r\n\n            \n                <p><b>MATT LAUER, NBC NEWS: </b>\"Mr. Trump, with some of the rhetoric you've used on the campaign trail over the last several months, targeting groups like Muslims and Mexicans, that - that evokes images of Nazi Germany and the scapegoating of Jews there back in the 1930s and '40s.\"</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>\"Well, I think that's a big, big stretch.\"</p>                \n                \r\n\n            \n                <p>It's more than a stretch. &#160;It's a strategy with the intention of not only demeaning Trump, but his supporters as well.</p>                \n                \r\n\n            \n                <p>The candidate aside, it is not hard to understand why some Americans support Mr. Trump.</p>                \n                \r\n\n            \n                <p>For the past seven years the folks have been witness to the following:</p>                \n                \r\n\n            \n                <p>Intense verbal attacks on police officers, labeling them racists who hunt down young black men.</p>                \n                \r\n\n            \n                <p>A porous southern border where narcotics and people smuggling continue unabated.</p>                \n                \r\n\n            \n                <p>A stagnant economy where workers have little bargaining power.</p>                \n                \r\n\n            \n                <p>A growing jihadist terror threat that the Democratic Party refuses to define, not even using the words \"Islamic terrorism.\"</p>                \n                \r\n\n            \n                <p>A Democratic president who after he announces the beheading of an American citizen by ISIS goes out to play golf.</p>                \n                \r\n\n            \n                <p>A culture that now demands political correctness, even if it goes against sincerely held religious beliefs.</p>                \n                \r\n\n            \n                <p>A legal system that may harm a business owner if he or she does not want to participate in a gay marriage or Catholic nuns who do not want to distribute birth control.</p>                \n                \r\n\n            \n                <p>A press corps that generally embraces liberalism, using its constitutional privilege to diminish non-liberals who have the temerity to speak out.</p>                \n                \r\n\n            \n                <p>An educational system dominated by leftist teachers and administrators who often impose their views on defenseless children.</p>                \n                \r\n\n            \n                <p>And a grievance industry that is often promoted by the media, thus allowing anti-American zealots to define this country as evil and oppressive, i.e. America is the real problem in the world.<br> In the face of all that an avenger named Trump has risen, promising to stop the madness and giving blunt voice to millions of angry Americans.</p>                \n                \r\n\n            \n                <p>The movement that Trump represents has nothing to do with fascism, everything to do with furious dissent.</p>                \n                \r\n\n            \n                <p>This memo is not a campaign ad for Trump. &#160;I know for a fact that some very bad people are trying to exploit his campaign to disguise racial and social hatred.</p>                \n                \r\n\n            \n                <p>Donald Trump should loudly condemn that and tone down some of his own inflammatory rhetoric. &#160;Just tell us what you want to do; no need to incite.</p>                \n                \r\n\n            \n                <p>Same thing is happening with the Bernie Sanders crew, where some haters are supporting Bernie in order to tear down marketplace freedoms and inflict pain on prosperous Americans.</p>                \n                \r\n\n            \n                <p>The cold truth is charges of racism and fascism are easy smears designed to stop freedom of expression and stifle debate.</p>                \n                \r\n\n            \n                <p>Here's more truth: The USA turned for the worse long before Donald Trump ever entered the political arena.</p>                \n                \r\n\n            \n                <p>And Germany has nothing to do with it.</p>                \n                \r\n\n            \n                <p>That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Fascism and Donald Trump", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/9; Plus reaction from Bernie Goldberg", "date": "2016-03-10T13:19:44Z"}