{"vcmId": "65e21498-ea49-4177-8ad1-0660786f5f65", "url": "http://www.foxnews.com/transcript/2016/01/15/bill-oreilly-illegal-immigration-and-republican-party.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>In the general election of 2016, the Democratic candidate will continue President Obama's policy of a quasi-open border by embracing sanctuary cities and not cracking down on illegal alien crime. That's what's going to happen. The Democrats will try to harvest votes from the newest Americans and avoid solving the illegal immigration problem.</p>                \n                \r\n\n            \n                <p>So how do Republicans counter that? Right now there is a deep division within the GOP. As you know, Donald Trump has called for building a massive wall on the southern border as well as suspending the entry of all Muslim foreigners into the U.S.A. -- very controversial. So much so, that other Republicans have hammered him.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>GOV. NIKKI HALEY (R), SOUTH CAROLINA:</b> We see Republicans who are not always being responsible with their words in terms of, you know, extending our tent, making sure that people who abide by our laws and abide by our traditions feel accepted in this country.</p>                \n                \r\n\n            \n                <p><b>GOV. JOHN KASICH (R-OH), PRESIDENTIAL CANDIDATE:</b> We all know you can't pick them up and ship them across -- back across border. It's a silly argument.</p>                \n                \r\n\n            \n                <p><b>JEB BUSH (R), PRESIDENTIAL CANDIDATE:</b> To send them back 500,000 a month is just not possible. And it's not embracing American values.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, Talking Points believes the illegal alien argument should be framed in a different way.</p>                \n                \r\n\n            \n                <p>Writing in the \"Wall Street Journal\" yesterday, William Galston said this, quote, \"Mr. Trump's hard line on immigration coupled with his resilience atop the polls has begun to redefine American conservatism. There was a time when Ronald Reagan, Steve Forbes and Jack Kemp could favor a welcoming immigration policy without losing their conservative credentials. That may no longer be possible,\" unquote.</p>                \n                \r\n\n            \n                <p>Now, I disagree. All Americans should welcome legal immigrants -- folks who obey our laws and go through the proper procedures. Everybody should welcome them. The Republican candidate must make that clear and then pivot into defining solutions that would stop the illegal immigration madness.</p>                \n                \r\n\n            \n                <p>There should be a wall because the Mexican government simply will not cooperate in stopping the flow of people and drugs into this country. Mexico is not our friend when it comes to smuggling. By accepting the chaotic status quo, the Democratic Party hurts all Americans.</p>                \n                \r\n\n            \n                <p>I mean come on. Sanctuary cities? Not supporting kate's law? Opposing a barrier that would make it harder for the cartels to smuggle tons of narcotics? That's crazy stuff.</p>                \n                \r\n\n            \n                <p>So the Republicans should simply tell the voters that laws will be enforced. And protection for American citizens provided. If we don't like the current laws, congress can vote to change them but enough with the anarchy.</p>                \n                \r\n\n            \n                <p>What the GOP should not do, however, is personalize the argument. Poor people seeking better lives are not villains. There is no place in America for hating. Many illegal aliens are just trying to help their families. Republicans should reject the personal and demand the rule of law because if things keep going the way they are going, we may be looking at what's happening in Europe.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>GREG PALKOT, FOX NEWS FOREIGN AFFAIRS CORRESPONDENT</b>: Violence in Germany as debates rage over the ongoing migrant and refugee crisis in Europe.</p>                \n                \r\n\n            \n                <p><b>ANDREAS LEOPKI, LEIPZIG POLICE DEPARTMENT </b>(through translator): A group of 150 persons plus acted as a closed group and caused massive damage to property.</p>                \n                \r\n\n            \n                <p><b>PALKOT: </b>It's the scene in the eastern German city of Leipzig Tuesday. Shop windows smashed, cars damaged, garbage set on fire -- all after German officials say far right demonstrators went on an anti-migrant rampage overnight beating the city's leftist district especially hard after a counter demonstration was also held in the city Monday night.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And there are problems in Finland, Sweden, Italy, France -- all over the place. To our credit, Americans have not rampaged against illegal aliens. Even after Kate Steinle was gunned down in San Francisco by an illegal alien felon who defied deportation five times Americans seethed but did not act out.</p>                \n                \r\n\n            \n                <p>Talking points believes a majority of American voters will respond to a strong message about illegal immigration, one that touts the law and rejects personal animus. That's the way to win.</p>                \n                \r\n\n            \n                <p>That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Illegal immigration and the Republican Party", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/14", "date": "2016-01-15T13:15:51Z"}