{"vcmId": "67e257c7-42c1-4216-a62f-e733c7a19716", "url": "http://www.foxnews.com/transcript/2014/12/12/supporting-controversial-torture-report.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 11, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story Segment\" tonight -- the controversial report on the CIA by the Senate Intelligence Committee.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. MARK UDALL (D), COLORADO: </b>Director Brennan and the CIA today are continuing to willfully provide inaccurate information and misrepresent the efficacy of torture. In other words, the CIA is lying.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, Mark Udall, member of the intel committee was voted out of office by Coloradans so that was his last hurrah. Joining us now from Washington, Senator John McCain -- see some merit in the report.</p>                \n                \r\n\n            \n                <p>First of all, we had CIA Director Brennan basically contradicting Udall said look, we didn't lie about anything to anybody. We did get actionable intelligence using these harsh measures; we are not going to do in anymore. But let's tell the truth. Do you know who is lying and who isn't lying, Senator? Do you personally know?</p>                \n                \r\n\n            \n                <p><b>SEN. JOHN MCCAIN (R), ARIZONA: </b>I know that that kind of treatment does not get accurate intelligence information. I know that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Wait, wait, wait -- let me stop you though. I was told directly by three former CIA directors they told me this. I talked to them. They told me they did get it -- all right, they did. And you say they don't. So I'm confused. My viewers are confused. You know, come on.</p>                \n                \r\n\n            \n                <p><b>MCCAIN: </b>First of all, let me say a word about waterboarding, it began with the Spanish inquisition is. After World War II we sentenced Japanese to death who had waterboarded our American prisoners. Had no doubt about the exquisite form of torture that waterboarding is.</p>                \n                \r\n\n            \n                <p>The second thing is about it Bill, and this is a fact and anybody who has been subjected to this kind of thing will tell that you that if you inflict enough physical pain on someone, they will tell you anything they think you want to hear in order to make it stop and that's just a fact.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. Right, we know that.</p>                \n                \r\n\n            \n                <p><b>MCCAIN: </b>That's just a fact.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know. And I'm not disputing those facts.</p>                \n                \r\n\n            \n                <p><b>MCCAIN: </b>Yes.</p>                \n                \r\n\n            \n                <p>Put yourself in the position of the viewer watching you and me right now. They are hearing from the highest levels of the intel community that, yes, we heard from you yesterday on this program. Ok?</p>                \n                \r\n\n            \n                <p>Yes, we did. We got worthy intelligence using these harsh methods. Yes, we did. And then we hear from sitting senators, no, we didn't. It's impossible for the American people to know.</p>                \n                \r\n\n            \n                <p><b>MCCAIN: </b>Well, all I can say is that that can be resolved. But I can also tell you that Mr. Brennan said he was for it and then he said he was against it. And now he said he is for it so there is a little bit of question about his.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, I don't know Brennan -- I'm talking about the other guys. I don't know him. And I didn't talk to him.</p>                \n                \r\n\n            \n                <p><b>MCCAIN:</b> Look, then the question is, Bill, why didn't we waterboard and torture Japanese prisoners of ours or German prisoners of ours or Korean prisoners of ours?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, I'm glad you asked.</p>                \n                \r\n\n            \n                <p><b>MCCAIN:</b> Why didn't we go out and torture them?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm glad you asked that question.</p>                \n                \r\n\n            \n                <p><b>MCCAIN: </b>Isn't that a legitimate question?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Absolutely and I'm glad you asked it. I want to point out to the viewers that Senator McCain was nice enough to read \"Killing Patton\" before publication and do a great review -- this posted on Amazon.com. As part of our research we found out that during the Battle of the Bulge U.S. troops did kill Germans with their hands up trying to surrender because the SS was gunning down American prisoners. Now, I'm not saying they were justified to do it but I'm saying it happens in the fog of war. And that's what happened here.</p>                \n                \r\n\n            \n                <p><b>MCCAIN:</b> No, no, what happens in the fog of war and combat there is killings that take place but we never ever captured a prisoner, took them back to a place -- A German or a Japanese -- and practiced these torture methods on them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We shot them then when they were (inaudible) with their hands up. We put a bullet between their eyes.</p>                \n                \r\n\n            \n                <p><b>MCCAIN:</b> We did that in the fog of war.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>MCCAIN:</b> Just as we carpet-bombed cities and capitals all over Europe and killing thousands of civilians in order to gain victory. That is dramatically different. Any person versed in the law of war will tell you that that is entirely different situation between the heat of the battlefield -- there is a huge difference between the heat of the battlefield. There is a huge difference. You have to understand that, Bill. I'm surprised you don't.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Wait a minute. I didn't say I don't.</p>                \n                \r\n\n            \n                <p><b>MCCAIN:</b> There is a difference.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's my job to interrogate you and ask the questions.</p>                \n                \r\n\n            \n                <p><b>MCCAIN:</b> But Bill all I'm telling you is --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Wait, Senator.</p>                \n                \r\n\n            \n                <p><b>MCCAIN:</b> -- that you want to kill somebody on the battlefield that's wrong. But it's dramatically different. Capturing, taking them some place and using the Spanish Inquisition methods of torture -- that's different.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How about this? The debate centers around in some circles drones that are used to kill suspected terrorists -- all right. And they kill other people killing other people with the suspected. Administration supports that and does that, yet when you get a Khalid Sheikh Mohammed who knows and who they say gave up information that saved thousands of American lives, you can't put them in the water. A lot of people are confused, Senator.</p>                \n                \r\n\n            \n                <p><b>MCCAIN:</b> Well then maybe you were confused when we carpet bombed Dresden that had no military involvement.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Break the will of the German people.</p>                \n                \r\n\n            \n                <p>It certainly was slaughter of thousands of innocent people.</p>                \n                \r\n\n            \n                <p><b>MCCAIN:</b> It certainly was a slaughter of thousands of innocent people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, it was -- so is the Tokyo bombings.</p>                \n                \r\n\n            \n                <p><b>MCCAIN:</b> War is tough business and it's hell.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, Senator. Look all I --</p>                \n                \r\n\n            \n                <p><b>MCCAIN:</b> Can I just mention one other thing? Could I just mention one other thing?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Absolutely.</p>                \n                \r\n\n            \n                <p><b>MCCAIN: </b>I had conversations with the vice president of the United States and with General Hayden the head of the CIA who tried to convince me that they wanted to be able to do this. I vigorously disagreed with them at the time on the grounds that you and I are talking about.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Oh, you have been remarkably consistent and we have to respect your opinion because you went through it. And you are a patriot and I want everybody to know that. But it's my job to interrogate you without throwing any water on you. And I want to wish you a very, very merry Christmas, Senator, thank you.</p>                \n                \r\n\n            \n                <p><b>MCCAIN:</b> But you are pulling out my fingernails.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Here is a great Christmas gift idea. Senator McCain's new book called \"13 Soldiers: a personal victory of Americans at war\" in stores everywhere. We hope you check it out.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Supporting the controversial torture report", "description": "Senator John McCain sees merit in the Senate Intelligence Committee CIA report", "date": "2014-12-12T14:03:34Z"}