{"vcmId": "67fd5168-8667-4d9e-8eb3-878469a12c3d", "url": "http://www.foxnews.com/transcript/2015/12/01/bill-oreilly-politics-and-murder.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As you may know, 57-year-old Robert Dear, accused of killing a police officer and two other civilians after he stormed a Planned Parenthood office in Colorado Springs. Dear is a long-time malcontent who has had problems wherever he has lived. Unfortunately in a free society disturbed individuals like Dear run unchecked and so we have to report murder after murder after murder.</p>                \n                \r\n\n            \n                <p>Planned Parenthood officials are blaming the killings on harsh criticism directed at the organization after undercover videotapes exposed the sales of aborted baby body parts.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>COWART: </b>We have experienced so much hateful language, hateful speech. Such a negative environment has been created around the work that Planned Parenthood does around the idea of safe and legal abortion. And we have seen that across the country from all sorts of speakers in the last few months.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, what Miss Cowart does not say is that Planned Parenthood is in the baby body parts business and deserves much of the harsh criticism directed toward it.</p>                \n                \r\n\n            \n                <p>The situation is reminiscent of the assassination in 2009 of Dr. George Tiller a late-term abortionist in Kansas. For $5,000 Tiller would terminate any pregnancy for any reason. He was nicknamed \"Tiller the Baby Killer\" by organizations who objected to his grizzly practice.</p>                \n                \r\n\n            \n                <p>I reported extensively on Tiller and after he was assassinated by a man named Scott Roeder, some far left loons blamed me. The truth is I reported accurately on Tiller whose assistant was stripped of her medical license after the assassination. By the way, Roeder was given life in prison, a well-deserved sentence.</p>                \n                \r\n\n            \n                <p>Now the big picture is the assassin Roeder and the Colorado killer represent their own sick selves -- nothing more. Same thing with the murder of nine-year-old Tyshawn Lee in Chicago who was gunned down on the street because his father is allegedly in a gang. 27-year-old Corey Morgan charged with first degree murder. 22-year-old Kevin Edwards being sought for killing Tyshawn. No matter what the circumstance, it would be wrong to demonize all young black inner city men for Tyshawn's murder. It is exclusively on the killers and no one else.</p>                \n                \r\n\n            \n                <p>It's long past time that political zealots stop using heinous crimes to advance their ideology.</p>                \n                \r\n\n            \n                <p>One more example. Again, in Chicago demonstrators are protesting the police department after a teenager, 17-year-old Laquan McDonald shot dead by Chicago officer Jason Van Dyke. Videotape shows Laquan holding a knife but far away from the police officers who were trying to contain him. Laquan was high on PCP and was shot dead during the confrontation. Officer Van Dyke now charged with first degree murder.</p>                \n                \r\n\n            \n                <p>The Chicago protests were largely peaceful unlike Baltimore and Ferguson. Also the Chicago PD is a troubled outfit. There is no question and deserves to be investigated. For years they have allowed mass murder to take place in poor neighborhoods.</p>                \n                \r\n\n            \n                <p>And although it is wrong to convict anyone on television, the videotape on Laquan is very troubling. It is to the credit of the demonstrators in Chicago that they are getting their points across without harming other Americans.</p>                \n                \r\n\n            \n                <p>But, again, you can be sure some zealots will use the Chicago police shooting to demonize all police officers all over the country. That is flat out wrong. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Politics and murder", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/30", "date": "2015-12-01T13:28:03Z"}