{"vcmId": "68ba904a-4e7c-4729-8b87-baa42b5f8bc8", "url": "http://www.foxnews.com/transcript/2016/05/13/bill-oreilly-real-story-donald-trump-meeting-republican-leaders-today.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>In politics, what you see and hear is not always reality.</p>                \n                \r\n\n            \n                <p>Spin dominates. That's why this program was created. &#160;The &#8216;No Spin Zone&#8217; cuts through all that.</p>                \n                \r\n\n            \n                <p>Today, Donald Trump met with Speaker of the House Paul Ryan - the two men trying to find common ground on which to defeat Hillary Clinton for the presidency in November.</p>                \n                \r\n\n            \n                <p>It is really impossible to say what both men are truly thinking, but they do have a common interest - and that is winning.</p>                \n                \r\n\n            \n                <p>Simply put, if President Obama's economic policies are continued for four more years under<br> President Hillary Clinton, the country may fracture.</p>                \n                \r\n\n            \n                <p>A Wall Street Journal column today by Daniel Henninger nails it - America cannot prosper on two percent growth a year. &#160;It's simply impossible.</p>                \n                \r\n\n            \n                <p>And that's what we have gotten under President Obama no matter how the Democrats spin it.</p>                \n                \r\n\n            \n                <p>The weak economic growth has caused deep anger among Americans in both parties, which is why Trump has won and Bernie Sanders is so competitive.</p>                \n                \r\n\n            \n                <p>American workers understand their lives are not secure, wages are stagnant, job growth paltry.</p>                \n                \r\n\n            \n                <p>If you've got three kids, a mortgage and want to live a basic life, you have to earn substantial money.</p>                \n                \r\n\n            \n                <p>Again, two percent growth will not provide the upward mobility that workers need.</p>                \n                \r\n\n            \n                <p>While there are a number of issues dividing Republicans and Democrats, the economy is the biggest.</p>                \n                \r\n\n            \n                <p>Trump has a big advantage here because he is running as a successful businessperson who will apply his acumen to improving the economy.</p>                \n                \r\n\n            \n                <p>Hillary Clinton pretty much says she'll do what President Obama has done.</p>                \n                \r\n\n            \n                <p>The problem for Trump is that some Republicans do not trust him.</p>                \n                \r\n\n            \n                <p>But now there is no other alternative. &#160;It's either gamble with Trump or live under economic policies that put government regulation and high taxes over growth.</p>                \n                \r\n\n            \n                <p>To be fair to Hillary Clinton, she could moderate once she's the official nominee. &#160;But right now it's entitlements everywhere and big government expansion.</p>                \n                \r\n\n            \n                <p>The classic tax-and-spend progressive platform.</p>                \n                \r\n\n            \n                <p>Again, how has that worked over the past eight years?</p>                \n                \r\n\n            \n                <p>So Talking Points fully expects the Republican Party to rally around Donald Trump.<br> Why?</p>                \n                \r\n\n            \n                <p>Because there is no other option for them.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The Real Story of Donald Trump Meeting Republican Leaders Today", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 5/12", "date": "2016-05-13T12:14:25Z"}