{"vcmId": "6b6dd392-f2ca-41e4-9857-f32b0459887f", "url": "http://www.foxnews.com/transcript/2015/08/17/2016-presidential-hopefulls-head-to-iowa.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 14, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching this special edition of THE FACTOR election 2016.</p>                \n                \r\n\n            \n                <p>After a dramatic week in the Presidential race, the campaign has come to Iowa. Many of the Democratic and Republican candidates are flocking to the Iowa state fair this weekend, trying to win the hearts and minds of voters where the first presidential caucus will take place.</p>                \n                \r\n\n            \n                <p>Joining us now from the state fair in Des Moines, Iowa Fox News chief political correspondent Carl Cameron. Carl -- the Trump bandwagon rolls into Iowa tomorrow via chopper. Give us a sense of the level of enthusiasm for Trump in Iowa.</p>                \n                \r\n\n            \n                <p><b>CARL CAMERON, FOX NEWS CHIEF POLITICAL CORRESPONDENT</b>: It's pretty extraordinary. He is obviously not a career politician. He has never run for president and come to Iowa as a Republican candidate before. He did run for president in the Reform Party ticket a few parties back.</p>                \n                \r\n\n            \n                <p>But tomorrow is being sort of eagerly anticipated by all types of fair goers. This is a bipartisan fair, obviously. It's open to the public. So there are going to be Democrats, perhaps throwing questions at Mr. Trump, Independents, as well as Republicans. He won't actually sit and take the stage at the so-called soapbox where all the candidates speak.</p>                \n                \r\n\n            \n                <p>He will have a media availability with reporters. There will be, just guessing here, somewhere in the neighborhood of 40 that will trailing him around with cameras and video cameras and hand-held things to live cast it to the web.</p>                \n                \r\n\n            \n                <p>And he is leading the polls. And he is owning the buzz. He is -- most of the discussion by all of the candidates is about Trump. There is a lot of questions amongst Iowa caucus goers about whether or not he will sort of flesh out the skeleton of his bumper sticker slogans and hot rhetoric with real policy. Iowans demand that but there's plenty of time for it. Right now he is unequivocally the front runner and the one about whom everyone is talking even his rivals.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> All right. Before we go on to the next one -- very quickly -- the corn kernel poll. Quick -- what is that?</p>                \n                \r\n\n            \n                <p><b>CAMERON: </b>The corn kernel poll is something that's put on by WHOU radio -- WHO Radio -- excuse me. And what you do is you take a corn kernel from them and you put it into the jar with the picture of the candidate that you like. Now we are in the second day of the corn kernel poll it's going to go all 10 days.</p>                \n                \r\n\n            \n                <p>The record they say was actually achieved in last year's senate races when Joni Ernst had 56,000 votes collectively and she won the straw poll here at the fair and she won the U.S. Senate seat. Trump is winning hands down. Ben Carson is second. And no one is even close to the rest of the two of them.</p>                \n                \r\n\n            \n                <p>It's a lot like the polls -- the most recent polls here in Iowa said that Trump is in the 30s, Ben Carson is in the -- excuse me in the 20s. Carson is in the teens and everybody else is down in single digits.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>All right. Speaking of Ben Carson he entered the No Spin Zone last night. He put some nasty accusations to rest. Are Iowans excited about another nonpolitician as president.</p>                \n                \r\n\n            \n                <p><b>CAMERON: </b>Absolutely. And one of the things that's so key here in Iowa is ground game. And folks who think that because they are non- politicians that Donald Trump and Ben Carson may not have are sadly and very seriously mistaken. Both of those gentlemen have hired long time Iowa pros.</p>                \n                \r\n\n            \n                <p>In the case of Donald Trump, it's Chuck Laudner, the man who helped Rick Santorum win the Iowa caucuses in 2008. In the case of Ben Carson it's a young man named Ryan Rhodes. He in 2013, 2014 -- 2010 was one of the very first Tea Party organizers here in Iowa. He is with Ben Carson and they have organizers in all 99 counties. And better than half of the 1,700 precincts already.</p>                \n                \r\n\n            \n                <p>The Trump people are trying to do that. Ben Carson already has. He is going to be a serious player and not going away with the depth of his organization.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> All right.</p>                \n                \r\n\n            \n                <p>Moving on, Carl, to the next one. Carlie Fiorina -- she has been on a roll lately. She made some news today talking about vaccinations and whether they should be mandatory to school kids. Your thoughts on that and how the Iowa people are taking that.</p>                \n                \r\n\n            \n                <p><b>CAMERON:</b> Well, Carly Fiorina has not spent a great deal of time in Iowa. She has come here but she hasn't been doing the types of bus tours outside of Des Moines and the big cities going into the real grassroots particularly in the northwestern part of the state, real conservative bastion. She'll have to do that.</p>                \n                \r\n\n            \n                <p>She clearly got the biggest bounce out of the debates a couple of weeks ago. She's been riding that very aggressively. She's the only woman on the field. She has a lengthy business record. She can go toe to toe with Donald Trump when it comes to either Hillary Clinton bashing or claims of job creation, et cetera.</p>                \n                \r\n\n            \n                <p>She can fund her own campaign should she choose to. She is worth about $30 million though she is using candidate donations and contributions now. So Carly Fiorina is a player.</p>                \n                \r\n\n            \n                <p>For her to come out to Iowa and do hard core retail politicking as is demanded, will be the next big test for her. She has proven that she can carry the tune in terms of the policy issues that matter. She has proven that she can be a very, very tough critic of Hillary Clinton. The important thing for her to do now is build the organization that can continue to sort of gas her campaign bus all the way to the finish line.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: So, you sat -- the next one is Jeb Bush -- you sat down with Jeb Bush earlier. We're going to take a listen to it and we'll get your comments in a second. Listen.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CAMERON: </b>Where do you need to be post Labor Day in this 17-horse, euphemistically, race?</p>                \n                \r\n\n            \n                <p><b>JEB BUSH (R), PRESIDENTIAL CANDIDATE: </b>It's hard to tell because I don't know if everybody is going to be in it for the long haul. We have a strategy in each of the early states. In Iowa it's to organize and organize. I will be here regularly.</p>                \n                \r\n\n            \n                <p>We have had great events. Lots of enthusiasm. And we've got to convert that to caucus goers. It's not the same thing as going to the polls or voting absentee. You really have to be all in to be able to show up Monday night for two hours on a February 1st.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Carl, give us a sense of the enthusiasm surrounding Jeb Bush. He really needs a come back here, does he not?</p>                \n                \r\n\n            \n                <p><b>CAMERON: </b>Yes, he does. Jeb Bush has never said he expects to win in Iowa. And that's very telling. Iowa, New Hampshire, and South Carolina traditionally you have got to win at least one or two of those states in order to have enough national name recognition, ID and incoming donations to go through the remaining 47 states and the additional territories and to actually clinch the nomination.</p>                \n                \r\n\n            \n                <p>Jeb Bush's campaign here has not been anywhere near as aggressive as the other candidates. In many ways he is running the type of frontrunner campaign that comes and stops in Iowa for cattle calls and big events like this but doesn't spend days at a time out in the country going to very small events, meaning 10, 15 people at a time. Which is how people like Rick Santorum and Mike Huckabee won the 2012 and 2008 caucuses here in Iowa. Jeb Bush hasn't done that.</p>                \n                \r\n\n            \n                <p>This is a swing state. And the general election, it's purple. In Iowa, only about 120,000 Republican will show up for the caucus, and that will be a record. When you consider that there is nearly four million people here, there are an awful lot of Republican moderates who will not be participating in the caucuses who may well be Jeb Bush supporters. The dilemma, the riddle, and in his own words, the problem, is whether or not Jeb Bush can, quote, \"lose the primary\" or potentially in this case the caucus and then still manage to win the general.</p>                \n                \r\n\n            \n                <p>He has been testing that question virtually every week with his arguments over common core and immigration and now, the question comes, when he comes here to the fair today, Jeb Bush had a fine showing. It was a huge scrum of supporters --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Right.</p>                \n                \r\n\n            \n                <p><b>CAMERON:</b> -- peppering him with questions, asking about that. He did the soapbox. He got questions about his controversial positions on education and immigration.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Carl --</p>                \n                \r\n\n            \n                <p><b>CAMERON:</b> But the one thing he got more than anything was questions about Trump.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Carl -- before we lose you I only have about a half a minute or so, maybe a minute.</p>                \n                \r\n\n            \n                <p>Can you talk to us a little about Hillary Clinton? She is going to roll in tomorrow. She hasn't spent a lot of time in Iowa. In the latest poll in New Hampshire, she is severely under water to Bernie Sanders by six or seven points. How does she turn that around? Can she turn it around? Or is it too early for her to turn it around?</p>                \n                \r\n\n            \n                <p><b>CAMERON:</b> Well, first, in New Hampshire, Bernie Sanders' surge may have something to do with being sort of a favorite nephew. He is after all from Vermont and it's right next door. Hillary Clinton did win New Hampshire back in 2008. But that was after she got her clock cleaned here in Iowa. She didn't come in second. She came in third. Not just to Barack Obama but to also the now disgraced former senator John Edwards she came in third.</p>                \n                \r\n\n            \n                <p>Her work here is going to definitely be cut out for her. Tomorrow has the kind of potential for political spectacle like nothing we have never seen. The crowd that Hillary is going to draw and Trump is going to draw, man, if they collide on the midway the fair is going to look like it did in 1932 when the Hoover and Roosevelt trains were literally clashed together as part of the fair's show.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> All right. Carl -- we're going to have to leave it there. Always great to talk to you. Thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "2016 presidential hopefulls head to Iowa", "description": "2016 presidential candidates head to the Hawkeye state to meet and greet potential primary voters at this weekend's state fair", "date": "2015-08-17T12:20:16Z"}