{"vcmId": "6d3f6d21-87e5-4034-995b-eb1d29f8e2b3", "url": "http://www.foxnews.com/transcript/2017/01/11/bill-oreilly-president-obama-job-performance.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>About an hour from now, Barack Obama will deliver his farewell address. &#160;After eight years in office, he believes he has been successful.</p>                \n                \r\n\n            \n                <p>Others dissent.</p>                \n                \r\n\n            \n                <p>The Wall Street Journal editorializing today:</p>                \n                \r\n\n            \n                <p>\"Yet (Barack Obama's) presidency has been a disappointment at home and abroad, a fact ironically underscored by Mr. Obama's relentless insistence that he has been a success.\"</p>                \n                \r\n\n            \n                <p>So now Talking Points would like to assess, and present the facts, about President Obama on the job.</p>                \n                \r\n\n            \n                <p>First of all, some of you believe I have been too easy on Mr. Obama.</p>                \n                \r\n\n            \n                <p>Over the years, I've received letters like these:</p>                \n                \r\n\n            \n                <p><b>FEB. 8, 2011: </b>Matthew Richards, Natick, Massachusetts: \"Mr. O, I didn't realize that you were the new spokesman for the White House.\"</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>FEB. 3, 2014</b>: Loreen Rorex, Johnson City, Tennessee, \"Bill, you threw soft balls at<br> the president. You are losing your edge.\"</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>MAY 14, 2015: </b>&#160;Marvin Dorfman, Monroe Township, New Jersey. \"O'Reilly, why are you defending President Obama?\"</p>                \n                \r\n\n            \n                <p>Talking Points replies this way.</p>                \n                \r\n\n            \n                <p>I've been fair. &#160;I have not bashed the President, have not attacked him personally, have not bought into the opinion that he wants to undermine the United States. &#160;What I have done is analyze what he's done in a fact-based way.</p>                \n                \r\n\n            \n                <p>So, let's take a hard look.</p>                \n                \r\n\n            \n                <p>We'll begin with President Obama the person. &#160;Certainly as half African-American, he's a historic figure.</p>                \n                \r\n\n            \n                <p>He has given hope to many minorities and others who see him as a person with little advantage who, through hard work, rose up to become the most powerful man in the world.</p>                \n                \r\n\n            \n                <p>That is a positive thing. &#160;Mr. Obama is a role model for success.</p>                \n                \r\n\n            \n                <p>On the negative side, inexplicably, the president has not improved the economic or social situation of most poor, minority Americans.</p>                \n                \r\n\n            \n                <p>There is now more poverty in the USA than there was when he took office.</p>                \n                \r\n\n            \n                <p>Black homeownership - down under his administration.</p>                \n                \r\n\n            \n                <p>And racial division - way up. &#160;Groups like Black Lives Matter have polarized blacks and whites, and Mr. Obama welcomed that radical group to the White House.</p>                \n                \r\n\n            \n                <p>It's kind of a mystery to me why Barack Obama did not concentrate more on solving the poverty problem.</p>                \n                \r\n\n            \n                <p>The key to that is keeping families intact.</p>                \n                \r\n\n            \n                <p>At one point, I expected Mr. and Mrs. Obama to make that theme one of their top priorities.</p>                \n                \r\n\n            \n                <p>It never happened.</p>                \n                \r\n\n            \n                <p>Poor education in the inner cities, a lax view on narcotics and the president's muted support of the police, have all contributed to chaos in poor neighborhoods.</p>                \n                \r\n\n            \n                <p>Now let's take a look at the healthcare situation.</p>                \n                \r\n\n            \n                <p>Mr. Obama's vision is good - that all Americans should have access to quality healthcare.</p>                \n                \r\n\n            \n                <p>But the execution of Obamacare put a steep burden on working-class families.</p>                \n                \r\n\n            \n                <p>As we all know, health insurance premiums are up, deductibles are up, and doctors accepting the health mandate are becoming fewer and fewer.</p>                \n                \r\n\n            \n                <p>There is no question Obamacare will be repealed under President Trump and we all have to hope that the Republicans have a better plan.</p>                \n                \r\n\n            \n                <p>On the economic front, Mr. Obama did a good job in his first year stabilizing the economy, which was in a free fall because of the mortgage-con that led to recession.</p>                \n                \r\n\n            \n                <p>For example, he made the right decision bailing out some of the American carmakers, who have since repaid the feds.</p>                \n                \r\n\n            \n                <p>But then Mr. Obama shifted into massive income redistribution mode.</p>                \n                \r\n\n            \n                <p>That meant that taxes went up, regulations went up, welfare payments went up and the economy stagnated.</p>                \n                \r\n\n            \n                <p>For eight years, the wages and the economy stagnated.</p>                \n                \r\n\n            \n                <p>That's why Donald Trump won the election. &#160;The economics on President Obama's watch were not successful.</p>                \n                \r\n\n            \n                <p>Period.</p>                \n                \r\n\n            \n                <p>Now let's go overseas. &#160;There the president made five major mistakes.</p>                \n                \r\n\n            \n                <p>The worst one - withdrawing all U.S. troops from Iraq.</p>                \n                \r\n\n            \n                <p>That led to the rise of ISIS, which Mr. Obama ignored and now we have a disaster, not only inside Iraq, but worldwide.</p>                \n                \r\n\n            \n                <p>Second was Syria.</p>                \n                \r\n\n            \n                <p>After the tyrant Assad used poison gas on innocent people, Mr. Obama threatened Assad.</p>                \n                \r\n\n            \n                <p>But the threat was hollow. &#160;Mr. Obama did nothing.</p>                \n                \r\n\n            \n                <p>And so hundreds of thousands of Syrians have been killed, brutalized or have fled.</p>                \n                \r\n\n            \n                <p>That has destabilized Europe and led to even more terrorism.</p>                \n                \r\n\n            \n                <p>On the Russia front, Mr. Obama was totally impotent in the face of the tyrant Putin.</p>                \n                \r\n\n            \n                <p>The former KGB officer did exactly what he wanted to do, including invading countries and hacking into the American political system.</p>                \n                \r\n\n            \n                <p>Also, the Chinese do not fear Barack Obama and have now made the South China Sea international water their own.</p>                \n                \r\n\n            \n                <p>The Chinese have also undermined the American economy, as Donald Trump has so often pointed out.</p>                \n                \r\n\n            \n                <p>Finally, the nuke treaty with Iran is still debatable.</p>                \n                \r\n\n            \n                <p>What is not debatable is that Iran is the primary sponsor of terrorism in the world, including the direct destabilizing of countries in the Mideast and Afghanistan.</p>                \n                \r\n\n            \n                <p>The Iranians do not fear Barack Obama.</p>                \n                \r\n\n            \n                <p>In international matters, it is clear that President Obama believes that global warming is more important than stabilizing and protecting the world in the face of a global jihad.</p>                \n                \r\n\n            \n                <p>Now, global warming is real, climate change is occurring. &#160;But Mr. Obama's vision of hurting certain economic sectors in order to lessen fossil fuel intrusion cannot possibly work unless countries like India and China do the same thing.</p>                \n                \r\n\n            \n                <p>And they are not.</p>                \n                \r\n\n            \n                <p>So, Mr. Obama imposed regulations that hurt the American economy knowing full well that climate change would not improve worldwide.</p>                \n                \r\n\n            \n                <p>Does that make any sense?</p>                \n                \r\n\n            \n                <p>At this point in history, two thirds of the American people think America is on the wrong track.</p>                \n                \r\n\n            \n                <p>But they still like Barack Obama. &#160;His approval ratings are above 50%.</p>                \n                \r\n\n            \n                <p>That is to the president's credit. &#160;He has put forth an image of responsibility.</p>                \n                \r\n\n            \n                <p>But as the nation's leader, Mr. Obama has not improved the economy to any significant extent, has not diminished poverty and poor education, has not brought Americans together, and has used the power of this great nation in a way that has created mayhem abroad. &#160;That is the historical record.</p>                \n                \r\n\n            \n                <p>And it has nothing to do with ideology, or wishful thinking.</p>                \n                \r\n\n            \n                <p>It has to do with performance.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: President Obama's Job Performance", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/10", "date": "2017-01-11T12:57:19Z"}