{"vcmId": "6d6a7aa5-45a1-477a-b6bc-c7321ada3d3e", "url": "http://www.foxnews.com/transcript/2016/06/02/bill-oreilly-donald-trump-and-media.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Yesterday, Mr. Trump slammed the national media for questioning his donations to American veterans. The issue stemmed from a benefit Mr. Trump held last January where he said he raised $6 million to help vets in need. A report by \"The Washington Post\" questioned whether the money had been distributed in a timely manner. So at a press conference Mr. Trump laid out what his organization did, citing names of the charities and amounts of money donated. Then Mr. Trump lashed the press something he does frequently.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: You know my opinion to the media, it's very low. Do we like the media?</p>                \n                \r\n\n            \n                <p><b>(CROWD)</b>: No.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Do we hate the media?</p>                \n                \r\n\n            \n                <p><b>(CROWD):</b> Yes.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I think the media is among the most dishonest groups of people I have ever met.</p>                \n                \r\n\n            \n                <p><b>(CHEERS AND APPLAUSE)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Some of the media is terrific. But most of it is, 70 percent, 75 percent is absolute dishonest, absolute scum. Remember that -- scum.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Today, the Associated Press report said some of Mr. Trump's donations were just recently distributed, including his own one-million- dollar check. That's legitimate. I did the same thing after the 9/11 telethon which was held to benefit families devastated by the al Qaeda attack. You may remember George Clooney and a bunch of other stars raised millions, but the money was not distributed in a timely way so I had to get involved. But nowhere did I insinuate that Mr. Clooney and other celebrities did anything wrong.</p>                \n                \r\n\n            \n                <p>I simply wanted them to push the united way and other charities for full disclosure. Very similar to the Trump situation. It isn't the reporting on the donations that's wrong. It's the insinuation that Mr. Trump is a fraud or something. Now, the National Press should push Trump and others to fulfill their obligations quickly and efficiently. But that's it. You don't cast aspersions. And that's what Trump is objecting to. To be clear, Mr. Trump should have defined the issue sooner. And also he should release his tax returns as Talking Points has stated.</p>                \n                \r\n\n            \n                <p>Although Mr. Trump is correct when he slams the National Press for constantly trying to vilify him playing the gotcha game. I personally can feel Trump's pain because the National Press does the same thing to me. The Factor is attacked over and over as am I on a variety of bogus charges that's been going to for 20 years. It's wrong and corrupt. And the only reason the National Press despises this program is ideology. We are the most successful cable news show of all time. We invented the prime time opinion genre. And we are fair and responsible here. You hear all sides.</p>                \n                \r\n\n            \n                <p>Yet, the press looks for any and all reason to denigrate us. So I understand what Trump is going through. But I also know that he sometimes gets a bit testy when legitimate reports surface that he doesn't like. Donald Trump wants to be president, so he will be scrutinized. That's the way it should be in a free society. However, skepticism should not be accusation. And often it is. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Donald Trump and the media", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 6/1", "date": "2016-06-02T12:00:27Z"}