{"vcmId": "700ca894-505b-4de0-8d71-68cc93dd5389", "url": "http://www.foxnews.com/transcript/2014/12/19/bill-oreilly-why-traditional-america-is-poised-to-come-back.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>I don't like to pigeonhole people as liberals or conservatives. Fair-minded folks should be able to cross back and forth when good ideas are on the table. Obviously some people simply cannot break free of ideology but most folks can.</p>                \n                \r\n\n            \n                <p>However, the word traditional is inflexible. I'm a traditionalist. That means it is my deep belief that the founding fathers got it right when they created the American system with the exception of slavery which Abraham Lincoln and millions union soldiers corrected. There are very few American traditions that I do not admire and that sets me apart from my fellow progressive citizens who want a brave new world and a brand new model for the U.S.A.</p>                \n                \r\n\n            \n                <p>It is easy to think the progressives are winning the fight after all their poster guy Barack Obama was elected twice. But a traditional storm is brewing as the policies of the President falter. Not all of them but enough to wake up many sleeping folks.</p>                \n                \r\n\n            \n                <p>Let me give you a striking example. Political correctness has taken deep root in the U.S.A. And a few years back Christmas was under fire. Some major retail companies were actually ordering their employees not to say \"Merry Christmas\". You might remember that. Well, the subject came up when I visited with Seth Meyers last night.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SETH MEYERS, TALK SHOW HOST: </b>You talked about the war on Christmas.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> You are sort of the Paul Revere for the war on Christmas.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We won the war on Christmas.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>You won so it's official</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We won.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>Christmas is fine and made it?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And this is true. This is the only -- I have been doing this about 10 years -- the only year we have not had a store that commanded its employees not to say \"Merry Christmas\". It's over. We won.</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> Congratulations.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Anybody can say \"Merry Christmas\" if they want to. They don't have to. I'm not like Stalin.</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But I'm very happy. Thank you.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>Yes, congratulations.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The reference to Stalin was that he shot people who celebrated Christmas. I write about it in \"Killing Patton\". Stalin invented his own atheist holiday \"Father Frost\". A lot of frost in Russia.</p>                \n                \r\n\n            \n                <p>Anyway, along with the Christmas deal traditional Americans have won a fierce battle to protect children. 46 states, 46 now have some semblance of Jessica's Law -- tough mandatory prison sentences for child molesters. That's a big win. Even though to their shame Hawaii, Idaho, Illinois and Vermont continue to ignore the issue.</p>                \n                \r\n\n            \n                <p>As far as the war on terror goes the media went wild over the Democrats condemning coerced intimidation. But the folks solidly support the limited use of enhanced interrogation when it's necessary to protect American lives. Americans were not persuaded by the anti-CIA campaign, all the polls say that. Support for the U.S. military remains very high. Support for less government is growing as voters demonstrated last Election Day.</p>                \n                \r\n\n            \n                <p>In fact, the only place where traditionalists are not gaining momentum is on the social scene: gay marriage, a reality; legalizing drugs, a terrible idea, has some support; but unfettered abortion, not gaining ground. Even among young people.</p>                \n                \r\n\n            \n                <p>So, if a traditional leader emerges, he or she will find a country that is now ready to listen and, perhaps ready to return to the vision and discipline that created the greatest nation the world has ever known -- America.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Why traditional America is poised to come back", "description": "Talking Points 12/18", "date": "2014-12-19T13:24:25Z"}