{"vcmId": "708ede63-01bb-416c-a14f-982a779a774c", "url": "http://www.foxnews.com/transcript/2015/08/12/politics-race-in-2016-campaign.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 11, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> In the \"Impact Segment\" tonight the politics of race in the 2016 campaign.</p>                \n                \r\n\n            \n                <p>Nearly two dozen people were arrested in Ferguson, Missouri last night as protesters continued to mark the one-year anniversary of Michael Brown's death. Since Ferguson, activist groups like Black Lives Matter have begun using more extreme tactics to further their cause. But could this end up hurting the Democrats in the election?</p>                \n                \r\n\n            \n                <p>Joining us now to analyze from Los Angeles, civil rights attorney Leo Terrell; and here in New York, Fox News contributor, Deneen Borell.</p>                \n                \r\n\n            \n                <p>Mr. Terrell -- I want to start with you. This is a one-year anniversary in Ferguson a day ago -- are New York and Baltimore next? And frankly every time there is an issue -- a race issue, are we going to see these -- repeat these issues? These activists coming in and creating violence and disrupting the community?</p>                \n                \r\n\n            \n                <p><b>LEO TERRELL, CIVIL RIGHTS ATTORNEY: </b>Well, I don't think it is violence Eric, per se. I know there's a situation in Ferguson where there's a lot of problems but Black Lives Matter is a legitimate political group now that is going to be a major player in Democratic politics because if they are going to try to keep the Obama coalition --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> On the plus side or on negative side? Mr. Terrell -- on the plus side.</p>                \n                \r\n\n            \n                <p><b>TERRELL:</b> Well --</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>They disrupted Bernie Sanders. They stopped Bernie Sanders in his tracks. He had to leave the stage because they disrupted that.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: And look what Bernie --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> One more issue. Martin O'Malley, a tough guy had to come out and apologize for saying \"all lives matter\".</p>                \n                \r\n\n            \n                <p><b>TERRELL:</b> Well, let me give you a perfect example. Bernie Sanders's rally was upset and protested, but he look what he did. He appointed some individuals regarding the issue of race. He has been pushing economic inequality but he was not addressing black lives.</p>                \n                \r\n\n            \n                <p>And now as a result of that protest, he definitely had don an about face and addressed the issue of racial inequality in this country.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Deneen, last night Sheriff Clarke was on the show and he said that this is nothing more than a return to the scene of the crime where the big lie \"hands up don't shoot\" started.</p>                \n                \r\n\n            \n                <p><b>DENEEN BORELL, FOX NEWS CONTRIBUTOR:</b> Sure. And that was a big lie because it was disputed by the Department of Justice investigation and the forensic evidence. Black Lives Don't Matter is a disruptive group. One of their demands is to arrest Darren Wilson. And again --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Black Lives Matter.</p>                \n                \r\n\n            \n                <p><b>BORELL:</b> Black Lives Matter -- excuse me. And so listen what they are ignoring are the root causes that are causing the problems in black communities -- poor quality schools, high unemployment. Individuals who are seeking income elsewhere because they can't get a job. Low job creation. And these are the issues that affecting these communities.</p>                \n                \r\n\n            \n                <p>And when you have this kind of environment, of course, there's going to be more crime. We have 13 percent of black Americans and they are creating almost half of the homicide rates in the country.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Mr. Terrell -- the numbers don't lie.</p>                \n                \r\n\n            \n                <p><b>TERRELL:</b> Eric --</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Go ahead. Go ahead.</p>                \n                \r\n\n            \n                <p><b>TERRELL:</b> Eric, it's disingenuous for my colleague to mention the situation in Ferguson and not to mention the situation in the University of Cincinnati; not to mention the situation in North Charleston, Carolina; not to mention the Freddie Gray case. She can point to Ferguson and she can argue that case.</p>                \n                \r\n\n            \n                <p>But what about these shootings where the prosecutor has charged police officer. Black lives matter and there are examples of cases where police have used excessive force.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Mr. Terrell -- can I ask you this?</p>                \n                \r\n\n            \n                <p><b>TERRELL:</b> Please.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Is the phrase \"white lives matter\" -- is that offensive to you?</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: No, it's not offensive to me. But to me it deflects the issue. There are African-Americans Eric, that are dying, being shot in the streets on a higher level, on a much more higher percentage level than whites. And I think what this focus group is doing is telling every Democratic candidate you have to address this issue.</p>                \n                \r\n\n            \n                <p>Because my colleague has not made any reference to Cincinnati that happened last week or the North Charleston shooting in which an African- American man was shot eight times in the back. How about a comment about that?</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Ok. Let's talk about this. The reason why we brought you two together is we see that on the Democratic side Hillary Clinton wants to talk about everything except this. Bernie Sanders, his rally got stopped in its tracks by Black Lives Matter. Are the Democrats going to be hurt by the Black Lives Matter movement?</p>                \n                \r\n\n            \n                <p><b>BORELL: </b>Just to address Leo's point real quick. What about the black on black high crime rate, murder rate in Chicago and elsewhere in urban communities?</p>                \n                \r\n\n            \n                <p>To answer your question, Eric, listen. This will harm the Democrat Party, the election because listen these individuals are disruptors, they're not looking at the problems. The root problems that are happening in these communities which are really a result of failed progressive policies. They had their own agenda.</p>                \n                \r\n\n            \n                <p>Again, what they are looking at, the demands that they are bringing to the table are not going to change the dynamics in the black community.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>All right. I have to leave it there.</p>                \n                \r\n\n            \n                <p>Go ahead, quick thought. Quick thought -- last words.</p>                \n                \r\n\n            \n                <p><b>TERRELL:</b> Yes. I bring up two points. One, the black on black crime. You ignore the fact that the crime here is government involvement with police. And secondly even Rand Paul, a Republican, has addressed the issue of black lives and the problems in the black community.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Ok. All right. We'll have to leave it there.</p>                \n                \r\n\n            \n                <p>Deneen and Leo -- thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The politics of race in the 2016 campaign", "description": "Could activist groups like 'Black Lives Matter' end up hurting the Democrats?", "date": "2015-08-12T12:12:25Z"}