{"vcmId": "71d6efcd-146c-48e5-a2d6-e3b1c86d48df", "url": "http://www.foxnews.com/transcript/2017/03/16/analyzing-new-polling-on-president-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 15, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Personal Story\" segment tonight, some new polling on President Trump, according to FOX News, when asked about the President's job performance, 43 percent approved. Fifty one percent disapprove. Is the economy getting better? Forty eight percent say, yes it is. Twenty nine percent say, it's getting worse. Nineteen percent, no change.</p>                \n                \r\n\n            \n                <p>As for the Republican plan to replace ObamaCare, 34 percent now favorite, 54 percent opposed. Not good news for the GOP. With us now to analyze, Geraldo Rivera and Eric Bolling. So, Bolling, lots of Trump news. What you want to focus on?</p>                \n                \r\n\n            \n                <p><b>ERIC BOLLING, FOX NEWS CO-HOST, \"THE FIVE\":</b> That's polling we had there. Fifty four percent -- 34 percent approve of the GOP plan --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> To replace ObamaCare. It's a disaster. The minute it came out, I was on \"OUTNUMBERED\" the same day, and I said this is dead on arrival.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Why? What is the main problem with it?</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: I will tell you what the biggest problem is. I didn't know at the time but the biggest problem is, it wasn't a free market solution. It wasn't a state line --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Nobody is talking -- it is a pinhead. What is the biggest problem?</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Okay. The two highest groups, the highest voter totals for Donald Trump where 50 to 64-year-olds and over 65-year-olds.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Tell me what the problem is, Bolling.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> The price. Are you ready for this? The price.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The price.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> It goes from $1700 a year under ObamaCare, if you are low income, to $14,000.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. But that is going to be -- they are going to deal with that.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: That means, the reason why the price is what it is for the whole health care Bill is because people are dropping out. That is where 52 million people dropped out. That is Ryan care.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They're going to have to fix it, there is no doubt about it. All right. A lot of Trump news, as I just said to Bolling, let's jump it out at you?</p>                \n                \r\n\n            \n                <p><b>GERALDO RIVERA, FOX NEWS CORRESPONDENT AT LARGE</b>: I saw it from Al Capone's vote, and I appreciate you sticking up for you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. I do.</p>                \n                \r\n\n            \n                <p><b>RIVERA:</b> The problem isn't the cost so much, I think. As the philosophical concept in terms of health care, does the government, do we Americans, owe our fellow Americans health care? So, you have the Ryan plan, which tries to cut the baby in the middle. The middle-of-the-road is also known as road kill. This program is dead on arrival, why? Because the right doesn't want to pay for the poor people, the left wants more than the Ryan plan is willing to give. Ryan attempted a compromise, it pleases nobody --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right. One third we won't know until Trump gets in as a master negotiator and tries to work it out. What else on Trump?</p>                \n                \r\n\n            \n                <p><b>RIVERA:</b> On Trump, I think that you didn't show the poll on his tweeting. I think the temperance, the temper of the President, his demeanor in office, is weighing heavily on his popularity.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I think so.</p>                \n                \r\n\n            \n                <p><b>RIVERA:</b> He can't keep being erotic, three million undocumented voted --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That is what he is doing these speeches. That is why he is doing his speeches, to whip it up. That was a populous speech. Once to whip up support --</p>                \n                \r\n\n            \n                <p><b>RIVERA</b>: The President wiretapped, you can't make those charges and --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We ought to mention that coming up, we have an interview with Tucker Carlson with President Trump, where he says, you know, the next couple of weeks, there are going to be a lot of wiretap stuff that everybody is going to be grasping at. So, we will listen to Carlson.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> I think you need to push away the ObamaCare stuff, the health care stuff and get to taxes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I got to go.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Analyzing new polling on President Trump", "description": "'The O'Reilly Factor' breaks down the latest approval ratings and healthcare", "date": "2017-03-16T12:36:38Z"}