{"vcmId": "71f8641c-9761-4527-ac01-bb858be0810c", "url": "http://www.foxnews.com/transcript/2015/04/10/accusations-that-rand-paul-is-mean-to-women.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 9, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Accusations that Rand Paul is mean to women. The Republican senator has been doing a bunch of interviews since announcing his presidential campaign earlier this week. Yesterday, things got testy during an interview with NBC's Savannah Guthrie.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>GUTHRIE: </b>You have had views in the past on foreign policy that are somewhat unorthodox but you seemed to have changed over the years. You once said Iran was not a threat. Now you say it is. You once proposed ending foreign aid to Israel. You now support it at least for the time being, and you once offered to drastically cut.</p>                \n                \r\n\n            \n                <p><b>PAUL:</b> Well, before we go --</p>                \n                \r\n\n            \n                <p><b>GUTHRIE: </b>Wait, wait, wait --</p>                \n                \r\n\n            \n                <p><b>PAUL: </b>-- before we go through a litany --</p>                \n                \r\n\n            \n                <p><b>GUTHRIE: </b>-- wanted to cut defense spending and now you want to increase it 16 percent. I just wondered if you have mellowed out.</p>                \n                \r\n\n            \n                <p><b>PAUL: </b>Yes -- why don't you let me explain instead of talking over me, ok?</p>                \n                \r\n\n            \n                <p><b>GUTHRIE:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>PAUL:</b> Before we go through a litany of things you say I have changed on, why don't you ask me a question? Have I changed my opinion? That would be sort of a better way --</p>                \n                \r\n\n            \n                <p><b>GUTHRIE:</b> Have you changed your opinion.</p>                \n                \r\n\n            \n                <p><b>PAUL:</b> -- to approach an interview.</p>                \n                \r\n\n            \n                <p><b>GUTHRIE: </b>Ok. Is Iran still not a threat?</p>                \n                \r\n\n            \n                <p><b>PAUL:</b> No, no, no -- you've editorialized. No, no, no, no, no -- listen. You've editorialized -- let me answer a question.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> And earlier this year there was this exchange on CNBC.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>KELLY EVANS, CNBC ANCHOR</b>: Senator, I'm sure you know that most of the research on this indicates that these actually cost more money over the long-term than they save.</p>                \n                \r\n\n            \n                <p><b>PAUL:</b> No, that's incorrect.</p>                \n                \r\n\n            \n                <p><b>EVANS:</b> Are you saying this time will be different?</p>                \n                \r\n\n            \n                <p><b>PAUL: </b>Let's go back again. Your premise and your question is mistaken, ok? The whole purpose of doing this is to bring money home. There is -- let me finish -- hey, Kelly, shhh.</p>                \n                \r\n\n            \n                <p><b>EVANS:</b> I'm sorry, go ahead. I'm sorry, go ahead.</p>                \n                \r\n\n            \n                <p><b>PAUL: </b>Quiet -- calm down a bit here, Kelly.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> So, is Rand Paul mean to women reporters or is this just a controversy cooked up by his detractors? Joining me now my co-host on \"THE FIVE\" Dana Perino who was a former press secretary to George W. Bush. Dana -- a couple of examples. Rand Paul: mean or firm.</p>                \n                \r\n\n            \n                <p><b>DANA PERINO, FOX NEWS HOST: </b>I don't think that he is mean specifically to women. I do think that he is self-described as a person with a short temper. And it comes across especially in interviews and when you see interviews like the two that we highlighted tonight with Savannah and Kelly, yes, you could say that he looks like he is becoming very impatient with them. That comes across.</p>                \n                \r\n\n            \n                <p>Whether he thinks he is being rude to them or not, which I don't think that he does think that, it comes across that way so he has a perception problem. The thing with Kelly Evans that happened a couple months ago -- that was a really big deal. You would think that he and his staff would realize that's something that we have to work against.</p>                \n                \r\n\n            \n                <p>Savannah's questions were not out of bounds. They were absolutely the ones that any communications director would have told the candidate you can bet the first question is going to be about how you have changed positions on Iran. How are you going to answer that? That would be a much better way to spend his time than arguing with the media. That works with some people but not a broad swath of people.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>So and I watched that interview and I was watching Savannah Guthrie ask him a series -- like a list of questions. The senator was trying to get in. As an interviewer, when the interviewee -- when the guest tries to get in, you let him speak.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Oh, really? Oh really? That doesn't always happen. Here's the other thing he says that he is not good at these remote interviews. He admits this on air last night and says I don't like it when I'm in a room by myself, I can't see you. I think what he could have done is said \"I will tell you what, Savannah. I'm going to come to New York I would love to sit down with you where we can have an in-depth conversation. Right now what I would love to talk about\" -- it's not a rocket science. It's just a pivot back to what he -- to talk about.</p>                \n                \r\n\n            \n                <p>It's not the media that created the headlines that he is facing today. He created those headlines. I would feel the same way if somebody like Jeb Bush couldn't answer a very obvious question: how are you different from your brother? If he can't answer that and gets defensive at this point, he has a bigger problem.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Right. If the interviewer was asking about common core and asking about immigration and asking about taxes and what not --</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> She was specific about foreign policy.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Fair enough but if the interviewer didn't allow Jeb Bush to start answering some of the things that's --</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> No. This is not about the interviewer. This is on the candidate. He wants to be President of the United States of America.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> I'm just pointing out you are doing what Rand Paul said last night. I'm just having some fun with you.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> But you know what? I got my message across.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>You did. You did.</p>                \n                \r\n\n            \n                <p>Let me ask you this. So last night I watched Rand Paul being interviewed by Megyn Kelly who asked some very tough questions. In fact, she asked the same questions. He didn't get annoyed. So --</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> I was there.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>-- maybe he doesn't have a problem with women interviewers, he just has a problem with the way he is being asked the question.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> It's possible. I was on Megyn Kelly's show last night. I watched that interview and reacted to it. I actually think that she defended him for the most part and she was trying to give him a chance. She is also pointing out to him that you have a vulnerability. She is trying actually to help.</p>                \n                \r\n\n            \n                <p>And at this point, if you are going to announce for president, you shouldn't need that kind of help. If I were the candidate, I would say I have considerable strengths. I would tell my team I could have done better. Next week let's go to New York and I would like to do some interviews one on one.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Is there any up side for Rand Paul to say look, I was tough, I didn't like the questions. I didn't like the way I was asked the questions. I think they were unfair and I pushed back and guess what I will push back if and when I become -- or the President?</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> Sure. I think that he can do that but he has got to figure out a way to pivot and to make some news. This week was his week, right? This was his week to announce. Next week is Rubio's week and within the next week or so we expect Hillary Clinton to announce. He needed to strike while the iron is hot. He has some real work to do.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Will Hillary use this. Let's fast forward a couple of months from now: Rand Paul versus Hillary Clinton for president. Will Hillary use this? She has been out there with this Republican war on women already. I can imagine every campaign ad is going to be \"Hey, Kelly, shhh.\"</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>If she doesn't directly then certainly her people will. You know what I think Rand Paul needs is something that I have. When you are uncomfortable with something that someone you are sitting next to is saying like on \"THE FIVE\", the best thing to do is just look in the camera and go, hmmm, you've got to have a look. You get something --</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Have you done that?</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> I have done that. It's a signature thing. That signals to the viewer that you are uncomfortable with the question but you're going to let the person finish because you are a polite person and people like presidents who are polite.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Let me throw one more thing out. A lot of times you will ask a politician something, you ask a very specific question like where are you on this foreign policy issue. And you get a completely different answer. Would he be better off doing that?</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> I think that he has to figure out a way to say I hear what you're saying. Here is what my position is instead of arguing with the reporter about what the question is, he needs to it be able to tell us what his position is. He is vulnerable on having changed positions. You can change a position. You can evolve. Look at President Obama. He has done it a lot. You just have to be able to explain it.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Evolve -- he evolves so much he is revolving.</p>                \n                \r\n\n            \n                <p>Dana Perino, thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Accusations that Rand Paul is mean to women", "description": "Dana Perino weighs in on the fallout from the Presidential hopeful's recent interviews", "date": "2015-04-10T12:36:07Z"}