{"vcmId": "72138335-0ecf-469f-a588-b91c918e6d6f", "url": "http://www.foxnews.com/transcript/2017/02/10/elizabeth-warren-scolded-in-senate.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 9, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: FACTOR \"Follow-Up\" segment. As we reported last night, Senator Elizabeth Warren tried to brand Jeff Sessions a racist by reading a letter written by Coretta Scott King 31-years-ago. The letter had to do with the case. Mr. Sessions prosecuted while US Attorney in Alabama. Miss Warren was not allowed to read that letter.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. ELIZABETH WARREN (D), MASSACHUSETTS</b>: I asked a leave of the Senate to continue my remarks.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Is their objection?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: I object.</p>                \n                \r\n\n            \n                <p><b>WARREN</b>: I appealed the ruling --</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Objection is heard.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> The Senator will take your seat.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: With us now, Kerry Kennedy, president of the Robert F. Kennedy Human Rights organization. Miss Kennedy's late father was a senator from the New York State, her late uncle, a senator from Massachusetts. So, you object to Senator Warren being silenced, why?</p>                \n                \r\n\n            \n                <p><b>KERRY KENNEDY, PRESIDENT, ROBERT F. KENNEDY HUMAN RIGHTS</b>: Well, because she was there looking into the appropriateness of Jeff Sessions as the Attorney General of the United States. And she was bringing legitimate questions to his record.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. But --</p>                \n                \r\n\n            \n                <p><b>KENNEDY: </b>She should not have been silenced.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: -- there is a clear rule, and I am going to read it now. This is Senate rule 19, section two. All right. So, there is no senator in debate shall directly or indirectly,\" and this would have been indirectly reading Loretta Scott King's letter, \"by any form of words, impute to another Senator or other Senators any conduct or motive unworthy or unbecoming a Senator.\" So, she was trying to make the point, Elizabeth Warren was, that Sessions is a racist. And doesn't deserve to be attorney general. This clearly violates Senate rule 19.</p>                \n                \r\n\n            \n                <p><b>KENNEDY:</b> Well, actually, that rule was put into place so that senator is talking about other senators as senators would not attack each other.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. Yes. They didn't want them leveling personal charges against --</p>                \n                \r\n\n            \n                <p><b>KENNEDY:</b> Exactly. So, that is not what was going on here. Here, she was talking about an Attorney General candidate who happened to be a senator.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. That is still a sitting senator.</p>                \n                \r\n\n            \n                <p><b>KENNEDY</b>: But her point was not to talk about them as a senator, her point was to talk to him as a potential attorney general of the United States.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But it was still being done in the Senate to another senator. So, they both got ruled.</p>                \n                \r\n\n            \n                <p><b>KENNEDY</b>: That is true. But they have never done that in the past. I mean, they have spent a lot of time in 1979 when Ted Cruz attacked a senator --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It wasn't '79. Cruz wasn't in the Senate there.</p>                \n                \r\n\n            \n                <p><b>KENNEDY</b>: No, no, no. The invoked rule 19 -- the last time the invoked rule 19 was 1979.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>KENNEDY</b>: Cruz has recently called -- I think it was Mitch McConnell a liar and they didn't use that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. Look, you don't justify bad behavior by pointing to other bad behavior. Here's what I would have done if I had been Elizabeth Warren, I would have said, I don't believe that Jeff Sessions is worthy to become Attorney General and here is why. And to back up my contention, I point to a letter written by Coretta Scott King about Mr. Sessions prosecution of civil rights workers in 19 whenever it was.</p>                \n                \r\n\n            \n                <p>And you can read that letter on my website. She could have done that easily. Easily. It wouldn't have been in violation of anything. But she wanted to hot shot at. Grandstand it for her own constituency. You know what she was doing. You have been in politics long enough. She was just - - and they caught on to it. This was demeaning. She didn't have to do that. You could have got your point across.</p>                \n                \r\n\n            \n                <p><b>KENNEDY:</b> Well, you know what, I think that is one way of approaching it. But I think that Coretta Scott King, she is an American icon.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Sure.</p>                \n                \r\n\n            \n                <p><b>KENNEDY</b>: And her husband was the leading civil rights --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But that doesn't mean you violated Senate rule. You can direct people to her --</p>                \n                \r\n\n            \n                <p><b>KENNEDY</b>: You know, I have to say, I don't think she was violating the Senate rule.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay, but that is not your call because that is the call that was made by the Senate.</p>                \n                \r\n\n            \n                <p><b>KENNEDY</b>: Well, but as we know people in power don't always make calls that are --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't mind you criticizing the call but there wasn't really much argument from the left on it because the role, as I just read, is pretty explicit.</p>                \n                \r\n\n            \n                <p><b>KENNEDY</b>: Well, I think the point here is not whether, did she break a technical rule or not. The point is, should this man, with a racist past, and who says that to --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But that is your opinion.</p>                \n                \r\n\n            \n                <p><b>KENNEDY</b>: No, no, that is not an opinion.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No, no, no. He was never branded a racist by anybody.</p>                \n                \r\n\n            \n                <p><b>KENNEDY:</b> Oh, excuse me, but I think that nobody has come forward, not one Republican has come forward to dispute --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure, they have.</p>                \n                \r\n\n            \n                <p><b>KENNEDY:</b> No, no. Excuse me, to dispute what Coretta Scott King said about him, which is that he tried to --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I'm not sure whether anybody delved into that case 31 years ago. But 52 Republican senators voted him attorney general. Many of whom --</p>                \n                \r\n\n            \n                <p><b>KENNEDY</b>: They don't think he is racist --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Are you saying that senators in the United States would vote a racist --</p>                \n                \r\n\n            \n                <p><b>KENNEDY</b>: Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You think so?</p>                \n                \r\n\n            \n                <p><b>KENNEDY:</b> I don't think so. They have done it in the past.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't think so. And I don't think it is fair to brand him a racist. Because as I said, it has never been proven in any way, shape, or form. He has put forth his point of view, that as U.S. attorney in Alabama, he prosecuted cases that put racists in prison. He did civil rights legislation aggressively. So, you can think he is. It is not fair to say definitive that he is. Last word.</p>                \n                \r\n\n            \n                <p><b>KENNEDY:</b> So, let's say this. Let's look at what he is going to do, the way he is acting. And I can tell you that Robert F. Kennedy's Human Rights is going to be watching him every single day.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And the ACLU. Right?</p>                \n                \r\n\n            \n                <p><b>KENNEDY: </b>And we are going to be holding him accountable and be calling him out and I look forward to coming back on your show.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Absolutely. And you are always welcome. But I think you do yourself a disservice and you know that I respect your late father immeasurably by branding people a racist. I don't think it's the right thing to do. Just my opinion. Miss Kennedy, thank you.</p>                \n                \r\n\n            \n                <p><b>KENNEDY:</b> Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Elizabeth Warren scolded in the Senate", "description": "Kerry Kennedy joins 'The O'Reilly Factor' to react to silencing of far left senator", "date": "2017-02-10T13:07:20Z"}