{"vcmId": "72afe7de-168e-4ae7-8968-8d3f6227e9b4", "url": "http://www.foxnews.com/transcript/2017/02/07/bill-oreilly-exclusive-interview-with-president-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 6, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Caution, you are about to enter the No Spin Zone, THE FACTOR begins right now.</p>                \n                \r\n\n            \n                <p>Hi, I am Bill O'Reilly. Thanks for watching us tonight. As you may know, my interview with President Trump making headlines all over the world. And tonight, we will show you what you did not see in the Super Bowl pregame show. Here is what happened. We interviewed the President on Friday afternoon, at the White House. The interview ran about 40 minutes. Ten of which were used by FOX Sports.</p>                \n                \r\n\n            \n                <p>So, that leaves us with half an hour. To show you tonight and tomorrow. The headlines out of the Super Bowl interview where Mr. Trump comments on the Russian and Putin and the anti-ObamaCare roll-up. It's interesting to watch our two competing cable news stations, which hate, hate Mr. Trump to an unhealthy degree. Try to analyze what the President told me. I thought Donald Trump was straightforward and honest in that interview, whether you like his answers or not.</p>                \n                \r\n\n            \n                <p>But the Trump haters were trying desperately to find something with which to hammer the President. Also apparently the Putin administration in Moscow demanding that I, your humble correspondent, apologized for saying old blood is a killer. So, I am working on that apology, but it may take a little time. Might want to check in with me around 2023. In a conference call with reporters, Putin's press guy said this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DMITRI PESKOV, VLADIMIR PUTIN'S SPOKESMAN (through a translator):</b> We think words like that coming from the FOX correspondent are unacceptable, offensive, and to be honest, we would prefer to get an apology to the President coming from such a respected company.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> One footnote, if you like to know more about the violent history of Vladimir Putin, you might check out the book \"I Ware\" by Bill Gertz, a Washington Times reporter.</p>                \n                \r\n\n            \n                <p>Anyway, tonight, we have a number of subjects that we presented to President Trump. Here they are.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Let's talk about Iran, your assessment, do you think we are on a collision course we being the United States with that country?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I think it was the worst deal I've ever seen negotiated. I think it was deal that should have never been negotiated.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The nuclear deal?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Absolutely. The deal that was made by the Obama administration, I think it's a shame that we've had a deal like that and that we had to sign a deal like that and there was no reason to do it. And if you're going to do it have a good deal. Secretary Kerry who was negotiating it never once left the table. We have the worst of everything. We've already given them billions and billions, probably hundred $50 billion. We gave them $1.7 billion in cash, which is unheard of. And we put the money out. And we have really nothing to show for it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Possibly you'll tear it up?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: We will see what happens. And we'll going to see what happens. I can say this, they had total disregard for our country. They are the number one terrorist state, they're sending money all over the place and weapons, and can't do that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Sanctions, that's how you're going to start with them?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Just started.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But you're going to move in a carrier, right?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, we're just started with sanctions. I never talked about military moves. I always criticize President Obama with having an announcement that they're going into Mosul, they're going to some place. And they give the name, the date, the time. I don't believe in that. We will -- let's see what happens. But I don't like to talk about what we do militarily.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, you're not real bullish on Iran at this point.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: No, I'm not bullish. It's like they're emboldened. They follow our planes, they circle our ships with their little boats, and they scream things at us. It is what happened -- it's not good. You would thought what the deal they made, which was a great deal for them and a horrible deal for us, that they would have had a warmth toward our country, and it's exactly the opposite. They lost respect because they can't believe anybody could be so stupid as to make a deal like that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Let's talk about Mexico. There was a report that you talk to President Nieto, and you told him that this was the report. I want to know if it's true or not. That if his arm he couldn't handle the drug cartels, that U.S. army soldiers would. Did you say that?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>We have to do something about the cartels, I did talk to him about it. I want to help him with it. I think he is a very good man. We have a very good relationship, as you probably know. We will going to have a wall, we will going to have a border. We have to stop drugs from coming into our country, and if he can handle it, and maybe they can and maybe they can't or maybe he needs help, he seemed very willing to get help from us because he has got a problem and it's a real problem for us.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, President Nieto of Mexico was open to the possibility of U.S. forces, all right? Helping him combat the drug cartels.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I would rather, as a very nice man that he is and somebody I respect, I would rather have him respond to that. But I will tell you, I certainly offered him help on knocking out the drug cartels because we have got a problem. Don't forget those cartels are operating in our country, and they are poisoning the youth of our country. And by the way, countries all over the work, just so you understand, this is a cartel all over the world, the cartels. But I certainly would help him if he needed the help here</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> At this point, do you consider Mexico a corrupt country? Because this stuff has been going on for decades. His Mexico corrupt.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Well, it's a country that has got difficulty. It's certainly has done well with us. We have a trade deficit with Mexico of $60 billion a year. That doesn't include drugs, and it doesn't include the border and all the things that are happening on the border. But it is a country that I have great respect for the people. I love the people. I really like this administration. I think he is a good man. We get along very well. But they have problems controlling aspects of their country. There is no question about it. And I would say that drugs and the drug cartels number one.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Have you figured out what kind of a tariff you're going to levy on Mexico to pay for the wall?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, we might not have to do that. They want to negotiate a deal. I want to negotiate a deal. We will see what happens. But we can always do a tariff or a tax if necessary, and we will do that if necessary. But if we can make a deal, we assignment of NAFTA, but I am going to put another F in the name NAFTA because right now it's free trade, and I'm going to have it fair trade also because it's not fair.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> We are losing, Bill. We are losing $60 billion a year in trade deficits with Mexico. We can't do that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You talked to Putin last week. You had a busy week last week.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I had a busy week. Yes. Busy week and a half.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But within 24 hours of you on the phone with the Russian leader, the pro-Russian forces step up the violence in Ukraine.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Did you take that as an insult?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No I didn't because we don't really know exactly what that is. They're pro-forces. We don't know if they're uncontrollable? Are they uncontrollable? That happens also. We're going to find out. I will be surprised, but we will see.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you respect Putin?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I do respect him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you? Why?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, I respect a lot of people. But that doesn't mean I am going to get along with him. He's a leader of his country. I say it's better to get along with Russia than not. Will I get along with them? I have no idea.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He is a killer though. Put is a killer.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> There are a lot of killers. Do you think our country is so innocent? Do you think our country is so innocent?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't know of any government leaders that are killers in America.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Take a look at what we have done too. We've made a lot of mistakes. I've been against the war in Iraq from the beginning.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. Mistakes are different then --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: A lot of mistakes, okay? But a lot of people were killed. So, a lot of killers around, believe me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. You mentioned ISIS. Can we expect, we the American people, more U.S. military action against ISIS?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: You know, I hate to be evasive but --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You know, tell me specifically.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I don't like talking openly about it. I don't like talking openly about it. I can say this, ISIS is bad. They are evil. They cut off heads of Christians and Muslims and anybody else that gets in their way. They drown people in steel cages. This is like not since the medieval times has anything happened like this. And the previous administration allowed it to happen because we shouldn't have been in Iraq, but we shouldn't have gotten out the way we got out. It created a vacuum, ISIS was formed. I was to take the oil. If they would've taken the oil, there would be no ISIS because they used that to --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: If you took the oil, the Iraqi oil, you would have to put in U.S. troops to do that, and then that would have started another round of it.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> And you would have made a lot of money with the oil and you would have had assets and to the -- and all of that. But forget that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. Let's turn to domestic policy. When can Americans expect the tax cuts? This year?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Yes. We are working very much right now on the health care package. Which I think would be -- it is moving along very well. We are trying to get our person Dr. Tom price approved, as you know, the Democrats are being purely political reasons.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>That is terrible.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But let me get you on the record here. 2017, can Americans expect a tax cut?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I think so, yes. And I think before the end of the year, I would like to say yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. Can Americans in 2017 expect a new health care plan ruled out by the Trump administration? This year.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, in the process, and maybe it will take until sometime into next year, but we are certainly going to be in the process. Very complicated. ObamaCare is a disaster. You have to remember, ObamaCare doesn't work. You look at Arizona, 160 percent increase. You look at Minnesota, all of these places it's going through the roof.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's done.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: It doesn't work.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But when are you going to have something ready?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: We're going to be putting it in very soon. I think that yes, I would like to say by the end of the year. At least the rudiments, but we should have something within a year into the following year. And by the way, we will have something that is good. Less expensive and really great health care.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Next on the rundown, part two of the Trump interview, we focus on immigration, Kate's Law, and Mr. Trump's relationship with President Obama. Coming right back.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly's exclusive interview with President Trump", "description": "Bill and President Trump discuss Iran, Mexico and the future of healthcare on 'The O'Reilly Factor'", "date": "2017-02-07T13:26:56Z"}