{"vcmId": "72c74e13-e203-4396-b4af-81f20dd944ae", "url": "http://www.foxnews.com/transcript/2017/01/17/bill-oreilly-factor-viewers-come-through-again.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As you may know, some vicious, hateful people are trying to sabotage the presidential inauguration set for this coming Friday. There is no excuse for that. Peaceful transition of power should be respected by all loyal Americans. In fact, the term, loyal opposition, is a badge of honor. Because we need differing opinions driving a vibrant society.</p>                \n                \r\n\n            \n                <p>But when you take the word \"loyal\" out, then, and it is simply a position, that is a subversion of the republic. Enter the Talladega College marching band, 230 strong. The tornadoes are a fabulous part of a very important Alabama College. Talladega was founded by ex-slaves, it's an excellent African-American school, it creates opportunities for students, who may not have many resources. The Talladega tornadoes were invited to perform at the inauguration. Ninety nine percent of the band have never been to Washington, D.C. Kids were thrilled. Then came the threats. Directive of the college president, Dr. Billy Hawkins. He spoke to The Factor on Thursday.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BILL HAWKINS, PH.D, PRESIDENT, TALLADEGA COLLEGE:</b> They have said that I have shamed the college by making this decision and I have had, you know, folks that say that, you know, that I am a disgrace to my African-American race and it has been pretty nasty.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, immediately after that interview, donated money from Factor viewers ported to GoFundMe.com to help the Talladega band. As it stands right now, the college has received -- ready -- close to a half million dollars for the band and for scholarships. That is simply amazing.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HAWKINS:</b> We owe Bill O'Reilly and The O'Reilly Factor a great thank you for the appearance on the show. We are just so happy that they'll have the opportunity, as American citizens, to have the opportunity to march down Pennsylvania Avenue, to be a part of the civic ceremony. And I am just excited for the students. The culture that we get to Friday, the more excited I become.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Great story. Again, The Factor viewers have donated so much money to help Talladega, not only will the vendor to go to the inauguration, it will have its entire infrastructure upgraded and scholarships will be provided to help poor students. My foundation donating $25,000. The bigger picture is this. Much of that money donated was given by Trump supporters, the Deplorables that have been demonized as racists by some on the hateful far left.</p>                \n                \r\n\n            \n                <p>The story is vivid proof that generalizing, generalizing about any group of people and is foolish and dishonest. Dr. Hawkins knew what he was doing when he came on The Factor. He could have gone on any program, but he chose us, because he knows this audience, you guys, are watching because you want fairness and justice.</p>                \n                \r\n\n            \n                <p>On this Martin Luther Jing Jr. Federal Holiday, the Talladega College marching band ready to perform at the inauguration. The students will never forget that honor. The country should be grateful to have these kids in D.C. And The Factor audience has made it all possible. And that is \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Factor viewers come through again", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points memo 1/16", "date": "2017-01-17T13:06:55Z"}