{"vcmId": "738d5bbd-ca26-4dce-a875-d9c7d447d535", "url": "http://www.foxnews.com/transcript/2017/03/24/sean-spicer-enters-no-spin-zone.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 23, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p> <b>ERIC BOLLING, FOX NEWS HOST:</b> Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching us tonight. Let's get straight to our top story.</p>                \n                \r\n\n            \n                <p> A wild day in Washington over health care, a vote for the Republican plan scheduled for tonight has been canceled due to a shortfall of support, leading G.O.P. leaders scrambling to get more lawmakers behind it.</p>                \n                \r\n\n            \n                <p> Joining us now from Washington with reaction, White House Press Secretary Sean Spicer. Sean, let's get right to this news that literally came across the wires a couple of minutes ago. It says that the boss, the President, is demanding a vote tomorrow, Friday, on the health care law.</p>                \n                \r\n\n            \n                <p> <b>SEAN SPICER, WHITE HOUSE PRESS SECRETARY:</b> My understanding, he's going to get it. The President has been working the phones, he's having in person meetings throughout the day. His team has been up and down Capitol Hill here at the White House. This is the opportunity for people who have waited for years to see ObamaCare repealed and replaced to have it happen.</p>                \n                \r\n\n            \n                <p> Ironically, Eric, today, is the seven year anniversary of ObamaCare. We are hoping to make this the last anniversary that any American has to suffer under ObamaCare by instilling a patient-centric health care system in place. And the President has made that case to members throughout the spectrum of the Republican conference and tomorrow, it is time to vote.</p>                \n                \r\n\n            \n                <p> <b>BOLLING:</b> Okay. So, former Speaker Nancy Pelosi called that, the fact that it is today, the seventh anniversary of ObamaCare, called it a rookie mistake on your guys part.</p>                \n                \r\n\n            \n                <p> <b>SPICER</b>: Look, Nancy Pelosi set out several criteria about how you can judge ObamaCare, the cost, and the choice that people have, all of those are an abysmal failure. One in three counties in America only have one choice. Premiums have skyrocketed, deductibles have skyrocketed. Americans don't have choice, they don't have coverage. They may have a card but they don't have coverage and I think for anyone to defend ObamaCare, it is collapsing under its own, the American people know it, they are paying too much. They're getting too few choices. This is finally going to be the repeal and replace that they've waited for for a long time. And respectfully, I think we got a much better way of doing this.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: You know, Sean though, for weeks, we have heard that you had the votes, Paul Ryan have the votes, he's going to deliver a bill to the President's desk that he could push through and get behind and get his name behind, and now we have this postponement for a day. Is the President -- is he disappointed with the health care bill that he has been presented?</p>                \n                \r\n\n            \n                <p> <b>SPICER</b>: No, not at all. In fact, the President has met with several groups today, with the House Freedom Caucus today. And yesterday the Vice President, their team were actually involved, he just got done meeting with the House Tuesday group, a group of moderates. Sixteen of the 17 that walked were either maybe or nos, excuse me, 17 of them were maybes or nos and 16 of 17 walked out yeses. The President continues to make tremendous progress on that.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: Yes. But Sean, those are the guys that you need, you need --</p>                \n                \r\n\n            \n                <p> <b>SPICER:</b> No, we need them all, Eric.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: Well, you're going to get those, those aren't the guys you're going to get. The ones you need are the Freedom Caucus, you got, I guess there is about 30 or so members, you got leeway with 22. You can lose 22 but you can't lose 30.</p>                \n                \r\n\n            \n                <p> <b>SPICER</b>: Right. And I think, but it was on both ends of the spectrum, and it is a balancing act. Every time you pick up a few, we had to worry about not getting a few on the other end of the spectrum. I think 16 of the 17 Tuesday group members came in today and reiterated their support today for it. But he also had a great meeting with the House Freedom Caucus. And I think that they made significant changes to the bill that they have put forward that make it a stronger bill, they continue to move forward toward the principles that we laid out, they continue to meet tonight.</p>                \n                \r\n\n            \n                <p> But I think, at the end of the day, this is the only train leaving the station that is going to be repealing ObamaCare in giving us an alternative to replace it. This is the train that is leaving the station. This is the choice that we've been waiting for. This is the pledge that people have made to the American people.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: All right. Sean, so you know, and I am watching this from the other side of the camera here, you guys telling me it's going to happen and we've been here and it's going to happen. Is the President disappointed with the Speaker of the House?<br> <b><br> SPICER</b>: No, not at all. Speaker Ryan and Leader McCarthy, Congressman Scalise have been tremendous in terms of helping to talk to members, continue to reach out, put aspects in the bill that people had wanted to make it stronger and better. But look, Eric, we could have continued through the night and voted in the middle of the night, that's what Democrats have done in the past. That's not what we're going to do. We wanted to do this in broad daylight tomorrow, when everyone in the American people concede. Not only the bill that we put online days ago but actually watch the debate take place and watch the vote go down.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: All right. If the bill doesn't pass, should the Speaker resign? Should Paul Ryan resign, Speaker of the House?</p>                \n                \r\n\n            \n                <p> <b>SPICER</b>: No. Absolutely not. This has been a great team effort on the Republican's behalf. But at the end of the day, I don't think that's going to be necessary because I think the President has made a very, very strong case as to why this is everything that we have talked for years --</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: But if it doesn't pass, Sean, can the President still have confidence in the Speaker to deliver his -- if it doesn't?</p>                \n                \r\n\n            \n                <p> <b>SPICER</b>: Look, I understand the question, Eric, but I'm not thinking that way. We put our heart and soul into this bill, the President has been working the phones and having meetings consistently for the last several days. He has been behind this from the get-go. He's been working with the speaker and meeting with all sorts of members to get this through make it the best bill we can.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: No, I get this Sean. I understand he is a dealmaker and he is taking this upon himself to get this through. Did he expect to spend this much political capital having to push this thing through? You know, that's his political capital. You know, he has got tax reform coming, he's got some immigration plans coming. And that's all capital that he is going to have to spend now on health care that maybe he didn't think, Paul Ryan told him he wasn't going to need to spend this early.</p>                \n                \r\n\n            \n                <p> <b>SPICER:</b> The President knew it was going to be tough from the get-go. This is an effect of our economy. There is a lot of ideas that are percolating since 2010. When Republicans started campaigning the repeal and replace ObamaCare. We knew it. We knew it was going to be tough, we knew there were a lot of ideas out there. And it is a balancing act to get to 216 in this case to make sure we can pass it. But the President has put everything he can on this. He's left nothing in the field. And frankly this is the same way he campaigned. He went into the 11th hour. He made the case to the American people and he won. And I think we will going to see the same level of success when it comes to this effort as well.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: All right. Sean, let's start the other big story that's been percolating from the last couple of days, specifically yesterday and today. The wiretaps. What is going on? Devin Nunes came to the White House yesterday to brief the President. What was going on with that? What did he say?</p>                \n                \r\n\n            \n                <p> <b>SPICER</b>: Well, I think Chairman Nunes, who is chairman of the House Intelligence Committee, held a press conference with members of the media, explained that he had come upon information that he thought was troubling, concerning to him, that didn't have to deal with the probe regarding Russia, that showed that there was surveillance about the president and his team during the transition period and wanted to explain that to the President. He came to the White House as we said after he briefed the media, came and shared some of his topline findings, explained to him the reports that he had seen in his position as chairman of the House Intelligence Committee, there were things that are troubling him about some of the --</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: Sean, those bombshell.</p>                \n                \r\n\n            \n                <p> <b>SPICER</b>: Yes.<br> <b><br> BOLLING:</b> I mean, when I saw this, I was blown away that this was going on, but when the President was asked, he said, he felt somewhat, quote, \"somewhat\" vindicated. Why not make this big? Why didn't he go after and say, see, this is what I've been saying all along.</p>                \n                \r\n\n            \n                <p> <b>SPICER</b>: Well, I think the President recognized that Chairman Nunes had started to look at the reports that have been made available, he wanted to see the full reports. And that this is a process. The President feels very confident that he will be vindicated, that there was surveillance during the 2016 election period, and that this should be a concern tonight, everyone. And as I said today from the briefing, Eric, you know, it is amazing that the mainstream press was all focused on the process, not the substance.</p>                \n                \r\n\n            \n                <p> This should be concerning to everyone. The people, American citizens, including, you know, the President and the transition team members, according to Chairman Nunes, were surveilled in some way shape and form, we don't know yet because we don't have all the intelligence that Chairman Nunes is looking at.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: Is there more? I mean, are we waiting to hear more?</p>                \n                \r\n\n            \n                <p> <b>SPICER</b>: He has indicated that there are additional reports that he wants to take a look at. We have asked him and Senator Burr on the Senate side to make sure that they are investigating all of these concerns that are coming up and why they're happening. But also importantly, why there are so many leaks that are out there, why are American citizens being unmasked, is what they call it, which is, when they come up in an intelligence report and their identities, not supposed to be known, why is that being unmasked, as they call it in the intelligence world, so that people know that they were involved or monitored in some way.</p>                \n                \r\n\n            \n                <p> <b>BOLLING:</b> It's terrible. It's terrible. You know, I have been completely on the side of, they can't just do this, they just can't arbitrarily unmasked, they can't arbitrarily target for surveillance, American citizen. My question is this, Michael Flynn got unmasked, why don't we just go find out who did it?</p>                \n                \r\n\n            \n                <p> <b>SPICER</b>: We need to. Absolutely. And we share that concern. I think that is what the President has made very clear from the beginning, not only do we need -- of that. But who are the people that have and continue to leak classified and other important information throughout the government. This is something that has plagued our government for a long time, and the President has made clear that it has a direct impact on our national security and the ability for not only heed but other individuals to talk about sensitive matters, and to make sensitive deals to protect the interests of our country.</p>                \n                \r\n\n            \n                <p> It should be something that everyone in this country is concerned about, that there is a reason that we have security clearance and there's a reason we classified information, it's to protect this country and our people. And when we see these kinds of leaks coming out of Washington --<br> <b><br> BOLLING</b>: So, does the President have the confidence in James Comey and his Intel Community?</p>                \n                \r\n\n            \n                <p> <b>SPICER</b>: The President does have confidence at this point in the Intelligence Community. He's obviously very concerned about the information that he has heard from Chairman Nunes, and looks forward to the House Intelligence Committee and the Senate Intelligence completing their review of the situation so that we can fully understand what happened.</p>                \n                \r\n\n            \n                <p> <b>BOLLING:</b> All right. Sean, we are going to leave it right there. Thank you very much for joining us tonight.</p>                \n                \r\n\n            \n                <p> <b>SPICER</b>: Thanks, sir.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: Big, big, busy news day. Thank you.</p>                \n                \r\n\n            \n                <p> <b>SPICER:</b> You bet.<br> <i><br> Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Sean Spicer enters the 'No Spin Zone'", "description": "This is a RUSH transcript from \"The O'Reilly Factor,\" March 23, 2017.", "date": "2017-03-24T12:03:00Z"}