{"vcmId": "757b9bba-cd3a-4268-8302-1f6bc836bb4e", "url": "http://www.foxnews.com/transcript/2016/03/22/bill-oreilly-what-next-president-should-do-to-save-usa.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Many Americans, myself included, are getting tired of the stale rhetoric by politicians on both sides. The harsh truth is, most of what they say will never happen. That's why people are so angry. Because the words disappear after the votes are cast. The next president will be facing complex problems that have been festering for years.</p>                \n                \r\n\n            \n                <p>First, income inequality. Working Americans not getting ahead. That's been going on for decades. The reason is companies do not have to pay unskilled workers decent salaries because there is too much competition at that level. If do you not have a skill, are poorly educated and are not willing to move to where the jobs are, you're in trouble. And millions of Americans find themselves in that very place. The solution to income inequality is not big government giveaways, Senator Sanders is pedaling a myth. Income inequality can only be overcome by education.</p>                \n                \r\n\n            \n                <p>The next president has to level with the folks. You must learn a skill and you must know how to conduct yourself in the marketplace. No tattoo on your forehead. Public schools receiving taxpayer money. Have to be revamped, totally revamped. Emphasizing basic educational skills, basic math, reading, spelling, and you have to know how write a sentence. And you have to know how to say it. And the high schools have to provide courses that are job-targeted. Remember shop?</p>                \n                \r\n\n            \n                <p>The crux of all this income business is an inability to compete. Public schools must deal directly with that. Now, the second thing the new president must do is mobilize NATO to defeat the jihad. That's long overdue as well. The most powerful military alliance on earth must confront Islamic terrorism and provide safe zones for refugees in places like Syria and Libya. Right now, the jihad is on the move in Africa, Asia and the Middle East. President Obama has dithered, allowing ISIS and other groups to grow stronger. It's got to stop. If some NATO countries won't cooperate, throw them out. Period.</p>                \n                \r\n\n            \n                <p>Finally, immigration and border security. There is no question a wall between the U.S.A. and Mexico is needed simply to stop the tons of hard narcotics flowing into America. The drug cartels control much of Mexico. And that's not likely to improve any time soon. We need to stop the madness down there and secure our border. A war will not solve every problem but it can be effective as the Israelis have shown the world it's worked over there. Once an effective barrier is built, illegal aliens currently living here can be dealt with in a fair way. They will all have to register with the federal government. All of them.</p>                \n                \r\n\n            \n                <p>And then Congress should pass a series of new laws defining their status. Those who have broken immigration law are not, not entitled to citizenship. But, we can be humane if they have kids who are American citizens, extended families, been here a long time. We can be humane. And allow some of them to work off a punishment in return for a green card. So, those are the top three priorities for the new president. And now Talking Points has a very simple question. Do you believe any of the candidates could accomplish those things? And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: What the next president should do to save the U.S.A.?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/21; Plus reaction from Charles Krauthammer", "date": "2016-03-22T19:22:32Z"}