{"vcmId": "759136f4-ca98-44b1-9f84-c34ca56ac25b", "url": "http://www.foxnews.com/transcript/2015/07/29/bill-oreilly-is-america-becoming-barbaric.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Today pro-life Americans in more than 50 cities protested against Planned Parenthood after gruesome undercover videos showed the organization selling the organs of dead babies.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Today the U.S. Department of Justice should open a criminal investigation into whether Planned Parenthood nationally is a criminal enterprise breaking the law.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> At least eight states are now investigating Planned Parenthood which receives about $500 million a year from the American taxpayer. That's obviously wrong. Planned Parenthood should be privately funded, and if -- if it is breaking the law, some executives should go to prison.</p>                \n                \r\n\n            \n                <p>Also today the pro-life group Center for Medical Progress yet another undercover sting video. This one shows Dr. Savita Ginde, the medical director of Planned Parenthood in Colorado talking about selling the body parts of a fetus aborted after 11 weeks, six days.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>11/6 was pretty good. There were like three or four samples we could have taken out of the 11/6 and that would be, you know, if we were doing like $50 to $75 per stuff. Then that will be like $300 but we would be covered.</p>                \n                \r\n\n            \n                <p>But like I said with stuff like this we don't want to do like just flat fee of like $200 and then it's like --</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> No. And I think the per item thing works a little better just because to see how much you can get out of it.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The words \"how much we can get out of it\" are damning for Planned Parenthood. Now, very quietly, an industry that harvests and sells body parts from babies has developed in the U.S.A. Planned Parenthood is part of that industry.</p>                \n                \r\n\n            \n                <p>It does business with a company called Stem Express based in Placerville, California. Stem Express buys bodies from Planned Parenthood and other abortion providers. Then dissects them, selling organs to medical research operations.</p>                \n                \r\n\n            \n                <p>A woman named Holly O'Donnell was hired by Stem Express to draw blood from dead babies. Here's how Miss O'Donnell describes being trained by a Stem Express employee.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HOLLY O'DONNELL, HIRED BY STEM EXPRESS:</b> She has tweezers and she's like, ok, this is the head. This is the arm. This is a leg. And she hands them over, here you go. Can you show me some of the parts I just showed you and I grabbed the tweezers, I'm like -- because I didn't wasn't to lose this job. I didn't know. I was already stoked to get it so I did what she said and the moment I took the tweezers, I put them in the dish.</p>                \n                \r\n\n            \n                <p>I remember grabbing a leg and I said saying this is a leg and the moment I picked it up, I could just feel like death and pain.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Planned Parenthood says it is not doing anything wrong and markets the bodies of aborted babes to help science. But there's no question that big money is involved. \"Ink Magazine\" is reporting Stem Express is very profitable. Revenue -- more than $2 million a year.</p>                \n                \r\n\n            \n                <p>We don't know how much money Planned Parenthood makes in the process but we should know. After all a half billion dollars of our tax money is given to that organization every year.</p>                \n                \r\n\n            \n                <p>There comes a point Americas have to decide what kind of country they can tolerate. Whether you're pro-choice or pro-life, the undercover video showing Planned Parenthood bargaining over the price of dead babies before they're even extracted from the womb is grisly beyond belief. Yet there's no remorse from Planned Parenthood and the White House is standing by them.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOSH EARNEST, WHITE HOUSE PRESS SECRETARY:</b> They have made very clear that they subscribe to the highest -- they subscribe and implement the highest ethical standards when -- in carrying out their operations.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> In light of the undercover videos, that statement is false and absurd. An insult to the American taxpayer.</p>                \n                \r\n\n            \n                <p>Talking Points is appalled about the lack of leadership in America and also about the apathy on the part of many individual Americans who could not care less what happens to the unborn. Congress must now get involved and at least suspend tax payments to Planned Parenthood until a federal investigation is completed.</p>                \n                \r\n\n            \n                <p>If Congress does not do that, we can then rightly be criticized by countries Iran and Russia as being a barbaric nation. We will lose all moral authority in the world.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly:  Is America becoming barbaric?", "description": "Bill O'Reilly's Talking Points 7/28", "date": "2015-07-29T12:09:08Z"}