{"vcmId": "76c0262d-cf50-4ecb-b6bc-ff21e357b7da", "url": "http://www.foxnews.com/transcript/2014/12/19/top-stories-2014.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 18, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Weekends with Bernie Segment\" tonight, the purveyor of BernardGoldberg.com's most interesting stories of the year. He joins us from Miami.</p>                \n                \r\n\n            \n                <p>So, you've got 10 stories. It's going to be like the Dick Clark, American Bandstand countdown. Start off with number 10 -- which is it?</p>                \n                \r\n\n            \n                <p><b>BERNARD GOLDBERG, FOX NEWS CONTRIBUTOR: </b>Ok. Number 10 starts out where you left off in the last segment with the two colonels -- the Bowe Bergdahl story. He was traded for five Taliban commanders. We still don't know if he was AWOL or if he was a deserter because the Pentagon which conducted a survey -- a report isn't telling us what they said. Maybe they'll tell us soon. Maybe they won't.</p>                \n                \r\n\n            \n                <p>Number 9, the border crisis in America focusing on the tens of thousands of little children who came across the border and President Obama's executive order to, what in some people's view is give amnesty to millions of illegal aliens.</p>                \n                \r\n\n            \n                <p>Number 8 --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, let me stop you -- let me stop you with that. What do you think the children's entry into the U.S.A., 75,000 of them, says about the country?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Well, it says we're incredibly generous. How is that for openers? Just about any other country would have turned them away. And I worry about what this will lead to, you know.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, it's a big story. I think it just shows that the border is not secure. And that's a pretty frightening scenario.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Number 8?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Number 8 is the missing Malaysian jetliner, terrible tragedy but a great mystery story.</p>                \n                \r\n\n            \n                <p>Number 7, President Obama's decision just yesterday to restore diplomatic relations or to normalize them with Cuba after 50 years -- that's a big deal.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How is that playing in Miami where you live?</p>                \n                \r\n\n            \n                <p><b>GOLBERG: </b>Well, you know, there are two groups of Miami Cubans -- the older ones and the younger ones. Older ones, like when I first came down here in 1969, the older ones would have blown things up over this and they did blow things up in those days. The younger ones don't feel the same way. So --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Divided scenario right now?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Yes.</p>                \n                \r\n\n            \n                <p>Number 7, no, that's number 7. Number 6, ebola -- not just because of the tragic loss of lives in West Africa but because of the frightening effects it had had here in America.</p>                \n                \r\n\n            \n                <p>Number five is a biggie because of its implications -- Vladimir Putin and the destabilization of the Russian economy. Who knows what Putin is going to do next to try to get things right with oil prices? That will continue into 2015.</p>                \n                \r\n\n            \n                <p>Number 4, another biggie -- cyber terrorism. I fear that what we're seeing currently with Sony, not only isn't going to be the last, I'm pretty sure of that, but may wind up being trivial compared to what else some foreign power may decide to do. If they can do this with Sony and cause this much havoc what can they do with our grid system, our power system.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. This is emerging as one of my big stories of the year because of the intensity of the destruction. And it's going to be interesting to see what Congress and President Obama do. Can't allow North Korea to get away with it -- you can't. So, if they prove it, that they did it then there has to be reprisal from the U.S.A. against North Korea -- has to.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Exactly. And I am not trying to foment any crazy stuff, but if they decide to knock out our power system.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Or try to -- right.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> It's not beyond crazy people to do that or try to. That's an act of war. That is an out and out act of war.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The big story going forward is what will President Obama and Congress do to North Korea to send a message that if countries mess with us this way, all right, they are going to feel some pain. So it will be interesting to see.</p>                \n                \r\n\n            \n                <p>All right, you have got three more left. Go.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Number three, doesn't need much explanation, Ferguson and its aftermath.</p>                \n                \r\n\n            \n                <p>Number two, the rise -- that's Ferguson and the aftermath is what you are watching right now.</p>                \n                \r\n\n            \n                <p>Number two is the rise of ISIS and the depravity of radical Islam -- whether it's chopping off the heads of innocent people or, as the Taliban and Pakistan did just this week, killing more than 100 children in retaliation for something the kids had absolutely nothing to do with. That's depravity.</p>                \n                \r\n\n            \n                <p>And number one, because it's a political story that will affect the rest of President Obama's presidency, the GOP tsunami in the midterm elections this year.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>And, of course, Bill, of course, not only can reasonable people disagree on the list. But the order is totally, you know, anybody can disagree with that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. What does Ferguson tell you about the U.S.A.?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Well, I'm troubled by the liberal reaction to Ferguson. When people and you have spoken of this quite well -- when football players come out with their hands up, don't shoot, which apparently never happened, that's troubling because people aren't -- they don't care about the facts.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> They have just made up their mind. Very simply they have made up their mind that this is a racist country with a lot of racist cops and an innocent kid in Ferguson got killed. Now, it's a tragedy that he got killed. But on that day, he wasn't an innocent kid.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's for sure.</p>                \n                \r\n\n            \n                <p>All right, Bernie Goldberg -- everybody. Happy Hanukkah. Happy New Year -- all of that.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Merry Christmas to you. Merry Christmas to you and the viewers.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Stay out of the sun down there in Miami, you know.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>I will do my best.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The top stories of 2014", "description": "Bernie Goldberg on the top ten most important stories of the year", "date": "2014-12-19T13:36:46Z"}