{"vcmId": "7a0bc3a3-7ad8-460c-8b30-e14f7f77baf6", "url": "http://www.foxnews.com/transcript/2016/03/03/bill-oreilly-super-tuesday.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It is now clear that Donald Trump will go to the republican convention in Cleveland this summer with more votes than anyone else. Last night he beat Ted Cruz by 450,000 votes across the board. Defeated Marco by more than a million.</p>                \n                \r\n\n            \n                <p>Therefore, there is no way that Trump will lose the popular primary vote as his supporters are steadfast. It means he is almost unstoppable because of the republican party did some kind of end-run regarding delegates or procedure. Mr. Trump could justifiably run on a third party ticket; therefore, dooming the G.O.P.</p>                \n                \r\n\n            \n                <p>Millions of Trump supporters will not accept the party doing something under the table. Now, things can happen. Though talking points cannot say, for certain, that Donald Trump will be the republican nominee; but, again, I can say that no one will beat him in the popular vote.</p>                \n                \r\n\n            \n                <p>I spoke with Mr. Trump this morning on the phone. He was supposed to be here tonight but asked forgiveness, because he said he needed to rest up for the big debate tomorrow night on Fox News. Being the very reasonable guy I am, I said \"OK.\"</p>                \n                \r\n\n            \n                <p>But I also told Mr. Trump that I, your humble correspondent, will be in Detroit and am looking forward to speaking to all the candidates tomorrow night in a no spin way.\" The Factor will be on live at 8:00 and back again live at 11:00 eastern time. So, we hope you catch all of it. It will be very different than what you have seen.</p>                \n                \r\n\n            \n                <p>By the way, Ben Carson dropped out of the race today. Not unexpected. Dr. Carson is a good man. On the democratic front, it was what we predicted. Hillary Clinton winning big. She beat Bernie Sanders by about 1.3 million votes. So, that race is over. Secretary Clinton wins. But, I have to give Senator Sanders credit.</p>                \n                \r\n\n            \n                <p>He is running an energetic campaign. Does not use personal attacks. He is a man of dignity, but he is not going to win. In fact, the only thing that could defeat Mrs. Clinton is the FBI. Yesterday, Director James Comey testified in front of the house judiciary committee talking about Mrs. Clinton's email problem.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JAMES COMEY, FBI DIRECTOR: </b>What I can assure you is that I am very close, personally, to that investigation to ensure that we have the resources we need, including people and technology and that it is done the way the FBI tries to do all of its work, independently, competently and promptly. That is our goal, and I am confident it is being done that way.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, some Americans do not trust Director Comey, talking points does. I believe an honest investigation is being done by the FBI. And, we should know the results of the email situation within a few weeks.</p>                \n                \r\n\n            \n                <p>Summing up, Donald Trump and Hillary Clinton will win the popular primary voting. Mrs. Clinton will be the democratic nominee, unless she is indicted. Mr. Trump looks to be unstoppable but it is not a lock for him yet. That is &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Super Tuesday", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/2", "date": "2016-03-03T20:17:17Z"}