{"vcmId": "7b13a8da-f3c8-4046-ac58-a46b83613570", "url": "http://www.foxnews.com/transcript/2015/04/07/ncis-report-on-bowe-bergdahl-raises-new-questions.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 6, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Factor Follow Up Segment\" tonight. We continue our reporting on the trade that brought Sergeant Bowe Bergdahl back to the U.S.A. in return for releasing five top Taliban terrorists from Guantanamo Bay.</p>                \n                \r\n\n            \n                <p>As you may know, Sergeant Bergdahl has now been charged with desertion and misbehavior before the enemy. If convicted of those charges in a military court, he can serve life in prison. That has embarrassed the Obama administration who made a big deal out of sergeant's release bringing his parents to the White House from Idaho.</p>                \n                \r\n\n            \n                <p>But here's what's new tonight. In 2009, the Naval Criminal Investigative Agency, NCIS filed, a report on Bergdahl's activities in Afghanistan. The NCIS, considered the military's best investigative agency, became involved in the case once Bergdahl went missing on June 30th of that year 2009. The NCIS report cited some very disturbing information.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington, Lt. Col. Tony Shaffer who has new facts about that NCIS report.</p>                \n                \r\n\n            \n                <p><b>LT. COL. TONY SHAFFER, U.S. ARMY RESERVE: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, did you see the report?</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> No Bill, I have not seen it but I have been in contact with two individuals who are not only -- did not only see it, they're actually part of the investigation and various aspects of it so they did see the report. And that gives you the insight.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And they told you? What's the headline? What is the headline?</p>                \n                \r\n\n            \n                <p><b>SHAFFER: </b>The headline is this is what is behind the Article 99 misbehavior charge. Essentially there is clear evidence that he was quote, unquote, \"going over to the other side\" with -- and he had a deliberate plan.</p>                \n                \r\n\n            \n                <p>There is two different strings here, Bill, that go off. First, one of the strings says that he was going to go off to Uzbekistan. He had made contacts with the local Afghans and wanted to be moved to Uzbekistan and then made contact with the Russians because he wanted to talk to Russian organized crime.</p>                \n                \r\n\n            \n                <p>The other thread says that he did move out with the purpose. He had Afghan contacts and he was actually trying to offer himself up to the Taliban. Both are very severe.</p>                \n                \r\n\n            \n                <p>And let me be very clear. This came from the NCIS doing computer forensics on his computer through both detailed debriefings of his platoon mates as well as going outside the wire. And God bless NCIS who went outside the wire, tracked down the Afghans he had contact with. So those three sources --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He was involved with some kind of security where he was speaking with Afghans while he was a member of the army.</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> That's right. That's right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But, you know, these are wild tales. They're -- he'll got to Uzbekistan and he wants to meet the Russians to become a hit man. I mean this shows a guy who is mentally imbalanced, does it not?</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> No doubt. That's one of the factors here, Bill, is that clearly he was not all there relating to what he was doing. And I think we are going to see more and more as this report is made public that there were a number of disconcerting things within Bergdahl.</p>                \n                \r\n\n            \n                <p>And let me be clear on this. I'm not trying to explain away his bad behavior. All I'm saying is --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, no, now. We just want to know what the NCIS came up with. We understand that but will this report be made public because it has not. This is a secret report.</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> This report right now is part of General Dahl's larger report. This was reviewed and validated by General Dahl. So I think what we're going to see here is that this -- and again, my information, Bill, is from two very senior sources. This is the information behind the Article 99 charge.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. That he is charged with misbehavior.</p>                \n                \r\n\n            \n                <p><b>SHAFFER: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>-- toward the enemy. So you can say collaboration. You can say a whole bunch of words.</p>                \n                \r\n\n            \n                <p>Now, here is the key. That was done and completed in 2009.</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Bergdahl was traded, what, last year, '14, right? The trade was last year. That's five years where he was held by the Taliban. So wouldn't the Obama administration know, based upon the initial investigation by the NCIS this was a troubled guy who did some, you know, serious things against his country; even if he was a loon he still did them. All right. Why would they make such a big dog and pony show out of this?</p>                \n                \r\n\n            \n                <p><b>SHAFFER: </b>Well, I was briefed on the initial -- some of the initial elements was back when I was asked to help out on the Bergdahl recovery back in 2012, Bill. And more to come on this.</p>                \n                \r\n\n            \n                <p>Let me be very clear. There is indications that senior leaders who were in constant contact with the White House did know these details we just talked about.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They had to know.</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> As early as 2010. And then they -- there is no way -- there is no way that could not have been shared with the White House. And I think that's what I --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The commander and chief, President Obama is the commander in chief of the armed forces. Are you telling me he doesn't -- he is going to make a trade for five top Taliban commanders and he doesn't know all the facts about who he is trading for?</p>                \n                \r\n\n            \n                <p><b>SHAFFER: </b>No, there is no way. No, there's no way. That information had to be provided --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But then why would he make such a big deal out of it trying to make it like it's the greatest deal in the world. I mean it doesn't make any sense, does it?</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> Bill, I think this White House, because they have nobody from the senior military background serving do not understand context. As far as can I tell it was more important to get the Taliban gone and this guy back and they could try to explain away why it's ok he walked away.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right, Colonel. We appreciate the report.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "NCIS report on Bowe Bergdahl raises new questions", "description": "Did the Army Sergeant commit criminal acts before his alleged desertion?", "date": "2015-04-07T12:17:31Z"}