{"vcmId": "7d899b8d-b9d4-492d-95e6-3aff5c16d60d", "url": "http://www.foxnews.com/transcript/2014/10/07/bill-oreilly-islam-destructive-force-world.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><em>By Bill O'Reilly</em></p>                \n                \r\n\n            \n                <p>Right now the ISIS terrorists are attacking a town in Syria very close to the Turkish border. Civilians are fleeing in panic because these ISIS savages are known to slaughter innocent people.</p>                \n                \r\n\n            \n                <p>Meantime, Turkish tanks and troops do nothing; sitting on their side of the border watching the carnage unfold. Turkey is a Muslim country and all throughout the world, there are about 1.6 billion Muslims and 35 countries practice some kind of Sharia Law. That means they are governed by people who abide by principles of Islam that are controversial to say the least. In some places you can even be stoned to death for committing a sin.</p>                \n                \r\n\n            \n                <p>A study published by the Pew Research Center last year asked Muslims if they favor Sharia Law. In Afghanistan 99 percent do; Pakistan 84 percent; Iraq 91 percent; Egypt 74 percent; Jordan 71 percent. And even in Great Britain, a national opinion poll found that 78 percent of British Muslims believe people who criticize Mohammed should be prosecuted by civil authorities.</p>                \n                \r\n\n            \n                <p>So you can see that millions of Muslims think their religion should dictate what happens in society. Enter uber liberals Bill Maher and Ben Affleck. Mr. Maher is anti-religionist. He despises all organized religion; makes no secret of that.</p>                \n                \r\n\n            \n                <p>Mr. Affleck is a traditional liberal, a fervent supporter of President Obama and of many left wing causes.</p>                \n                \r\n\n            \n                <p>Over the weekend Mr. Maher, an author named Sam Harris and Mr. Affleck debated Islam.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>MAHER: All I'm saying is that liberal principles like freedom of speech, freedom to practice any religion you want without fear of violence, freedom to leave a religion, equality for women, equality for minorities, including homosexuals -- these are liberal principles that liberals applaud for but then when you say in the Muslim world this is what is lacking, then they get upset.</p>                \n                \r\n\n            \n                <p>SAM HARRIS, AUTHOR: Yes, yes well, liberals have really failed on the topic of theocracy. They'll criticize white theocracy, they'll criticize Christians. They'll still get agitated over the abortion clinic bombing that happened in 1984 but when you want to talk about the treatment of women and homosexuals and free thinkers and public intellectuals in the Muslim world, I would argue that liberals have failed us.</p>                \n                \r\n\n            \n                <p>AFFLECK: So hold on are you the person who understands the officially codified doctrine of Islam? You are the interpreter of that?</p>                \n                \r\n\n            \n                <p>HARRIS: I'm actually well-educated on this topic.</p>                \n                \r\n\n            \n                <p>AFFLECK: I'm asking you. You are saying if I criticize that you're saying that Islamaphobia is not a real thing. That if you're critical of something --</p>                \n                \r\n\n            \n                <p>MAHER: Well it's not a real thing when we do it.</p>                \n                \r\n\n            \n                <p>AFFLECK: Right.</p>                \n                \r\n\n            \n                <p>MAHER: Well no it really is.</p>                \n                \r\n\n            \n                <p>HARRIS: I'm not denying that certain people are bigoted against Muslims as people. And that's a problem.</p>                \n                \r\n\n            \n                <p>MAHER: Right big of you have.</p>                \n                \r\n\n            \n                <p>HARRIS: But the --</p>                \n                \r\n\n            \n                <p>MAHER: But why are you hostile about this concept.</p>                \n                \r\n\n            \n                <p>AFFLECK: That's gross. It's racist.</p>                \n                \r\n\n            \n                <p>MAHERS: It's not, but it's so not. Your shifty Jew.</p>                \n                \r\n\n            \n                <p>AFFLECK: Absolutely not.</p>                \n                \r\n\n            \n                <p>MAHER: You're not listening what we are saying.</p>                \n                \r\n\n            \n                <p>HARRIS: We have to be able to criticize bad ideas.</p>                \n                \r\n\n            \n                <p>MAHER: Of course we do.</p>                \n                \r\n\n            \n                <p>AFFLECK: Ok, ok, but --</p>                \n                \r\n\n            \n                <p>MAHER: But why --</p>                \n                \r\n\n            \n                <p>HARRIS: But Islam is the mother load of bad ideas.</p>                \n                \r\n\n            \n                <p>AFFLECK: So we have ideas like blasphemy.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: Interesting how Mr. Affleck invokes the name of Jesus. Now who is correct? As far as condemning all Muslims, Mr. Affleck is on the side of the angels, pardon the pun. As \"Talking Points\" stated last week most Muslims are peaceful people. Even if they do believe in Sharia Law, that's a flaw in their thinking, it doesn't mean they are violent maniacs.</p>                \n                \r\n\n            \n                <p>Also like the bible there are violent passages in the Koran, it doesn't mean much. Interpretation of scripture is what separates a fair person from a hateful fanatic. However, Mr. Maher is correct on the overall effect Islam is having on the world right now. The truth is many Muslim nations have not confronted Islamic terrorism have not attacked violence in the name of Allah, and have not even condemned the jihad. There is exception to the rule but they are few.</p>                \n                \r\n\n            \n                <p>Therefore militant Islam continues to drive worldwide terrorism and have plenty of sanctuaries from which to commit their evil. Ben Affleck should well understand that he himself would be beheaded in a heartbeat by these ISIS animals and that even though they are the most extreme element of the jihad they are not that far away from their fanatical cousins.</p>                \n                \r\n\n            \n                <p>You may remember that hours after America was attacked by al Qaeda on 9/11 thousands of Muslims, regular folks celebrated in the streets. They were happy that more than 3,000 innocent people, including Muslims, were murdered. Again, these people are a minority but they were not called out in any official way by Muslim nations around the world.</p>                \n                \r\n\n            \n                <p>The truth is that Islamic jihad could not, could not exist if not for Muslim nations turning away. Turkey could crush ISIS right this minute, but Turkey does nothing. The Afghan people could turn against the Taliban, they do not. The Pakistani government harbored Osama bin Laden -- the government did. Those facts are something that Ben Affleck and others who agree with him should think about. In any discussion about the overall effect Islam is having on the world.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" well understands that for centuries Muslims coexisted peacefully with other religions. But now terrorism and the jihadists are again on the move. And most Muslim nations are not joining with the West to confront that therefore, criticism of Islam's role on the world stage is certainly valid. The Muslim world needs to take a hard look at itself.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Is Islam a destructive force in the world?", "description": "By Bill O'Reilly Right now the ISIS terrorists are attacking a town in Syria very close to the Turkish border.", "date": "2014-10-06T04:00:00Z"}