{"vcmId": "7e0a1d0c-6cf5-474f-bac8-3f9615d3a337", "url": "http://www.foxnews.com/transcript/2016/06/28/bill-oreilly-open-borders-dont-work.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The vote in Great Britain to leave the European Union was not really about macroeconomics. It was largely an emotional decision based on what the folks are seeing with their own eyes. That open borders and mass immigration have directly affected their lives and not for the better.</p>                \n                \r\n\n            \n                <p>Entire cities in England have changed as millions of foreign-born people have poured into Great Britain. Making full use of the public health and education systems establishing vast neighborhoods that mostly reflect their own origins. Not traditional British culture. Most of the immigrants are good people. Simply seeking better lives for their families. There is no question that life in England or the U.S.A. for that matter far better, generally speaking, than Africa, the Middle East, or South Asia.</p>                \n                \r\n\n            \n                <p>Liberals are correct in saying it is compassionate to give suffering people a lifeline. But their numbers are so great. It's impossible for even wealthy nations to absorb the flow. So many problems ensue from open borders that the folks are saying no more. That's not racist or nationalistic or inhumane. It's an opinion based on social order and rejecting a total breakdown of immigration supervision. Once you get to Europe, you can move without hindrance. After settling in, you can then receive entitlements paid for by workers of your new country.</p>                \n                \r\n\n            \n                <p>In England, foreign-born newcomers can use government run medical services which are already strained. The wait to treat maladies is catastrophic in some places. Now, the vote last week demonstrates the majority in Great Britain believe their lives are worse under the EU umbrella. Shift to North America where the open border issue is one of the big reasons that Donald Trump has prospered. He is by far the most progressive politician in promoting border regulation and a slowdown in the entry of foreign born individuals.</p>                \n                \r\n\n            \n                <p>For this he has been demonized. Branded a racist by the left. But millions of Americans do not see it that way. They are backing Trump because he is talking tough about a situation they believe is truly deplorable. That being said, Mr. Trump would be wise to stop identifying specific groupings of people like Muslims and Mexicans because that kind of scapegoating dilutes the larger issue that the rule of law, as well as common sense has collapsed in the immigration debate. What is not widely known is that many in the Democratic Party and in liberal press actually want open borders in the U.S.A. even though they won't come right out and say it. Recently John Kerry slipped in a commencement speech at Northeastern University.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOHN KERRY, SECRETARY OF STATE: </b>You are the most diverse class in Northeastern's history. In other words, you are Donald Trump's worst nightmare.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>You are about to graduate into a complex and borderless world.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Most Americans are not ready for a borderless world and never will be. And in this age of terror, simply too dangerous. In this time of massive debt is simply too expensive for any country to absorb millions of poor people year after year. Think about it. Which Democrat has called for strict border security? Or ending sanctuary cities, or even harshly punishing violent felonious illegal aliens who defy deportation? Which one? Has President Obama done that? Hillary Clinton? Bernie Sanders? The answer is no. In fact, as Sanders supporter recently came clean on The Factor.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>ERICA PAYNE, AGENDA PROJECT FOUNDER</b>: There is a fundamental difference between progressives and conservatives when it comes to people visiting this country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Visiting?</p>                \n                \r\n\n            \n                <p><b>PAYNE:</b> Progressives think that people move in order to build better lives for their families.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And you are okay with anybody visiting --</p>                \n                \r\n\n            \n                <p><b>PAYNE</b>: And our country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: -- any time they want.</p>                \n                \r\n\n            \n                <p><b>PAYNE:</b> I'm perfectly okay with anybody who wants to be a constructive part of this country industry.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Anybody no matter how many of them.</p>                \n                \r\n\n            \n                <p><b>PAYNE</b>: And live and work.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: OK.</p>                \n                \r\n\n            \n                <p><b>PAYNE</b>: We can handle it, Bill. This is the greatest country in the world.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But the greatest country in the world is growing weaker. We owe $20 trillion. Entitlement spending now at the 50 percent level for American households. Half of us are getting subsidized to some extent by the government. And migrant families are at that level as well. No longer is the U.S.A. a self-reliant society. We are growing more dependent every month. And that is sapping, sapping America's greatness. The truth is, Democrats believe they need the immigrant vote to achieve and retain power, therefore, there is no motivation to stop illegal immigration and impose discipline and obeying the law. None.</p>                \n                \r\n\n            \n                <p>Talking Points firmly believes that most Americans welcome foreign-born people who come here the legal way. There is not a prevailing nativist sentiment in America. In fact, it's the opposite. Foreign-born Americans are generally hard workers, loyal to their new country, and that is widely admired. But the folks have had enough with lax border security, amnesty, and the failure of Congress to pass even basic protections like Kate's law. The left believes it is noble to promote policies that are inclusive as they say in San Francisco. But while they are feeling good about themselves, anarchy has taken root.</p>                \n                \r\n\n            \n                <p>Resources stretched to the limit and a kind of illegal immigrant apartheid now on display in certain parts of the country. When scores of major cities say, blank you to federal authorities, refusing even to detain criminal aliens? You know the breaking point has been reached. So most Americans are fed up and given the chance to vote like the British people, that frustration would become apparent. Come Election Day in November, it may be the economy, stupid. But a close second will be the government's responsibility to protect us from terrorism and chaos.</p>                \n                \r\n\n            \n                <p>We need to crack down on illegal immigration and those who undermine federal law. America needs a sane policy when it comes to admitting noncitizens and we need strong leadership to deliver it. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Open borders don't work", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 6/27", "date": "2016-06-28T12:08:41Z"}