{"vcmId": "7fda91c1-e3da-4cdd-8eca-c7933fbc7f7c", "url": "http://www.foxnews.com/transcript/2015/04/24/does-president-obama-have-problem-with-christians.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 23, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Back of the Book\" segment tonight. \"Weekdays with Bernie\" earlier this week. FOX News analyst Kirsten Powers hammered President Obama for not being protective enough for Christians.</p>                \n                \r\n\n            \n                <p>And in his weekly column posted on BernardGoldberg.com, Bernie has some thoughts on that. He joins us now from Miami. So you have been thinking a lot about this and you say?</p>                \n                \r\n\n            \n                <p><b>BERNIE GOLDBERG, FOX NEWS CONTRIBUTOR:</b> Well, first, I want to say hats off to Kirsten Powers especially because she is a liberal who had the guts to take it on President Obama. What I write about is liberals in general who have never been shy about showing their outrage on all sorts of things. They were outraged over Ferguson, despite the facts. They were outraged over phony wars on women. They were outraged a few years ago when critics didn't want a mosque built at ground zero. So liberals are always showing their outrage because it's a way to show their compassion and how good they are. Okay. Fine. Where is their outrage now?</p>                \n                \r\n\n            \n                <p>Where are the demonstrations now? Isn't the killing of Christians by Muslim fanatics worthy of outrage? Don't Christian lives matter? If I guarantee you this, Bill. If a fringe of Christians were merely discriminating, not killing, discriminating against Muslims, there would be plenty of liberal outrage. You know what? Outrage is dead. And when outrage dies, I don't want to be poetic here or put too fine a point on it, but when outrage dies, some of our humanity also dies.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, and our protections, also. Our protections of the weak dies if there is nobody angry about child molestation or anything like this. But might it be because the Christians who are being killed are being killed in places like Libya, in the Mediterranean Sea, in Pakistan, far, far away from, you know, because all the outrage as you mentioned took place here in the U.S.A. But the killings of Christians overseas.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>I think there is a helplessness that is happening over there, what can I do about it even if I want to do something? Outrage isn't going to stop the killings. But without outrage there can never be action that will stop the killings. And when the most powerful man in the free world as Kirsten Powers pointed out doesn't show an ounce of outrage at his news conference a few days ago when the subject came up of the Christians who were thrown overboard on the boat going to Italy, when he doesn't show outrage, then his allies in this country and his allies overseas are not going to show outrage.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, and the Italian prime minister -- go ahead.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>There is a sense of helplessness, you're right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The Italian prime minister wouldn't even attributed to Muslims killing --</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> That's right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know, and then Obama just sat and didn't say anything. But he never says anything. And I don't know why. And if I ever interview him again, which is like a million to one shot, that would be one of my questions.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Well, he won't mention -- he has never uttered the words, \"Islamic terrorism.\"</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> But he doesn't have the problem reminding Christians about their atrocities.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And certainly he did that. And that was a huge rhetorical mistake that he made. Now, let me give my theory on why the left does not show any concern or outrage for murdered Christians. And I've said this before on this program. And it's absolutely true. Generally speaking, far left Americans -- not liberals. Far left Americans believe that Christians are the oppressors in the world. Okay? Against gay marriage. They're against abortion. Women's reproductive rights. All right? They're against legalization of narcotics. And many Christians are judgmental on private behavior. Therefore, 80 percent of Americans are Christian. They are the oppressive force. They're the ones that have made America a bad country. That's the far left mind-set. Am I wrong?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> No, I think you're absolutely right. And I add just one small element to that. On the one hand, everything you said, I happen to agree with. On the other hand, who are the people doing it? A group of Muslims. To that same far left mentality, a group that's been oppressed themselves so we're not going to go -- we're in the going to bash Muslims. We're not even going to bash Muslim killers who are killing in the name of their religion. We won't even show outrage over that. Because of what you rightly said about how we feel about Christians.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, I think there is --</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> I'm not Christian, Bill, and I'm outraged.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Everybody knows it. Look, I mean, that's what that war on Christmas was all about that the far left denied was even going on. I mean, everybody knows, all right, that there is this strain on the far left that the Christians -- they're the problem. If we could only get rid of these people we could have progressive paradise. Last word.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Well, just so everybody knows and we don't turn religion against religion here. Most of the people on the far left who you're describing, they're Christians too.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No. Atheist/agnostic.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Well, there are a lot of Christian liberals out there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Liberals but not far left. Not far left. Those precincts do not accept religious orthodoxy ever. All right? And just go on their websites and look. And look at the vicious garbage. I know, because that movie \"Killing Jesus.\" You should have seen what they were saying about it. It was outrageous.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> When outrage dies, a piece of civilization and humanity also die. And that's what's happening right now.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Bernie Goldberg, everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Does President Obama have a problem with Christians?", "description": "Bernie Goldberg weighs in on the White House's silence on religious persecution", "date": "2015-04-24T12:18:22Z"}