{"vcmId": "81ce036f-ff0e-454c-9102-f5c8c1a2bf71", "url": "http://www.foxnews.com/transcript/2017/04/11/bill-oreilly-donald-trump-commander-in-chief.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As we reported last week, the president's job approval numbers are likely to go up because he took strong action against Syria after the tyrant Assad gassed his own people.</p>                \n                \r\n\n            \n                <p> Right off the bat Mr. Trump went up three percent in a new CBS News poll. That is likely to rise even further this week.</p>                \n                \r\n\n            \n                <p> When CBS asked, do you approve or disapprove of the U.S. launching missiles against Syria?</p>                \n                \r\n\n            \n                <p> 57% approve</p>                \n                \r\n\n            \n                <p> 36% disapprove</p>                \n                \r\n\n            \n                <p> 8% don't know.</p>                \n                \r\n\n            \n                <p> Do you have confidence in Donald Trump's ability to handle the situation in Syria?</p>                \n                \r\n\n            \n                <p> 41% confident</p>                \n                \r\n\n            \n                <p> 54% not confident</p>                \n                \r\n\n            \n                <p> And finally, do you think it's necessary for Congress to approve any further U.S. action in Syria?</p>                \n                \r\n\n            \n                <p> A whopping 69% say it is that Congress should get involved.</p>                \n                \r\n\n            \n                <p> 25% do not feel it's necessary.</p>                \n                \r\n\n            \n                <p> There are a number of developments on the military front.</p>                \n                \r\n\n            \n                <p> U.S. warships are heading toward the Korean Peninsula because the nutty dictator of that country continues to test ballistic missiles in violation of international law.</p>                \n                \r\n\n            \n                <p> Also the two U.S. warships in the eastern Mediterranean continue to monitor Syria.</p>                \n                \r\n\n            \n                <p> There's also an aircraft carrier in the Persian Gulf, the George H.W. Bush.</p>                \n                \r\n\n            \n                <p> So you can see that President Trump and the Pentagon are sending signals that if world order is threatened, America will respond.</p>                \n                \r\n\n            \n                <p> It's just a damn shame that we are the only country willing to take this stand.</p>                \n                \r\n\n            \n                <p> There is no reason for Russia to prop up Assad in Syria, the man is a war criminal.</p>                \n                \r\n\n            \n                <p> Also, China does not try to control the North Korea situation when it absolutely could.</p>                \n                \r\n\n            \n                <p> Staunch allies like Britain, Australia, Canada and France do help us out, but it's on a limited basis.</p>                \n                \r\n\n            \n                <p> Unfortunately policing the world falls to America, with all the danger and expense that entails.</p>                \n                \r\n\n            \n                <p> President Trump would be wise to pick his spots. The attack on Syria worked and was approved by most in the world who care about protecting innocent people.</p>                \n                \r\n\n            \n                <p> Yes, Russia and Iran are now threatening the USA, but so what? Those countries have thrown in with the devil, and we cannot back away from their bluster.</p>                \n                \r\n\n            \n                <p> However, a confrontation with Russia is not what anybody needs, so President Trump would be wise to talk to Putin quietly and try to get the guy to wise up by helping his economy.</p>                \n                \r\n\n            \n                <p> Iran is truly a hopeless situation, but the mullahs do not want to commit suicide. How the nuke treaty will eventually play out is one of the great world mysteries.</p>                \n                \r\n\n            \n                <p> It is likely that North Korea will be the next problem we have to deal with.</p>                \n                \r\n\n            \n                <p> If they test a nuclear device again in violation of international law, something must be done.</p>                \n                \r\n\n            \n                <p> Can Donald Trump convince the Chinese to partner up with us against North Korea?</p>                \n                \r\n\n            \n                <p> That would end the problem and be good for world order and business.</p>                \n                \r\n\n            \n                <p> Again, it is a mystery why the Chinese will not exert their strength and influence on North Korea.</p>                \n                \r\n\n            \n                <p> Summing up, President Trump gained a measure of respect for his actions against Syria, the U.S. military is gearing up, but caution is the word.</p>                \n                \r\n\n            \n                <p> And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Donald Trump, Commander-in-Chief", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 4/10", "date": "2017-04-11T12:13:00Z"}