{"vcmId": "82138746-2df0-4468-b6fa-8bc4982144ad", "url": "http://www.foxnews.com/transcript/2017/02/15/bill-oreilly-first-casualty-trump-administration.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>National security chief Michael Flynn has resigned.</p>                \n                \r\n\n            \n                <p>The general got into trouble over a phone call he had with the Russian ambassador before Donald Trump took office.</p>                \n                \r\n\n            \n                <p>The issue centered on sanctions President Obama slapped on Russia, apparently General Flynn discussed that with the Russian.</p>                \n                \r\n\n            \n                <p>Michael Flynn should have known that his call was being taped both by American and Russian intelligence agencies, that is standard.</p>                \n                \r\n\n            \n                <p>But then things get foggy. &#160;I don't know what General Flynn said. &#160;Nobody knows at this point except government officials because there is a transcript of the conversation, as yet unreleased.</p>                \n                \r\n\n            \n                <p>But according to Fox News Correspondent John Roberts, General Flynn misled Vice President Pence about the content of the call.</p>                \n                \r\n\n            \n                <p>That's the big reason he was fired.</p>                \n                \r\n\n            \n                <p>Vice President Pence wields a lot of power in the White House and subordinates simply cannot mislead him.</p>                \n                \r\n\n            \n                <p>So the Trump administration is now searching for a new national security advisor.</p>                \n                \r\n\n            \n                <p>The story really ends here unless General Flynn was ordered to say something to the Russians that was inappropriate.</p>                \n                \r\n\n            \n                <p>Again, speculating on that is foolish. &#160;If evidence surfaces, we will certainly report it.</p>                \n                \r\n\n            \n                <p>Perhaps the most interesting aspect on the Flynn saga is the PR component.</p>                \n                \r\n\n            \n                <p>Yesterday Kellyanne Conway said the general was safe.</p>                \n                \r\n\n            \n                <p><b>KELLYANNE CONWAY, COUNSELOR TO PRESIDENT TRUMP: </b>&#8220;General Flynn does enjoy the full confidence of the president. &#160;And this is a big week for General Flynn. &#160;He's the point of contact for many of these foreign visits.&#8221;</p>                \n                \r\n\n            \n                <p>Did Ms. Conway mislead or did she not know the general was in trouble? &#160;Either way, not a good situation.</p>                \n                \r\n\n            \n                <p>Talking Points well understands the complexities of running this country.</p>                \n                \r\n\n            \n                <p>But it is becoming clear that President Trump needs better coordination among his staff.</p>                \n                \r\n\n            \n                <p>There should be someone in charge of quality control and accurate messaging.</p>                \n                \r\n\n            \n                <p>That someone should be Chief of Staff Reince Priebus, who is experienced and skilled.</p>                \n                \r\n\n            \n                <p>No way Kellyanne Conway should be out saying all is fine with General Flynn when all was not fine.</p>                \n                \r\n\n            \n                <p>That kind of confusion does not do anyone in this country any good, especially because President Trump has legions of people trying to hurt him.</p>                \n                \r\n\n            \n                <p>Summing up, Flynn is out. &#160;A new security person will be appointed and the Trump White House needs to become better organized.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The first casualty of the Trump administration", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/14", "date": "2017-02-15T12:55:25Z"}