{"vcmId": "8364422a-efcc-4eb8-86fd-fcc1f7b41ce6", "url": "http://www.foxnews.com/transcript/2015/07/24/bill-oreilly-abortion-and-network-news.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It is no secret that most folks who work in the TV news industry are liberal thinkers and many support abortion. So when the Planned Parenthood controversy erupted last week the network news organizations were put in a quandary.</p>                \n                \r\n\n            \n                <p>The undercover tape taken by a pro-life group was damning as two Planned Parenthood doctors spoke cavalierly about harvesting and selling organs from dead babies. That's against the law and eight states are now investigating Planned Parenthood.</p>                \n                \r\n\n            \n                <p>So this is a big story, right? And the Fox News Channel, CNN, MSNBC gave it a lot of time. But not so much on the network news. According to data from the Media Research Center, a conservative watchdog group CBS News spent a total of 7 minutes, 21 seconds on the story that includes \"Evening News\" and \"CBS This Morning\". NBC 3 minutes, 4 seconds including the \"Nightly News\" and the \"Today\" show. ABC News just 46 seconds on \"World News Tonight\" and \"Good Morning America\" combined. That is truly amazing.</p>                \n                \r\n\n            \n                <p>Now, when the Susan Coleman Breast Cancer Charity cut ties with Planned Parenthood because the charity said it had a policy barring it from funding groups under congressional investigation, which Planned Parenthood was at the time, the three broadcast networks covered the story extensively spending a combined 31 minutes 48 seconds. And taking a generally sympathetic stance towards Planned Parenthood.</p>                \n                \r\n\n            \n                <p>So you can see that Planned Parenthood as a victim was far more attractive to the network news than Planned Parenthood as a possible law breaker. That is called media bias.</p>                \n                \r\n\n            \n                <p>In the latest Gallup poll on abortion, 55 percent of Americans say they want abortion legal in only a few circumstances or outlawed all together. Only 29 percent want abortion legal in all circumstances, which is pretty much the position of Planned Parenthood which receives taxpayer funding.</p>                \n                \r\n\n            \n                <p>Talking Points has long known that the American media is generally unfair. And the data on how the networks covered the organ-selling story basically proves that. Liberal philosophy dominates in TV news and that is what is being put forth to Americans on a daily basis.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Abortion and the network news", "description": "Bill O'Reilly's Talking Points 7/23", "date": "2015-07-24T12:14:06Z"}