{"vcmId": "8397a695-a5a1-4883-8b13-21779d2c2b4e", "url": "http://www.foxnews.com/transcript/2015/09/16/bill-oreilly-dramatic-muslim-invasion.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As we reported last night, many Americans are angry about the U.S. economy, which is not providing enough good jobs and about all the chaos overseas. Both of those things can be placed at President Obama's doorstep.</p>                \n                \r\n\n            \n                <p>Since Ronald Reagan declared amnesty for illegal aliens in 1986, estimates are as many as 15 million undocumented people who did not get amnesty have crossed into the U.S.A. As Donald Trump points out over and over the southern border is a joke.</p>                \n                \r\n\n            \n                <p>Now same thing is happening in Europe. Countries are being overrun by migrants mostly Muslims fleeing terror and economic deprivation in the Middle East and North Africa. These poor people are desperate and deserve sympathy from all of us. But the cold truth is, Europe is getting what it deserves.</p>                \n                \r\n\n            \n                <p>In the face of Islamic terrorism, the EU, not an equal partner with America, it lets us take most of the casualties and pay most of the bills. If a combined Europe had stepped up in Afghanistan, Iraq, and Syria the way it should have those conflicts would have been contained. A well- coordinated American-European power push would have crushed the jihadists a long time ago. And would have badly damaged Iran as well.</p>                \n                \r\n\n            \n                <p>But Europe has basically sat it out. Thus, it was left to Presidents Bush and Obama to manage the Middle Eastern mess and neither man could do it. President Bush lost control of the Iraq war and President Obama has made things even worse.</p>                \n                \r\n\n            \n                <p>Let's begin in October of 2011 when the brutal dictator Gadhafi was killed in the Libyan uprising.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES:</b> Today, the government of Libya announced the death of Muammar Gadhafi. This marks the end of a long and painful chapter for the people of Libya who now have the opportunity to determine their own destiny in a new and Democratic Libya.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But the Libyans did not get any opportunity to do anything because Europe and President Obama got the hell out of that country as fast as possible leaving Islamic militias to run wild. Now, hundreds of thousands of people are fleeing the chaos in Libya and coming through Libya.</p>                \n                \r\n\n            \n                <p>Just two months after the Gadhafi announcement you just saw, President Obama removed all American troops from Iraq. Our forces were providing stability in keeping, were keeping Iran from dominating Iraq. Nevertheless, Mr. Obama pulled the troops out.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>Now, Iraq is not a perfect place. It has many challenges ahead. But we're leaving behind a sovereign, stable, and self-reliant Iraq with a representative government that was elected by its people. We're building a new partnership between our nations.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> In hindsight, that statement is ridiculous. As soon as our troops left Iraq, the Iranians moved in persecuting the Sunni minority who then allowed ISIS to take up residence. So, Iraq, along with Syria, became ISIS strong holds. That was perhaps President Obama's biggest foreign policy mistake.</p>                \n                \r\n\n            \n                <p>Then in 2013, Mr. Obama learned that Syrian dictator Assad was using poison gas to kill civilians, innocent people. Mr. Obama threatened Assad with military action and Europe should have immediately supported that, but the European leaders did nothing and Mr. Obama backed down.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So even though I possess the authority to order military strikes, I believed it was right in the absence of a direct or eminent threat to our security to take this debate to congress.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Of course, Congress didn't do anything. And ISIS gained power in Syria, murdering thousands of people along the way. Now, millions of Syrians are fleeing their own country, heading for Turkey and Europe. So you can see a combination of cowardice and bad policy has led to one the biggest mass migrations in history.</p>                \n                \r\n\n            \n                <p>In Europe right now, the crisis is so intense the entire European Union may collapse. Eastern European countries like Hungary and Poland do not want to take any Muslim refugees. Countries like Denmark and the Netherlands also don't want any migrants. Even Great Britain and Ireland say they will take very few.</p>                \n                \r\n\n            \n                <p>So where are these people going to go? Germany is being overrun. Remember, migrants must be supported. Governments must house and feed them. It will take decades before the migrants assimilate into European societies if they ever do.</p>                \n                \r\n\n            \n                <p>And this mass migration is not going to stop. Once people in Africa find out they can move to Europe without consequence, millions, millions will begin to do so. So the next human wave will come from the African continent.</p>                \n                \r\n\n            \n                <p>Meantime Europe has no solution and President Obama will not even acknowledge his drastic foreign policy mistakes. You want a worldwide mess? You have one.</p>                \n                \r\n\n            \n                <p>Finally, hundreds of thousands of migrants will eventually find their way to North America. It's just a matter of time. Here is the bottom line. If the U.S.A. and western Europe continue to blunder in the face of the jihad, and tolerate brutal dictators like the Iranian mullahs, the world will devolve into continual conflict and humanitarian disaster. There is no question about it.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The dramatic Muslim invasion", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 9/15", "date": "2015-09-16T18:56:03Z"}