{"vcmId": "8515a5a7-96aa-4509-8b84-609db6c1df53", "url": "http://www.foxnews.com/transcript/2016/11/16/bill-oreilly-first-challenge-to-president-elect-donald-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>One of Mr. Trump's most vivid campaign promises was this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENT-ELECT</b>: We will end the sanctuary cities that have resulted in so many needless deaths. Cities that refuse to cooperate with federal authorities will not receive taxpayer dollars.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Let me get more pointed than that. But now a number of mayors across the country are defying the President-Elect saying, they will not stop their sanctuary policies.</p>                \n                \r\n\n            \n                <p><b>RAHM EMANUEL (D), CHICAGO MAYOR: </b>To be clear about what Chicago is, it always will be a sanctuary city.</p>                \n                \r\n\n            \n                <p><b>BILL DE BLASIO (D), NEW YORK CITY MAYOR</b>: You're not going to sacrifice a half million people who live amongst us. We're not going to tear families apart.</p>                \n                \r\n\n            \n                <p><b>ED MURRAY (D), SEATTLE MAYOR</b>: I think by continuing to be a sanctuary city, we're doing the most American thing that we could possibly do.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So let's analyze what's really happening here. By refusing to obey federal immigration law, the politicians are basically saying, we want open borders because anyone who gets in to America illegally has a place where they can go with no repercussions. While most migrants are law abiding people who just want to support themselves and their families, a number of them are criminals or lay abouts, simply here to exploit the American system. Those people become part of the sanctuary movement as well.</p>                \n                \r\n\n            \n                <p>Now, you will remember that the thug who allegedly murdered Kate Steinle was released by the county of San Francisco after ICE requested he be held in jail so the Feds could pick him up. San Francisco let the man go despite the fact he had seven felony convictions in America, had been deported five times. Kate Steinle is dead because San Francisco refuses to obey federal law, period.</p>                \n                \r\n\n            \n                <p>There is a lawsuit, civil suit, underway in the case and the criminal proceeding is crawling along. Now, you would think any decent politician would learn a lesson from the Steinle case but, no. These mayors all uber liberals believe they will harvest more votes by showing phony compassion than by promoting public safety and fighting anarchy. If the left believes everybody should be allowed to come in to this country, say it. Say it. But, know that sanctuary policies will never be able to tell the good from the bad. The chaos will continue to rule.</p>                \n                \r\n\n            \n                <p>So it comes down to what Donald Trump will do to the mayors and counties that defy him on immigration law. It has to do something. And we expect the showdown will develop quickly early next year. And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The first challenge to President-Elect Donald Trump", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/15", "date": "2016-11-16T13:13:14Z"}