{"vcmId": "85b04aef-e3e1-4f09-b84f-59d3c3bfd6e4", "url": "http://www.foxnews.com/transcript/2015/05/21/bill-oreilly-will-jihad-defeat-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Close to two years ago, reports began surfacing that militant jihadists were gathering power in Syria. President Obama did not take any action. Then, the situation began to get worse. ISIS infiltrated into Iraq and a full-fledged ground war began. Once again, President Obama did little.</p>                \n                \r\n\n            \n                <p>Finally, the conflict threatened Kurdistan, a strong American ally in the northern part of Iraq. That situation forced Mr. Obama to step up bombing the ISIS savages who were also taunting the U.S.A. and the world by beheading captured westerners on camera.</p>                \n                \r\n\n            \n                <p>But despite all the carnage, President Obama and the Pentagon did not develop any cohesive plan to defeat ISIS.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Why is there no coordinated strategy to defeat the jihad after all this time? Teddy Roosevelt's basic philosophy was \"speak softly and carry a big stick\". With the Obama administration, we basically have \"speak incessantly and carry nothing\". The American people deserve to know the truth about President Obama campaign to defeat the jihad. And truth is there is no campaign.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And to this day there is no campaign. Today, tens of thousands of refugees in Iraq are creating chaos as they march toward Baghdad. ISIS has captured the city of Ramadi, just 70 miles away from the Iraqi capital -- shades of Vietnam. This is a catastrophe. Yet, the Obama administration still doesn't see the urgency.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOSH EARNEST, WHITE HOUSE PRESS SECRETARY: </b>We have seen a lot of success but we have also seen significant periods of setback. That's part of what a military conflict is going to be, particularly one that's going to be a long-term proposition like this one.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, it will be a long-term proposition if the Iraqi government falls which is certainly possible. Perhaps all Americans should send Mr. Earnest some sand so he can put his head in it.</p>                \n                \r\n\n            \n                <p>The brutal truth is, the Obama administration is losing fight against ISIS. That savage group is now operating in nine countries, may have even infiltrated into Afghanistan where we have U.S. troops. We'll get to that in a moment.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" believes that the apathy the Obama administration has shown to this growing worldwide threat endangers all Americans. The best historical comparison I can give is you President James Buchanan who ignored the growing threat of secession from the southern states. Did little to keep the country together and presto, a bloody civil war breaks out. Thank God, Abraham Lincoln had the guts and intelligence to win that war.</p>                \n                \r\n\n            \n                <p>If President Obama doesn't kick it into gear quickly, the next president of the United States will be facing an armed conflict in the Middle East that will dwarf anything we have seen so far including the conflicts in Iraq and Afghanistan.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Will the jihad defeat America?", "description": "Bill O'Reilly's Talking Points 5/20", "date": "2015-05-21T12:24:26Z"}