{"vcmId": "864d301d-884d-48a8-9ffe-3bed0fe4a159", "url": "http://www.foxnews.com/transcript/2016/12/12/rudy-giuliani-out-contention-for-cabinet-post.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 9, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>ERIC BOLLING, FOX NEWS ANCHOR</b>: And that was Donald Trump continuing his \"Thank You America Tour\" tonight in Grand Rapids, Michigan. I'm Eric Bolling in for Bill O'Reilly. Thanks for watching us tonight.</p>                \n                \r\n\n            \n                <p>Let's get straight to our top story, Rudy Giuliani, the former New York City mayor withdrawing himself from consideration for any cabinet position in the Trump administration. The news stunning the political and media world today.</p>                \n                \r\n\n            \n                <p>Joining us now with more on that, what led to his decision, the man himself, Mayor Rudy Giuliani. Mayor, thank you for joining us tonight. Big, big news today that you pulled yourself out of the running for secretary of state. What about that? Why did you do it?</p>                \n                \r\n\n            \n                <p><b>RUDY GIUILIANI (R), FORMER NEW YORK CITY MAYOR:</b> I did on November 29th and I thought that the president-elect who my main interest was getting him elected, not getting a job, saving America. I thought there were enough choices, good ones, for him to pick that I wasn't absolutely necessary.</p>                \n                \r\n\n            \n                <p>On the other hand, I have a whole private life and two businesses to run and other responsibilities. If I felt like I was the only one who could do it, probably I would have stayed in. But I thought that he has enough sufficient choices so that can he get someone as good, maybe better. And so I gave him a letter on the 29th.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Ten days ago?</p>                \n                \r\n\n            \n                <p><b>GIUILIANI</b>: Yes. Got a very nice personal conversation. I explained to him that I came to work for him, really to save America. I mean, that's the reason I worked as hard as I did. Some people wondered why was so I passionate? I was passionate because I felt our country was going off a cliff.</p>                \n                \r\n\n            \n                <p>Felt we were going in the direction of being a social democracy, European social democracy and extremely weak country internationally. And I saw Donald Trump as the person who could change that.</p>                \n                \r\n\n            \n                <p>Second part of is I know Donald for 28 years. I consider him a close personal friend. He has done some very good things for me, personally. That I owe him and so I have passion about him being elected. I know what I think America is now getting to know.</p>                \n                \r\n\n            \n                <p>He is going to be a great president. He has got all of the skills on talents of a great executive, a motivator, and a great president. So I felt I had done my job. I helped him get elected and he had great choices.</p>                \n                \r\n\n            \n                <p>And I have great options. And if he -- if he tells me you're of the only one who can do this job, I'll do it. But there are plenty of choices that he had.</p>                \n                \r\n\n            \n                <p>So I got out on the 2th and we kept it quiet for about 10 days so that he had enough time without pressure being put on him to have to make a choice, have to make a choice. And now I think he is getting close within two or three days of making one.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: So is that where the timing comes? So today we find out that you pulled yourself out of consideration because of choice is imminent? A name is going to be announced soon.</p>                \n                \r\n\n            \n                <p><b>GIUILIANI: </b>Meaning within the next three or four or five days. I think he is down to two or three people and he has to decide which of the two or three he considers best for him. They will all be very good.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Before I go into that, I want to know what you say to all these pro-Rudy people. People have said we want Rudy Giuliani to be secretary of state. He is the tough guy that we have seen throughout the campaign. We want him for secretary of state. What do you say to those people?</p>                \n                \r\n\n            \n                <p><b>GIUILIANI: </b>They are going to get somebody very, very good for secretary of state. So far I don't think Donald Trump has let us down on any choice that he has made. I think each and every choice that he has made, he has exceeded expectations, and he will do the same thing with this one. He has an extraordinary ability to pick good people.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Are you advising him on this pick, secretary of state?</p>                \n                \r\n\n            \n                <p><b>GIUILIANI</b>: Actually, that's the one thing I'm not. I'm vice chairman of the transition team. I have been involved. I have got to tell you this is the best transition I have ever seen done. I have been through three of them. More professional. Much better done.</p>                \n                \r\n\n            \n                <p>Mike Pence gets a great deal of credit for that. Mike has organized this like a search for a major corporation. So I have advised on a number of the appointments. The one I was recused on was the one where I was a possible candidate.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>But you are not involved now so maybe you can --</p>                \n                \r\n\n            \n                <p><b>GIUILIANI: </b>I have already given the president my advice.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: And that was John Bolton, right, for the secretary of state. Tell me a little about that.</p>                \n                \r\n\n            \n                <p><b>GIUILIANI</b>: Well, I can't tell you who I advised, but I can tell you that I have tremendous respect for John and I think John and some of the others would be great secretaries of state.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Which others?</p>                \n                \r\n\n            \n                <p><b>GIUILIANI:</b> Well, I can't mention the others. Those are for the president- elect.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Let me push back on that a little bit, Mr. Mayor. Ambassador Bolton I understand where you are on that. He seems to be pro- intervention. He was in favor of the Iraq war. He is in favor of getting involved in Syria, Libya. In favor of regime change in Iran where maybe Donald Trump hasn't been in that same lane for the campaign. How do you pick someone who is so ideologically away from where --</p>                \n                \r\n\n            \n                <p><b>GIUILIANI</b>: I'm not so sure how ideologically away they are. I mean, the reality is there are going to be some differences between let's get to the presidency now. The president and the secretary. Betsy DeVos who is the secretary of education who was speaking tonight was in favor of the program the Bush administration.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Rudy Giuliani out of contention for Cabinet post", "description": "Former New York City Mayor weighs in on President-elect Trump's transition on 'The O'Reilly Factor'", "date": "2016-12-12T13:22:12Z"}