{"vcmId": "86f0bcdc-3be1-42de-9043-866d7433f725", "url": "http://www.foxnews.com/transcript/2015/10/06/bill-oreilly-truth-about-gun-crime-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As you may know, President Obama and now Hillary Clinton are calling for more regulation of gun sales in the U.S.A. That is bitterly opposed by the National Rifle Association and some other Americans who believe the government should not intrude on the right to bear arms. Of course, there are logical compromises that can and should be made. But the issue is all about emotion. Not rational thinking.</p>                \n                \r\n\n            \n                <p>Perhaps the best sound bite I heard after the Oregon massacre, was this:</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>RUDY GIULIANI, FORMER MAYOR OF NEW YORK CITY:</b> I mean, the reality is, gun control laws control the behavior of legitimate people. People who rob stores, people who rob banks and people who are insane and want to go ahead and murder don't follow the gun control laws.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Of course, that is true. No amount of legislation is going to stop a mad man from killing. And right now there are more than 300 million -- 300 million civilian-owned firearms in the U.S.A. according to congressional research data. That's just about one gun for every U.S. citizen. So even you stop gun sales, which is unconstitutional, there would still be 300 million firearms floating around.</p>                \n                \r\n\n            \n                <p>Now, in order to stop the insanity, Talking Points will put forth what should happen in the gun arena. First of all, politicians should knock stuff off like this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> We have got to keep guns out of the hands of people who should not have them -- domestic abusers, people with serious mental health problems -- there has got to be a better tracking and record keeping.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, Mrs. Clinton knows it's impossible to keep guns away from dangerous people so why demagogue the issue? However, better tracking and record-keeping would be a good thing. For example, convicts should not be able to buy guns and the FBI data base is there to flag gun sellers to that circumstance.</p>                \n                \r\n\n            \n                <p>Also, if an American undergoes treatment for mental illness and is hospitalized because of it that should be in the FBI data base as well. Yes, there are privacy violations here. But the greater good is served by keeping people with criminal records and mental problems away from firearms. Correct? Therefore, background checks should be mandatory even at gun shows and on the net.</p>                \n                \r\n\n            \n                <p>Conservative Americans who value keeping the peace should back that. Liberal Americans who want all kinds of regulations in addition to that are being irrational.</p>                \n                \r\n\n            \n                <p>Every time I bring up the Chicago murder rate, every time, where gun laws are stringent, I get blank looks from the left. They don't want to talk about it. They don't want to hear about it. They have no solutions. Chicago is run by ardent liberals. Gun crimes there are out of control despite the toughest laws in the nation. So if those tough gun laws don't work in the Windy City, why should they work anywhere else -- President Obama and Hillary Clinton?</p>                \n                \r\n\n            \n                <p>Talking points has said it before. All gun crimes should be federalized and gun laws themselves should be made by the states with the two exceptions of mental health and convicted criminals. If Texas wants to have lenient gun laws, fine. If Massachusetts wants the opposite, fine. But if someone commits a crime using a gun, and is convicted they should receive a mandatory five years in a federal pen on top of the punishment for the other crime. That would go a long way in stopping the abuse of guns, would it not?</p>                \n                \r\n\n            \n                <p>Right now in Chicago, cops can fine you find with you a gun, little happens in many circumstances -- plea bargains all over the place. It's got to stop.</p>                \n                \r\n\n            \n                <p>Summing up, the husband of former Congresswoman Gabriel Giffords who herself was shot by a mad man and badly injured told the truth yesterday when asked this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TAPPER: </b>What gun laws you can point to that specifically would have prevented the shooting in Roseburg, Oregon or any of the horrific shooting events we have seen in the last five years or so?</p>                \n                \r\n\n            \n                <p><b>KELLY: </b>You know, with individual events, I mean sometimes there isn't a specific law that you can point to that would prevent a tragedy like this from happening.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Kelly, a good man, wants more stringent background checks when guns are sold but he knows, he knows that laws cannot stop the madness.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The truth about gun crime in America", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/5", "date": "2015-10-06T12:01:57Z"}