{"vcmId": "879b4359-4dcf-4dc2-a5a8-4a4ffb426899", "url": "http://www.foxnews.com/transcript/2015/10/05/bill-oreilly-portrait-killer.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The Factor will not -- will not name the 26-year-old man who killed nine young Americans in Oregon yesterday, wounding seven others. We respect this point of view.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOHN HANLIN, DOUGLAS COUNTY SHERIFF: </b>You will never hear me mention his name. We would encourage media and the community to avoid using it. We encourage you to not repeat it. We encourage you not to glorify and create sensationalism for him.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Sheriff Hanlin is correct. But it is instructive to know that yet another mass murderer shot dead by police fits the same pattern as so many others.</p>                \n                \r\n\n            \n                <p>The young man was a mama's boy, sharing a one bedroom apartment with his mother. He was a loner. He liked guns. He liked Nazi memorabilia. He admired previous killers. He despised organized religion. He had no criminal record that e know about. He attended a school in Los Angeles for special needs children. He was obviously disturbed.</p>                \n                \r\n\n            \n                <p>There are millions of people all over the world that fit that profile. The Oregon guy is similar to the maniac who shot down nine people in the Charleston, South Carolina church and to the killer in New Town, Connecticut.</p>                \n                \r\n\n            \n                <p>What happens is these maladjusted people want to kill themselves but instead of just doing that they take innocent people with them because they have no respect for human life and no feelings for anyone but themselves.</p>                \n                \r\n\n            \n                <p>Now, last night I told you two things: that all the gun control laws in the world will not stop maniacs from committing murder; and that as the world becomes more become secular, civilized restraints to bad behavior drop. If you believe in nothing, anything goes.</p>                \n                \r\n\n            \n                <p>It seems the Oregon killer was targeting Christians. That doesn't surprise me. There is an intense battle between good and evil on this earth right now. And good people are becoming targets. Summing up, another mentally unstable person commits mass murder but it was really a suicide play.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Portrait of a killer", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/2", "date": "2015-10-05T12:19:21Z"}