{"vcmId": "884f7d8c-fea0-408d-84d0-88ef56f6d1c1", "url": "http://www.foxnews.com/transcript/2015/05/01/is-media-inflaming-baltimore-situation.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 30, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Weekdays with Bernie Segment\" tonight, there have been charges the media is enflaming the Baltimore situation. President Obama weighed in on that.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>PRES. BARACK OBAMA (D), UNITED STATES: </b>In one burning building will be looped on television over and over and over again and the thousands of demonstrators who did it the right way, I think have been lost in the discussion.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Joining us now from Miami, the purveyor of BernardGoldberg.com. Mr. Goldberg, is that a fair point the President just make?</p>                \n                \r\n\n            \n                <p><b>BERNIE GOLDBERG, FOX NEWS CONTRIBUTOR:</b> Half of it is. Maybe there should have been more coverage of the peaceful demonstrators. But no it wasn't one building the CVS drugstore on a loop being played over and over again. There were over 40 buildings that were set on fire by the arsonists and rioters. There were over 100 cars set on fire. At his news conference he said, this is his word, it was a handful of people involved. That's wishful thinking. And reporters did not inflame anything in this case in Baltimore. But I understand why the President and a lot of city officials in Baltimore aren't happy with the coverage because they understand the power of images. Okay? And I will be delicate in how I say this. They understand how many Americans are perceiving those images. Okay? I don't know what happened in that police van and I'm not going to be shocked, no matter what conclusion it turns out to be but reporters didn't start this fire.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And the basic premise of news is that you report things that are unusual, not that 90 percent of the American people are good, decent hard working folks. I mean, that's not what you look for. You look for, hey, is there violence? Yes, there was violence. Hey, is there disruption? Yes, there was destruction. I do agree that looping video when there is only a small portion that is a problem in making it seem bigger is not right. But, as you pointed out rightfully, that's not what happened. However, some people do grandstand in these things, both in the media and on the street and a good reporter has got to get away from that.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Yes. And by the way on the good news, bad news, we didn't cover the plane at Miami International Airport that did not crash today. And we didn't cover the first national bank that didn't get held up. So it is the nature of news.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>The President should.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He knows that.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Yes. He knows that right. There is a bigger story though, Bill, and I'm not blowing smoke at you, that you have been covering all week that just is not getting nearly enough tension. We have a split in this country that's as wide as the Grand Canyon. People on the left. Whether they are black or white, look at those pictures and see something that conservatives, they look at the same pictures and see something else. Liberals see people being oppressed. They see victims. They don't like the use of the word thug because that implies that the looters are criminals, which, of course, they are. They want more programs and more federal money. Conservatives, on the other hand, see dysfunction. That's what you have been talking about all week. They see kids running around without fathers. They see kids dropping out of school. They see crime. They see rampant drug use. Now, you tell me. What entrepreneur, what business person is going to invest his money in a community like that?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. None of them will.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>These are the two views of America.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They are.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>That's an important story and it should be covered.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Here is the thing, one is true and one is not. One is fiction to say that a person who will hurt another person is entitled to do so because the government doesn't provide the perpetrator, the offender with a job when the offender in many cases doesn't want the job would rather sell drugs in a lazy way to make cheap money by destroying other people to put forth that that is justification for the vigilante violence you are seeing is just a lie and an insult to every hard-working American. So, you know, the equivalency is like zero to 91 on the side of a personal responsibility.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Look, that's why it's a good story. The President -- I wrote a column on my website and I said two cheers for President Obama. The two cheers were that he called them thugs and he said this is unacceptable and all that, good for him. That's the least he could do, but he did it. But then he goes on to the hopelessness and how we need more programs and how we need to spend money on these things. He goes right up to the edge but he can't bring himself as charismatic as he is, he can't bring himself to talk to the black community and say knock it off.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. Peer pressure.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Stop the dysfunctional behavior.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> And that's a good story.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It is.</p>                \n                \r\n\n            \n                <p>All right, Bernie, as always thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Is the media inflaming the Baltimore situation?", "description": "Bernie Goldberg analyzes the coverage of the rioting in reaction to Freddie Gray's death", "date": "2015-05-01T12:29:33Z"}