{"vcmId": "89cce4d9-48d2-4750-b9ed-4a7619d80625", "url": "http://www.foxnews.com/transcript/2016/04/14/bill-oreilly-is-republican-party-in-crisis.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It's becoming clear that many major Republican politicians might not attend the convention in Cleveland this coming July. As you may know, the party is split over Donald Trump. And he may very well secure the nomination. However, Mr. Trump believes the system is rigged against him. Pointing to Colorado where Ted Cruz got all the delegates this weekend without a traditional vote by the folks.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Our Republican system is absolutely rigged. This was a dirty trick. These are dirty tricksters. This is a dirty trick. And I will tell you what, the RNC, the Republican National Committee, they should be ashamed of themselves for allowing this kind of crap to happen. I can tell you that.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Clearly Mr. Trump is sending a signal if he does not get the nomination, he will not go quietly into the night. His point is that votes from human beings should be the deciding factor in the primaries but that has never been the case. Beginning in 1832, party leaders have selected the candidates. Today the delegate system is chaos with each state deciding what kind of process will take place. So, in Colorado the Republican Party chiefdoms select the delegates, not the folks. It's even worse in the Democratic Party where so-called super delegates can vote for whomever they want no matter who wins the direct voting primaries.</p>                \n                \r\n\n            \n                <p>They can override that. Now, Talking Points believes the system needs to be reformed. But it's not going to happen this year. However, if Donald Trump is denied the nomination. And has more votes than Ted Cruz or John Kasich, the Republican Party will fracture and Hillary Clinton will become the next president of the United States. So, you can see how desperate the situation is if you do not believe Hillary Clinton is suitable for the presidency. Opponents of Donald Trump believe that even though he is the vote leader right now, his support is thin nationwide.</p>                \n                \r\n\n            \n                <p>Most polling backs that up. So if he does get the nomination, the Republican Party could very well be slaughtered next November. Not only on the presidential ticket. But also in the House and the Senate. It should also be noted that despite Mr. Trump's success, most Republican primary voters have not supported him. He tops out at about 37 percent. But his support is extremely loyal, even fervent. So, this is one big mess. And while Bernie Sanders is offering a stiff challenge to Hillary Clinton on the Democrat side, there is no question Mrs. Clinton will secure the nomination. On the Republican side, however, it's either going to be Trump or Cruz. But neither candidate will have the support of the entire party. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Is the Republican Party in crisis?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 4/13", "date": "2016-04-14T18:51:23Z"}