{"vcmId": "8c22d122-adf4-4cec-a58b-0896564d925e", "url": "http://www.foxnews.com/transcript/2016/04/26/bill-oreilly-derailing-donald-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As you may have heard, Ted Cruz and John Kasich are now working together to trying to deny Donald Trump the delegates he needs to win the Republican presidential nomination outright. Tomorrow, Trump is expected to dominate the primaries here in the northeast. So by Wednesday he could be close to one thousand delegates leaving him a bit more than 200 delegates short of winning the nod.</p>                \n                \r\n\n            \n                <p>But now John Kasich says, he will not campaign in Indiana, leaving Ted Cruz to go one-on-one with Trump. In kind, Cruz says he will not campaign in New Mexico and Oregon. So Kasich will take on Trump in those states. Talking Points believes that strategy could deny Donald Trump the delegates, especially in Indiana, a winner take all state. The Real Clear politics polling average in Indiana has Trump currently at 39 percent, Cruz 33, Kasich 19. So you can see if some Kasich voters go to Cruz he could defeat Mr. Trump. For his part, Trump is sneering at his competition.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL CANDIDATE: </b>You know, if you collude in business, if you collude in business or if you collude in the stock market, they put you in jail. But in politics, because it's a rigged system, because it's a corrupt enterprise, in politics, you're allowed to collude. So, they colluded and actually I was happy because it shows how weak they are. It shows how pathetic they are.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Talking Points believes there is nothing wrong with Cruz and Kasich banding together, sometimes politics is intense. And that is the only way, the only way to deny Trump the delegates. On the other side, I continue to believe that Mr. Trump will be very close to winning the nomination outright. And if he arrives in Cleveland and is denied, all hell will break loose. Of course, the beneficiary of all of this is Hillary Clinton. He is locked in the tight battle right now with Bernie Sanders in Connecticut and Rhode Island, Mrs. Clinton well ahead in Pennsylvania.</p>                \n                \r\n\n            \n                <p>But she doesn't have to worry about her establishment, they're firmly on her side. Understanding Bernie Sanders and his socialist philosophy would run into big trouble in the general election. But the Republican establishment is not in favor of Donald Trump and that is why the GOP is in such chaos. He may be unstoppable. But at this point anything could happen in Cleveland. And that is &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Derailing Donald Trump", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 4/25", "date": "2016-04-26T19:21:07Z"}