{"vcmId": "8c9ab828-6082-462a-9708-6a5d6efc46cb", "url": "http://www.foxnews.com/transcript/2015/12/02/truth-serum-muslims-celebrating-after-11-attack.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 1, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Truth Serum Segment tonight, two very hot topics. Who is buying oil from ISIS, keeping the savages in business? Also, Donald Trump claiming he saw some American Muslims celebrate the 9/11 attack.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Hey, I watched when the World Trade Center came tumbling down. And, I watched in Jersey City, New Jersey, where thousands and thousands of people were cheering as that building was coming down. Thousands of people were cheering.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, that statement by Mr. Trump has become very controversial. So, what are the facts? Joining us from Washington Shannon Bream, and here in New York City, Eric Shawn, both Fox News Correspondents. OK. there were some Muslims in America happy about the attacks. That has been established beyond a reasonable doubt. Let us start there.</p>                \n                \r\n\n            \n                <p><b>ERIC SHAWN, FOX NEWS ANCHOR &amp; SENIOR CORRESPONDENT: </b>Well, not thousands and thousands in one place as he said. Professor Earthan Kolaja (ph) of Felician University (ph) in New Jersey studied this 10 years ago. He says, \"Well, there was not one place and there was no evidence of one large -scale demonstration. What you are seeing there is what happened in Jerusalem and the Gaza.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>SHAWN: </b>So, maybe Donald Trump was mixing that up. But, he said there were maybe a half a dozen teenagers in Patterson, New Jersey. There have been people through the years, who have said that they did see this. Courteously, with WABC, he said he was getting phone calls that morning about this.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>There were people in New Jersey according to the state police we have investigated, Muslims, who were happy about the 9/11 attack. But, they were not vast numbers of them.</p>                \n                \r\n\n            \n                <p><b>SHAWN: </b>No. Yes, I talked to Mayor Giuliani tonight about New York. He said maybe there were 12. And, he knows that because they were getting beaten up.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, that was in New York City.</p>                \n                \r\n\n            \n                <p><b>SHAWN:</b> That was in New York City.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>SHAWN:</b> But, here is something that we found two days after 9/11. This is the \"New York Post\" September 13th. Trio who cheered attack face boot as illegal aliens. Three men who celebrated as the twin towers crumbled are facing deportation.</p>                \n                \r\n\n            \n                <p>Witnesses saw them cheering and jumping up and down at liberty state park after the attack and the FBI sent this out, Bill. It said, three individuals were seen celebrating after initial impact and subsequent explosion.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK. And, we must tell everybody that we tried at Mr. Trump's request to get video of any of the Jersey situations. All of the affiliated stations, including New York one, the cable station here, they say they do not have any video. And, if they did, they would have run it. I mean we do not have any.</p>                \n                \r\n\n            \n                <p><b>SHAWN:</b> Yes. We have looked. Not only that, reporters and cameramen, you have you been on the streets for years.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>SHAWN:</b> You know, you would come out and say, \"Yes, I covered that. I was there.\"</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, there was -- they said, there is no video of it, but I think, you are right when you said that he probably conflated a voiceover of Palestinians celebrating with the local reporter saying, \"We got some problems in Jersey.\" Because, I think that probably happened.</p>                \n                \r\n\n            \n                <p>All right, Mr. Trump again will be here tomorrow and we will run it by him. Now, ISIS, in order for these killers to operate, they need money. And, they get the money by selling oil from the oil fields that they have captured in IRAQ. We want to know who is buying oil from the savages and Ms. Shannon Bream has that information. Who is buying it, Shannon?</p>                \n                \r\n\n            \n                <p><b>SHANNON BREAM, FNC SUPREME COURT CORRESPONDENT: </b>Well, Bill, it depends on who you ask, but it looks like what is happening is local traders are actually showing up, fueling up in some areas. There is actually a month long wait at these oil fields controlled by the rebels, where local traders will buy the oil and then it is used in the rebel held areas.</p>                \n                \r\n\n            \n                <p>But, the U.S. has now made allegations that Syria -- the government of Syria itself may be buying some of this oil benefiting ISIS. But, there are now allegations coming out of Russia. They believe that turkey is actually facilitating this as well.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK. So, what happens --</p>                \n                \r\n\n            \n                <p><b>BREAM:</b> So, there could be some state actors.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You correct me if I am wrong, because you are the Truth Serum correspondent. So, guys with trucks show up at the oil fields, or the oil refineries, because they have to refine the oil into gasoline. All right.</p>                \n                \r\n\n            \n                <p>They load their trucks. They pay ISIS on the spot for the oil, whatever ISIS charges them. They take the trucks, and they drive. And, you are saying they drive three place, these are the allegations.</p>                \n                \r\n\n            \n                <p>One in ISIS held areas where they sell to gasoline stations or power stations. Two, to Assad's government, who got money and they need oil, so they buy from them, and maybe Turkey. I have not heard the Turkey thing from the west. Putin is accusing them of everything. You know that.</p>                \n                \r\n\n            \n                <p><b>BREAM:</b> Yes. Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do I have the story right?</p>                \n                \r\n\n            \n                <p><b>BREAM:</b> You are exactly right. And, I will tell you that Turkey's President Erdogan, speaking in Paris where they are having as a climate gathering said that, if this turns out to be true, he will actually resign his position. He says, there is no way they are officially involved with it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, I tend to believe the Turks are not buying, because they hate ISIS. But, now, we are bombing those trucks, which we should have been doing a long time ago, all right? But for some reason, President Obama would not allow the trucks to be bombed, but now they are being bombed.</p>                \n                \r\n\n            \n                <p>OK, thanks very much, you guys. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Truth Serum: Muslims celebrating after the 9/11 attack?", "description": "Investigating Donald Trump's claims and ISIS oil buyers; Eric Shawn and Shannon Bream separate truth from spin on 'The O'Reilly Factor'", "date": "2015-12-02T13:28:14Z"}