{"vcmId": "8d4ace88-6a0e-4ca6-8f93-ca8e41044732", "url": "http://www.foxnews.com/transcript/2017/02/08/exclusive-interview-with-president-trump-part-3.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 7, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Hi, I am Bill O'Reilly. Thanks for watching us tonight. We are alive, waiting for the Ninth Circuit Court of Appeals to decide whether or not President Trump's executive order constraining some refugees abroad will be allowed to go forward. Deliberations are going on right now. The moment anything happens, you will know it.</p>                \n                \r\n\n            \n                <p>Also, the Talking Points memo on President Trump breaking big news in his interview with me will be in our second block this evening. But first, the final part of our interview with Mr. Trump. This time around, we focus on the personal.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What is the most surprising thing for you about this job you have? You come from the private sector, no political office, now, you are the President of United States. What surprised you?</p>                \n                \r\n\n            \n                <p><b>PRES. DONALD TRUMP (R), UNITED STATES</b>: I think the size, the magnitude of everything. So, I was a very big real estate person. I build a building for 500 million or $900 million. And here, you look at an airplane contract where you can save $600 million on 90 plans. I saved more than $600 million. I got involved in negotiation on a fighter jet, the F-35. And by the way, Lockheed Martin, a great company. But they weren't bringing their price up. I got involved, I saved more than $600 million as their (INAUDIBLE). But the magnitude of -- you can do that at every level of government. My new thing is going to be Pharma because we pay too much with the largest drug purchaser in the world. And they don't negotiate.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How many hours a day you're working?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I'm working long hours. Long hours. Right up until 12:00, 1:00 in the morning.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What time do you get up?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Five o'clock.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. And you are working after you have breakfast?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I read the papers, I see what is going on, I take a look. I see the lies, you know, the lies -- that is another thing. I always got good press. You know, I was a business guy, I got good press.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: (LAUGHS) I know.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I have never -- I collect, you know, fake news. Some of the networks and some of the papers -- the level of dishonesty, when they take a story that should be good, I know good from bad.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Sure.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> They take something that should be a good story, in fact, sometimes, I say, oh, this is going to be nice to read and say, whoa. And they will purposely totally change it. It is fake news.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Why are they doing that?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, because I am on the other side of the equation. They did it to Reagan but not as much.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Why? I don't understand.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I just think that it is just the other side of the coin. You know, they called themselves progressive, which is a beautiful word. But it's not true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you think they don't like you?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: When you look at what happens -- I don't know. I think they don't like my -- I don't think they like anybody on our side.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I know you for a long time and I know that, you know, when people attack you personally, that bothers you. So, they are saying that you are anti-Muslim. They are saying you are anti-Black. They are saying you are anti-poor. Do you respond, because you do come back?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I always respond.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I mean, but does it hurt your feelings that they are making you into a hater?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: No because they always do it. The first thing they do with the Republicans or conservatives is the racist card. They pull out the racist card. They always do. Not just me. I mean, they do it with everybody. And I see that and once you know that, you feel a lot better about it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is there any validity to the criticism of you that you say things you can't back up factually? And as the President -- you can do that as a candidate or businessman. But if you say for example that there are three million illegal aliens who voted and then, you don't have the data to back it up, some people is going to say, that is irresponsible for a president to say that. Is there any validity?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, many people have come out and said I am right. You know that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know but you have to have the data to back that up.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: And doesn't have to do with a vote, although, that is the end result, it has to do with the registration. And when you look at the registration, and you see dead people that have voted, that are on many, many dead people are on that have voted, when you see people that are registered in two states that voted in two states, when you see other things, when you see illegals, people that are not citizens, and they are on the registration rolls. See? What they do is they load up the registration rolls. There is a lot of bad things happening. Look, Bill, we can be babies but you take a look at the registration, you have illegals, you have dead people, you have this, it is really a bad situation. It is really bad.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, you think you're going to be proven correct in that statement?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, I think I already have. A lot of people have come out and said that I am right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. But the data has to show that three million illegals voted.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Look, we have a lot of different -- you go to the voting booths and you see what was going on. But to get that -- forget all of that. Just take a look at the registration as we're going to do it. I'm going to set up a commission to be headed by Vice President Mike Pence and we are going to look at it very, very carefully.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, that is good.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Let's get to the bottom of it. Do you ever think you were going to convince the media, the American media, to give -- and I know that you don't feel you are getting a fair shot, okay?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: So, you don't, either. Because I watch and you say --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: In many cases --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You say you're not getting a fair shot because you said, ideology drives the news coverage and it shouldn't. News coverage should be news coverage, not ideological. What I do, I am an analyst, I can do whatever I want. And I have criticized you and you know what and you come right back at me and that is good. That is a good thing. But there are entities in this country that despise you and your administration. Can you, do you think you can ever convince them to take it down a bit?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Yes, I do. I think so. I think success will do that. I think jobs will do that. I think companies coming back into our country will do that. Yes, I think I can. Not all the way, I'll never get all the way back. Hey, look, I was named, I used to be man of the year, now it's president of the year by \"Time\" magazine. But even on the cover, when they named it, they talked about the divided nation. I don't think it is fair. Maybe other people do think it is fair. But I think I can bring it back. Yes. I think success, jobs, lots of other things can bring it back.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Last question. You get four hours of sleep or some crazy thing like that. When your head hits the pillow, do you ever say to yourself, I can't believe I am here? I cannot believe that I'm the President of the United States, when I wasn't a politician, I didn't start out this way, that wasn't my life goal? Does that ever come into your mind?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, I must tell you, the other day, I walked into the main entrance of the White House. And I said to myself, \"this is sort of amazing.\" Then, I walked into the Oval Office, and I have had to the head of Ford and General Motors and all of these people now as they come to see me, because I want to hear from them, and they walk into the Oval Office, and they have beautiful offices, and you know, they feel the same way. Or you walk into Air Force One. It is like a surreal experience in a certain way. But you have to get over it because there is so much work to be done, whether it is jobs or other nations that truly hate us, truly, truly hate us, and are looking to do damage. You have to get over it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. President, thanks very much for taking the time.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Exclusive interview with President Trump, Part 3", "description": "Bill and President Trump discuss the media, the left and working in the White House on 'The O'Reilly Factor'", "date": "2017-02-08T13:32:41Z"}