{"vcmId": "8efb9ae2-d37a-471d-9223-7c0e7af45b51", "url": "http://www.foxnews.com/transcript/2015/08/26/bill-oreilly-joe-biden-for-president.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>With the FBI now investigating Hillary Clinton's e- mail shenanigans, Vice President Biden, 72 years old, ramping up to challenge her for the Democratic presidential nomination.</p>                \n                \r\n\n            \n                <p>So how do we know this? `First, Mr. Biden met with President Obama yesterday and somehow it leaked out that the President has no problem with old Joe making the run. In fact, Mr. Obama has sent a very public signal.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOSH EARNEST, WHITE HOUSE PRESS SECRETARY: </b>The President does plan to vote in the Illinois primary. And that ultimately it will be Democratic voters who are responsible for choosing the Democratic nominee. I wouldn't rule out the possibility of an endorsement in the Democratic primary.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's big as President Obama is standing in the Democratic Party is immense. The President and the Vice President are close personal friends. It's almost inconceivable Mr. Obama would not endorse Joe Biden over Hillary Clinton with whom he has a distant relationship.</p>                \n                \r\n\n            \n                <p>Also, Mr. Biden has been meeting with advisors, money men, Democratic stalwarts like Senator Elizabeth Warren. If he does run, Biden will have to announce soon. \"Talking Points\" believes he will be in the race. That being said, once he does commit he will be hammered and there is plenty of ammunition.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>In Delaware, the largest growth in population is Indian American. Moving from India. You cannot go to a 7/11 or a Dunkin' Donuts unless you have a slight Indian accent. I'm not joking.</p>                \n                \r\n\n            \n                <p>Romney wants to let -- he said in the first 100 days is he going to let the big banks, once again, write their own rules. Unchain Wall Street. They are going to put you all back in chains.</p>                \n                \r\n\n            \n                <p>I'm very optimistic about Iraq. I think it's going to be one of the great achievements of this administration.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Wrong. As we all know Iraq is one of the great disasters of the Obama administration. However, to be fair all politicians, pundits, American citizens have said dopey things. All of us are guilty of that.</p>                \n                \r\n\n            \n                <p>Now as far as Hillary Clinton is concerned, things may get even worse. The e-mail evidence made public so far pretty much enough to indict her on a misdemeanor national security beef. If the FBI discovers she had her e- mail server professionally scrubbed, the former secretary of state could be looking at a felony charge.</p>                \n                \r\n\n            \n                <p>Bottom line, any charges, any charges against Hillary Clinton will take her out of the race and Joe Biden knows it. So we have high drama. And the Presidential contest is just getting started.</p>                \n                \r\n\n            \n                <p>That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Joe Biden for president", "description": "Bill O'Reilly's Talking Points 8/25", "date": "2015-08-26T12:06:52Z"}