{"vcmId": "8fca8aad-d37b-43e4-af8e-61a2e547af1d", "url": "http://www.foxnews.com/transcript/2016/01/06/bill-oreilly-truth-about-guns-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>President Obama is taking his cause to the public that there should be tighter restrictions on who is allowed to buy firearms in America.</p>                \n                \r\n\n            \n                <p>Today he said this:</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>And from every family who never imagined that their loved one would be taken from our lives by a bullet from a gun -- every time I think about those kids, it gets me mad. And by the way, it happens on the streets of Chicago every day.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Mr. Obama is obviously sincere in his quest for more public safety, but he is missing the big picture. According to the latest FBI stats, slightly more than 8,000 people were victims of firearm murders in 2014. There were 118,000 robberies involving a firearm and almost 150,000 aggravated assaults involving guns.</p>                \n                \r\n\n            \n                <p>The population of the U.S.A. is approaching 330 million so you can see there is not a gun crime epidemic. And the vast majority of these heinous crimes are committed by hard core criminals, not civilian shooters.</p>                \n                \r\n\n            \n                <p>Right now, there are more than 300 million firearms in America and they are currently all over the place. So there will be a thriving black market for guns no matter what kind of registration laws are passed.</p>                \n                \r\n\n            \n                <p>As far as terrorist-related firearm killings in the U.S.A.? There have been 88 deaths in the past 10 years by armed terrorists -- not an epidemic.</p>                \n                \r\n\n            \n                <p>Now, \"Talking Points\" understands public safety and reasonable gun registration laws should, should be on the books. But perspective is very important and restricting law abiding Americans from acquiring guns is obviously unconstitutional.</p>                \n                \r\n\n            \n                <p>Again, the gun violence problem primarily lies with hard core criminals. So where is the federal law that mandates strict prison time for anyone using a gun in the commission of a crime? Where is that law Mr. President?</p>                \n                \r\n\n            \n                <p>You mentioned Chicago. That law could do something about gun violence in Chicago. You simply can't leave sentencing to local judges if you want to control gun violence on a national level. You can't do it.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" has said it before. Any person convicted of a gun-related crime should get 10 years in prison on top of what they get for the crime whether it's assault, murder, or robbery. That would send a meaningful message.</p>                \n                \r\n\n            \n                <p>The truth is, terrorists are not going to submit themselves to background checks neither are dangerous felons or insane people. They are not going to sign any paper when they buy a gun. Do we all get that?</p>                \n                \r\n\n            \n                <p>They will buy their guns on the black market. And no registration law will prevent that.</p>                \n                \r\n\n            \n                <p>On the other side, the NRA and the gun owners should be reasonable. The FBI should background check anyone buying a firearm in America. That just makes sense. If you are paranoid and believe the government is stockpiling information so they can come to your house and take your guns -- that's your problem, your problem.</p>                \n                \r\n\n            \n                <p>But the government has an obligation to enhance public safety. And that brings us back to harshly punishing people who violate the law with guns. Registration is not going to solve the gun murder problem. Zero tolerance toward gun crime might. Think about it, Mr. President.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The truth about guns in America ", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/5", "date": "2016-01-06T13:10:34Z"}