{"vcmId": "913f0224-1d46-4359-befa-82930b1b608e", "url": "http://www.foxnews.com/transcript/2015/04/29/bill-oreilly-who-is-big-loser-in-baltimore-riots.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Let's start at the top with the President of the United States.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>If our society really wanted to solve the problem? We could, it's just it would require everybody saying this is important. This is significant. And that we don't just pay attention to these communities when a CVS burns. We don't just pay attention when a young man gets shot or have his spine snapped.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It's easy to say but what about results? On the President's watch, unemployment for blacks stands at 10 percent after more than six years in office. The overall unemployment number 5.5 percent.</p>                \n                \r\n\n            \n                <p>In Baltimore, the situation is dire. 63 percent of the population there is African-American -- 63 percent. Unemployment rate -- 8.4 percent. And blacks control the city. Black mayor? Nine out of the city council members are black, only six are white. So African-Americans calling most of the shot. Police chief is black.</p>                \n                \r\n\n            \n                <p>Despite that, 24 percent of Baltimore residents live below the poverty line -- 24 percent. But the median income for Maryland is $73,500, the highest in the nation. But for Baltimoreans median household income is a whopping $32,000 less than the state. That's just over $41,000 a year. So you can see despite African-Americans controlling Baltimore, the city is not prospering.</p>                \n                \r\n\n            \n                <p>The facts then dictate that racial persecution really isn't the problem in Baltimore. Something else is in play. That something else is personal behavior.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>When individuals get crowbars and start prying open doors to loot, they're not protesting. They're not making a statement. They're stealing. When they burn down a building, they are committing arson.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That is correct, Mr. President. There is no linkage between what happened to Freddie Gray and torching buildings. Peaceful demonstrations get national attention. Dr. Martin Luther King Jr. proved that beyond any doubt.</p>                \n                \r\n\n            \n                <p>But what about the police in Baltimore? Well, black crime there is out of control. The city has the fifth highest murder rate in the country. 90 percent of homicide victims in Baltimore are black. 90 percent of murder suspects are black. 90 percent of those arrested for robbery are black. About 90 percent of those arrested for aggravated assault are black. And arrests for all offenses in the city of Baltimore, Maryland -- 85 percent black. Again, the black population is 63 percent.</p>                \n                \r\n\n            \n                <p>With so many African-Americans committing crimes, there is going to be tension between the cops and the community. It's inevitable. Honest people know that and most African-Americans in Baltimore, I believe, are sickened by what's happening there. There are good honest people who reject violence and crime. In fact, a mother, whose son was rioting, has now become famous.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TOYA GRAHAM, PROTESTER'S MOTHER:</b> (EXPLETIVE DELETED). You want to be out here doing this dumb (EXPLETIVE DELETED). Get (EXPLETIVE DELETED) over here. Get over here now.</p>                \n                \r\n\n            \n                <p>You know, I'm a single mom. I have six children. And I just choose not to live like that no more. I was angry. I was shocked because you never want to see your child out there doing that. Everybody that knows me know I don't play that, you know what I mean? He knew. He knew. He knew he was in trouble.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That mother's name is Toya Graham. We're hoping she will come on The Factor tomorrow night. She knows firsthand that the destruction in Baltimore last night and black crime in general has set that city back decades. I mean who is going to invest or start a business in the poor precincts of Baltimore? Who?</p>                \n                \r\n\n            \n                <p>That means good jobs will not come to those neighborhoods. So the big loser in the Baltimore riots -- are those that live in the poor neighborhoods primarily African-Americans. These idiotic thugs rioting and looting are hurting their own people. And because the entire world sees pictures of blacks rampaging, all African-Americans are affected. One of the councilmen in Baltimore understands that.</p>                \n                \r\n\n            \n                <p><b>BRANDON SCOTT (D), BALTIMORE COUNCIL:</b> I am simply pissed off. This is the city that I love. This is the city that I chose to dedicate my life to. And we cannot stand idle and let thugs, whatever you want call them. I don't even say they're thugs. We're going to just call them cowards ruining our city.</p>                \n                \r\n\n            \n                <p>So what I'm going to say here today is if you are an adult and you are out there participating in this, you are ruining the future for these young people.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Scott is brave and he is absolutely right on the mark.</p>                \n                \r\n\n            \n                <p>Summing up, it is long past time for police agencies in America to have a no tolerance policy towards brutality on the part of officers. Every American, even criminals, should be safe in police custody.</p>                \n                \r\n\n            \n                <p>But it is also long past time for African-American communities across America to begin to police themselves -- criminal activity, drug use, child abandonment, disrespect, general chaos all on display every single day in many places. And you know what? No government is going to stop that. No bureaucracy is going to help you. The communities have to do it themselves.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Who is the big loser in the Baltimore riots? ", "description": "Bill O'Reilly's Talking Points 4/28", "date": "2015-04-29T12:06:26Z"}