{"vcmId": "91a2fa2d-13d7-45a1-bab3-11c4a2d95d93", "url": "http://www.foxnews.com/transcript/2015/02/11/bill-oreilly-another-american-killed-by-isis-savages.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>26-year-old Kayla Mueller from Arizona is dead. Apparently ISIS contacted her family providing proof that she had been killed by them. This makes four Americans executed by the jihadists.</p>                \n                \r\n\n            \n                <p>Kayla was captured by ISIS on august 4th, 2013 in Syria while leaving a hospital staffed by the humanitarian group Doctors without Borders. She was in Syria to help suffering refugees.</p>                \n                \r\n\n            \n                <p>President Obama said, quote, \"The United States will find and bring to justice the terrorists who are responsible for Kayla's captivity and death. ISIL is a hateful and abhorrent terrorist group whose actions stand in stark contrast to the spirit of people like Kayla,\" unquote.</p>                \n                \r\n\n            \n                <p>The fact that these jihadists have been able to continue to murder civilians with impunity should trouble the entire world. As Talking Points has mentioned President Obama has received advice about terrorism from two former defense secretaries -- advice he has rejected.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>ROBERT GATES, FORMER U.S. SECRETARY OF DEFENSE:</b> The reality is they are not going to be able to be successful against ISIS strictly from the air or strictly depending on the Iraqi forces or the Peshmerga of the Sunni tribes acting on their. So there will be boots on the ground if there is to be any hope of success in the strategy.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But Mr. Obama has said no to targeting ISIS from the ground. Why? Here is what Leon Panetta says.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>LEON PANETTA, FORMER U.S. SECRETARY OF DEFENSE:</b> He lost his conviction that we had to constantly go after terrorism that we had to constantly be involved in a very troubled world because I think wanted to hopefully be able to focus again on this country and what needed to be done here.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Panetta's statement is backed up by the President's own words yesterday.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> My first job is to protect the American people but we also have to attend to a lot of other issues and we have make sure we are right sizing our approach so that what we do isn't counterproductive. I would argue that our invasion of Iraq was counterproductive to the goal of keeping our country safe.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> With all due respect to the President, this country is capable of attending to many issues at the same time. And the war in Iraq should not impede effective strategy against Muslim killers today. To allow the jihad to continue its reign of terror without a solid plan strikes me as irresponsible and dangerous.</p>                \n                \r\n\n            \n                <p>Last night I talked with David Axelrod, one of Mr. Obama's closest advisers. He, like Secretary of State Kerry, believes that air power and paper coalition will eventually, eventually degrade the ISIS fanatics.</p>                \n                \r\n\n            \n                <p>I think Kayla Mueller might disagree.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Another American killed by the ISIS savages", "description": "Talking Points 2/10", "date": "2015-02-11T13:12:09Z"}