{"vcmId": "92f7eef7-d935-4e37-8a5c-8c867fda0bf0", "url": "http://www.foxnews.com/transcript/2014/12/09/more-professional-athletes-protesting-racial-injustice.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 8, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Back of the Book segment tonight. More protests in pro- sports about race. Tonight, Cleveland Cavaliers forward LeBron James wore a shirt saying, \"I can't breathe.\" That on the heels of the five St. Louis Rams players raising their hands in sympathy of the \"Hands up, don't Shoot\" movement.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington, Charles Krauthammer. So, my position as I said last week is, I think people in the public eye like pro-athletes have a responsibility to know what they're talking about before they protest on the company dime. Am I wrong?</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, FOX NEWS CONTRIBUTOR: </b>Well, I mean, there are people in the public eye who all the time talk about things they know nothing about. Let the leading democratic candidate for the presidency, the former secretary of state said a couple weeks ago, don't let anybody tell you that corporations and businesses create jobs. Presidents often talk about things they know nothing about, senators, Congressmen. I might say even talk show hosts and even I -- perhaps even I have once said something that makes no sense, although I can't say, I can't remember one off-hand.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> There's a difference though. If you're going to throw in as a professional athlete or an actor or on stage, by the way -- I'm not talking about in your private life. I'm not talking about that. But if you're in an arena where people have paid money to come and see you and you're working for a team, all right? And then you make a statement, a political statement as these statements are, I don't mind that if you defend the statement articulately. The Rams players could not do that because they didn't even know that don't shoot -- \"Hands up, don't Shoot\" was debunked by the forensic evidence in Ferguson. They didn't even know that. All right? They thought that \"Hands up, don't Shoot\" was what actually happened. So, their protest was based on a fallacy. Now, it's a little bit -- it's not that intense with LeBron James. He's a smart man. I saw him last week. He may get a statement -- I'm not sure whether Mr. James -- I don't know what his point of view is and I think he needs to say what his point of view is.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>Well, I think that t-shirt speaks for what he's -- I assume --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But does he think that the grand jury is corrupt? Does he think all police as our lead guest tonight are targeting blacks? Is he there? Or is he just saying I don't agree with this singular decision? You know, we don't know.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>Look, I don't expect an elaborate legal exegesis on the case from the best ballplayer in the NBA. But if he wants to say by having a jersey on, a t-shirt on, that there was a case in which a man was choked to death or died while being held by police that there's something about that that disturbs him. That I assume is the message of that t-shirt that is a perfectly reasonable thing to do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> And it's a perfectly reasonable use of his celebrity. Look, scientists use their celebrity to make a political point. Priests do. Experts do. Movie stars do. We've sort of accepted that in the culture. You can ask them under cross-examination to explain what they say. And often the movie stars can just have these inane explanations to what they are talking about. But in and off itself for a celebrity to use a platform to make a case, that's perfectly fine.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. But if I were a sports -- I would say in the press conference, you know, what do you mean there? What exactly is your beef here? Get it out so everybody understands.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> I expect that LeBron will be asked about that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, we'll see. I got 45 seconds. The theme of this show so far is that America hunts down black men using the police, that American women are being raped and nobody really cares about it, that grand juries are corrupt and we need to do away with them and that the President of the United States says, there's constant bias in America. I mean, are you and I going to have to move to Iceland? What are we going to have to do here?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> No, we just have to make clear what the truth is. And in Ferguson, there was a case where the grand jury, I think, made the right decision. The overwhelming evidence was against any intent or criminality and in the case in what happened in Staten Island I think there was a true miscarriage of justice. The obvious evidence on the video is that this was an abuse of power. But there is no evidence that it was racism.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No. And that I think --</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> And that is the heart of the case in Staten Island.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. All right, Charles. I got to run. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "More professional athletes protesting racial injustice", "description": "Charles Krauthammer reacts to public figures commenting on tense race relations", "date": "2014-12-09T13:03:14Z"}