{"vcmId": "95d2592f-05fc-4e7b-8fb6-39a8332a4a50", "url": "http://www.foxnews.com/transcript/2016/10/19/bill-oreilly-what-is-wrong-with-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>This evening, we will set up the final presidential debate in Las Vegas tomorrow night. Just a few moments we will show you why Donald Trump has to win decisively in Vegas or he will lose the general election.</p>                \n                \r\n\n            \n                <p>Mr. Trump should absolutely capitalize on what is wrong in America because there is no doubt we're in trouble. First, the economy. Growth is less than two percent. That means well-paying jobs are scarce, and workers have to take what's available. The unemployment rate doesn't mean very much when new jobs come with low salaries. With all the resources we have in the U.S.A., growth should be far more than two percent.</p>                \n                \r\n\n            \n                <p>On the immigration front after all these years people can still walk across the Southern border, establish residency illegally in this country, and then have the government actually pay them entitlements. Does that sound like a fair system to you? When Kate's Law was destroyed by the awful Senator Harry Reid, critical mass was reached. All that law would have done was require a mandatory federal prison sentence for a violent, illegal alien felon who defied deportation who came back after being kicked out. Reid and other Democrats in the Senate killed it.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HARRY REID (D-NV), SENATE MINORITY LEADER:</b> The new mandatory minimum sentences the bill would create would have a crippling financial effect. And that's an understatement with no evidence that they would actually deter future violations of law. This legislation would require about 20,000 new prison beds. Twenty thousand. Twelve new prisons. Cost over $3 billion. This is yet another attack on the immigrant community.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So let me get this straight, Reid. To punish violent illegal alien felons who cross back into this country after being deported is an attack on the immigrant community? And the prison stuff is just false. The numbers of criminal aliens would fall drastically once they knew they would be partially punished just for standing on American soil. They wouldn't have to commit another crime. Just for standing here they get 10 years under Kate's Law.</p>                \n                \r\n\n            \n                <p>Now, the kind of insanity that Reid puts forth is why so many Americans, including this one, are angry. About crime in the poor neighborhoods, last night in Chicago, 12 people shot including a 13-year-old boy. Twelve. That begins -- that brings the total number of Americans shot in the windy city this year alone to 3,476. Chicago is more dangerous than Kabul, Afghanistan. And it's clear that Democratic Mayor Rahm Emanuel and Republican Governor Bruce Rauner will not stop the violence in poor black Chicago neighborhoods.</p>                \n                \r\n\n            \n                <p>Will not stop it. Now, that is true racism. For you p.c. people out there. Let's go overseas. Major battle underway right now to remove ISIS from Iraq's second largest city Mosul. The hard truth is, ISIS should have never been allowed to take Mosul or any other Iraqi territory in the first place. The only reason that happened was a huge foreign policy blunder by President Obama. As you may know, he withdrew all-American troops from Iraq in 2011 without American forces there, ISIS grew in power. And who was the architect of that policy? Secretary of State Clinton.</p>                \n                \r\n\n            \n                <p>Finally, what about our national spirit? One word, terrible. With all the muck, WikiLeaks, media bias, and chaos surrounding the presidential campaign, Americans are disgusted. We're a divided nation. Most folks are voting against the candidate rather than four one. And a politically correct culture that is being imposed on us by the media, imposed is rapidly destroying traditional values. All religious Americans know that. So it seems to me that the challenger in the presidential race, Trump, should have an advantage because Secretary Clinton is embracing the policies of Mr. Obama. But it has not turned out that way. And Trump is down to his last chance tomorrow night. And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: What is wrong with America?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/18", "date": "2016-10-19T13:22:01Z"}