{"vcmId": "961356b6-5544-4285-869b-26ecf94e1c45", "url": "http://www.foxnews.com/transcript/2017/01/20/ca-withdraws-request-to-give-illegals-health-insurance.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 19, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Unresolved Problems\" segment tonight. The state of California, perhaps the most progressive entity in allowing undocumented aliens benefits. But now, California has withdrawn its request to the federal government for permission to allow undocumented folks access to government mandated health insurance. Some say that back down is because of Donald Trump.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington, California Congressman Brad Sherman, a Democrat. So, do you think Mr. Trump has intimidated Sacramento, the capital, into withdrawing this request?</p>                \n                \r\n\n            \n                <p><b>REP. BRAD SHERMAN (D), CALIFORNIA: </b>Well, first, let's clarify the request. It was to let undocumented immigrants shop on the website. Just as they can shop at Safeway.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>SHERMAN</b>: Just as they can shop on Amazon. No subsidy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's what he said.</p>                \n                \r\n\n            \n                <p><b>SHERMAN</b>: And when you get more customers, and as lower prices for everybody. So, that is with the waiver intended. Yes, it is indeed Donald Trump that has caused California to withdraw the waiver. Keep in mind, the two things that he hates most are undocumented immigrants and ObamaCare.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, I don't know about that. But he certainly wants to change the policies. But you said something very interesting.</p>                \n                \r\n\n            \n                <p><b>SHERMAN</b>: Uh-hm.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, he has, just by his power, sent a message to California that says, what? What is the message that Trump is sending to California?</p>                \n                \r\n\n            \n                <p><b>SHERMAN</b>: That if undocumented immigrants want to buy health insurance, they can buy it anywhere except on these particular exchanges.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. The ObamaCare exchanges, no-go. Now California is defying Trump on sanctuary cities and a number of other things. They have threatened a lawsuit for the border wall. Why are they giving in on this?</p>                \n                \r\n\n            \n                <p><b>SHERMAN: </b>Well, the fear is that if undocumented immigrants sign up that that would give Trump a list for his mass deportation policy. Now, we do know if he is going to follow that policy. But if you listen to his rhetoric --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, that's appeared that if there was undocumented on the list to access health care, that the federal government would know about it. I don't know if that is the case, though. I think that California is in a very tough spot here. Because if it is going to go up against Jeff Sessions, the new Attorney General, and Donald Trump, there is a lot of federal dollars in play here. And I think that is in the back of everybody's mind out there. I could be wrong. Now, you are not boycotting the inauguration. Why not?</p>                \n                \r\n\n            \n                <p><b>SHERMAN:</b> Well, it is a tough decision. I respect those who are boycotting. The leaders of our party are going to be in attendance. Presidents Clinton, Obama, and Carter, candidates Hillary and Bernie, and I'm going to do it out of respect for the system. You know, it is easy to respect the system when it gives you the right results. I am not, you know, I was very happy to attend the inauguration of Barack Obama. I will be attending without much joy but with a respect for a system even though I know the system is flawed with the Electoral College, et cetera, et cetera.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Why do you think other Democrats don't see it that way you do? Because I do. And you may remember, the second inauguration for Barack Obama, there was no Republican boycott, even at that time, they were at each other's throats. Republicans showed up. It just makes the Democratic Party look bad, I think.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, it does because, while we get excited about reaching out to a base that includes a lot of people that really do not think Donald Trump is legitimate, may even loathe him, we have got to remember that we will not be a majority unless we can appeal to those people who either voted for Trump or thought of voting for Trump.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, it's the independent Americans at the Democratic Party needs to win back if you want to take power away from Donald Trump and four years. But see, I don't understand what this boycott accomplishes. I don't get that. It doesn't strengthen the Democratic Party. I believe that most Americans don't like this at all. They would much rather see a country, at least on one day come together and celebrate our traditions. I think you agree with that. Most Americans want to see the country celebrate it on inauguration day. Not politicians. The country. So, it hurts the Democratic Party to be put in this position. It also makes them party of fanaticism. And that never works, does it?</p>                \n                \r\n\n            \n                <p><b>SHERMAN: </b>Well, I don't know if we are in a celebratory mood, even those of us --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Because it doesn't matter, it celebrates the country.</p>                \n                \r\n\n            \n                <p><b>SHERMAN</b>: We're there to celebrate the country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We're aware a little flag pin or something. You know, you don't have to be jumping up and down. Republicans were jumping up and down for Barack Obama second time around, where they?</p>                \n                \r\n\n            \n                <p><b>SHERMAN:</b> I don't think so. I celebrate America every day with joy. There will be a little less joy than usual tomorrow. I think a lot of my colleagues feel that there are representatives, and their constituency is in an angry mood toward Donald Trump.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But are they supposed to be the adults in a room? So, they are in an angry mood, all right, next time around, let's give it a better shot and maybe we will take power back. But right now, do we want to be petulant? Do we want to be subversive? I just think it hurts your party.</p>                \n                \r\n\n            \n                <p><b>SHERMAN</b>: Well, it's a close call. Keep in mind, if you got a ten dollar bill and a $20 bill in your wallet, both those presidents had their inaugurations boycotted by their predecessors. John Adams boycotted, John Quincy Adams boycotted.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> There was bad feeling but never like this.</p>                \n                \r\n\n            \n                <p><b>SHERMAN</b>: If you know American history, and I know you do, there have been even more contentious times that we face today.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Not with the internet. The internet spreads the hate so fast that by the time the pony express got out to Missouri when John Quincy Adams didn't like Jackson, he was out of office already, Jackson. And it was like, it took four years to get out there. Hey, Congressman, it is always good talking to you. We appreciate you taking the time.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "CA withdraws request to give illegals health insurance", "description": "Why is the state backing down? 'The O'Reilly Factor' investigates", "date": "2017-01-20T13:16:52Z"}