{"vcmId": "97c49c8d-be22-4bb9-b3d9-8bcb9b80e824", "url": "http://www.foxnews.com/transcript/2016/01/20/bill-oreilly-president-obama-ordering-illegal-aliens-out-country.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>So far this month Homeland Security has apprehended 121 Central Americans - - all with outstanding deportation orders. It's the same old story. Immigration judges order people to be deported -- they don't show up for the hearings and ICE has to track them down. That costs millions of dollars.</p>                \n                \r\n\n            \n                <p>So far 146 House Democrats sent a letter to Mr. Obama demanding that he halt the deportations. Also Hillary Clinton, Bernie Sanders, Martin O'Malley all have denounced the raids that's because many Democrats want open borders and amnesty in order to change voting patterns in the states.</p>                \n                \r\n\n            \n                <p>Now, it's interesting that President Obama is enforcing immigration law when he really has no will to do it. Perhaps the President is looking at the Supreme Court which today announced it will hear his executive order granting some aliens temporary residence in the U.S.A. in apparent violation of immigration law. That will be a landmark case.</p>                \n                \r\n\n            \n                <p>And \"Is It Legal\" has details in just a few moments.</p>                \n                \r\n\n            \n                <p>Summing up: illegal immigration, a major issue in the Presidential race, and no doubt about it.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: President Obama ordering illegal aliens out of the country", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/19", "date": "2016-01-20T13:30:10Z"}