{"vcmId": "985279c2-ba4f-44f1-859c-4be6556703eb", "url": "http://www.foxnews.com/transcript/2014/12/10/radio-network-mocking-jesus.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 9, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Unresolved problem segment, tonight, mocking Jesus just in time for Christmas. On the very liberal NPR Radio Network, there is a show called \"Wait, Wait, Don't Tell Me.\" It's a quiz show. Host of the program is Peter Segal, who on Saturday mocked a Catholic advertisement.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>You can take a selfie with Jesus, the Catholic Church preaches that Jesus is always with us. In fact, he is right behind you. New Catholic diocese shows a woman sitting by herself and holding out a phone to take a selfie like the kids do. But in the picture you see this woman and this bearded man behind her. His hands were occupied?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> His hands were occupied? What does that mean? We asked NPR President Jarl Mohn. That's his real name to define his hands are occupied. Here is what the PR person sent me.</p>                \n                \r\n\n            \n                <p>\"Wait, Wait, Don't Tell Me is a comedy show that pokes fun at the news. Their goal is to make people laugh. We regret that we didn't succeed in this case, but no definition on the hands deal.\"</p>                \n                \r\n\n            \n                <p>Joining us from Washington is Pastor Robert Jeffers, a Fox News contributor. This whole thing arose because the diocese of Brooklyn trying to get people to come back to church for the Christmas season.</p>                \n                \r\n\n            \n                <p>And they put this marketing program and this guy seized on it. Do you have any idea what the hands thing is all about, Pastor?</p>                \n                \r\n\n            \n                <p><b>ROBERT JEFFRESS, PASTOR, FIRST BAPTIST CHURCH IN DALLAS:</b> I don't want to speculate what was going through that sick mind, but what I do want to point out, Bill, this is illustrates the hypocrisy, the double standard of the secular media when it comes to Christianity.</p>                \n                \r\n\n            \n                <p>I can guarantee you one thing that if this host had been ridiculing Mohammed or Islam, he would have been out overnight. Look at what they did to Juan Williams just a few years ago, but when it comes to Christianity, it's open season.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now you say sick mind. Why would you characterize the man that way?</p>                \n                \r\n\n            \n                <p><b>JEFFRESS:</b> Well, I think the context to me is something that at the very least is dirty, and possibly could be blasphemous. But, you know, I was in Washington, D.C. earlier today to lead the opening prayer for Congress, so I thought, I'm going to be with Bill tonight, talking about this subject?</p>                \n                \r\n\n            \n                <p>I want to find out how much taxpayer money are we using to support NPR. It turns out we are subsidizing them $40 million a year to support this kind of junk. Bill, that is something the folks out there ought to get mad as hell about.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> As you know, Pastor, we have been talking about that NPR and PBS should not have access to taxpayer money. I just want to be fair to this guy. I truly hope that his comment about Jesus was not salacious, all right?</p>                \n                \r\n\n            \n                <p>I truly hope that maybe he was saying that Jesus' hands were nailed to the cross and that's why, maybe. You know. I mean, it's Christmas, Pastor. I want to be as charitable as I can to this man.</p>                \n                \r\n\n            \n                <p>, if indeed, it was salacious what he was trying to get at with Jesus, then that is -- he should be fired immediately. I don't know if we can prove that or not.</p>                \n                \r\n\n            \n                <p><b>JEFFRESS: </b>No, I can't either and I can't read another person's mind, but if it was talking about having his hands on a cross, to me that's even worse.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Really?</p>                \n                \r\n\n            \n                <p><b>JEFFRESS:</b> Yes. It is. I mean, we are doing, it's interesting a campaign in our church around the city of Dallas in a couple of months. We have billboards around the city. It says how good is God at forgiving and the tact is he nailed it with a picture of Christ's hands on a cross? That is not blasphemous. That is trying to promote Christianity. NPR at the very least is ridiculing Christianity.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>There is no doubt they were ridiculing it. I just don't know how out of control it was and obviously the president of NPR doesn't want to get to the bottom of it.</p>                \n                \r\n\n            \n                <p>Pastor, Merry Christmas to you. Thanks for coming on.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Radio network mocking Jesus", "description": "NPR game show ridicules Jesus 'selfie' ad campaign by Brooklyn Catholics", "date": "2014-12-10T13:12:41Z"}