{"vcmId": "98874b8a-177d-4a1e-92aa-1995300c8724", "url": "http://www.foxnews.com/transcript/2014/12/15/race-relations-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>A couple of weeks ago, we told you that the rioting in Ferguson, Missouri would actually bring more bias against blacks. That's because most Americans do not want anarchy, looting and destruction. And they resent whoever does that no matter what the cause.</p>                \n                \r\n\n            \n                <p>A new Fox News poll tells the story. Do you agree or disagree with the decision of the grand jury in Ferguson, Missouri not to seek criminal charges against the white police officer in the August shooting death of a black teenager? Agree 55 percent; disagree 33 percent; don't know 12 percent. Among whites, 65 percent agree. But just 12 percent of blacks think the Missouri grand jury did the right thing. There is your racial divide.</p>                \n                \r\n\n            \n                <p>Bottom line on the Michael Brown shooting is that beyond a reasonable doubt Mr. Brown attacked the police officer, Darren Wilson. That's it. When that happens you are not going to get an indictment law enforcement agent no matter what happens afterward.</p>                \n                \r\n\n            \n                <p>Second question in the poll: do you agree or disagree with the decision of a grand jury in New York not to seek criminal charges against a white police officer in the July chokehold death of a black man? Just 27 percent of Americans agree; 57 percent disagree; 17 percent don't know. The difference here is the video. It's clear from that that Eric Garner was not a threat to the police. He was an annoyance -- a low level street hustler. A vast majority of Americans do not want violence in situations like that.</p>                \n                \r\n\n            \n                <p>Think about it. If white society were prejudiced against back people that poll result would have been a lot different, would it not?</p>                \n                \r\n\n            \n                <p>And finally this question: since Barack Obama became president do you think the relations between the races in the U.S.A. have gotten better or worse? 19 percent say better; 62 percent worse; 17 percent no difference. So here is what is driving that result. Under President Obama, the grievance industry has taken off. The racial agitator Al Sharpton has been to the White House scores of times. The President is legitimizing Sharpton and other provocateurs. This has angered Americans of all colors. The grievance industry is not seen as a positive by most citizens.</p>                \n                \r\n\n            \n                <p>On the other side, many black Americans who are not doing well are being fed a steady diet of propaganda. They are being told that white people actively want to keep them down; that the police are hunting down young black men, incarcerating them for no reason. Race hustlers tell African-Americans their country is bad. In the words of Jeremiah Wright -- \"God damn America.\"</p>                \n                \r\n\n            \n                <p>Majority of blacks don't buy it, but a substantial minority do. And sometimes those folks act out further alienating the people on the sidelines. So that's why the racial divide has grown under President Obama. He has allowed the grievance industry to prosper. The backlash against that has been substantial.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Race relations in America", "description": "Talking Points 12/12", "date": "2014-12-15T13:37:29Z"}