{"vcmId": "9a1bac97-d8f3-4f5a-b3b5-cd483d2677e9", "url": "http://www.foxnews.com/transcript/2015/05/05/bill-oreilly-another-round-why-politicians-will-not-tell-truth.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>For the past 48 years, Democrats have controlled the city of Baltimore. During that time the city's population has fallen 30 percent. And the poverty situation has grown more intense.</p>                \n                \r\n\n            \n                <p>During the past five years, the federal government has poured billions of dollars into the poor areas of Baltimore -- stimulus money. Total taxpayer money given $1.8 billion. One poor neighborhood Midtown Belvedere got a whopping $838 million. That includes $467 million to education, $206 million to the environment, $24 million to quote \"the family\", $50 million in transportation and on and on -- the result, not much improvement.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>WALLACE:</b> One of the things that we learned this week is Baltimore spends the third highest amount per capita on its public schools. Baltimore was already spending plenty on public schools and schools were still lousy.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>Well, look, there is uneven spending in the public schools and I would say to you I mean even the school that let out where the riots first began, there was a student who was interviewed who said I'm looking at a book that's 20 years old.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So either the money is being stolen or the Democratic administration in Baltimore is so incompetent that despite billions in funding, pouring in from we the taxpayers, poverty and hopelessness remain entrenched.</p>                \n                \r\n\n            \n                <p>Instead of pointing that out, President Obama today stated the problem but totally avoid the solution.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES: </b>Those opportunity gaps begin early often at birth and then compound over time becoming harder and harder to bridge making too many young men and women feel like no matter how hard they try they may never achieve their dreams.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Then give them a road map to dream achievement, Mr. President which you have done to your credit with the \"My Brother's Keeper program. But what you have not done is spotlighted the total failure of money politics. It is the behavior of individual human beings not big daddy government that leads to success and touting that message is free of charge.</p>                \n                \r\n\n            \n                <p>I mean this is just brutal and poor Americans trapped in the ghettos have a right to be furious. But their anger should be directed at the corrupt dishonest politicians who are lying to them. The truth is liberal policies of creating dependence and entitlement, promoting victimization, and anger have failed to help Americans who desperately need help.</p>                \n                \r\n\n            \n                <p>Once again, these stats are in stone. Billions poured into Baltimore -- improvement almost nonexistent.</p>                \n                \r\n\n            \n                <p>Now: another example of truth-evading from the opposite side of the spectrum. There is no question that the Clinton Foundation has benefited Bill and Hillary Clinton by allowing them an affluence few human beings will ever experience. Nearly $2 billion have flowed into the Clinton Foundation. In just a few moments we have a segment on what you can do with foundation money legally and you will be surprised.</p>                \n                \r\n\n            \n                <p>But President Clinton believes there is nothing wrong, even though the Clinton Foundation now has to re-file its income taxes because it neglected to mention some very big donors, and even though Hillary Clinton violated a signed agreement with President Obama by accepting foreign money for the foundation while she was secretary of state. Despite all that here is Mr. Clinton.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> I give 10 percent of my revenue off the top every year to the foundation and Hillary in the year she was there gave 17 percent. Over the last 15 years I have taken almost no capital gains and I've given --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> To pay my bills and because in the --</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> But you have working Americans look and say $500,000 for a speech?</p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> Why shouldn't -- it's the most independence I can get.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It's the most independence I can get.</p>                \n                \r\n\n            \n                <p>Now, there is no way on earth that Bill and Hillary Clinton are going to admit to any wrongdoing. But they have to know that the whole foundation thing is unethical to say the least. But as long as it's not illegal, apparently they are fine with it.</p>                \n                \r\n\n            \n                <p>So the question becomes what about the legality of the foundation? Shouldn't the Clinton Foundation be investigated? Of course it should. And I'm not on a witch-hunt here. But there is big money involved in foreign countries and a secretary of state and a former president.</p>                \n                \r\n\n            \n                <p>The FBI can start that investigation tomorrow. It doesn't need President Obama's approval and it doesn't need Attorney General Lynch's approval. So my question tonight is for FBI Director James Comey. Will you start an investigation? Today we presented that question formally to the FBI. We will let you know what the agency says.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Another round of why politicians will not tell you the truth", "description": "Bill O'Reilly's Talking Points 5/4", "date": "2015-05-05T12:06:48Z"}