{"vcmId": "9c4c28fe-e3b2-469e-9d66-c3033f5b3771", "url": "http://www.foxnews.com/transcript/2014/12/05/race-relations-and-new-york-times.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 4, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Thanks for staying with us. I'm Bill O'Reilly in the weekdays with Bernie segment tonight. Let's get right to the purveyor of BernardGoldberg.com who joins us from Miami. So, you wrote a letter to the \"New York Times\" and that paper ignored the letter, correct?</p>                \n                \r\n\n            \n                <p><b>BERNARD GOLDBERG, FOX NEWS CONTRIBUTOR:</b> Yes. But I want to make clear right from the jump, I'm not whining over that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I am. I'm whining.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> It's their newspaper. They could ignore it. It's their paper they could do it whatever they want.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Here is what happened.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, let me set this up. How long ago was this?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Thanksgiving morning.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay, Thanksgiving morning, and then you emailed it to them?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay, you didn't hear anything back, right?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>I just got an auto reply that they received it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. So you know they received it. All right. Now, what I want you to do is read the portion of the letter that you feel is important. We will put the words on the screen.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Okay.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Go.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Okay. So, here's what the story was about. Story was about the things that Officer Darren Wilson in Ferguson could have done differently to de-escalate the situation that led to Michael Brown's death. I wrote that this was a legitimate journalism news story. And what I said in the letter, in the beginning of the letter was this is important journalism because if we follow the advice of the experts who had advice on how to de-emphasize and reduce the tensions, that might save the life of some young man in the future. So far so good. And then I wrote, now Times editors might want to consider doing a story on what Michael Brown might have done differently.</p>                \n                \r\n\n            \n                <p>Given how many needlessly provocative things he did that led to his demise. And then I said that story, might, if you decide to do it, also save some young man's life sometime in the future. Okay. So for whatever reason, the \"Times\" decided not to publish it. No harm, no foul, no problem. The point I was trying to make on Thanksgiving morning and the point I would like to make tonight is this, that too many liberals both inside the media and outside the media will look at what the police officers should do differently, which again, is legitimate and important. But they won't look at what the Michael Browns of the world should do differently, which is also legitimate and important.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. It's a good point.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>And they --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Go ahead.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>They treat black people generally. Generally as hot house flowers who can't stand up to any kind of criticism. And as a result of that we don't see nearly enough coverage of dysfunction.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Sympathy toward the plight of the --</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Such as a stuff you and I talked about.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> There are sympathy toward the plight of the African- American overrides any kind of personal responsibility call which is why your letter wound up in the dumpster.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Maybe. Maybe.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, but it gets a little more complicated, it gets a little bit more complicated with an Eric Garner because, unlike Michael Brown --</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Yes, it does.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- who was violent. All right? Eric Garner was hapless, hapless. All right? He was just selling cigarettes, very low level beef he didn't want to be taken into custody. He was out on bail already. And then he winds up dead. It's a different situation there.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Absolutely. Absolutely. Every word that I wrote in that letter had to do exclusively with Ferguson. I want to make very clear and I'm glad you made this transition. I want to make very clear that nothing I'm saying here so far has anything to do with Staten Island, which, as far as I can see, is a completely different matter than what happened in Ferguson.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> If you were to write a letter to the \"New York Times\" about Eric Garner, because he should have, he should have complied with the police and put his hands behind his back and then gone in and that's what he should have done. What would you say in the letter?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> I think I might say that something you said earlier in the program. I think I might say that there are too many conservatives who have a knee jerk reaction to something like this. And I'm not one of them. What I saw on the video and I don't know what happened, what testimony was given inside the secrecy of the grand jury, but what I saw and what everybody else saw on the video leads me to believe that this was a miscarriage of justice. That there should have been an indictment and it should have gone to trial. That's what I would have written. What the police apparently did in Staten Island is not what Michael Brown did to the officer. Michael Brown went after the officer.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's what the ballistics show.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>In this case, this guy was selling loose cigarettes. You think about this. It's perverse, a guy is selling loose cigarettes and he winds up dead.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Awful.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> That's wrong. That's really wrong.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But what complicates it further and I got to go. But I just want everybody to know where I stand on this. What complicates it further is I don't think the police had bad intent. I just think things got out of control. Bernie, thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Race relations and the New York Times", "description": "Bernie Goldberg on the New York Times ignoring his letter reacting to Ferguson coverage", "date": "2014-12-05T13:27:12Z"}