{"vcmId": "9dc8ac42-9492-4112-9b4a-90735d963087", "url": "http://www.foxnews.com/transcript/2014/10/29/illegal-alien-kills-two-police-officers.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 28, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Factor Follow-up\" segment tonight, two police officers killed last week in California by an illegal alien who had been deported twice. 34-year-old Luis Monroy-Bracamonte was deported in 1997 after being convicted of selling narcotics in Arizona.</p>                \n                \r\n\n            \n                <p>In 2001, he was back, they caught him, deported again we don't know why. But last week Monroy-Bracamonte stole a car, shot homicide detective Michael Davis and Sacramento County Deputy Danny Oliver dead in the aftermath of his crime. Bracamonte is currently being held without bail expected to be charged with the two murders.</p>                \n                \r\n\n            \n                <p>It's obvious the federal government is not protecting police officers or civilians for that matter from dangerous aliens. If you are deported and come back to the U.S.A. it's a felony with a maximum two years in the federal penitentiary. That's far too light a sentence but you are supposed to be in prison.</p>                \n                \r\n\n            \n                <p>In 2013, 60 percent of all the people ICE deported had been deported at least one time before; 60 percent. In that year alone 2013, at least 223,000 aliens had multiple deportations. However, there are only 20,000 aliens currently incarcerated for immigration offenses -- a fraction of those with multiple deportations. Proving once again, the feds will not enforce the law to its full extent.</p>                \n                \r\n\n            \n                <p>Joining us now from Boston, Jessica Vaughn, an analyst for the Center for Immigration Studies. So am I overstating the situation, Ms. Vaughn?</p>                \n                \r\n\n            \n                <p><b>JESSICA VAUGHN, CENTER FOR IMMIGRATION STUDIES: </b>No, I don't think you are at all. Especially when you consider that most of ICE's case load right now is people who are convicted criminals. And they keep coming back. We know that they reoffend, again, once they get here. So this is a huge problem. It happens for a number of reasons.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Why aren't they in -- why look, 223,000 apprehended in 16 with multiple deportations -- why isn't every single one of them in the federal penitentiary?</p>                \n                \r\n\n            \n                <p><b>VAUGHN: </b>Well, there is a couple of reasons. Because, first of all, the Obama administration's priority has been to legalize as many people who are here illegally as possible to carry this out, you know, if he has to by executive action. So he put the handcuffs on ICE agents and they are simply not allowed to arrest a lot of people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Wait, wait you got to get more specific than that. I mean if you are going to blame Obama and I don't mind you blaming him if you have got the facts. You have got these people -- you've got these people arrested 223,000 of them with multiple deportations. It's a fact. It's in stone ok? Less than 10 percent of them are in prison. What happened to the other 90 percent? They were apprehended. They grabbed them. What happened to them?</p>                \n                \r\n\n            \n                <p><b>VAUGHN: </b>A lot of times they are simply released because they are under pressure from advocacy groups who say oh you can't take this person away from their family. Or sometimes it happens because local sanctuary jurisdictions refuse to cooperate with ICE, places like New York, Chicago, San Francisco, Philadelphia have just said we don't care about immigration violations. We don't care that these people are convicted criminals.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But still, the stat was reported to the federal government. You see? The stat is reported that these people were taken into custody and they ran them through the computer 223,000 had multiple deportations yet, less than 10 percent wind up in federal prison.</p>                \n                \r\n\n            \n                <p>So even if the sanctuary cities are letting them go, they are not reporting them to the feds. These are people who are caught who are in the system. They still don't go.</p>                \n                \r\n\n            \n                <p><b>VAUGHN: </b>Well, sometimes ICE releases them under pressure from advocacy groups. Other times the U.S. attorneys will not take these cases for prosecution.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's the key. Under Holder -- under Holder, the Attorney General the U.S. attorneys in charge of prosecuting the felonies don't prosecute them. That's what's happening.</p>                \n                \r\n\n            \n                <p><b>VAUGHN: </b>That -- there is no doubt that would be a huge disincentive to people for coming back if they knew they were caught again.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Absolutely.</p>                \n                \r\n\n            \n                <p><b>VAUGHN: </b>That they were going to time and they have to serve that time. So it's a matter of priority.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Big time. Right it's two years on first offense, it should be 10 years on second. But that's what I want everybody to understand -- all right. It's not the local enforcement. They are grabbing them. It's Holder's Justice Department telling the U.S. attorneys don't prosecute them. Let them -- deport them back and then they just come back again like the guy did who killed the two cops in California.</p>                \n                \r\n\n            \n                <p>All right, Ms. Vaughn, we appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Illegal alien kills two police officers", "description": "Man with criminal past and previous deportations accused of shooting two California police officers", "date": "2014-10-29T12:22:51Z"}