{"vcmId": "9eb72e84-398c-4b52-bd26-a6c8f8f772cb", "url": "http://www.foxnews.com/transcript/2015/11/09/bill-oreilly-scrutinizing-ben-carson.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Dr. Carson having some trouble. Today his campaign admitted that the story he told about being offered an appointment to West Point is not true. Also CNN reporting Dr. Carson's biography, where he describes himself as an angry boy who was close to committing violent acts, may be suspect as well. (Know we're) trying to corroborate portions of his story that at age 14 he tried to stab a boy related to him.</p>                \n                \r\n\n            \n                <p><b>DR. BEN CARSON</b>: The person that I tried to stab, you know, I talked to today, said would they want to be revealed. They were not anxious to be revealed. And it, it was a close relative of mine, and I didn't want to put their lives under the spotlight. It's a smear campaign. But, you know, I'm not going to play that game with them. They can do it all they want.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now Dr. Carson is smart to hit the controversy head on. When I was attacked earlier this year, I did the same thing. Let the folks see and hear your side, and then they will make their determination. Talking points has no idea about Ben Carson's childhood but, as a presidential candidate it is proper for the press to vet what he has put out there. And now that the West Point thing has been established as false, the doctor is on the defensive. Add to that some dumb statements Ben Carson has made. Back in 1998 he said this about the Egyptian pyramids.</p>                \n                \r\n\n            \n                <p><b>CARSON:</b> My own personal theory is that Joseph built the pyramids in order to store grain. You know all the archeologists think that they were made for the pharaohs' graves but, you know, it would have to be something awfully big, if you stop and think about it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Dr. Carson was speaking at a school associated with his religion, Seventh Day Adventist, a fundamental Christian church. The doctor is obviously no historian. The pyramids were built in honor of the dead Egyptian royalty. Period. Carson and all the other political candidates should understand that any, any foolish statement they make will become a headline, especially if they're Republican. And there is no statute of limitations on that. Whatever demeaning stuff the media can dig up, it will use. However, all the candidates do have an obligation to speak the truth. Period. Again. And that's &#8216;The Memo&#8217;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Scrutinizing Ben Carson", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/6", "date": "2015-11-09T13:04:08Z"}