{"vcmId": "9ec343ad-88f7-4285-b2b4-b6a3c9e5d38f", "url": "http://www.foxnews.com/transcript/2014/10/13/janine-turner-enters-no-spin-zone.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 10, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>In her new book, \"A Little Bit Vulnerable -- on Hollywood, Gods, Sobriety and Politics,\" she dishes on her romance with the very liberal and extremely hairy, Alec Baldwin, among other things.</p>                \n                \r\n\n            \n                <p>Janine stopped by The Factor last week along with her teenage daughter, Juliette, who also just published a book called \"Our President's Rock.\" Everybody is publishing books.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEOTAPE)</b></p>                \n                \r\n\n            \n                <p><b>BILL O'REILLY, FOX NEWS HOST:</b> So, here they are, the Turner people, Juliette and Janine. They both have books out. I don't know if I've ever heard of a mother and daughter having books out at the same time, all right.</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p>So, Juliette, I want to start with you. Most teenage girls -- you're 16, right.</p>                \n                \r\n\n            \n                <p><b>JULIETTE TURNER, : </b>Yes, that's right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK. They don't care about history or their country or the Constitution. I mean, I'm not being supercilious here, arrogant, but that's the truth. How did you get involved with that.</p>                \n                \r\n\n            \n                <p><b>JULIETTE TURNER: </b>Well, what you're saying is the truth. Sadly, my generation is not interested in history or the Constitution and that is part of what got me interested in history.</p>                \n                \r\n\n            \n                <p>Because I realized that my generation is the future of our country. It's our responsibility to maintain our country and maintain our freedom, to know our history.</p>                \n                \r\n\n            \n                <p>And, also, a lot of my friends and kids my age don't want to sit down and read pages and pages of history textbooks. And so, what I tried to do with my book -- so what you smash so purposely in your book is making history fun and interesting.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes and you've succeeded. I mean, even I can understand the history that Juliette has put out there. But when you talk to your friends, do they think that you're like a nerd or weird or something.</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p><b>JULIETTE TURNER:</b> I've fully embraced my historical nerdability.</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p>I am definitely --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But do you get that jazz that they give you.</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p><b>JULIETTE TURNER:</b> I sometimes do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do they give you like, \"Juliet, hey,\" you know, \"I wanna talk about,\" -- what is that -- \"One Dimension,\" or what group was that. I don't know.</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p><b>JULIETTE TURNER:</b> One Direction.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>One Direction.</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p>The Fifth Dimension. I knew it was something like that. All right, but you don't care. You like your history.</p>                \n                \r\n\n            \n                <p><b>JULIETTE TURNER: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> This is the second one. And we're proud of you.</p>                \n                \r\n\n            \n                <p><b>JULIETTE TURNER: </b>Thank you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right, Janine, not so proud of you. You're a troublemaker.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER, RADIO TALK SHOW HOST: </b>OK.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You are a troublemaker. You know that.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER: </b>Yes, I guess.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, about 20 years ago, you moved from Hollywood where you're a big -- you're a big star then --</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> Even though Mike and I have this very caring, very understanding relationship, that doesn't mean that you and I can't be friends.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED ACTOR: </b>Friends, huh.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- \"Northern Exposure\" and all that stuff -- to Texas.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>To run play with rattlesnakes and run around with scorpions --</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER: </b>Longhorn cattle.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- on the little ranch deal. In general, has that worked out for you career-wise.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER: </b>Well, I think it's difficult when you're not in New York or L.A. And so it's definitely a sacrifice. I mean, I had worked. I mean, I just did three movies this year somehow.</p>                \n                \r\n\n            \n                <p>But, also, my daughter was born in '97, so I wanted her to be around family in the state of Texas --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER: </b>-- and to raise her there but there is a sacrifice.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Fresh air, all of that.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> There is a sacrifice.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But you did pay a price in your career.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But you're still working now. You had some movies out and things like that.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> Yes, yes. And it's given me an opportunity to focus on other things because I'm found raising my baby but I always want to be doing some things.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Now, you're a conservative woman. That's accurate?</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK. So, that, in addition to not being geographically close to Hollywood in New York, you are politically far away from them as well, all right.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> Very much so.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Has that come back and hurt you.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> I think so. I think it hurt me in my 20s, you know, because they were all running off to Jane Fonda parties, you know, and I wasn't.</p>                \n                \r\n\n            \n                <p>My dad was a West Pointer. I wasn't about to go do that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> So, there was -- I was always sort of on the peripheral of the in-crowd. And, you know, never -- it took a little longer probably for \"Northern Exposure\" to happen for me. So, it's sad but it's not really --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But when you went on the set of \"Northern Exposure,\" --</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>-- for example, did they know you were a traditional person, not a liberal person.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER: </b>I think so.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, you shouldn't open your mouth --</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p>Now, I saw you on \"Fox &amp; Friends,\" you know. They had to pay you to go on that show. You just didn't go. Why, they didn't think &#8211; did Kilmeade give you some money.</p>                \n                \r\n\n            \n                <p>But on \"Fox &amp; Friends,\" you told them that you were once engaged to Alec Baldwin.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That true?</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER: </b>That is true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Officially engaged?</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> Officially engaged. I had the wedding dress, the invitations, the church book.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Really?</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> Everything.</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But he's insane. He was on Long Island, you know. I've known him for many --</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>-- he's nuts. Did you know that.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER: </b>Well, maybe a little.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> A little you knew it.</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p>He's a nice guy, I think, if you get him away from the politics, right.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER: </b>Yes, he is.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But you were really serious. You were almost going to marry him.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> I was. Yes, I had the invitations, addressed.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And what happened. Why didn't it -- why didn't it go through.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER: </b>Well, we didn't break up because of politics.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No?</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER: </b>So, he was shocked. I called him and said, \"I read this article by William Sapphire in 'The New York Times' about young Republicans stepping forward.\" And there was this long pause.</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p>\"You're a Republican?\"</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Can you tell us why you didn't get married to him. You know, I don't want to get --</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER: </b>Well, you know, I just think it was -- it was just not -- it wasn't working.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right, so you knew that this was not going to be a long-term deal.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> But it wasn't because of the politics.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> But now that I look back, I learned a lot from that relationship because --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And you still like him, right, as a person.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> Yes, we're still friends.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER: </b>And I ended up getting involved because of my relationship with him and a 12-step program. And I got sobered at age 23. So, sometimes, when things don't work out, --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER: </b>-- you can look back and say, \"This is why God had\" --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But I think that is an amazing fun fact for Janine Turner.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> OK.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ladies, the best of luck with your books. It's nice to see you, girls.</p>                \n                \r\n\n            \n                <p><b>JANINE TURNER:</b> Thanks.</p>                \n                \r\n\n            \n                <p><b>JULIETTE TURNER:</b> Thank you so much.<br> &#160;</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Janine Turner enters the 'No Spin Zone'", "description": "Actress and conservative activist on her new book “A Little Bit Vulnerable: on Hollywood, God, Sobriety and Politics”", "date": "2014-10-13T14:45:56Z"}