{"vcmId": "a028382d-5a3a-41f9-8968-38a1c56be778", "url": "http://www.foxnews.com/transcript/2015/11/17/confronting-isis-following-paris-terror-attacks.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 16, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Continuing now with our lead story: is President Obama delusional about ISIS.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington is Charles Krauthammer. Is he?</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, SYNDICATED COLUMNIST:</b> Look, judging from the press conference, there is several explanations for that appalling performance, the kindest of which is that he is delusional. You heard him say in fact one of the throwaway lines all the things he has been doing. He said as he said on Friday that ISIS was not gaining in strength even his own Dianne Feinstein said essentially it's a delusion. Of course it's gaining in strength.</p>                \n                \r\n\n            \n                <p>And then he went on to say all -- he listed all the things he has done. He said a few weeks ago, at the U.N. I led a discussion on how to counter terrorism. Isn't that remarkable?</p>                \n                \r\n\n            \n                <p>Look, this is a guy who thinks that he is actually achieved the things with these discussions. But the reason why I say it's the kindest of explanations, and incidentally he listed among other things tightening up international security, especially on airplanes and putting the bombs of airplanes. This is what a week and a half after the downing of the Russian airliner. Has nobody on his staff told him that that actually happened? So that he listed as one of his achievements.</p>                \n                \r\n\n            \n                <p>The reason that delusion is the kindest is I think the more likely explanation is he knows opposition is weakening. He knows that ISIS is strong and that is a threat. But in the end he doesn't think it matters. He has never thought the war on terror was important or existential.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: How could you not though?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Look, he has said this in his public speeches. He abolished the term. He gave a speech about two years ago in which he said we have to end this war on terror because of its awful effects on us as if he can end it by saying it.</p>                \n                \r\n\n            \n                <p>Of course, that's what he thought he was doing in Iraq. He said I'm ending the war. He didn't end the war. He simply quit. He watched it dissolve.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How can you say that he doesn't understand that millions of people, millions of people are either dying, being dislocated, being tortured, being wounded, whatever it may be? He has to know that it's right in front of him. Millions of people are affected, all right?</p>                \n                \r\n\n            \n                <p>And you still, Charles Krauthammer, say that he doesn't care? It doesn't mean anything to him?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> There is a difference between millions of people suffering and an existential threat to the west which is what it is and which is what he denies. That's what he doesn't want to acknowledge.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So what you are saying then is that he has adopted the philosophy of acceptable losses.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> No. No, I think he has a deeper philosophy and that is when he says the arc of the moral universe is long but in the end it tends towards justice. He thinks radical Islam is a passing phase. It's an extreme of an extreme. It's not a threat to our way of life that we got suckered in by 9/11 into expensive wars because we overreacted.</p>                \n                \r\n\n            \n                <p>He said that in his U.N. Speech that we overreacted and essentially betrayed in our principles. He thinks that he wants to keep the U.S. out of this because otherwise we overreact. It's a quagmire. Look, he is telling the Russians in his press conference -- he said astonishingly that what he is doing to settle the Syrian war is where he said we have to work to convince Russia and Iran that the path they are pursuing is not going to work. As if A, he can persuade them and if B, Russia and Iran do not understand their interest entirely and that Obama knows that more deeply --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't think that -- if what you are saying is true -- if what Krauthammer is saying is true then President Obama will go down in history as one of the most incompetent presidents that this nation has ever seen.</p>                \n                \r\n\n            \n                <p>Now, let's get on to the NATO situation. That's my solution.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>Which I agree with you on that, by the way.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. That's a good start.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> History will judge him for not only his denial and delusions but for his misreading of the importance of what's at stake.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. So you agree with me on that. Do you agree with me on NATO declaring war on ISIS and then getting this colossus organized to crush these people?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Well, first of all -- simply as a sign of solidarity. The only time that NATO he has ever invoked Article 5 which is what you are talking about \"an attack on one\" is after 9/11. That was Europe showing solidarity with us. I think the least we can do is reciprocate and say that under Article 5 yes it's an act of war and yes we are in this. Whether or not you get a formal resolution from NATO, I don't care.</p>                \n                \r\n\n            \n                <p>Here is what I care about. Can you get a force coming through Turkey, remember, the Turkish border is not far at all from Raqqa, the capital. It is not a huge threat. In fact the friendly Arabs and the Kurds are within 10 or 15 miles of Raqqa. You get a European and American force -- not just Americans but like in the Gulf war and you come in from there.</p>                \n                \r\n\n            \n                <p>Obama says oh yes, but if I take Raqqa what do I do perpetual occupation? Of course not. What you do is you get the Saudis, the Jordanians, the Egyptians -- they're all Sunni Arabs. They are not Shiites they are Sunni Arabs which is what the Raqqa population is. And you get them to be the occupying force.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure. Just like a U.N. peace keeping force in Africa.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>And you leave. So this argument about perpetual occupation is nonsense. It's all a question of will -- he doesn't have it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I'm going to predict that he is going to have to do something, President Obama. But I could be wrong.</p>                \n                \r\n\n            \n                <p>Charles as always, thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Confronting ISIS following the Paris terror attacks", "description": "Will President Obama update his strategy? Charles Krauthammer weighs in on 'The O'Reilly Factor'", "date": "2015-11-17T13:28:40Z"}