{"vcmId": "a1715e3a-7e3f-4a11-b472-2f2e80702ed9", "url": "http://www.foxnews.com/transcript/2016/11/10/rudy-giuliani-on-donald-trump-upset-win.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 9, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story\" segment tonight. One of the big winners apart from Donald Trump in the presidential sweepstakes, former mayor of New York City Rudy Giuliani. And there he is.</p>                \n                \r\n\n            \n                <p>All right. So, it's you, it's Christie, it's Gingrich, it's General Flynn, it's Kellyanne Conway. That's the five in the inner circle, right?</p>                \n                \r\n\n            \n                <p><b>RUDY GIULIANI, FORMER NEW YORK CITY MAYOR:</b> Yes. I would say General Kellogg certainly Steve Bannon, Jared Kushner --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. Yes. Yes.</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>These are all people that are very different.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, but they are not experienced in governance.</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>Very helpful in the campaign.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. But I'm looking now to advance the story. So, I see Kellyanne Conway as chief-of-staff, all right? Okay. That's a yes?</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: That would be a good choice.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I see you as attorney general.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> Well, I sure know the Justice Department.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>Okay. That's a yes. I see Gingrich as perhaps secretary of state. But does he want to run around like that? Does Gingrich want to run around like that?</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: You've got Senator Sessions.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sessions, right.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> You've got John Bolton.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Bolton, yes.</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: You've got a couple and I'm probably missing a few.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But Gingrich has got to be a role for him.</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>Yes. I see Newt as kind of a domestic security advisor.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>And these are my suggestions to you. I haven't even talked to Donald yet about it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So you guys didn't even talk about this theoretically? You must do.</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>We talked about it a little bit here and there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. Because you and Gingrich put your reps on the line. I mean, you did. You took a lot of heat and so did Gingrich.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> You're kidding.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. You really, I hope Trump appreciates it.</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: Even coming here today.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, we got all these protesters if you were looking at --</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>Banging on my car.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You've got the usual radical and this does not reflect the Democratic Party. I want everybody to know this.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> Yes, it does.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: These aren't Democrats.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> And, you know, in a way --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> I don't want to make too much -- I'm used to it for being mayor of New York.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. These are radical leftists. They're in Philly, Chicago, L.A., New York. They don't have anything to do. They don't work. You know what -- the crew is and that will die out. But let's get back to a Trump administration. So I see you as --</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> And Carson.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Carson helps in Human Services. You as Attorney General. Gingrich as domestic advisor. Christie now Homeland Security for Christie?</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> He would be fabulous at it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. Not infrastructure building bridges or anything though.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>No. Don't want that.</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: I always thought that was a somewhat exaggerated situation. As a U.S. attorney, I think I would have handled that very differently.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> There is a little gist there, I don't want anybody getting upset. Now, Trump is going to need a lot of help. He is going to need a lot of help.</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: Every president does.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. But you know, and by the way, please tell him not to put the Trump sign on top of the White House. We really don't need that now.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: We don't need --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Like Mar-A-Lago. But I'm saying this with all due respect, he is going to need help because he has never been in this --</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> He has told you that actually in several interviews.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He has never been a guy who has overestimated experience.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: He doesn't have it.</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: I used to point out on the campaign trail, he didn't build his own buildings and he didn't build his own golf courses. He got the best architects, he got the best carpenters, the best plumbers.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Let me tell you something though. He knows we set at Yankee Stadium and he goes look at that crack in the -- so he knows that world.</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: Same thing with his staff during the campaign. When things were going wrong. He would get them all together, you're not doing this. You're not doing that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He knows pr, he knows entertainment. But what he doesn't know is administration because it can get slogging and grinding and he is not Bill Clinton and he doesn't stay up all night studying the policy papers. So, he is going to need guys like you and Gingrich. Is there anybody else in the mix that I haven't mentioned?</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> I'm sure there are. Yes. I hate to leave -- there are a lot.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> I think Chris has probably assembled about 100 people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: He is in charge. Governor Christie. He is in charge --</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>Christie has probably assembled about 100 people that he can consider. The way I my transition when I did it for mayor was, I wanted three nominations for every position.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I like that.</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>So then ultimately I could pick the right men I want for the job.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. When you put yourself out, as you did. And so did Newt Gingrich and you were attacked, I mean, really brutally attacked.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> Including death threats and all kinds of other things.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is there going to be pay back? You think, because Trump, he is the pay back kind of guy.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> For me, having been mayor of New York and having gone through that it's now let's move on and let's see if we can --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No pay back to you.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> For me, there is nobody that I want to particularly pay back.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So you're not going to investigate Hillary Clinton if you are attorney general?</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: Oh, different story. You have got a big choice there. And I don't know the right answer to it. There's one tradition in America, right? Election is over. We forget about it. There is another tradition in America which is equal justice under the law. And it would depend on how bad the violations are. And there has not been.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, you would have to take a fresh look.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> Well, the FBI is still investigating the Clinton Foundation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. And the foundation, right.</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: So, whoever the Attorney General is we have to evaluate that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But you know what's going to happen. Obama is going to pardon her before --</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: Then that will seal Obama's legacy as one of the worst presidents.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't think so. I disagree with you there. Because his base, Obama's base would want him to do that. It's almost like the Ford-Nixon situation. But I do believe that if this continues and Obama will know, that he will pardon her before he gets out of there.</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: Then he should pardon the sailor who is spending a year in jail taking pictures of the submarine and he should.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. Instead of the dope dealers that he is legged letting out.</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: And he should pardon Petraeus and he should pardon Governor --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Good. I hope he is watching tonight. Last question, you were watching returns with Donald Trump last night.</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: I was.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Tell me, was he jumping up and down? Was he hooting? What was he doing?</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: He was very calm. I think he realized the turning point when the exit polls turned out to be so far off our own calculations. I think he realized he had a good chance. Once he saw Florida turn and he knew he had Ohio. I always believed if he won Florida and Ohio.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. Those were the bellwether.</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: The rest will fall in.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Was he in his tie or in his jammies?</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> He was in his tie all the time.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: He never takes the tie off. In the shower, he is wearing the tie.</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: Which is rigged. I'm going to give the lecture at the Reagan Library this Saturday night.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They love me there. Don't mention my name.</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: Had we lost, I don't think we would have had many people there. Now we're sold out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now you're going to be a big shot.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> Now we're sold out and President Reagan never ever took his jacket off in the Oval Office. And Mrs. Reagan once told me, he liked to take his jacket off, so it was hard for him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes, but Trump doesn't want to take his ties off because he wants people to buy the ties.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Thank you for coming in, Mr. Mayor. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content</i>.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Rudy Giuliani on Donald Trump's upset win", "description": "Former mayor of New York on the President-elect's historic campaign on 'The O'Reilly Factor'", "date": "2016-11-10T13:19:09Z"}