{"vcmId": "a429a3c4-caa2-4f24-8b67-82d037ade0e5", "url": "http://www.foxnews.com/transcript/2014/10/09/bill-oreilly-fallout-my-interview-leon-panetta.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><em>By Bill O'Reilly</em></p>                \n                \r\n\n            \n                <p>Predictably the former Defense Secretary is being attacked by some folks upset that President Obama is being criticized.</p>                \n                \r\n\n            \n                <p>Instead of debating what Mr. Panetta is saying they are questioning his motives.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>CHRIS MATTHEWS, MSNBC HOST: Panetta is out there trashing the President on those decisions he has made. Shouldn't there be a period of loyalty until the election is put behind them?</p>                \n                \r\n\n            \n                <p>AL SHARPTON, MSNBC HOST: There is nothing wrong with criticizing the President. But for a former trusted official to do so while the President is still in office that's low and a real blemish on Leon Panetta's record of service.</p>                \n                \r\n\n            \n                <p>LAWRENCE O'DONNELL, MSNBC HOST: Bill O'Reilly gave half of his show to Leon Panetta tonight hoping to emphasize a rift between the President and his former advisor.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: Now for the record the MSNBC zealots are failing in the marketplace. Their ratings always terrible are getting worse. They have now fallen behind CNN. That's because you cannot get an honest assessment from that operation which is in business solely to promote liberal causes.</p>                \n                \r\n\n            \n                <p>That being said, it's not only the left that is criticizing Mr. Panetta.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>BERNARD MCGUIRK, EXECUTIVE PRODUCER, IMUS IN THE MORNING: He was there to hammer Obama. He is a Clinton flunky.</p>                \n                \r\n\n            \n                <p>CONNELL MCSHANE, FBN CORRESPONDENT: Right. Former chief of staff.</p>                \n                \r\n\n            \n                <p>MCGUIRK: And a manipulative in my opinion greedy profiteer make no mistake with this guy I don't think, I know O'Reilly disagree with me on that.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: Now the Panetta interview last night raised important national security questions and shed light on President Obama's leadership. It's not only Leon Panetta who is troubled by America's receding power in the world. All the polls say every day Americans are concerned as well and have little confidence that Barack Obama can protect them in an effective way.</p>                \n                \r\n\n            \n                <p>That's the crux of this matter -- protecting you. There is no way on this earth that ISIS savages should be terrorizing the Middle East and threatening the entire world. Those thugs should have been dealt with a long time ago. The fact that they are allowed to run wild is disturbing in the extreme.</p>                \n                \r\n\n            \n                <p>And it's not just Barack Obama's fault. We're living in a cowardly world where villains know they can commit atrocities, violate international law and generally do whatever they want without lawful nations confronting them. The fact that Turkey is allowing ISIS to murder it's civilians on their border says it all. The Turks should be ashamed.</p>                \n                \r\n\n            \n                <p>Add to that, the lack of American leadership. That is where President Obama takes a big hit. It is up to him to rally the world against evil. We are the super power. We are the nation that stands for freedom and justice. But from the very beginning, President Obama did not want that responsibility. He wanted America to be one of many nations. He wanted to see consensus about how to deal with difficult problems. Well the abdication of leadership is not working. Our world is becoming more chaotic by the day. And for my money, Leon Panetta is doing the right and patriotic thing in pointing that out.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The fallout from my interview with Leon Panetta", "description": "By Bill O'Reilly Predictably the former Defense Secretary is being attacked by some folks upset that President Obama is being criticized.", "date": "2014-10-08T04:00:00Z"}