{"vcmId": "a74bc3a3-d6d2-4bdf-96d8-90f1b2b5d3c3", "url": "http://www.foxnews.com/transcript/2017/03/23/bill-oreilly-insanity-over-illegal-immigration.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As we reported extensively last night, a 14-year-old girl in Rockville, Maryland was rapped, in a high school bathroom by two men allegedly in this country illegally.</p>                \n                \r\n\n            \n                <p>The incident is beyond shocking, an 18-year-old from Guatemala and a 17- year-old from El Salvador were freshmen at the school, freshman. Authority say, they've dragged the 14-year-old into a bathroom and brutally raped her. FOX News covered the story extensively as I said last night. But ABC, NBC, CBS did not cover it on their nightly news broadcast, nor that did they cover it this morning, and they hours of air time in the morning.</p>                \n                \r\n\n            \n                <p>CNN did not cover the Maryland story in prime time last night. Ditto MSNBC. That is beyond anything I have ever seen in my 40 years plus of journalism. A story of that magnitude ignored by the national media. We all know why. Illegal immigration is a political issue. President Trump has made the apprehension of undocumented criminals a top priority. The Democratic Party is resisting that saying that all illegal aliens are being demonized and that presents a danger to that community.</p>                \n                \r\n\n            \n                <p>Now, every fair-minded American knows the immigration system is broken and Congress has refused to fix it. As I said last night, we don't know who is here. We don't know where they are. And we don't know what they're doing. They being people who illegally enter this country. It is beyond the pale that even after this poor 14-year-old girl has had her life brutalized, even after that, the Maryland House of Delegates actually voted to make the state a sanctuary situation.</p>                \n                \r\n\n            \n                <p>Thankfully, the Governor of Maryland Larry Hogan has said he will veto that legislation. But how on earth could members of that Maryland body after this poor young girl gets attacked, do that? It is incomprehensible. Many Americans have had enough. For decades, Congress has looked the other way as millions of people poured into the USA without proper credentials.</p>                \n                \r\n\n            \n                <p>Most of these people are harmless and many contribute to our society, but the fact remains that the federal government has lost control over the immigration process and that many states and cities will not obey federal law, creating anarchy. This is the best example I can give you. Between January 28th and February 3rd of this year, more than 3,000 detainers were ordered by the Department of Homeland Security.</p>                \n                \r\n\n            \n                <p>That means that local jurisdictions were asked to hold illegal aliens in jail who ICE considered dangerous. Two hundred and six of those aliens were released by the sanctuary places despite the federal demand. Hundred and forty two of those releases came from one place, Travis County and Texas. That is Austin. We trust Texas officials will stop that madness in Travis County, as they have promised, but you can see how anarchy is being openly practiced in some places.</p>                \n                \r\n\n            \n                <p>There comes a time when citizens at any country have to demand justice, demand protection, demand the law be respected. We have not, have not come to that time yet in America. We have a president who vows to stop the illegal alien criminals madness. But we have a media that openly opposes that, allowing the sanctuary movement to pretty much run wild.</p>                \n                \r\n\n            \n                <p>And that is \"The Memo.\"</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Insanity over illegal immigration", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/22", "date": "2017-03-23T11:50:39Z"}