{"vcmId": "a9bd06f1-154d-4bb5-8b33-6e3ad768b51a", "url": "http://www.foxnews.com/transcript/2017/02/09/how-is-senate-dealing-with-trump-controversies.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 8, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Impact\" segment tonight, Federal Court of Appeals still deliberating the legality of President Trump's refugee order designating seven countries for a hold up in entry to America. That on top of a number of new policy instructions by the administration.</p>                \n                \r\n\n            \n                <p>Joining us from Washington, Senator Ben Sasse from Nebraska. First of all, your reaction to your colleague, Elizabeth Warren, and what you try to do to Jeff Sessions.</p>                \n                \r\n\n            \n                <p><b>SEN. BEN SASSE (R-NE), SENATE JUDICIARY COMMITTEE:</b> Well, first of all, I just heard your last segment. And I think Geraldo predicted that we need to bring canes back on the floor of the Senate.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know.</p>                \n                \r\n\n            \n                <p><b>SASSE:</b> Her references to grizzly as a knife. Let's face it. The Senate has fancied itself the greatest deliberative body in the world for 240 years. And for quite a long time it hasn't been that. That doesn't mean we should abandon that. That means we should go back to actually debating the biggest problems that face America. Right now, the Senate isn't a very serious place. It needs to be again. And it is unfortunate when rules like that are violated.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you think that Senator Warren should have been allowed to read Mrs. King's letter?</p>                \n                \r\n\n            \n                <p><b>SASSE:</b> You know, I think that there's all sorts of really important history of the civil rights movement that we should be celebrating. But the rule, rule 19, nothing says primetime television like esoteric rules of the U.S. Senate, that rule 19 makes it clear that you can't impugn the motives of another senator.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>SASSE:</b> And you can't do it even by putting it in somebody else's voice.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay.</p>                \n                \r\n\n            \n                <p><b>SASSE</b>: So, it's a violation of the rules.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know, it was a clear violation but Senator Warren doesn't seem to respect the rules as they are written. Now, you have not been a fan of Donald Trump's. But his cabinet selections are embraced by the majority of the Republicans holding office. What say you about them?</p>                \n                \r\n\n            \n                <p><b>SASSE</b>: I think he has named a lot of really, really strong folks. General Mattis, let's start there. He is an absolute rock star, when you talk to people at the Pentagon who have worked there over the course of the last 50 years, there's probably no one who has been held in higher esteem there in 50 years. I am 44, I know a bunch of guys my age or a few years younger or what the Pentagon when Mattis was there, and sort of end of their active- duty careers when he was running the marines.</p>                \n                \r\n\n            \n                <p>And a lot of them say, if he led men into battle today, he would quit their jobs and try to beg their lives to let him go and follow him into battle. A lot of good folks like that, the Mattis Tillerson access on formulating the foreign policy for the age of -- actors in cyber war and jihad, there is a lot of really good picks. But frankly, let's acknowledge the single most significant thing the President has done in these first three weeks. And frankly, maybe the biggest thing that any president can do in the next three or four years, is Neil Gorsuch is an absolute rock star.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. And Judge Gorsuch, today, actually criticized the President for his remarks about the judge who stalled the refugee thing. Let's get to that refugee executive order.</p>                \n                \r\n\n            \n                <p><b>SASSE:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know, seven nations, all of those nations are out of control. Anybody can get on a plane in Tripoli, go to Paris, change planes and come to Kennedy in New York. You have objected to the order, why?</p>                \n                \r\n\n            \n                <p><b>SASSE:</b> Well, first of all, let's back up. I affirmed the goal of what the President is trying to do. Fundamentally, we haven't taken borders seriously enough in this country for a really long time. And we need to do more rigorous vetting of people who are coming to this country, specifically from places where you have failed states. So, Syria and Libya, where there isn't functionally any central government.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. Nothing.</p>                \n                \r\n\n            \n                <p><b>SASSE</b>: You have terror training grounds. So, the goal of the order is a good goal. I affirmed the President's objective there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>SASSE</b>: Now, the details also matter. We are the kind of nation that keeps our word. And we have translators who fought alongside American troops --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But that's all been corrective from what I understand.</p>                \n                \r\n\n            \n                <p><b>SASSE</b>: In my criticism of the order was at the beginning that the rollout was --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But now, you are okay with that?</p>                \n                \r\n\n            \n                <p><b>SASSE</b>: There are a lot of details still to be worked out in the implementation. If you know, people working in the airports trying to implement the order, obviously, there is a stay in place now.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay.</p>                \n                \r\n\n            \n                <p><b>SASSE</b>: But there are details that General Kelly is trying to get done. I think they are making a lot of important steps.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. And finally, your overall assessment of President Trump. You weren't a fan but he is in there for four years. How do you think he is doing so far?</p>                \n                \r\n\n            \n                <p><b>SASSE:</b> Well, first of all, I think we need to do a much better job in this country distinguishing between campaigns and governance. We have had an election now. It doesn't matter whether people voted for Donald Trump --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. But can you tell me how you think he is doing, done a lot of things in three weeks. How was he doing?</p>                \n                \r\n\n            \n                <p><b>SASSE:</b> He has disrupted a lot of stuff. I think some of it is really, really good. I think the regulatory reforms are really strong. I think his cabinet picks have been strong. I think his Supreme Court pick as a home run. I also think it is really important in America, I spend a lot of my times with students. When I travel in Nebraska, I speak in elementary schools, middle schools, high schools, colleges, and they don't know basic civics.</p>                \n                \r\n\n            \n                <p>They don't understand the First Amendment. They don't know why the beating heart of America is freedom of speech, religion, press, assembly, the right of protest. We need to celebrate those things. And I don't think we are doing a very good job of that. You mentioned last night's a discord in the Senate. That is not celebrating being part of America.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. I got to go. But I am giving him a be so far. Be?</p>                \n                \r\n\n            \n                <p><b>SASSE</b>: We have three separate but equal branches. It is not my job.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It's not my job. The late Freddie Prinze, it's not my job. All right, Senator.</p>                \n                \r\n\n            \n                <p><b>SASSE</b>: Amen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Always good talking to you.</p>                \n                \r\n\n            \n                <p><b>SASSE</b>: Thanks, Bill.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "How is the Senate dealing with Trump controversies?", "description": "Senator Ben Sasse weighs in on 'The O'Reilly Factor'", "date": "2017-02-09T12:53:26Z"}