{"vcmId": "aa67a94c-2d54-4b60-aaea-3557a42294a3", "url": "http://www.foxnews.com/transcript/2016/02/27/bill-oreilly-tenth-republican-debate.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As usual, there are analysts saying who won and who lost the debate last night. That is meaningless, because it is really up to you, the voter. The real test will come on Super Tuesday, just four days away.</p>                \n                \r\n\n            \n                <p>Right now, Donald Trump has 82 delegates. Ted Cruz 17. Marco Rubio 16, John Kasich 6. Ben Carson 4. 1,237 delegates are needed for the nomination. So, you can see the race is not even close to being called. However, there is one undeniable fact. Donald Trump is a clear favorite. So, last night, his two main contenders went after him hard.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. CRUZ:</b> For 40 years, you have been funding liberal democratic politicians. And, by the way --</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I funded you.</p>                \n                \r\n\n            \n                <p><b>SEN. CRUZ: </b>The reason -- you are welcome to have the check back.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I funded this guy. I gave him a check.</p>                \n                \r\n\n            \n                <p><b>SEN. CRUZ: </b>Yes. You gave me $5,000.</p>                \n                \r\n\n            \n                <p><b>SEN. RUBIO:</b> You never funded me.</p>                \n                \r\n\n            \n                <p><b>(AUDIENCE LAUGHING)</b></p>                \n                \r\n\n            \n                <p><b>SEN. CRUZ: </b>By the way, let us be clear, Donald claims -- Donald claims --</p>                \n                \r\n\n            \n                <p><b>(AUDIENCE CHEERING)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Do you know why I did not want to -- But he said to me, he wants autograph --</p>                \n                \r\n\n            \n                <p><b>SEN. CRUZ:</b> Donald. Donald. Donald, I understand.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Mr. Trump, you are doing a great job. I have this book.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That was entertaining, but did not really advance public policy, did it? Talking points has said from the very beginning of the campaign that many Americans are voting on emotion, not facts. That is why candidates like Trump and Bernie Sanders have gotten so much attention.</p>                \n                \r\n\n            \n                <p>Not to say those two men are policy-poor, they are not. But, their primary appeal is personal. And, I think they both acknowledge that. Couple specific things from the debate. Trump was criticized by the \"The Washington Post\" and others for saying this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>You look at our borders, they are like Swiss cheese, everybody pours in. We need to have a country or we do not have a country. We have at least 11 million people in this country that came in illegally. They will go out. They will come back -- some will come back, the best, through a process. They have to come back legally.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, the post is saying that Trump is exaggerating the border is not as sieve-like as it has been. But, that is not the point, the southern border of Mexico is not secure. Narcotics continue to flow through it at an astounding rate, and any thug who wants to can get in here. We saw that in the Kate Steinle murder case. So, Trump is smart to make border security a corner stone of his campaign.</p>                \n                \r\n\n            \n                <p>Now, it is interesting to watch the left wing respond to the Trump phenomenon even though the press tries to pump up Senator Sanders, nobody really believes that he will defeat Hillary Clinton for the nomination. So, there is little drama in that race. But, at this point, three republicans could still become the G.O.P. Nominee. This morning after the debate, Hillary Clinton actually helped Trump.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON, (D) PRESIDENTIAL CANDIDATE: </b>It has been most surprising to me to see somebody who was affable and was good company and you know had a reputation of being kind of bigger than mine. Really traffic in a lot of the prejudice and paranoia and some of the comments that he has made, which have been so divisive and mean-spirited does not quite fit with what I thought I knew about him. But, he has really been offensive and in many respects surprising to those of us who did know him.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That was very interesting. Showing me that Hillary Clinton has already got her campaign theme that Donald Trump is biased and offensive. I do not believe three months ago Mrs. Clinton would have said that. But, now she knows, she may be facing the bombastic businessman head to head.</p>                \n                \r\n\n            \n                <p>However, Hillary Clinton must know that most Americans feel she is a controversial figure and anyone she targets could gain from her scrutiny, because millions of Americans do not really like the former secretary of state. Later on Bolling and Rivera handicap a possible Trump versus Clinton race. But, for now, I think the Clinton campaign has changed its view.</p>                \n                \r\n\n            \n                <p>Before South Carolina, Mr. Trump's lead was kind of hypothetical. Now, it is reality. Many pundits believe Marco Rubio won the debate last night, but again that is your call. Responsible American voters have now seen the republicans hash it out 10 times. Yet, it is estimated that 6 percent of G.O.P. voters are still undecided and others could change allegiance if other candidates drop out.</p>                \n                \r\n\n            \n                <p>That is what keeps Rubio and Cruz going because it is really hard to be undecided about Donald Trum, you either like him or you do not. One of the big advantages Trump has is name recognition because of his television program. Rubio and Cruz are not well known by most Americans, so they are essentially playing catch up as far as I.D. is concerned.</p>                \n                \r\n\n            \n                <p>That is why Rubio's feistiness last night may have helped him. Even though a fraction of the American public watched the debate, the clips were all over social media and local news. Rubio took a page out of the Trump playbook, take it too-to-your opposition. Unlike the past debates, the former senator did not concentrate on Ted Cruz he went after the poll leader.</p>                \n                \r\n\n            \n                <p>For his far, Trump stood firm and fought back the way he always does, using a mixture of disdain and pointed criticisms. While some Americans are offended by his blunt talk, there is no questions it has worked for him so far.</p>                \n                \r\n\n            \n                <p>But, now it is crunch time. If Donald Trump sweeps on Tuesday, he wins. Marco Rubio or Ted Cruz can stay close, then it is on to the big March 15th vote in Florida. A must-win for any republican nominee. Also if Trump beats Cruz in Texas on Tuesday, the Senator is done.</p>                \n                \r\n\n            \n                <p>Now, the two other candidates on the stage last night, I thought John Kasich did a good job because he concentrated on policy and he has been very successful in Ohio as we know. I like his economic vision. I like his healthcare stand and there is no question the man knows what he is talking about.</p>                \n                \r\n\n            \n                <p>But, at this point, Kasich is really running for vice President. He cannot overcome the three frontrunners. As for Ben Carson, what can you say? He is a good man who has waged a dignified campaign, but he has no shot. We discussed that with the doctor himself earlier this week.</p>                \n                \r\n\n            \n                <p>Carson stays in the race because he feels his message must be heard. There is nothing wrong with that. But, after Tuesday, I expect Ben Carson to drop out. Kasich could stay in because his home state of Ohio comes up on March 15th and he runs stronger in the Northeast and Midwest than in the South. So, that is about it.</p>                \n                \r\n\n            \n                <p>Summing up, Rubio and Cruz gave Trump their best shot. Trump took the heat, did not buckle. And, you, the voter, make the ultimate call. That is where the spin really stops. And, that is &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The tenth Republican debate", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/26", "date": "2016-02-27T22:10:51Z"}