{"vcmId": "ab104b29-cc11-4402-b909-4cce8d785715", "url": "http://www.foxnews.com/transcript/2017/03/23/do-surveillance-comments-substantiate-trump-claims.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 22, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Back of the Book\" segment tonight, let's bring in our pal Charles Krauthammer. He's been following the Trump tap story and new developments very closely. So, this helps the president, does it not?</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, SYNDICATED COLUMNIST:</b> Well, there have always been two stories. One was Obama ordering a tap on Trump, which is what was tweeted out, which we know is false, and that Chairman Nunes repeated today is not true. And there's always been the auxiliary story, and I wrote about this two weeks ago, which is improper unmasking of Americans caught up in incidental tapping of other people. We know that happened because that's how we learned about the Flynn encounter, the meeting, the talk with the Russian ambassador.</p>                \n                \r\n\n            \n                <p>What we didn't know until today is that it was about more than Flynn. What we learn from Nunes, is this was not incidental chatter picked up from the Russians. It was apparently picked up from the tapping in on other people. Obviously foreign, because you're not allowed to do it without a warrant on domestic people. And that involved in that chatter were references to Trump's transition team, perhaps to Trump himself. Nunes was very indistinct about whether it was actual transcripts of statements by the Trump people or whether it was chatter that was about the Trump people. And that's a fairly important detail.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay, and also important is how it was gathered, whether it was gathered by wiretaps on two foreign people talking to one another, as we discussed with Bob Woodward, or directly with the President or some of his transition team talking to those people as well. We just don't know that. Now, to me, there is two big things here. Number one, President Obama had to know about this.</p>                \n                \r\n\n            \n                <p>All right? And remember, as I pointed out, he gave the order that Intel could be shared, which never before had been the case, in his last few days in office. All right? So, he had to know about it, because he's briefed every day on the Intel stuff that goes on. And number two, the Trump- hating press, how are they going to handle this? So, let's take President Obama first.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Well, I don't know that it's a given that Obama was briefed on this. We have no idea what the content of this is. Let's say, for the sake of argument, it was idle gossip that may not have been deemed by the briefers to be important enough to bring to the President. If it had to do with the deployment of missiles, you can be sure they would have brought it to the President, but you can't say in advance that you know whether that happens.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you believe the President will be called in front of the Intel Committee to see, you know, and asked those questions? Because that would be unbelievable if that happens.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Yes, that's not going to happen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: What you're going to have to do is, you're going to have to get it from the people who did the eavesdropping, the people who picked up the data, the people who transcribed it, and whoever it was who authorized the unmasking.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. But then you'll never know whether President Obama knew about it or not if you don't ask him.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Well, first of all, when we see with the content is, we'll have a fairly good idea of whether it rises to the presidential level or not. At that point you can decide, look, this is important stuff, this is Intel picked up, say, from the German ambassador, it had to do with NATO, it was likely brought to the President. Then the committee will have a choice about whether to bring him in. But if it's the ambassador from who knows --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I got it. I mean, it depends on what the content is.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Right. And we don't know.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But we, it will be incredible coincidence if the President gave that order that everything could be widely disseminated in his last few days, and now we know that there's all kinds of Trump stuff being disseminated. Finally, real fast --</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Until today, we thought the reason for that was to -- Flynn.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Flynn. Flynn.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. And now we know it is a big wide deal. Finally, I only have 20 seconds here. The anti-Trump press, do you think they will going to eat a little crow?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: It is not a question of eating crow. They're going to play the story. Give it the play it deserves. I have no idea. They have been very anti-Trump. They'll probably want to play it down. But you can't avoid it. Look, those of us who may be unsympathetic to the President nonetheless have been raising this is a serious issue that is a side issue to what Trump had raised.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> But it remains a serious issue. You do not unmask Americans willy-nilly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Absolutely. Charles Krauthammer, everyone. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Do surveillance comments substantiate Trump claims?", "description": "Charles Krauthammer weighs in on 'The O'Reilly Factor'", "date": "2017-03-23T11:58:02Z"}