{"vcmId": "ab52d994-767d-4bdc-9189-6217eb25972c", "url": "http://www.foxnews.com/transcript/2015/09/10/bill-oreilly-nation-turns-against-iranian-nuke-deal.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>New poll released yesterday asks a very simple question do you approve or disapprove of the nuclear agreement between Iran, the U.S.A. and other nations. Just 21 percent of Americans approve. 49 percent disapprove and 30 percent don't know anything. So the folks have turned against President Obama's deal with the mullahs. The reason is there is nothing in it for the U.S.A. outside of avoiding a possible war down the road. Now, that's a big thing. But the consensus is Iran won.</p>                \n                \r\n\n            \n                <p>Today in Washington, thousands of people turned out to hear politicians opposed to the deal.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. TED CRUZ (R-TX), PRESIDENTIAL CANDIDATE: </b>This Iranian nuclear deal is catastrophic. It is the single greatest national security threat facing America. If it goes through, over $100 billion will flow directly to Iran, to the Ayatollah Khamenei.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> They rip us off. They take our money. They make us look like fools. And now they are back to being who they really are. They don't want Israel to survive.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Indeed the top mullah said again today Israel must be destroyed and America remains the Great Satan.</p>                \n                \r\n\n            \n                <p>On the other side, Hillary Clinton supports the deal.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> Without a deal, Iran's breakout time, how long they need to produce enough material for a nuclear weapon, would shrink to a couple of months. With a deal, that breakout time stretches to a year which means that if Iran cheats, we will know it and we will have time to respond decisively.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Mrs. Clinton pledges that if she is elected president, she will use military force to prevent Iran from getting a nuclear weapon if they break the deal. Despite overwhelming opposition, the nuke agreement will go through. It will go through. The whole fiasco shines a spotlight though on President Obama's foreign policy, which is a disaster.</p>                \n                \r\n\n            \n                <p>As you know, millions of refugees are fleeing the Middle East and Africa, going to Europe asking for asylum. There is no way to stop this mass migration, which will change the European continent dramatically. Most of these people are Muslims who are simply trying to survive.</p>                \n                \r\n\n            \n                <p>The world was stunned when a picture of a three-year-old Syrian boy was published. He drowned in the Mediterranean Sea as his family tried to reach the Greek Island coast. The boy's mother and five-year-old brother also drowned.</p>                \n                \r\n\n            \n                <p>Now this is happening because the U.S.A. and western Europe retreated from the Middle East. Once President Obama removed all American forces from Iraq, ISIS moved in and chaos broke out. The President has never, never acknowledged that his policy of disengagement has led to thousands of people being murdered and the catastrophe we are now seeing in Europe.</p>                \n                \r\n\n            \n                <p>It is simply stunning that the American press has said so little about the disastrous foreign policy of the Obama administration. The reason for the silence is that the liberal press despise the Iraq war so much it is simply not going to accurately assess the results of Mr. Obama's timid approach.</p>                \n                \r\n\n            \n                <p>So now we have one of the biggest mass migrations in the history of the world, which is overwhelming and will allow terrorists entry into almost every western country. Of course Russia and China will not accept migrants. They never do. Israel will also not accept refugees fearing terrorist infiltration. As for America 27 Iraqi Christians made it here through the southern border and were promptly incarcerated by ice. None of them have been granted asylum by the Obama administration. But we can now expect thousands of refugees top begin entering America.</p>                \n                \r\n\n            \n                <p>Summing up the jihad on the march. The Obama administration and other western powers have no idea how to deal with it and the world is suffering drastic consequences.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The nation turns against the Iranian nuke deal", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 9/9", "date": "2015-09-10T12:27:50Z"}