{"vcmId": "aba12ec6-2857-4b1f-a65d-da77e44c9b6f", "url": "http://www.foxnews.com/transcript/2015/09/02/is-there-epidemic-violence-against-police-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" September 1, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight, so far this year. Twenty two police officers have been killed by gunfire in America. Some believe that's in response to a number of black men being shot by the cops. Bexar County, Texas there is a video showing 41-year-old Gilbert Flores being shot to death by two police officers. The cops say, Flores was armed but no weapons was seen in the video. That doesn't mean anything of course. And that kind of incident is seized upon Black Lives Matter and other radical groups to demonize the police. Thus, we have open season on the cops.</p>                \n                \r\n\n            \n                <p>Today in Illinois 52-year-old Police Lieutenant Joe Gliniewicz shot and killed in the Chicago suburban Fox Lake. The lieutenant was a 32-year veteran of the Fox Lake Department and father of four children. His killer still at large, police are looking for three suspects, two white men, one black.</p>                \n                \r\n\n            \n                <p>Joining us now from Pittsburgh, Dr. Alfred Blumstein, criminologist at Carnegie Mellon University. Here in New York City, Dr. Peter Moskos, professor at John Jay College of Criminal Justice. Former police officer. Do you believe that the Black Lives Matter crew and other radicals are igniting violence against cops?</p>                \n                \r\n\n            \n                <p><b>DR. PETER MOSKOS, ASSOCIATE PROFESSOR, JOHN JAY COLLEGE:</b> I think they are making the police job tougher. But the police, I think the police can handle it. It's always been a tough job. But no, I don't think there is not a result of cops getting killed from Black Lives Matter.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. So, despite the provocative pigs in a blanket and all this business and every time there is a controversy about an officer shooting a black person, they are out there stirring the pot. You don't feel that disturbed individuals watch this and then act out?</p>                \n                \r\n\n            \n                <p><b>MOSKOS: </b>There are fewer cops shot this year than last year. Are you willing to give Black Lives Matter for that? Cop shootings are down.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know they are down slightly.</p>                \n                \r\n\n            \n                <p><b>MOSKOS:</b> Up 17 percent.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But in August, they are up.</p>                \n                \r\n\n            \n                <p><b>MOSKOS: </b>A bad month. The month before there were none.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>MOSKOS:</b> I mean, overall they are down.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>MOSKOS</b>: So I don't see an epidemic there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How do you see it Dr. Blumstein?</p>                \n                \r\n\n            \n                <p><b>DR. ALFRED BLUMSTEIN, PROFESSOR, CARNEGIE MELLON UNIVERSITY: </b>I think first there is a very serious copycat problem as there was with school shootings and I don't see that as necessarily coming out of the Black Lives Matter environment. But I see just a lot of change going on in policing, because police are now being held much more accountable for the things they do that might be wrong. And there has been growing tension between police and communities. And certainly Black Lives do matter in terms of the people being hit by police. Black Lives Matter also because when homicide rates go up, they probably go up more for blacks than for whites, also.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They always do. But the problem is that the propagandists of Black Lives Matter, I mean, there are justified police shootings.</p>                \n                \r\n\n            \n                <p><b>BLUMSTEIN: </b>I wouldn't call that propaganda. I would say.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Wait, wait, wait. Let me challenge you then. In Ferguson, all right? The man was killed, attacked a police officer, Darren Wilson. He attacked him.</p>                \n                \r\n\n            \n                <p><b>BLUMSTEIN: </b>Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. But the Black Lives Matter, they are still doing hands up and shoot. That's not propaganda?</p>                \n                \r\n\n            \n                <p><b>BLUMSTEIN: </b>There is a lot of rhetoric going on.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Oh, that's propaganda. Come on, Doc. Come on. Come on. You know what happened. And you are distorting what happened. That's propaganda.</p>                \n                \r\n\n            \n                <p><b>BLUMSTEIN:</b> But there certainly have been.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I want to throw these stats out and you both --</p>                \n                \r\n\n            \n                <p><b>BLUMSTEIN:</b> There have been cases where videos have shown inappropriate behavior by police.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. And that is true and that has to be dealt with. And the truth is what we are after here. And I want to quote statistics by the Centers for Disease Control. All right? 99.9 percent of all arrests do not, do not result in any violence at all. 99.9 percent, all right? In 2013, last stats available 147 blacks were killed by cops. Two hundred and sixty eight whites. Okay? So to make this a war on black men is fallacious. Is it not?</p>                \n                \r\n\n            \n                <p><b>MOSKOS: </b>I think there is a problem sometimes with cops shooting too many people. I don't think -- it's not an issue of cops outgunning for black men.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So you agree with that it's not cops gunning black men.</p>                \n                \r\n\n            \n                <p><b>MOSKOS: </b>Some states like California where police shoot people six times as often as New York. So they are doing something right in New York.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I agree.</p>                \n                \r\n\n            \n                <p><b>MOSKOS: </b>We could reduce some police shootings.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I'm just trying to get, I want the police to be as competent as possible. Dr. Blumstein, I'm going to give you the last word. Go.</p>                \n                \r\n\n            \n                <p><b>BLUMSTEIN:</b> Absolutely. You want the police to be effective and you want the police to behave right. And both of those are issues that are now on the table as all these changes are going on. And it's not just blacks, it's the whole operation of police and the whole operation of communities and the interactions particularly sensitive because so much of the violence goes on in the black community and that's where the police are.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's right.</p>                \n                \r\n\n            \n                <p><b>BLUMSTEIN: </b>And that's where it's centered.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And we want to make sure that everybody has the facts. Gentlemen, thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Is there an epidemic of violence against police in America?", "description": "Casualty count mounts as another police officer is killed in Illinois", "date": "2015-09-02T12:21:20Z"}