{"vcmId": "ac1b3e59-ad4e-4bce-b85f-552a84ed1784", "url": "http://www.foxnews.com/transcript/2014/11/14/man-who-killed-bin-laden-enters-no-spin-zone.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 13, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Thanks for staying with us. I'm Bill O'Reilly in the personal story segment tonight. Millions of Americans saw a two part \"Special Report\" on FOX this week about senior chief petty Officer Robert O'Neill a Navy SEAL who says he killed Osama bin Laden on May 1st, 2011 in Pakistan. The special was fascinating shedding light on the Seal operation and the dramatic events that took place. The downside is that Rear Admiral Brian Losey, commander of the Seals has strongly criticized Mr. O'Neil saying, he violated Seal protocol talking about the operation that he shouldn't have done that.</p>                \n                \r\n\n            \n                <p>Here now is Robert O'Neill, first of all, why did you go public? You knew what the protocol was. You knew the admiral was saying we had a tradition we don't talk about it. You knew all of that. Why go you did you go public?</p>                \n                \r\n\n            \n                <p><b>ROBERT O'NEILL, FORMER NAVY SEAL: </b>I wasn't planning on going public with this until this summer when I went to the 9/11 memorial with the intention of donating a piece of, I wanted to donate my shirt and a flag that I wore on my shirt into the room where Osama bin Laden was living. While I was there, I was sort of on a stage to give impromptu talk. I started to talk to them, and as I was talking I was looking out at the audience, no dry eyes in the room. One woman in particular told me I didn't close the chapter and the worst thing that ever happened, I closed the entire book and she was not afraid anymore.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So, you believe by coming forward that the pain experienced by the people who lost loved ones on 9/11 and the entire country would be assuaged a little bit because you could tell them, look, we got him. We got the guy behind this. That's essentially it?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>That's essentially it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ninety minutes in the helicopter. You go from Afghanistan into Pakistan. You know what you are going there for. You land in the compound at Bin Laden's compound. You get off the helicopter, you go in the compound. First thing you saw?</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> Well, the first thing I saw in the compound was looking up at the actual house that I had been studying so long. And the first thought was, wow, this is a Navy SEAL stuff. This is so cool that I'm here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So, you were prepared to go in because you had done so much research. But when you get in the door --</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> Uh-mm.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What's the first thing you see?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>The first thing I saw was a long hallway with doors on either side leading to rooms and then at the end of the hall there was another door that two of my fellow teammates wore using methods of entry to try to breach the door.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Did you hear anything?</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> I could hear an explosion now and then and then I could hear my guys sort of rounding up the women and children and putting them in the safe place.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, you're going up the stairs.</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right? So, you're on the ground floor, you go up the stairs. What you do on the second floor?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>Well, on the way up the stairs the analysts told us, we're going to run into Khalid bin Laden.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's the son.</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> We do. His the last line of defense and the son of Bin Laden will be upstairs.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, the son of Bin Laden came out after one of the SEALs said something to him in what, Pashto?</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> I think he says something in Pashto and in Arabic. He said his name for sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay, so he went out and bang, shot. You didn't give him a chance to surrender anything like that.</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>He was armed and he made a move behind the banister.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay, you saw that?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>Yes, I did. I saw him move as I made my way there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He was armed.</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>He was definitely armed.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay, so he is down, right?</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay, then you proceed, it's you and six guys or something.</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> Probably six or seven guys in front of me and we were going up the stairs, when we got to the second floor, all but the first guy went to the right and left to clear other we call them threats, where there was a closed door, an open door or unknown.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure. You and the other SEAL, you go up to the stairway of the third floor, you get to the third floor landing, what do you see?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>We went to the third floor. He went through the curtain and grabbed a few women that were moving around and he sort of pushed them down the hallway and fell on top of them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Why did he do that?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>He did that because he was sure they were going to blow up. And he wanted to absorb the blast, so his teammate behind him to get the shot off.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's you.</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> He didn't know it was me. He knows it was one of his guys.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay, so he takes the women, four of them?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Pushes them on the ground goes down, all right? So you can get a clear shot.</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> No, I turned to the right and there's an open door into bedroom. I turned that corner and standing a few feet in front of me is Osama bin Laden.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You see him eye to eye, it's just you and him.</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> It's me and him and his wife. He's got his hands on the back of his wife and they're moving.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>His wife is looking right at you.</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>She is sort of looking over my shoulder. It was pretty dark and they couldn't really see me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. So the wife is though in front. You are here, wife is there. He is behind the wife.</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Hiding behind the wife?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>He is not surrendering is all I can say. If he was surrendering, he would be laying on his face.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Or his hands would be up in the air.</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The hands are on the wife's back.</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> Right. And just, in that movement and the recognition and, you know, assuming he is wearing a vest. I'm within my rules of engagement so I shot him twice.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Explosive vest is what you are talking about?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay, but what do you think he was doing behind his wife? What was he doing there?</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> I don't know what he was doing, all I knew is he wasn't surrendering and I know my rules of engagement.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Just take him out because he might pull something.</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> He could be detonating a vest, he could be denoting an explosives that are rigged in the house.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Did he say anything?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>He didn't say anything.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Did the wife say anything?</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> No. Not before he was shot.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Then he was shot, what does the wife do?</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> I shot him twice and he fall down I shot him again, and then I took the wife over to the bed because we needed to like subdue her and there was, about a two-year-old boy in the room.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Wow!</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>So, we put them on the bed.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Was the wife saying anything, crying? Screaming?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>She was screaming. He was confusing for her I'm sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>And at this point other SEALs are coming in --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>To help out.</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> -- to help out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You shot him in the head?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay, twice in the head.</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>Twice in the head and we have to shot him in the head again.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And you shot him in the head on the ground?</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But he didn't say a word the whole thing.</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>No.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. You knew it was him right away.</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>Right away.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Big guy, right?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>Taller than me. Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How tall are you?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>Six foot.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So he is about 6'3\", 64.</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>About that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Big beard?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>No. I was surprise with that. He had a shorter beard than I was used to seeing in the famous pictures. But he hadn't been seen obviously in a while.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You but the Bin Laden's body in a bag with you.</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And you take a bunch of computers --</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> Computers and anything that there could be intelligence where we could develop more targets.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. But you didn't take the wife or anything like that.</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>No, we did that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Interesting. His wife might have known things?</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>Yes. But we were, you know, we were just -- we're worried about, you know, the objective.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Subsequently, when you look back on it, any thoughts?</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> Yes, my thought is I'm just proud to be invited to be a part of the greatest team I've ever seen assembled. My proud that our government pick that team to do that job. It was an honor to be there. It was an honor to help with the healing process of people who lost so much.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Mr. O'Neill, thanks for coming. Fascinating.</p>                \n                \r\n\n            \n                <p><b>O'NEILL: </b>Thank you so much for having me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Thank you. You are a patriot.</p>                \n                \r\n\n            \n                <p><b>O'NEILL:</b> Thank you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The man who killed bin Laden enters the 'No Spin Zone'", "description": "The man who killed bin Laden enters the 'No Spin Zone'", "date": "2014-11-14T13:17:34Z"}