{"vcmId": "acd9dbc6-677a-4a3a-873f-d106afbdaa6f", "url": "http://www.foxnews.com/transcript/2016/05/04/donald-trump-wins-big-in-indiana.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" May 3, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BILL O'REILLY, FOX NEWS HOST, \"THE O'REILLY FACTOR\"</b>: Hi, I'm Bill O'Reilly. Thanks for watching us tonight.</p>                \n                \r\n\n            \n                <p>No formal Talking Points Memo because we have a lot of information about the Indiana primary. First up, Trump won, room to spare. Second, looks like Sanders will defeat Hillary Clinton although no one will say that but me.</p>                \n                \r\n\n            \n                <p>Third, here is Martha MacCallum to tell us all how it went down according to the exit polling. Before we get to that, though.</p>                \n                \r\n\n            \n                <p><b>MARTHA MACCALLUM, FOX NEWS ANCHOR</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I called this race for Trump three weeks ago as you know. And I said after the New York primary.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM:</b> What have we been doing all this for?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't know why you guys are all doing. So, I don't know why you're staying up late and running 24 hours a day. The process is the process and I respect the process. But it was clear to me after New York and that, you know, huge that he was going to sweep in. And that's exactly what's happened. Here are the numbers that we have thus far. And we are awaiting Ted Cruz who is probably going to speak during this hour and we will take a good part of the Senator's remarks. There is going to be an announcement made by him. I don't speculate about it. But you see the one or two things, right? He either going to California or he's hanging it up. Now, the headline of the exit polling is?</p>                \n                \r\n\n            \n                <p><b>MACCALLUM: </b>I think there are two headlines. I think the outsider headline continues to ring true. More than anything else, what these voters in Indiana wanted was an outsider by huge numbers. They also are very concerned about the U.S. economy. And 92 percent say they are either concerned or very concerned. And they believe that Donald Trump, who has spoken to them since last summer about fixing trade deals, about bringing manufacturing back to the United States, that's what matters to these voters and Ted Cruz had made a bet that they were very conservative, that he could win enough, bring them out in large enough numbers and he did win with very conservative. But the problem is that the majority of GOP voters or the Independents who went GOP tonight are not very conservative. They fall much more into the somewhat conservative and moderate.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. There was 62 percent were moderate or somewhat what conservative and the rest very conservative. This is what they call an open primary. So, anybody can vote for anybody?</p>                \n                \r\n\n            \n                <p><b>MACCALLUM</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: On the Democratic side what did we see in the exit polling?</p>                \n                \r\n\n            \n                <p><b>MACCALLUM:</b> So, Bernie Sanders is ahead with Independents, it's a neck and neck race at this moment. But Bernie Sanders looks like --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But I just told how is going to win.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM: </b>I know Bill O'Reilly already told how he is going to win.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Bernie.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM</b>: Have not called a winner in this state yet but there is a look at the independents number. You can see it very well within 73 points --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And that's what is going to put Bernie over the top.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The Independents, absolutely.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM</b>: In terms of the honest and trustworthy number, which we watched closely, for Hillary Clinton, she had a record high in those who believe that she is not honest and trustworthy 44 percent.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ahah!</p>                \n                \r\n\n            \n                <p><b>MACCALLUM:</b> Yet 53 percent believe that she is. She is not that worried about Indiana. Her overall numbers as we know are very strong and she looks like she will make it through this process and secure the nomination.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What do you mean she is not worried about winning it because she is so far ahead? And we are going to talk to two Democrats later. She didn't even take out a TV ad, not one.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM: </b>No, not one.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>In the whole state. Now what caught my eye and I want you to explain this to me. Because I may have it wrong in the exit polling, is that a substantial number of Republican voters will not say they will not vote for Donald Trump if he gets the nomination. What's that all about?</p>                \n                \r\n\n            \n                <p><b>MACCALLUM</b>: Yes. So, here is what that number is. These are people who voted for Ted Cruz or for John Kasich, because some of them dead. So, the people who did not vote for Trump. Then you break that down and you say, where are you going to go? Fifty one percent of them say they will never vote for Trump. They are in the quote Never Trump crowd. So, the question is going to be, where will they go? Will some of them potentially go to Hillary Clinton? Will they stay home? And then you see how the numbers stack up.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. So, it looks to me like it's going to be 55, 45 percent on a combination of Kasich and Cruz will get 45 percent of the vote in Indiana and Trump will get 55 percent.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, that means that 45 percent of Republicans, you cut that in half, what did you say 44 percent won't vote?</p>                \n                \r\n\n            \n                <p><b>MACCALLUM</b>: Fifty one percent say they won't -- for Donald Trump.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So half of that -- if that holds, Hillary Clinton would win Indiana which is a Republican state. Always goes Republican if that holds. And, you know, Trump has a good point is that the whole thing is going to turn around, the whole dynamic once it's a one-on-one that number caught my eye.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM:</b> Yes. It is a very interesting number. And it goes -- I mean, this is a dug-in Never Trump crowd. And what we are seeing also is that Republican voters in Indiana, 60 percent of them say that they believe that this process has divided their party. So, there is a rift. You know, there is a --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You bet.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM:</b> -- fault running down the GOP party. And we're seeing those numbers bearing out in Indiana again tonight. He's got his work cut out for him. He believes he can bring some of those people over. He thinks that numbers is not going to stay at 51 percent. Boy, it got ugly in Indiana over the past --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know. And thank you for bringing that up. I'm not going to use the attacks that Ted Cruz made on Donald Trump. Because I haven't done that the whole time. I haven't used that. We call it ad hominem to the man attacks unless there is somebody here to apply to it if Cruz were here, I would use that it, as somebody doing or if Trump were here, I say, do you want to reply? But just to use them because Cruz got frustrated today and just he laid out Donald Trump in a very personal way.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM:</b> One last thing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM:</b> But he won the late deciders. Cruz won the late deciders.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Cruz won the late deciders.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM:</b> The problem is that there weren't a lot of late deciders.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yep.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM:</b> Seventy five percent of people were already locked in. He got the late deciders which has to have him and his campaign looking at that number and saying, what if we did this earlier?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No, he should not have done it. He should have not done it.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM</b>: You know, some of it may have been.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You do it face to face, you don't do it.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM: </b>That's what he said initially.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You know, those personal attacks. I said this about Boehner the other day when he attacked Cruz. Okay? No. That's wrong. And we don't want to be a part of it.</p>                \n                \r\n\n            \n                <p>Nice job as always, Martha. Thank you. We appreciate it.</p>                \n                \r\n\n            \n                <p><b>MACCALLUM: </b>Thanks, Bill. Good to see you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump wins big in Indiana", "description": "Martha MacCallum joins 'The O'Reilly Factor' to analyze the exit polling", "date": "2016-05-04T12:07:05Z"}