{"vcmId": "ad30706e-1c3a-4b84-91ff-f76dc636cdb5", "url": "http://www.foxnews.com/transcript/2016/10/05/bill-oreilly-will-vp-debate-influence-vote.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The answer is ... No.</p>                \n                \r\n\n            \n                <p>Goodnight, everyone.</p>                \n                \r\n\n            \n                <p>Not really. &#160;I'm here for the hour, but we always tell you the truth and the truth is that the American people will not change their votes based upon anything Pence and Kaine might say this evening.</p>                \n                \r\n\n            \n                <p>The two presidential candidates are so much larger than life that it all depends on them, not their seconds.</p>                \n                \r\n\n            \n                <p>In my lifetime, only Sarah Palin brought enough charisma to benefit her ticket.</p>                \n                \r\n\n            \n                <p>Sept. 3, 2008</p>                \n                \r\n\n            \n                <p><b>PALIN:</b> &#8220;I love those hockey moms. &#160;You know what they say the difference between a hockey mom and a pit bull is? &#160;Lipstick.&#8221;</p>                \n                \r\n\n            \n                <p>But as you'll remember, Governor Palin ran into trouble with her frame of reference, how much she knew about the world.</p>                \n                \r\n\n            \n                <p>She did, however, put a scare into the Democratic Party and initially helped John McCain.</p>                \n                \r\n\n            \n                <p>Other than that, the VP candidates have been pretty much used as surrogates. &#160;Does anyone remember what Joe Biden said to Paul Ryan or vice versa four years ago?</p>                \n                \r\n\n            \n                <p>So tonight's debate will be interesting because of the joust -- who is quicker on the draw -- but it will not influence the vote.</p>                \n                \r\n\n            \n                <p>So all eyes will turn to Sunday night, round two between Hillary Clinton and Donald Trump.</p>                \n                \r\n\n            \n                <p>Polling this week is not good news for the Trump campaign. &#160;Many Americans apparently believe that Hillary Clinton won the first debate and she has gained in most of the polling.</p>                \n                \r\n\n            \n                <p>Also, Donald Trump remains on defense. &#160;While the Miss Universe thing is going away, the tax deal is big.</p>                \n                \r\n\n            \n                <p>Yesterday in Colorado Trump defended his big tax write-off in 1995.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: &#8220;As a major real estate developer in this country and throughout the world, I face enormous taxes &#8211; city taxes, state taxes, sales taxes, excise taxes, employee taxes, federal taxes, VAT taxes in different countries. &#160;It&#8217;s my job always to minimize the overall tax burden to the greatest extent possible, which allows me to reinvest in neighborhood workers, building amazing structures all over the place and fuels tremendous growth in communities around the United States.&#8221;</p>                \n                \r\n\n            \n                <p>Now that makes sense. &#160;As we reported last night, corporations take big losses all the time and that's what Mr. Trump did.</p>                \n                \r\n\n            \n                <p>The fact that he turned his companies around to make big profits is to his credit.</p>                \n                \r\n\n            \n                <p>But we all know that the two debate moderators -- Martha Raddatz and Anderson Cooper -- as well as Hillary Clinton herself will try to paint Trump as a greed head who doesn't care about his country.</p>                \n                \r\n\n            \n                <p>That presents an interesting challenge to the candidate.</p>                \n                \r\n\n            \n                <p>Trump must calmly, I repeat calmly, state his case, that his economic vision on taxes and everything else will benefit the country.</p>                \n                \r\n\n            \n                <p>If Donald Trump goes on the defensive and lashes out in any way at all, he will lose the second debate.</p>                \n                \r\n\n            \n                <p>And if that happens, well I think we all know how the November vote will turn out.</p>                \n                \r\n\n            \n                <p>But Mr. Trump is a talented communicator, so it would be foolish for anyone to count him out at this point.</p>                \n                \r\n\n            \n                <p>But he needs a big win on Sunday, not just holding his own.</p>                \n                \r\n\n            \n                <p>If that happens, the polls will turn around because Hillary Clinton still has not defined herself to independent American voters.</p>                \n                \r\n\n            \n                <p>And that's 'The Memo'.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Will the VP debate influence the vote?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/4", "date": "2016-10-05T12:23:07Z"}