{"vcmId": "ad64456a-633a-40a6-98bb-db920bb6c3cc", "url": "http://www.foxnews.com/transcript/2016/03/15/bill-oreilly-donald-trump-and-violence.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>One of the biggest political stories in years unfolded in Chicago Friday night as hundreds of left wing protesters manage to shut down Donald Trump's rally at the University of Illinois, Chicago. But if you were monitoring the national media coverage of the fracas, you did not, did not get the entire story. Which is grossly unfair to you and an insult to journalism. Here's what really happened.</p>                \n                \r\n\n            \n                <p>One week ago on Monday, March 7th, about 180 University of Illinois faculty and staff sent a letter to the University Chancellor expressing concern about the Trump rally from a liberal point of view. The same day, the far left website MoveOn.org partially funded by radical George Soros posted a petition opposing the Trump rally in Chicago. All throughout the week, far left people ramped up the campaign to deny Donald Trump the Chicago forum. Thus, on Friday, it was no surprise that disrupted protesters entered the University pavilion to shut Trump down and confront his supporters. So, I ask you, who is at fault here? Who provoked the incident?</p>                \n                \r\n\n            \n                <p>The answer is obvious far left agitators who do not believe in freedom of speech, drove a situation that could have become violent. There is no question about it. And Mr. Trump was right to cancel the event because people might have been hurt. But the national media almost immediately spun the story, demonizing Donald Trump and his supporters, blaming the incident on inflammatory rhetoric and racist thought. In the process the press ignored the MoveOn component. Essentially condoning a flat out assault on freedom of speech. Now, there is evidence that some Trump supporters are angry, undisciplined people. Some violent.</p>                \n                \r\n\n            \n                <p>That's true. But some supporters of Bernie Sanders are angry and undisciplined. And here is an interesting footnote. The radical group Black Lives Matter actually shut down a Sanders rally last August. So, there is a trend. Radical leftist believing they can disrupt political events at will. Talking Points applauds honest dissent. If you don't like Donald Trump, stand outside his events peacefully. Make a little sign. Chant whatever you want as long as it's not threatening, opposition to Donald Trump is not the issue here. True fascism is. We have seen some anti-Trump people use the fascist salute while taunting Trump supporters.</p>                \n                \r\n\n            \n                <p>But here's a very simple question. Shutting down opposing points of view is totalitarian, right? So some of the very people accusing Trump supporters of being fascist are really practicing that terrible philosophy themselves. Or am I wrong? Now, for the political implications of the Chicago story. Basically, Trump is taking heat from both sides.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. TED CRUZ (R-TX), PRESIDENTIAL CANDIDATE:</b> First of all, the protesters were in the wrong. When you come up and you use violence, you engage in violence, you threaten violence. And when you try to shut down and shout down speech, that's not what the First Amendment allows. It is not beneficial when you have a candidate like Donald Trump who is telling his protesters punch that guy in the face.</p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON (D), PRESIDENTIAL CANDIDATE:</b> It's clear that Donald Trump is running a very cynical campaign pitting groups of Americans against one another. He is trafficking in hate and fear.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So what's the real truth about Mr. Trump himself? Well, he has said some provocative things when protesters have interrupted his speeches. That's okay for a businessman to do. But not for a potential president. Donald Trump must make a transition now from trying to get there to actually being there. In the beginning of the campaign his flamboyant rhetoric got him attention and support. But now he is a very viable presidential contender. Thus, his presentation carries much more weight. There is some irony here that the far left protesters in Chicago are actually helping Trump, rather than hurting him. He, again, dominated the news cycle this weekend and by shutting down his event, his support grew in some places. Because the Trump haters are so extreme. Don't believe me? Listen to this sound bite from a former Ohio State senator.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>NINA TURNER, NINA TURNER, FORMER OHIO STATE SENATOR</b>: Mr. Trump continues to amp up folks in a way that is unbecoming of this country. But I -- and I know that we are quick to point the finger at him, but let us not forget that in the DNA of this country, Chris is, racism. This country was founded on racism and sexism, point blank. And we need to admit that.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, we do not need to admit that because it is simplistic, insulting and ridiculous. Those who support Donald Trump loathe people like Nina Turner who you just saw. And the more she and others demonize Trump, the stronger his support gets in some precincts. But, again, if you are going to be president, you cannot load up on inflammatory statements and that is being seized upon by Mr. Trump's Republican opponents.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. MARCO RUBIO (R-FL), PRESIDENTIAL CANDIDATE:</b> Some of these protesters that you saw in Chicago apparently -- obviously were organized, maybe even paid to disrupt an event. So, I'm not excusing their behavior. But this is not just the protesters in Chicago. This is now multiple rallies where people are assaulted and beat up. Where a guy gets sucker punched by one of the Trump supporters and then instead of condemning it, Trump is silent.</p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL CANDIDATE: </b>I don't accept responsibility. I do not condone violence in any shape, and I will tell you from what I saw, the young man stuck his finger up in the air and the other man sort of just had it. But I still -- I don't condone violence.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, if Donald Trump wins Ohio tomorrow, he wins the nomination. That's how close he is to running against Hillary Clinton for the presidency. By winning the Republican nod -- but winning the Republican nod, I should say, is far different than winning the general election where Mr. Trump is going to have to persuade about 65 million Americans to vote for him. A significant challenge. It is a forgone conclusion that minority voters in America will be very skeptical about Donald Trump. He will also have trouble in states like California, Illinois and even here in New York which have a lot of electoral votes.</p>                \n                \r\n\n            \n                <p>In addition, some Republicans who don't like Trump will stay home, and the press, as we have seen in the Chicago case, will not cover the Trump campaign fairly. They will come after him with everything they have. This election here is unlike any I have ever seen. And things could easily get out of control. Donald Trump is an intelligent man. But he is in unfamiliar waters. He has never been through anything like this before. He would be wise to tone it down a bit. To fully explain his positions. To hire advisors who can articulate his vision. And to conduct himself with restraint.</p>                \n                \r\n\n            \n                <p>Mr. Trump has to overcome big odds to win the White House. It can be done as Mrs. Clinton has her own challenges. But a tone adjustment will have to be made. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Donald Trump and violence", "description": "The OReilly Factor: Bill O'Reilly's Talking Points 3/14", "date": "2016-03-15T19:40:35Z"}