{"vcmId": "ae583318-1de0-44ca-b112-b2051e8f3e1f", "url": "http://www.foxnews.com/transcript/2015/01/12/bill-oreilly-terrorism-wins-again.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Over the past few days in France, at least 17 innocent people have been killed by radical Muslims.</p>                \n                \r\n\n            \n                <p>Really doesn't matter what group they are affiliated with. These killers are all the same. They murder, torture, rape in the name of their god Allah. They kill their own, they kill infidels and they think they are going to heaven for doing that.</p>                \n                \r\n\n            \n                <p>Now, there's been some misreporting of the story in France. So, tonight let's bring you up-to-date.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>On Wednesday morning about 11.30 Paris time, two gunmen Cherif Kouachi and his brother Said, invaded the offices of a satiric magazine called Charlie Hebdo. There they killed 11 people because that magazine had dared printed cartoons of the Prophet Muhammad. The brothers who say they were then financed by Al-Qaeda of Yemen then fled to scene, killing a police officer in the process. The brothers escaped into the French countryside.</p>                \n                \r\n\n            \n                <p>At 8 a.m. on Thursday morning, another terrorist who knew the brothers killed a policewoman a few miles away. Then today, at 8.10 a.m. French time, the brothers who attacked the magazine are spotted and a shootout ensues, eventually they take refuge in a printing works plant. At 5.00 this afternoon, police storm that plant. There is a shootout, both brothers are killed. The hostage they were holding is freed.</p>                \n                \r\n\n            \n                <p>Meantime, the terrorists who killed the police woman takes a number of people hostage at a Jewish supermarket. Just 15 minutes after the Kouachi brothers are killed by police, cops go on the supermarket killing Amedy Coulibaly but not before he kills at least four hostages and wounds a number of others.</p>                \n                \r\n\n            \n                <p>At least two other terrorist are also in play. One of them the getaway driver for the brothers surrendered to police yesterday. The other, a woman, who helped the supermarket killer is still being hunted. All in all, this was the worst terror attack on French soil in decades.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Again, I want to make this point, it doesn't matter whether these people are Al-Qaeda, ISIS, Boko Haram or any other insane group. They are all killing people in the name of Islam. But the talking points reported last night rather than confront the Jihad, many people, including President Obama, are doing everything they can to avoid the central issue.</p>                \n                \r\n\n            \n                <p>How do you defeat Muslim terrorism? Instead, we constantly hear this kind of stuff.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> We stand for freedom and hope in the dignity of all human beings, that's what the City of Paris represents to the world.</p>                \n                \r\n\n            \n                <p><b>NICHOLAS KRISTOF, NEW YORK TIMES COLUMNIST:</b> We have to acknowledge and Muslims indeed do acknowledge that there is a legitimate problem within Islam, but at the same time that we acknowledge that there is a real issue here of extremism within this vast religion, I think we have to be very, very careful not to engage in religious profiling and to recognize that, you know, one can't blame 1.6 billion adherence of this vast and complex religion.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now we asked Mr. Kristof there who writes for the \"New York Times\" to appear with us. He will not because he is afraid. He is scared. He is one of the chief apologists for Islam throughout the world. As soon as the mass murder took place on Wednesday, Kristof turned out a column saying, \"In essence, don't blame the Muslims, no, no, no.\"</p>                \n                \r\n\n            \n                <p>At this point, everybody knows that blaming all Muslims for terrorism is stupid and wrong. But even more foolish is the world looking away from the continuing threat. Maybe Mr. Kristof and other left-wing media should address this question. Why is there no coordinated strategy to defeat the Jihad after all this time? And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Terrorism wins again", "description": "Talking Points 1/9", "date": "2015-01-12T13:28:34Z"}