{"vcmId": "ae5c931e-ffc0-4238-8c20-bae0893ff5f2", "url": "http://www.foxnews.com/transcript/2015/11/25/sympathy-for-syrian-refugees.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 25, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Weekdays with Bernie segment tonight. The debate over Syrian refugees. Some commentators are comparing the situation to the Japanese internment camps during World War II.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>VOICE OF HARRY SMITH:</b> The President Franklin Delano Roosevelt was commander-in-chief in 1938 who sign the executive order to intern Japanese- Americans after the bombing of Pearl Harbor. It was also under his watch that we denied a safe haven to Jewish refugees fleeing the horrors of Nazi violence.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Joining us now from Miami, the purveyor of BernardGoldberg.com, Mr. Goldberg.</p>                \n                \r\n\n            \n                <p>So there is great sympathy on the left for the Syrian refugees. Of course, I solved the problem by the NATO situation. I don't want to belabor that. But, you know, it's not hard to set up safe zones inside Syria and Iraq to protect these people. But, again, President Obama doesn't seem to want to do that.</p>                \n                \r\n\n            \n                <p>However, the reasonable the press is sympathizing with the Syrian refugees is because that's the modus operandi of liberal thought, you feel sorry for the down trodden, right?</p>                \n                \r\n\n            \n                <p><b>BERNIE GOLDBERG, FOX NEWS CONTRIBUTOR: </b>That's exactly right. Let's take what Harry Smith said about this supposed analogy between interning Japanese Americans during World War II and not letting Jews in who are trying to escape Nazi-Germany on the one hand and opposition to Syrian refugees on the other.</p>                \n                \r\n\n            \n                <p>They are both supposedly based on irrational fear. But it doesn't hold up. Franklin Roosevelt did not intern Italian-Americans. He did not intern German-Americans, even though we were at war with both Italy and Germany. He only interned Japanese-Americans and let's emphasized they were Americans because they weren't white. It was racism and that was irrational.</p>                \n                \r\n\n            \n                <p>Roosevelt wasn't concerned that the Nazis were trying to sneak Nazis into this country along with Jewish children during the war. It's was that we didn't want Jews in this country.</p>                \n                \r\n\n            \n                <p>America was largely anti-Semitic country in the 40s and that's what that was about. That was irrational. But it is not irrational to be concerned about ISIS sneaking terrorists in to this country along with the refugees. It is not crazy. It's a legitimate concern so I personally -- look, the analogy is historically weak.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Invalid comparison is what they say in philosophy class.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Yes and intellectually lame. And in my personal view, it's obscene also.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, why is it obscene? I mean, Harry Smith -- he is a liberal man, but he is not a bomb thrower. I mean, why would you say it would be obscene?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Well, to compare, we round up Japanese-Americans -- by the way, I was based in California in the 70's. I interviewed these people and I interviewed their children and I have been to the camps.</p>                \n                \r\n\n            \n                <p>[20:25:25] What we did to them was wrong, very, very wrong. Comparing that with a legitimate concern about what ISIS may do with the Syrian refugees, they did it in France. They did it in Paris. Why wouldn't they at least try to do it in America? That is a bad, bad analogy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>OK, I agree it's bad, but I don't think he meant anything other -- I think it was an invalid comparison based on historical fact. I think you are absolutely right.</p>                \n                \r\n\n            \n                <p>But isn't there, in your opinion, a hysteria that takes hold and on the right, too.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You see it on the right sometimes on these issues. You get hysterical about it. You know, if you oppose or you moderate, or you're not accepting of these poor people who are down trodden and threatened.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Yes, correct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>.Then you are an evil person. You know, that kind of thing.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Exactly. We are not just wrong, we are evil.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, we're evil.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> You are absolutely right. Look, here is how I see it. Starting with President Obama, liberals starting with President Obama and then joined by his pals in the media, Harry Smith and many others are turning this debate into a morality play.</p>                \n                \r\n\n            \n                <p>And, of course, they are the moral ones because they want to help people who need help. And conservatives, of course, are the immoral ones except it isn't just conservatives who are against allowing ten thousand Syrian refugees in by the end of next year. It's also 53 percent of the American people according to that poll last week. It's also 47 Democrats. These aren't conservatives.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, they're voting, right.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>These are 47 Democrats in the House who are against it. So, if it's a decision between self-righteous morality on the one hand and security on the other, the American people have already voted and they are voting for security at the moment.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Bernie, Happy Thanksgiving. Thank you.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</b></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Sympathy for Syrian refugees", "description": "Bernie Goldberg analyzes how the media is covering the refugee crisis on 'The O'Reilly Factor'", "date": "2015-11-25T13:58:12Z"}