{"vcmId": "aeed6b23-9d01-4586-ac68-b43475db354a", "url": "http://www.foxnews.com/transcript/2015/08/20/bill-oreilly-storm-clouds-for-hillary-clinton.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Some political analyst now believe former secretary of state Clinton will not be able to complete her run for president that's because the FBI now investigating her e-mail situation and things are getting serious.</p>                \n                \r\n\n            \n                <p>Yesterday, Fox News correspondent Ed Henry questioned Mrs. Clinton.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HENRY</b>: The FBI believes that you tried to wipe the entire server. Did you try to wipe the entire -- so that there'd be no e-mail, no personal, no official, wipe the whole thing?</p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> My personal e-mails are my personal business, right? So we went through a painstaking process and turned over 55,000 pages of anything we thought could be work related. Under the law, that decision is made by the official. I was the official.</p>                \n                \r\n\n            \n                <p><b>HENRY:</b> You were the official, did you wipe the server?</p>                \n                \r\n\n            \n                <p><b>CLINTON: </b>What -- like with a cloth or something?</p>                \n                \r\n\n            \n                <p><b>HENRY:</b> I don't know. You know how it works digitally. Did you try to wipe the whole server?</p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> I don't know how it works digitally at all.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Even if that's true, and I tend to believe Hillary Clinton doesn't know the technical details, she was in charge of her correspondence therefore she is responsible as the former director of the National Security Agency points out.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>GEN. MICHAEL HAYDEN, FORMER NSA DIRECTOR: </b>The sin here is the original sin -- all right. The original sin is actually co-mingling the two accounts and not using a government e-mail server. I'm stunned that her staff allowed her to do that in 2009, given the unhappy outcome that was guaranteed.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> With all due respect, Talking Points believes Mrs. Clinton's staff has little say over what she does. Now, the polling data dubious for Mrs. Clinton. A recent CNN poll put forth the following. Do you have a favorable opinion of Hillary Clinton? 44 percent say yes, 53 percent no -- that favorable down nine points since march.</p>                \n                \r\n\n            \n                <p>Do you think Hillary Clinton did anything wrong in the e-mail situation? 56 percent said she did do something wrong, 39 percent she did not.</p>                \n                \r\n\n            \n                <p>Then the CNN poll compared Hillary Clinton to some Republicans running for president. Hillary Clinton 51 percent, Donald Trump 45 percent. Clinton 52 percent, Jeb Bush 43 percent. Clinton 52 percent, Scott Walker 46 percent. Clinton 53 percent, Carly Fiorina 43 percent.</p>                \n                \r\n\n            \n                <p>So you can see that the former secretary of state remains an option for some Americans, but that option is eroding quickly.</p>                \n                \r\n\n            \n                <p>A Fox News poll asks did Hillary Clinton lie about the e-mails. 58 percent yes, 33 percent no.</p>                \n                \r\n\n            \n                <p>Now, the issue will come to a head when the FBI issues its report in a few months. There can be no cover up with the intense media scrutiny. Talking Points believes President Obama is now invested in Hillary Clinton's success therefore he's likely to remain on the sidelines. Unlike other matters like the IRS scandal in which the President obviously did not want the truth to come out.</p>                \n                \r\n\n            \n                <p>However, it would be foolish for any serious person to discount Hillary Clinton. She is a savvy and determined candidate. But she has never, never experienced anything like this, and that's saying something.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Storm clouds for Hillary Clinton", "description": "Bill O'Reilly's Talking Points 8/19", "date": "2015-08-20T12:07:05Z"}