{"vcmId": "aefff3d0-a7e1-404a-860f-e7d87e926bd8", "url": "http://www.foxnews.com/transcript/2015/04/30/bill-oreilly-truth-about-riots-in-baltimore-part-2.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Last night I opined the big loser in the Baltimore situation is the African-American community and that city and nationwide. That's because in order to succeed in America you have to be competitive in the economic marketplace. That message is not getting through to many Americans. Simply put, the government cannot provide prosperity. You have to make it happen.</p>                \n                \r\n\n            \n                <p>False promises from politicians are really damaging America. In Baltimore, the economic situation is dire and the crime problem in the African-American precincts is a scandal. But most black citizens are honest, hard working people. They are just looking for opportunity. But the rioting has now diminished that opportunity big time.</p>                \n                \r\n\n            \n                <p>For example, Baltimore is a major convention city -- 29 meetings set for this year alone, an estimated $138 million to Baltimore in convention business. Now, conventions are starting to cancel.</p>                \n                \r\n\n            \n                <p>The Baltimore Orioles another big revenue-driver for the city. Today the Orioles played a game in front of zero spectators. Nobody allowed in the park. So all the vendors, many of them young people lose a pay day and they'll lose three more paydays over the weekend as the Orioles were supposed to play Tampa in Baltimore but they're now moving the games to Florida.</p>                \n                \r\n\n            \n                <p>I can give you scores -- pardon the pun -- of other examples. It is a fact that irresponsible criminals in Baltimore have once again hurt good folks -- this time on a mass level. The city will take years to recover. That means more poverty, more law breaking, more deprivation -- and that means more confrontations with the police.</p>                \n                \r\n\n            \n                <p>Look, inner city policing is perhaps the most difficult job in the country no matter what color the cops are. That being said, there is no excuse for brutality and any kind of police violence unless in self-defense has to be adjudicated. It's quite clear many African-Americans believe they are not treated fairly in the criminal justice system. So, our elected officials must deal with that on a factual basis. They must right wrongs.</p>                \n                \r\n\n            \n                <p>But, in Baltimore, the elected officials are primarily black as is the leadership of the police department. So the race card is very hard to play there. Nevertheless, we hear some really dumb things from politicians. Here's one of them.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BERNARD \"JACK\" YOUNG (D), BALTIMORE CITY COUNCIL:</b> I made a comment on yesterday out of frustration and anger when I called our children thugs. They are not thugs. They are just misdirected. And we need to direct them on a different path by creating opportunity for them because they see hopelessness.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> With all due respect, the government cannot create opportunities for young people who are uneducated, disrespectful, and unmotivated. It's impossible. Personal behavior dictates success or failure. And no phony promise from a politician is going to change that. So, let's stop making all of these false promises, and excuses. Like this one.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>STOKES:</b> No, of course, it's not the right word to call our children \"thugs\". These are children who have been set aside, marginalized, who have not been engaged by us, no. We don't have to call them --</p>                \n                \r\n\n            \n                <p><b>BURNETT:</b> But how does that justify what they did? I mean that's a sense of right and wrong. They know it's wrong to steal and burn down a CVS and an old person's home. I mean come on.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>Come on, so calling them thugs, just call them (EXPLETIVE DELETED), call them (EXPLETIVE DELETED).</p>                \n                \r\n\n            \n                <p>Very emotional statement by councilman stokes using the n word. But again, if the children have been marginalized or misdirected in Baltimore, it is largely the fault of their parents, not the country and not the police. Again, the city of Baltimore has been run by black politicians and the Democratic Party for decades. So who exactly is marginalizing the children? Forcing them to commit violent crimes in the streets? Who?</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The truth about the riots in Baltimore, part 2 ", "description": "Bill O'Reilly's Talking Points 4/29", "date": "2015-04-30T12:10:41Z"}