{"vcmId": "af23a1a0-c300-4d6a-aaf5-b24e0630b4f0", "url": "http://www.foxnews.com/transcript/2015/03/27/is-obama-administration-defending-indefensible.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 26, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> In the \"Personal Story Segment\" tonight, is the Obama administration defending the indefensible. With the Middle East appearing to spiral out of control and desertion charges leveled against Bowe Bergdahl Obama administration policies seem to be unraveling by the day. But that's not stopping the White House from doubling down on its defense of its decisions.</p>                \n                \r\n\n            \n                <p>Here is how incoming communications director Jen Psaki spun the Bergdahl situation on \"THE KELLY FILE\" last night.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>PSAKI: </b>Was it worth it? Absolutely. I think that we look at Sergeant Bergdahl as somebody who served his country as many men and women have. Obviously there have been steps taken today or an announcement made today -- that will be determined. It's been quite some time since we brought him home and there has been some time for those in the military justice system to take a look at this case and we'll all be the judge of that once that decision is made.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> And with Yemen in total collapse and on the brink of civil war, the White House still amazingly says it's a model of success for U.S. counter terrorism strategy.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>ED HENRY, FOX NEWS CHIEF WHITE HOUSE CORRESPONDENT:</b> The President said it's a success. He was wrong, right? Why can't you say he was wrong and we are trying to fix it? We're trying to figure it out. It just seems like we keep going around and around that it's still a model when it's not, right?</p>                \n                \r\n\n            \n                <p><b>JOSH EARNEST, WHITE HOUSE PRESS SECRETARY: </b>Ed, we have been very clear about what we think the strategy can be and that strategy, even in Yemen, despite all of the challenges that readily -- that I readily acknowledge exist there that we have put intense pressure on extremists inside of Yemen. It has mitigated the threat that they pose to the U.S. and the west.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>Joining me now with reaction Dana Perino, who was George W. Bush's White House press secretary and is my fellow co-host of \"THE FIVE\". Dana, can't they just once say we were wrong? We made a mistake? Oops?</p>                \n                \r\n\n            \n                <p><b>DANA PERINO, FOX NEWS HOST:</b> That is not something you are going to hear from President Obama and when you are in the White House, the media wants nothing more than to get you to admit a mistake and to apologize for something. And sometimes it's kind of worth it to take the air out of the balloon and move on.</p>                \n                \r\n\n            \n                <p>I think though that too much is being -- too much criticism is being leveled at the spokespeople because the blame, if you are unhappy with the White House and what the White House is saying, the blame really is at the top, that is would be with President Obama.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Fair enough. But, you were there. What do you do if you don't agree with the policy that you are\u007f delivering?</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> You are the spokesperson so it doesn't matter what you think. It doesn't matter what I personally believe as a spokesperson. It matters, can I convince -- convincingly explain to the American people what the President is thinking and why he is thinking that way?</p>                \n                \r\n\n            \n                <p>And what I -- I wasn't elected to anything. Dana Perino doesn't matter what I think or what I say. It doesn't matter what they say. Now, if there is some sort of unethical behavior going on then that would be different.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> When you watch Josh Earnest or Jen Psaki or Marie Harf -- do you pick up anything where in their where you say, she doesn't really buy into this. She's just doing what she's -- or just doing what they're supposed to say.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Not really -- although I do like it when you see the exchange between Ed Henry and Josh Earnst because you can see that Ed is kind of trying to bait the witness. He is trying to lead the witness to say like come on, why don't you just say that something is wrong? Why don't you just do it? And Josh is sitting there thinking I know your game and I'm not going to play it.</p>                \n                \r\n\n            \n                <p>I think that their biggest problem when I watch what they are saying is the tone. I can understand them sticking by the President's decision to bring Bowe Bergdahl home in exchange for those five prisoners. I don't agree with that decision but I understand why they are sticking with the President because he is saying to them I still would have done the same thing again. They have to do that.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Fine. What about the Rose Garden victory lap?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>And that's where I think there is a problem on two folds. One, as a press person or communications director you do have the right to raise your hand and say I don't think this is a very good idea. It's not just because I disagree with it it's because it is going to be very bad for the President of the United States and our U.S. military and the entire country is going to be upset with us.</p>                \n                \r\n\n            \n                <p>You can do that it doesn't appear that anybody in the White House said maybe we should have some caution and exercise some restraint here.</p>                \n                \r\n\n            \n                <p>The other thing is the tone. So, when she is asked do you think it's worth it? She goes \"absolutely\". I think that they can show a little bit of concern and empathy for the families whose soldiers are not coming home because they went to look for him and they died trying. Just a little bit more of a serious tone from them could take them a long way.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Are they rookies though -- Dana? You think about the time that --</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>No. It's six and a half years.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>I know but who makes the decision to bring President Obama off the golf course to address an American beheading and then decide to let him go back on the golf course?</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> I absolutely defend the spokespeople again because that comes from the top. If you as a person --</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>When you say the top -- where?</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> That's President Obama. If he doesn't think that it is going to be -- if he doesn't have any problem with giving a statement about someone who was just beheaded, an American who was beheaded and then hitting the golf course six minutes later. If he doesn't have a problem with it, there is not much that a spokesperson can do.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> What is the layer in between? There has got to be a layer between President Obama and spokesperson. The layer of plausible deniability that they don't get involved?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Again, maybe they do or maybe nobody tells him. The bottom line is these decisions come from the very top, the President of the United States, the person elected to represent us. He has not even represented himself well. However, I believe he is representing himself accurately.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Honestly.</p>                \n                \r\n\n            \n                <p>Very good. Dana Perino thank you</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Is the Obama administration defending the indefensible?", "description": "White House doubling down on claims regarding Bowe Bergdahl and US counter terrorism strategy", "date": "2015-03-27T12:17:04Z"}