{"vcmId": "afb30d88-60e8-4904-b4f6-56746f5b4cff", "url": "http://www.foxnews.com/transcript/2016/11/29/bill-oreilly-amazing-amount-confusion-over-illegal-aliens-voting.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><b>O'REILLY:</b> Impact segment tonight, Donald Trump tweeted on Sunday that he believes millions of illegal aliens voted in the presidential election. Immediately, Mr. Trump was mocked and scorned by those who don't like him.</p>                \n                \r\n\n            \n                <p>Now, \"Factor\" cannot possibly verify whether Mr. Trump's statement contains any truth at all. What we can tell you with certainty, however, is that there is an amazing amount of confusion over illegal aliens voting. And that is the subject of the first talking points memo.</p>                \n                \r\n\n            \n                <p>As you may know, California, along with 11 other states now gives illegal aliens license to drive. And once you have a valid driver's license in California, Connecticut, Oregon, Vermont, and West Virginia, you're automatically registered to vote if you use some slight of hand. You must provide a valid social security number to prove you're here legally, but that can be done via computer. And as we all know, phony social security numbers are legion.</p>                \n                \r\n\n            \n                <p>Now, in California, if you are undocumented you get a stamp on your license that federal limits apply and the law in all of 12 states says illegal aliens are not allowed to vote. However, who is checking? The answer, no one, as far as we can tell. And as talking points stated, it's not hard to game the system. So it's not inconceivable that millions of illegal aliens did vote on November 8th, but it's not a fact either, at least, at this point.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Amazing amount of confusion over illegal aliens voting", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/28", "date": "2016-11-29T13:21:52Z"}