{"vcmId": "afc2c612-5f6d-4028-bc94-286e905e5ef7", "url": "http://www.foxnews.com/transcript/2017/03/15/bill-oreilly-irrational-thinking-hysterical-debates.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>For those of you who have watched us over the years, you have seen a change on The Factor.</p>                \n                \r\n\n            \n                <p>Used to be I'd slug it out with almost anyone, no matter how crazy they sounded.</p>                \n                \r\n\n            \n                <p>We've had people on this program who said the U.S. government engineered the attacks on 9/11.</p>                \n                \r\n\n            \n                <p>We had Congressman Barney Frank on and after we played a tape where he said that the federal mortgage system was \"fundamentally sound\" and \"not in danger of going under,\" he actually denied saying that even though he listened to the tape of his own words.</p>                \n                \r\n\n            \n                <p>That resulted in a loud confrontation.</p>                \n                \r\n\n            \n                <p>I could give you scores of other examples.</p>                \n                \r\n\n            \n                <p>But we don't do that much anymore because the irrationality in some precincts, the dishonesty of some zealots, the absolute hysteria that surrounds some news stories is simply dumb and incredibly annoying.</p>                \n                \r\n\n            \n                <p>You get nowhere when you present facts. They are rejected, so why bother?</p>                \n                \r\n\n            \n                <p>Above all, I don't want to waste your time.</p>                \n                \r\n\n            \n                <p>Last night on her program &#8220;The First One Hundred Days,&#8221; Martha MacCallum tried to reason with a man who believes that the feds and authorities in Missouri allowed Michael Brown to be executed by a police officer.</p>                \n                \r\n\n            \n                <p>Even though Martha presented the facts, that didn't matter.</p>                \n                \r\n\n            \n                <p><b>MARTHA MACCALLUM:</b> &#8220;You are suggesting that 40 FBI agents were all...&#8221;</p>                \n                \r\n\n            \n                <p><b>JASON POLLOCK, DIRECTOR OF &#8220;STRANGER FRUIT&#8221; DOCUMENTARY: </b>&#8220;I'm suggesting the Department of Justice failed.&#8221;</p>                \n                \r\n\n            \n                <p><b>MACCALLUM</b>: &#8220;... to make sure that this person [Officer Darren Wilson] was not indicted. Listen to me.&#8221;</p>                \n                \r\n\n            \n                <p><b>POLLOCK</b>: &#8220;They failed.&#8221;</p>                \n                \r\n\n            \n                <p><b>MACCALLUM</b>: &#8220;Listen to me &#8230;&#8221;</p>                \n                \r\n\n            \n                <p><b>POLLOCK: </b>&#8220;They failed!&#8221;</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>MACCALLUM</b>: &#8220;There were three different forensic investigations that were done that showed that he [Michael Brown] was shot in the front.&#8221;</p>                \n                \r\n\n            \n                <p><b>POLLOCK</b>: &#8220;I don't care! They failed him! They all failed.&#8221;</p>                \n                \r\n\n            \n                <p><b>MACCALLUM:</b> &#8220;Everyone in the country was told this narrative that he was shot in the back.&#8221;</p>                \n                \r\n\n            \n                <p><b>POLLOCK:</b> &#8220;They all -- do you know how many black men -- do you how many black men are in jail right now?&#8221;</p>                \n                \r\n\n            \n                <p><b>MACCALLUM:</b> &#8220;That he had his hands up and said &#8216;don't shoot.&#8217; It was all discounted by 40 ...&#8221;</p>                \n                \r\n\n            \n                <p><b>POLLOCK</b>: &#8220;Do you how many black men are in jail right for nothing? For nothing? Because the Department of Justice failed them.&#8221;</p>                \n                \r\n\n            \n                <p><b>MACCALLUM</b>: &#8220;You know ...&#8221;</p>                \n                \r\n\n            \n                <p><b>POLLOCK</b>: &#8220;You know how many black men are in jail right now?&#8221;</p>                \n                \r\n\n            \n                <p>So that guy sincerely believes that blacks are brutalized and thrown into prison on a mass scale because of their color.</p>                \n                \r\n\n            \n                <p>That's what the man believes.</p>                \n                \r\n\n            \n                <p>So why debate him? Facts don't matter to him and you can't even get a sentence out.</p>                \n                \r\n\n            \n                <p>And the worst part is, you're a racist if you don't see it the way he does.</p>                \n                \r\n\n            \n                <p>It's the same thing with less volume with some politicians.</p>                \n                \r\n\n            \n                <p>No matter how many facts you present to Nancy Pelosi, she is going to tell you Obamacare is great.</p>                \n                \r\n\n            \n                <p>No matter how many policy failures there were in the Iraq War, some conservatives will shrug it off and deny any mistakes were made.</p>                \n                \r\n\n            \n                <p>Talking Points believes the propaganda element is worse on the left at this point in history, but the honest American will cede that zealots on both sides spin it. They're not looking for the truth.</p>                \n                \r\n\n            \n                <p>We are.</p>                \n                \r\n\n            \n                <p>So you will not see Jason Pollock on The Factor after he failed to treat Martha with respect.</p>                \n                \r\n\n            \n                <p>You will not see Nancy Pelosi here either, even though I would interview her if given the chance.</p>                \n                \r\n\n            \n                <p>But she would never do that because she knows her own city is falling apart due to liberal policies, and she has to know that Obamacare has hurt far more Americans than it's helped. But she doesn't care.</p>                \n                \r\n\n            \n                <p>In her mind, she's noble because she believes in far left tenets.</p>                \n                \r\n\n            \n                <p>For irrational people, compromise is impossible and that's why America is having a tough time.</p>                \n                \r\n\n            \n                <p>There are way too many irrational people.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Irrational thinking, hysterical debates", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/14", "date": "2017-03-15T12:08:40Z"}