{"vcmId": "afdbef02-782a-4568-81d2-2a4e868369c4", "url": "http://www.foxnews.com/transcript/2016/04/12/bill-oreilly-democratic-party-and-your-physical-safety.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Like him or not, former President Bill Clinton is an excellent analyst of the American political scene. Last week confronted by Black Lives Matter militants in Philadelphia, who say the criminal justice system is racist, Mr. Clinton fought back.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON</b>: I don't know how you would characterize the gang leaders who got 13-year-old kids hopped up on crack and sent them out on to the street to murder other African-American children.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Clinton is absolutely correct. The vicious drug world results in millions, millions of Americans being harmed. Dope pushers and gang members should be incarcerated. But after saying that, Mr. Clinton came under pressure from his own party and he may have buckled.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> I did said yesterday in Philadelphia, I almost want to apologize for. But I want to use it as an example of the dangers threatening our country.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, why would Bill Clinton almost want to apologize if what he's saying is true? Here are the facts. According to FBI data, between 1960 and 1990, the rate of violent crime in the U.S.A. surged by 350 percent. Violence in cities like New York, Detroit, Los Angeles, way out of control. And people in the poor neighborhoods took the brunt of it. In 1970, convicted murderers in America served a median sentence of just 3.5 years for murder, for killing somebody, 3.5 years. That was insane. So, Bill Clinton and both political parties finally did something about it. They passed tough new sentencing laws. The result, violent crime has dropped drastically since the mid-1990s to historic lows today.</p>                \n                \r\n\n            \n                <p>That's the truth. Tough sentencing for violent offenders drove crime down in the U.S.A. big time. Now the race question. Again, according to FBI data, from 1976 to 1995, Black Americans were identified by police as committing more than half of the homicides in the U.S.A. African-Americans make up 13 percent of the population. In addition a national crime victim's survey reported that Blacks committed robberies at a rate of 60 percent. Again, the Black community is just 13 percent of the entire population. So, what's the beef? If Blacks Americans are committing crimes out of proportion to other ethnic groups, why is there a racial component to their presence in prison, why?</p>                \n                \r\n\n            \n                <p>Also, forget the drug myth. Right now in federal penitentiaries, 99.5 percent of drug convicted inmates are traffickers not users. 99.5 percent. So the question becomes why is the Democratic Party caving in to propaganda put out by radical groups like Black Lives Matter? It's clear that tough sentencing reform spearheaded by both parties in the `90s and signed by President Clinton saved perhaps millions of American lives. Yet, the entire criminal justice system is now being branded as racist and oppressive. Disgraceful. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly:  The Democratic Party and your physical safety", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 4/11; Plus reaction from Charles Krauthammer", "date": "2016-04-12T12:14:03Z"}