{"vcmId": "b03c7d68-8be0-4892-af88-580b8490ae5d", "url": "http://www.foxnews.com/transcript/2014/11/17/bill-oreilly-will-president-obama-harm-country-next-week.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It is widely believed in Democratic circles that Barack Obama will sign an executive order within a few days that will grant legal status to perhaps as many as five million undocumented aliens. That doesn't mean they will become citizens it does mean they can stay here, work and enjoy the freedoms America allows.</p>                \n                \r\n\n            \n                <p>Now, \"Talking Points\" believes it is meaningless, meaningless to debate the merits of amnesty for illegal aliens. The far left, the open border people, some in the Hispanic American precincts will not be dissuaded. They want few limits on immigration. Nothing I can say, nothing you can say will change their minds. Same thing on the right -- millions of Americans believe that people breaking civil law, illegally crossing the border, overstaying their visas have no right at all to any privileges given by our federal government.</p>                \n                \r\n\n            \n                <p>Some nativist Americans even object to immigration on the basis of ethnicity. That group is small but, but again, we're not going to change their minds. So, further blather about the immigration debate is useless tonight.</p>                \n                \r\n\n            \n                <p>What concerns me is President Obama subverting the Constitution and the law. Here is what he said three and a half years ago.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> With respect to the notion that I can just suspend deportations through executive order, that is just not the case.</p>                \n                \r\n\n            \n                <p>Now I know some people want me to bypass Congress and change the laws on my own. But that's not how -- that's not how our system works.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Remember, President Obama is a constitutional attorney. He knows that undermining immigration law is wrong. He knows the founding fathers did not want presidents to make law. Yet, Barack Obama doesn't seem to care. That's dangerous. And the President will eventually lose in the courts. There is no way on this earth the Supreme Court as comprised will rule that the President can mandate a new immigration law.</p>                \n                \r\n\n            \n                <p>This national confrontation doesn't have to happen. The new Congress would be under extreme pressure to pass new immigration laws. Now I believe the new Congress would do that because if the House and Senate don't, Republicans will lose the presidency in 2016 and even if Congress did shirk it's responsibility and didn't come up with a fair immigration plan President Obama could then take piecemeal executive action. That is he could grant certain privileges to targeted groups. But not five million people -- that's insane.</p>                \n                \r\n\n            \n                <p>Finally, the President said -- has had I should say six years to secure the southern border. Democrats say that's been done. I heard it this morning on \"Fox &amp; Friends\". Congressman Henry Cuellar painted the city of Laredo, Texas as some kind of Disney world. But we all know that when 75,000 children can march across the southern border unimpeded we do not have security. So once again reality overwhelms partisan spin.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" fervently hopes that on the long plane ride back from Australia President Obama changes his mind and spares this country a terrible fight over his power and illegal immigration.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Will President Obama harm the country next week?", "description": "Talking Points 11/14", "date": "2014-11-17T13:16:01Z"}