{"vcmId": "b254a52a-f3c7-4e7d-a2c1-f9fcadf4300f", "url": "http://www.foxnews.com/transcript/2015/03/06/is-ferguson-biased-against-african-americans.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 5, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Factor Follow up Segment\" tonight, the town of Ferguson, Missouri. As you may know Ferguson police officer, Darren Wilson shot 18- year-old Michael Brown dead last August 9. The story became national and protests and rioting erupted in Ferguson.</p>                \n                \r\n\n            \n                <p>Yesterday, the Justice Department issued a report saying the town does indeed target African-Americans especially for civil relations, tickets. Ferguson 67 percent black. But 90 percent of the citations issued there go to African-Americans.</p>                \n                \r\n\n            \n                <p>Joining us now from St. Louis Jeff Roorda spokesman for the police officers association there. And McGraw Milhaven, radio talk show host on KTRS.</p>                \n                \r\n\n            \n                <p>Mr. Milhaven, I begin with you. What do you think of the Justice Department report?</p>                \n                \r\n\n            \n                <p><b>MCGRAW MILHAVEN, RADIO HOST:</b> Two things, Bill. First of all, they excoriated every one in Ferguson except Officer Darren Wilson, right? They said it never hands up don't shoot. He was justified. African-American witnesses came forward and supported Officer Wilson's claim. So, he is completely innocent. That's one.</p>                \n                \r\n\n            \n                <p>Two, you have to understand Ferguson. Ferguson doesn't live in the middle of a cornfield. There are little communities all around Ferguson that are predominantly African-American. Those numbers, right, 67 percent of the residents of Ferguson are white. I want to know of those 90 percent who got those tickets, how many of them actually lived in Ferguson, how many lived around the surrounding areas? Just to take that number and put those numbers on it, you show me a good statistician, I will show you a good liar.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. But I can give you some perspective. I mean in the low level beef of failing to comply, which is like jay walking and all of that stuff, 94 percent, Mr. Milhaven, of all citations issued to blacks. They are targeting blacks. They are. I mean there's no way on earth that that -- this is a discretionary beef. You don't have to give a ticket to somebody who is not crossing the street properly. They are targeting it they are doing it for money. They want the money. And it's an easy play. Come on.</p>                \n                \r\n\n            \n                <p><b>MILHAVEN:</b> No question. No question. They are targeting blacks and whites and everyone knows.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Not and whites. It's only 6 percent of whites get these things. So, it's not and whites. It's blacks. Wrong, it's wrong. You know it's wrong.</p>                \n                \r\n\n            \n                <p><b>MILHAVEN: </b>No, no, no. It is wrong, bill. You have to remember that people get caught for speeding.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Speeding is a different deal.</p>                \n                \r\n\n            \n                <p><b>MILHAVEN:</b> Listen to me. And in St. Louis you then plead guilty to a nonmoving violation, you are charged more.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. I don't want to get into the weeds on this thing but somebody is speeding or goes through a red light that I don't think is targeting anybody. You do it, you pay. Somebody is walking along on a curb, they are looking for them.</p>                \n                \r\n\n            \n                <p>Ok, I want to get to you, Mr. Roorda you know Darren Wilson and as Mr. Milhaven pointed out, he was not excoriated by this report at all that what his testimony was pretty much the feds back up. So, what does Mr. Wilson think about this?</p>                \n                \r\n\n            \n                <p><b>JEFF ROORDA, ST. LOUIS POLICE OFFICERS ASSOCIATION: </b>Well, you noticed yesterday, Bill, that Attorney General Holder could barely bring himself to share that news. It struck me that this release or this leak of information the day before these reports came out were the most damning information that they could leak about the Ferguson police department was leaked out in advance of the announcement that the Justice Department determined the same thing that the much derided grand jury here decided. And that was that Darren Wilson was the victim of an attempted murder and that he used reasonable force in the face of --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. Ok. So think that's established beyond a reasonable doubt. Anybody can wear a t-shirt that says anything. But the facts are the facts. The officer has been exonerated, not going to be charged with a civil rights violation and the grand jury didn't charge him with anything else.</p>                \n                \r\n\n            \n                <p>How is he processing that? I understand you spoke with him. How is he doing?</p>                \n                \r\n\n            \n                <p><b>ROORDA: </b>I haven't spoke to him since the decision came out. I spoke to his attorney yesterday. He described Darren as very relieved. The weight of the world is on your shoulders when you are under charges like this. And really everybody in the media except for a handful like you declaring before any facts come out that he is guilty. Now that the facts are out there, you know, we get the full story.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I feel bad for him. Again I feel terrible for the brown family as well. This should never have happened.</p>                \n                \r\n\n            \n                <p><b>ROORDA: </b>And I do, too.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I think every fair human being does. I mean, Benjamin Crump, the lawyer for the family is a stand up guy. He's a dignified man. He comes on this program. I have told him many, many times if he could wave a magic wand, we have two lives. One life snuffed out and Wilson's life is ruined. It's horrible.</p>                \n                \r\n\n            \n                <p>Now Mr. Milhaven I think you would agree with me that we need a revamp in Ferguson. We need to revamp in Ferguson. We need a whole revamp this whole thing and nobody should be targeted for tickets for revenue. That's the problem.</p>                \n                \r\n\n            \n                <p><b>MILHAVEN:</b> No question.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Nobody in America should be a target of tickets for revenue. Last word.</p>                \n                \r\n\n            \n                <p><b>MILHAVEN:</b> No question. No question, Bill. And, yes, the Justice Department has started the job and pointed out that, yes, there needs to be wholesale changes. But Ferguson doesn't live on an island. There are little municipals all around Ferguson that you have to drive through.</p>                \n                \r\n\n            \n                <p>And look, Floridale Hills (ph) during all of this invented their own police department. They have a population of 800 people. They are the mayors are black, the police chief are black, they are targeting everybody. That's how they are surviving.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, because they want money. It's a shakedown.</p>                \n                \r\n\n            \n                <p><b>MILHAVEN:</b> You mentioned Benjamin Crump. Pine Lawn has a population of 3,000 people. They wrote 17,000 tickets last year.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. That's got to stop.</p>                \n                \r\n\n            \n                <p><b>MILHAVEN:</b> Guess who their police chief is. Guess who their police chief is.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And now the attorney general -- who is your police chief?</p>                \n                \r\n\n            \n                <p><b>MILHAVEN:</b> The police chief's name is Anthony Gray who is the family attorney for Michael Brown.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I think the attorney general has got to start to clean up these towns in Missouri and stop.</p>                \n                \r\n\n            \n                <p><b>MILHAVEN:</b> Everywhere, yes -- Everywhere. Not just Ferguson, the entire north county is being destroyed.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, gentlemen. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Is Ferguson biased against African Americans?", "description": "DOJ report claims the Ferguson Police Department targets African Americans", "date": "2015-03-06T13:29:14Z"}