{"vcmId": "b31ae68e-2191-4479-a4db-46c8352b04d8", "url": "http://www.foxnews.com/transcript/2015/11/06/bill-oreilly-what-has-happened-to-democratic-party.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>In a disgraceful exhibition yesterday, one that will go down in history as a blight on American politics, the senate minority leader, Democrat Harry Reid killed Kate's Law, at least for now.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>REID:</b> The new mandatory minimum sentences the bill would create would have a crippling financial effect. This is yet another attack on the immigrant community.</p>                \n                \r\n\n            \n                <p><b>DOBBS:</b> I truly believe that what Harry Reid is doing here is pure evil. I think Bill O'Reilly has it exactly right. I believe Ted Cruz has it exactly right. And it demonstrates why we have got to go to regular order in this government.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What Lou Dobbs is saying is that one senator, Reid, should not have the power to derail legislation. But even though Kate's Law will likely come up again for a vote, it seems certain most Democrat senators will not support the measure that's designed to protect all Americans from thugs like the guy who shot and killed Kate Steinle in San Francisco.</p>                \n                \r\n\n            \n                <p>As you may know, that illegal alien had seven felony convictions, came back six times after being deported. I mean it's insane. Nevertheless, Democrat senators like crazy left Sherrod Brown in Ohio oppose mandatory five-year prison terms for such individuals. Brown saying, quote, to his constituency: \"The mandatory minimum sentences established under this bill, Kate's Law, would waste taxpayer money by increasing the federal prison population.\" Yes, that's right, Senator. Convicted aggravated felons who defy deportation would wind up in prison under Kate's Law instead of running around sanctuary cities like San Francisco selling drugs and shooting young women in the head. Brown is a disgrace. How Ohioans ever elected him is a mystery of the universe.</p>                \n                \r\n\n            \n                <p>Now, as talking points reported yesterday, Americans overwhelmingly support Kate's Law. Think about it. Who would oppose the law? Who would oppose this? I can't figure this out. Democrat senators like Bob Casey, Dianne Feinstein, Patrick Leahy, Claire McCaskill, Bill Nelson -- these people should openly embrace Kate's Law. Instead, they remain silent and will remain so unless pressured by their constituents. On that front, I'm not hopeful.</p>                \n                \r\n\n            \n                <p>Last week a guy from the Media Research Center went to a pro- immigration rally in Colorado.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Have you heard of Kate's Law?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: No.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Have you heard of Kate Steinle?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE</b>: No.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Have you ever heard of Kate's Law?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE</b>: No, I have not.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: I don't like you asking the people here the questions that you are asking.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: See, we got it he doesn't like the questions.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>Ok. Well -- thank you.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Perfect. I knew you were something else.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>You are welcome to leave.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> We are welcome to, of course. We don't have to.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>You are not going to interview anybody else.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>Why not? How can you stop them?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>Because I just said.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They shut him down.</p>                \n                \r\n\n            \n                <p>Now, we should point out that both President Obama and Hillary Clinton have also been silent on Kate's Law. So we have to assume they oppose it. Again, that's scandalous. It's a very simple concept that would protect all Americans. Mandatory prison terms would give law enforcement another tool to dismantle gangs operating in the U.S.A. and would discourage convicted aggravated felons from coming back here after being deported. But, once again, the Democratic Party will not support Kate's Law.</p>                \n                \r\n\n            \n                <p>It is beyond a reasonable doubt the DNC is incredibly radicalized. There don't seem to be any moderate Democrats anymore because if you are a moderate Democrat you are scorned by your peers. That's why Harry Reid can get away with killing Kate's Law which, of course, would prevent even more killing.</p>                \n                \r\n\n            \n                <p>My apologies to the family of Kate Steinle -- you do not deserve this. And I'm not giving um. We will get that to the senate floor again. They need 60 votes. And we will try to convince some Democrats to support it. That's all I can do.</p>                \n                \r\n\n            \n                <p>That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: What has happened to the Democratic Party?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/5", "date": "2015-11-06T13:03:38Z"}