{"vcmId": "b355180e-cdc3-42e0-897d-49cec9a5fb28", "url": "http://www.foxnews.com/transcript/2014/09/30/oklahoma-beheading-incident.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><em>This is a RUSH transcript from \"The O'Reilly Factor,\" September 29, 2014. This copy may not be in its final form and may be updated.</em></p>                \n                \r\n\n            \n                <p><em>Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</em></p>                \n                \r\n\n            \n                <p>O'REILLY: \"Personal Story\" segment tonight -- the Oklahoma beheading incident. Tomorrow 30-year-old Alton Nolen will be charged with murder and a variety of other crimes. Nolen is suspected of beheading 54-year-old Colleen Hufford and attacking another woman last Thursday after being fired from his job on a production line at a food processing plant. Nolen recently converted to Islam. And obviously people are worried about that connection, especially since Nolen gave the ISIS hand signal in a photo.</p>                \n                \r\n\n            \n                <p>But no matter what he does, the left wing in America will downplay it.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>UNIDENTIFIED FEMALE: I would be remiss not to bring up the story out of Oklahoma. It is a story that I read as a work place violence story.</p>                \n                \r\n\n            \n                <p>One of the women -- her head is severed but then this gets said at the conference. Let's just listen for a moment.</p>                \n                \r\n\n            \n                <p>UNIDENTIFIED MALE: After conducting interviews with co-workers of Nolen, information was obtained that he recently tried -- started trying to convert some of his co-workers to the Muslim religion.</p>                \n                \r\n\n            \n                <p>UNIDENTIFIED FEMALE: And then that's it. And now -- and now this is somehow about Islam.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: Of course it's about Islam. Guy is most likely a copycat killer.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington Mary Katharine Ham and Juan Williams both are Fox News analysts. You know it gets to the point, Juan, where it's almost a caricature. There is nothing else you can say. Or am I wrong?</p>                \n                \r\n\n            \n                <p>JUAN WILLIAMS, FOX NEWS POLITICAL ANALYST: No. I think you are right. I mean, look, you can't call every abhorrent act done by somebody who is, you know, converted to Islam or, you know, you can't say all of it is terrorism. I mean some of it is done by people who are -- this guy has a criminal history, coke possession, assault on a police officer, a bad personnel record, he had some problems.</p>                \n                \r\n\n            \n                <p>But to ignore the idea that he recently converted to Islam, to ignore the fact that in an era or you know, last month or two where we have had these beheadings that he then killed somebody by beheading them -- that's a very specific act, and then say oh, it has nothing to do with Islam? Gee whiz, I think is he a copycat as you said, Bill.</p>                \n                \r\n\n            \n                <p>But I think that people who just don't want to see that connection are kind of ignoring what is staring them in the face.</p>                \n                \r\n\n            \n                <p>O'REILLY: She is not ignoring it. She is flat out deriding anyone who would make the connection.</p>                \n                \r\n\n            \n                <p>WILLIAMS: Right he's calling us all -- guessing we are all bigots for saying it. But the reality --</p>                \n                \r\n\n            \n                <p>O'REILLY: That's next.</p>                \n                \r\n\n            \n                <p>WILLIAMS: But that's not the fact. The fact is you are seeing a clear pattern.</p>                \n                \r\n\n            \n                <p>O'REILLY: Of course not. All right Mary Katharine.</p>                \n                \r\n\n            \n                <p>MARY KATHARINE HAM, FOX NEWS CONTRIBUTOR: Yes.</p>                \n                \r\n\n            \n                <p>O'REILLY: When you hear this lunacy. And you know this is a person who is on a national television program. When you hear this, what goes through your mind?</p>                \n                \r\n\n            \n                <p>HAM: Look it's just -- it's willful blindness. It doesn't have to all be about Islam. But this is part of the equation. It's what the FBI is investigating. This is the fact that issue at the press conference. And the fact is there can be a whole discussion between run of the mill tragic work place violence and terrorism that specifically linked to al Qaeda or something. In the middle there is lone wolves, lone wolves who are inspired by people.</p>                \n                \r\n\n            \n                <p>We'd like to know who they were inspired by and this is we should note America's first work place beheading which seems to have a lot of weight and it tends to be one string of religious extremist who's is interested in it.</p>                \n                \r\n\n            \n                <p>O'REILLY: And then to top it all off -- to top it all off. The alleged murderer gives the ISIS hand signal.</p>                \n                \r\n\n            \n                <p>(CROSSTALK)</p>                \n                \r\n\n            \n                <p>WILLIAMS: Well come on I don't know about that.</p>                \n                \r\n\n            \n                <p>O'REILLY: Well no Juan, Juan.</p>                \n                \r\n\n            \n                <p>HAM: And the other thing Bill one more thing, wait hold on.</p>                \n                \r\n\n            \n                <p>O'REILLY: Wait, wait, Juan just said he doesn't know about that it's captured.</p>                \n                \r\n\n            \n                <p>WILLIAMS: No, no. I know about it but I don't see that that is some huge signal. We're not sure what that guy was doing.</p>                \n                \r\n\n            \n                <p>O'REILLY: It's a connector. It's a connector.</p>                \n                \r\n\n            \n                <p>HAM: Let me say.</p>                \n                \r\n\n            \n                <p>WILLIAMS: Ok now he said but look, he had -- he had a tattoo for Jesus on his arm. He has another Muslim tattoo. What I'm saying to you is that Mary Katharine has made the point. The FBI said this is work place violence. They are not sure the motive. Nobody is rushing to any conclusion here.</p>                \n                \r\n\n            \n                <p>O'REILLY: Obviously it's work place violence, it's a copycat --</p>                \n                \r\n\n            \n                <p>WILLIAMS: But to ignore the reality. Is that what that woman did, on that other channel, she is trying to avoid what's obvious because it doesn't fit her ideological thinking.</p>                \n                \r\n\n            \n                <p>O'REILLY: Ok.</p>                \n                \r\n\n            \n                <p>HAM: Well here's the thing. The same people Bill on the same channel are perfectly comfortable jumping to conclusions about say the marathon bombing because of nothing more than the date. Which you will remember was April 15th. And so they decided that that was Patriot's Day, it was tax day it has something to do with right wing violence and they were perfectly comfortable assigning that kind of violence. they're just not comfortable with assigning it on way that doesn't confirm their narratives.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right enough of these crazy -- enough of these insane people.</p>                \n                \r\n\n            \n                <p>All right what about the -- the Hume discussion where I said that things are changing in America right now quickly. And the President is losing credibility in the sense that he can defend the nation. Do you think that's true, Mary Katharine?</p>                \n                \r\n\n            \n                <p>HAM: Look, I think I would add something to your \"Talking Points\", something that really has hit close to home quite literally for the President which is we got this news today I think from \"The Washington Post\" breaking these various Secret Service stories about how the guy who ran across the lawn got into the White House and beyond the main entrance.</p>                \n                \r\n\n            \n                <p>So you're looking at just the most concentrated and sort of arguably most --</p>                \n                \r\n\n            \n                <p>O'REILLY: Protect -- well protected.</p>                \n                \r\n\n            \n                <p>HAM: -- right protected area and they can't even concentrate on that successfully. That gives me pause.</p>                \n                \r\n\n            \n                <p>O'REILLY: I'm not trying -- I don't really see the linkage though. I don't -- that is just an incompetency if it's true on the part of certain agents.</p>                \n                \r\n\n            \n                <p>HAM: Right how widespread is that incompetency?</p>                \n                \r\n\n            \n                <p>O'REILLY: But, Juan, the American people are starting to say to themselves and the polls prove this we don't believe the Commander-in-Chief is tough enough to defend us.</p>                \n                \r\n\n            \n                <p>Last word, Juan, 30 seconds.</p>                \n                \r\n\n            \n                <p>WILLIAMS: No I don't think that's real. I think what people are saying is, is I think I saw a poll like this today Bill, they say he is a dub. And I think is he a dub. I don't think he wants to go to war. I think that he predicated his whole political career on getting us out of war.</p>                \n                \r\n\n            \n                <p>But look, we've had no major terrorist accidents or acts in this country while he has been president. In fact increase the troops --</p>                \n                \r\n\n            \n                <p>(CROSSTALK)</p>                \n                \r\n\n            \n                <p>O'REILLY: No foreign intrusion.</p>                \n                \r\n\n            \n                <p>WILLIAMS: -- the troops presence in Afghanistan.</p>                \n                \r\n\n            \n                <p>HAM: It's called work place violence.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right.</p>                \n                \r\n\n            \n                <p>WILLIAMS: Yes and we are -- I think we're safer in many ways. He has dedicated to that. I think that's very clear that's not fair to say about him.</p>                \n                \r\n\n            \n                <p>HAM: And can be dedicated to it and also not very good at it.</p>                \n                \r\n\n            \n                <p><em>Content and Programming Copyright 2012 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2012 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</em></p>                \n                \r\n\n            \n\n            \n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The Oklahoma beheading incident", "description": "This is a RUSH transcript from \"The O'Reilly Factor,\" September 29, 2014.", "date": "2014-09-29T04:00:00Z"}