{"vcmId": "b3661b75-3af6-469a-a99a-cc0c89210b4d", "url": "http://www.foxnews.com/transcript/2015/08/25/another-bad-day-for-stock-market.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 24, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>No \"Talking Points Memo\" this evening because we have a lot of news to cover, including an interview with Donald Trump. Usually at the end of August, very slow news time. Not this year.</p>                \n                \r\n\n            \n                <p>Another bad day for the stock market, trillions of dollars have been lost all over the world, adding to the already soft economy here in the U.S.A. Millions of Americans are angry that President Obama has not shored up the economic situation and that problems like illegal immigration are not being dealt with effectively.</p>                \n                \r\n\n            \n                <p>That is the reason Donald Trump's campaign has caught fire, anger. Last Friday about 30,000 people showed up to hear Donald Trump speak in Alabama. The crowd was raucous, obviously not happy with the way things are going in the U.S.A. As you may know, Mr. Trump's polling numbers remain strong leading to fear and loathing in some political precincts.</p>                \n                \r\n\n            \n                <p>So joining us now from his New York City headquarters is Mr. Trump. First of all, why do you think the stock market is going down?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Well, you look at what's going on with China or generally with Asia and, you know, I have been saying for a long time on your show and on anybody else that wanted to listen that we're tying ourselves so closely to Asia and, in particular, to China, that this is going to be trouble for our country. And not only now have they taken our jobs and they are taking our base and they have taken our manufacturing, but now they are pulling us down with them.</p>                \n                \r\n\n            \n                <p>I said we can't do this. We can't allow this to happen. And we have to do a big uncoupling pretty soon before it's too late. I have been saying this for a long time, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Do you have any theory about why the Chinese economy is collapsing? Do you have any knowledge of it at all?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Because it's funny money. They devalue their currency constantly in order to take our jobs and lots of other countries' jobs frankly. They have done a pretty big number in Europe, too. Not as good as they have done to us.</p>                \n                \r\n\n            \n                <p>You know, I said the other day this is the greatest theft in the history of America with the money that they have taken out. We have rebuilt China. But now it's gotten to a point they have devalued their currency to take even more from us. And we have nobody that's competent. We have nobody that knows what's happening. We have nobody that knows how to handle China.</p>                \n                \r\n\n            \n                <p>And, believe me, we have all the cards. But, they have devalued to a point where they wanted to take even more money out, even more jobs out, increase and all of a sudden they have a big, fat beautiful balloon that is popping right now. But it's taking us with us.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Very briefly, say you are talking to somebody on the street and they go Mr. Trump, I don't really understand what devalue the currency means. What does that mean to me? I buy stocks in my IRA. I expect them to be, you know, profitable. And now they are not because of China devaluing -- devaluating their economy. What does that mean?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, they are not devaluing their economy. They are actually in some ways increasing there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I mean their currency, the yuan.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They are devaluing their currency and by doing that they are cheapening their currency and they are making it very inexpensive. They will be able to make goods for far less than our goods.</p>                \n                \r\n\n            \n                <p>You know, we make great product. But it's impossible to compete when the product is so much more expensive. Eventually what they are doing leads to depression, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. They have a billion and a half people. They are flooding money into the provinces around, so the people don't starve because there is not enough legitimate business to support a billion and a half people. So, therefore, when they pay us --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> -- they are taking it from us. Bill, the problem is they are taking the business from us. So, they don't want their people to starve. We all agree with that. That's wonderful. What they are doing is they want our people to starve. They are taking our business away. They have taken our jobs away.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I got it, I got it. U.S. companies, they go over there voluntarily because the labor is cheaper. But now the U.S. companies are being paid back with money, that's not worth as much money as they made a deal. So they are getting hosed, aren't they?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, not only that. How about we owe them $1.4 trillion and those dollars become strong. You know, the word strong dollar sounds good, but it's costing us a lot of money. There is some nice things about having a strong dollar, but there is some really bad things. And number one bad thing is we're not exporting anything. We are going to be in big trouble. It's getting worse and worse.</p>                \n                \r\n\n            \n                <p>And ultimately, the balloon is going it pop, and it's going to get very ugly. You are starting to see the beginning of that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. Now, the reason that a lot of politicians favor the trade with China, is because when China is tethered to us by having so much of our debt, holding our bonds, it's less likely they will cause military trouble to us. So, if you are tethered to somebody economically, if your welfare means their welfare then it's easier to control them. That is the original intent of all these Chinese deals, is it not?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I don't think so at all. I don't think it's the intent. It's not the military intent. If you look at China with the wars with Japan, Japan would constantly beat them in wars. So I don't think that's the problem.</p>                \n                \r\n\n            \n                <p>I think the problem that we have is that we have a country that got away with murder for many years. They have built their bridges, their roads, their everything. They have built infrastructure, their airports like we don't see in this country. Where are we building airports and look at LaGuardia Airport. Look at Kennedy. Look at LAX and Los Angeles. They are like third world airports.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Ok, but we're wandering away. So you are not buying the fact that keeping your enemy close --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> -- no, I don't believe that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Keeping your enemy close is a good geopolitical strategy? You don't buy that.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>No, I don't believe that. I don't believe that ever took place. I think that what has happened is China has gone out of its way to devalue. They got away with it they kept devaluing. And all of a sudden they built this monster but they have also built a monster bubble.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. Two people coming to the United States of note in September, the Pope, ok, and the President of China is coming. A man named Xi Jinping. Do you know Xi Jinping? him? I have never heard of him. I don't know who he is. He is the President.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Very smart.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He is coming over. He is getting a big dinner free at the White House, addressing the U.N. If you were president of would you be throwing him a dinner?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I would not be throwing him a dinner. We've had this conversation -- I would get him a McDonald's hamburger and say you we have to get down to work because you can't continue to devalue. You know, we will give him a steak dinner and what he has done is sucked all of our jobs. And he suck some money right out of our country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Again, he hasn't done it. U.S. companies do it. They are doing it. So, you would be confrontational with the Chinese? You are saying look, I'm not giving you a dinner.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Excuse me --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Here is a big mac? I mean really is that what you are going to do?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I would give him a very -- yes, but I'd give him a probably a double sized big mac.</p>                \n                \r\n\n            \n                <p>Look, it's not so much the companies. It's our government that allowed China to do this to us.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't buy that for a second.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>The problem with -- I do 100 percent, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Those companies, they go over there because they want as much money as they can. They go to Mexico. Our government lets them do it but this is a free nation. So they want --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: But our government.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- to go over and do it, you can't stop them. Now, you could punish them.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Bill, our government, our government should have stopped China from devaluing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They can't.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> They never even bring them up. It's the numbers -- of course, they can.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Do you know how they can?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, how.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Very simply, Bill, it's so simple. They put a tariff on Chinese goods.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Then you have got a trade war.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>You have to do that. And then you bring it back to normal. You have no choice. You do that. Our government doesn't even -- by the way, China does it to us. Do you think that we sell to China without a tariff? They call it a tariff. I call it a tax.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>There is no question the imbalance --</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>China is taxing our goods.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>There's no question the imbalance is that way.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>There's a total imbalance -- do you know what the big imbalance is? Intelligence. Their leaders are intelligent. Ours aren't. We don't know what we are doing. We had to do this and it should have taken place a long time ago, and you wouldn't have this bubble right now, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. So I'm not going to get Xi Jinping and you together. I was going to take you both out to dinner I'm not doing that. So I think it might be --</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I'd get along with him very well. I have great relationship with China and Chinese --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You'll be vacationing in the Yellow Sea with him, I know.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Another bad day for the stock market", "description": "Donald Trump reacts to latest Wall Street woes", "date": "2015-08-25T12:12:00Z"}