{"vcmId": "b3a3d3df-59a6-46f6-8b8f-e0b254dedae8", "url": "http://www.foxnews.com/transcript/2015/04/17/bill-oreilly-hillary-clinton-on-campaign-trail.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>After just a few days, the Clinton campaign has already become fodder for pundits and comedians.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEOCLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b> (voice-over): This scene in Iowa of nutty media people chasing her van got worldwide attention.</p>                \n                \r\n\n            \n                <p><b>(END VIDEOCLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY </b>(on camera): And it seems everything Mrs. Clinton does gets attention, mostly negative.</p>                \n                \r\n\n            \n                <p>Unlike the Republican candidates for president, Hillary Clinton has not subjected herself to press interviews, and that has brought her criticism. But look at it from her point of view. She has little to gain and a lot to lose by sitting down with skeptical media folks.</p>                \n                \r\n\n            \n                <p>Everybody knows Hillary Clinton, and most Americans have a strong opinion about her one way or the other. Without a definite opponent, she really doesn't have to convince anyone about anything.</p>                \n                \r\n\n            \n                <p>However, if a strong Republican challenger emerges, then Hillary Clinton will have to do some interviews, but believe me, they will be few and they will be well chosen to put her in a favorable light.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEOCLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b> (voice-over): You may remember, I interviewed Mrs. Clinton back in 2008 when she was running against Barack Obama. That interview took place near Notre Dame University in Indiana. It was fine. She made her points, I made my points.</p>                \n                \r\n\n            \n                <p><b>(END AUDIOCLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b> (on camera): I hope we can duplicate that, but I'm not running after her van. I am not running after the van. Does everybody understand me? The Scooby-Doo vehicle will just have to roll on without me. At this point, Americans expect Republicans to hammer Hillary Clinton. What else is new? Well, here's what else. Some liberals have doubts.</p>                \n                \r\n\n            \n                <p><b>(BEGIN AUDIOCLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. BERNIE SANDERS, (I-VT): </b>Why don't you tell me what Hillary Clinton is campaigning on. Do you know? You don't know, and I don't know, and the American people don't know, so it's premature.</p>                \n                \r\n\n            \n                <p><b>(END VIDEOCLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> In just a few moments we will talk with Senator Sanders.</p>                \n                \r\n\n            \n                <p>For whatever reason, there is deep skepticism on the far left about Mrs. Clinton. She's certainly not as liberal as Barack Obama, especially on foreign policy, and she does not seem to connect with regular folks the way Mr. Obama has. And then there is the honesty factor, especially regarding Benghazi and her emails.</p>                \n                \r\n\n            \n                <p><b>(BEGIN AUDIOCLIP)</b></p>                \n                \r\n\n            \n                <p><b>REP. TREY GOWDY (R-SC): </b>We most assuredly need to talk to her about Benghazi, and, again, I want to be fair to her. She's never indicated that she would not come, but I also am going to be very firm that it is a condition precedent to my being able to talk to her about Benghazi for me to understand that I have all the documents I'm entitled to.</p>                \n                \r\n\n            \n                <p><b>(END AUDIOCLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, good luck. Congressman Gowdy, the chairman of the House Select Committee on Benghazi, is a bulldog, so news may be forthcoming. But he's never going to get those emails. Those emails are vapor.</p>                \n                \r\n\n            \n                <p>Summing up, Hillary Clinton's first week on the campaign trail, kind of bizarre, and Talking Points believes that condition may continue right up to election day 2016.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Hillary Clinton on the campaign trail", "description": "Bill O'Reilly's Talking Points 4/16", "date": "2015-04-17T12:09:08Z"}