{"vcmId": "b54524b0-37ae-4bf3-98f5-4e2856c92cbb", "url": "http://www.foxnews.com/transcript/2016/06/15/is-terrorism-expanding-under-president-obama.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 14, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Impact\" segment tonight.</p>                \n                \r\n\n            \n                <p>Reaction, my talking points, unacceptable losses. Joining us from Washington, Kirsten Powers. So, you heard the stats from the Rand's study that under President Obama's watch, terrorism is expanding, what say you?</p>                \n                \r\n\n            \n                <p><b>KIRSTEN POWERS, FOX NEWS ANALYST</b>: I mean, I'm not surprised that terrorism is expanding. I mean, I think this study is from 2014. Right? And so, you know, I don't know what's happened in the last couple of years.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It's gotten worse in the last couple years.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Yes, it would strike me as a true statement. I think that we've obviously, I don't know who would dispute the fact that terrorism has expanded in the world.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. Isn't that a bad thing though?</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Doesn't the President bear responsibility at least some for that?</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: I don't know. Because, you know, we have talked about this before in terms of --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But he is the leader. He is the leader of the country.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: I know. But you believe that we can eradicate terrorism and I'm less inclined to belief that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't think that we can eradicate it. I believe that we can defeat it.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: There are some things we could have done differently for sure. I mean, first of all, he under estimated the threat. We can start there. You know, calling ISIS the jayvee team.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. But let's not dwell on that. Let's not dwell on that.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: If you think they are jayvee team, you are probably not going to respond to them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Look, I entitled my memo, \"Acceptable Losses\" because that is the philosophy in place in Washington right now.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That, we have to bear it. We have to bear Orlando and we have to bear Boston and San Bernardino and Paris and Brussels. We have to bear it. We can't actually join together in a NATO alliance and say, you know what? Here they are, Raqqa, Syria, we know they are there. They are in Libya in this town on the Libyan coast. We know they are there. You know, we are going to organize. We're going to go in. We're going to take care of them. We're going to show the world that this is not going to continue on our watch. We're going to declare war, Congress is, we're going to use the war powers act to investigate people like Mateen --</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- in a more aggressive way. Doesn't that make sense to you?</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> But, so you are very focused on this than you were with Colbert as well about declaring war on ISIS, the President wants to do this.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No he doesn't.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Yes, he does. Yes, he did. He wanted --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> When? When did the President --</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: He said -- no, he said in his State of the Union that he wanted authorization and Republicans made it very clear that they weren't going to vote for it because it wasn't the authorization that they wanted.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: But it is something that he wants and it is something that he should have, frankly. Because --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I dispute that he has ever asked and we have the speaker of the house tomorrow, Paul Ryan --</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And I'm going to ask him, has the President ever come to you and asked for you to put forth a declaration --</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: He may not have made a formal request but he definitely said that he wanted it and the Republicans made it clear they are not going to give it to them.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>Rewind the tape and it's exactly what I said the first time.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm going to ask Mr. Ryan if the President has ever come to him and asked for a declaration of war.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Well, that's not what I said that he did.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: So, you can ask him whatever you want. What I said is that he wants that he is in agreement with you on that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No, he's not.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> And I don't know why you can't see that there is agreement on that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Rhetoric in action. Leadership is needed to defeat evil. You would see that, right? So in World War II we had Churchill, right? In the cold war we had Reagan. And the war on terror we have Obama. Do you not see the difference?</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Yes. So, here's the thing. You are suggesting that President Obama has not done nothing and --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>He hasn't done what you wanted him to do, which is, go to war. And that is not what most people want to do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That is wrong. I believe that. In a poll most people would want a declaration of war --</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> No, no, no. I don't say declaration of war. There is a difference of sending ground troops somewhere and having a declaration of war. What you want is ground troops.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, bottom-line is to you, the acceptable losses theory is okay with Kirsten Powers. That is the bottom-line.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Actually it's not the bottom-line. I think that you need to do a lot of the things to try to stop terrorism and I think that President Obama has done that. And the one thing that you don't want to talk about really. Although I have to say, you did talk about it a bit in your talking points but I still don't understand exactly how it would work of getting rid of the type of guns.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Congress passes.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> That was used to kill 50 people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It's a very simple, Congress passes laws, they did in 1994, certain type of weaponries, certain type of rifles are not allowed to do be sold in the U.S.A.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: So, you think we should ban that rifle?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't know enough about rifles. I want Congress to debate it and I want a vote on it.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Okay. So you are open to it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's the way we do it. Okay? That is the way we do it.</p>                \n                \r\n\n            \n                <p>All right, Kirsten, thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Is terrorism expanding under President Obama?", "description": "Kirsten Powers joins 'The O'Reilly Factor' to discuss the spread of radical Islam", "date": "2016-06-15T12:14:43Z"}