{"vcmId": "b6eaa187-4048-4898-aa98-fc3d0463a414", "url": "http://www.foxnews.com/transcript/2017/01/06/bill-oreilly-putin-trump-and-election.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Today in Washington, the Senate Armed Services Committee held hearings about Russia allegedly subverting the presidential election.</p>                \n                \r\n\n            \n                <p>Front and center was the Director of National Intelligence, James Clapper.</p>                \n                \r\n\n            \n                <p><b>JAMES CLAPPER, DIRECTOR OF NATIONAL INTELLIGENCE</b>: \"The Russians have a long history of interfering in elections&#8212;theirs and other people&#8217;s. ((EDIT)) But I don&#8217;t think we&#8217;ve ever encountered a more aggressive or direct campaign to interfere in our election process than we&#8217;ve seen in this case.\"</p>                \n                \r\n\n            \n                <p>Talking Points believes Mr. Clapper. &#160;However, there has been no definitive proof put forth that Russia and its leader Vladimir Putin did try to interfere with our vote.</p>                \n                \r\n\n            \n                <p><b>JAMES CLAPPER, DIRECTOR OF NATIONAL INTELLIGENCE</b>: \"We have invested billions and we put people&#8217;s lives at risk to glean such information. &#160;And so if we were to fulsomely expose it in such a way that would be completely persuasive to everyone, then we can just kiss that off. &#160;Because we will lose it.\"</p>                \n                \r\n\n            \n                <p>Mr. Clapper saying he cannot expose his sources or explain how the USA got the information about the Russian hacking.</p>                \n                \r\n\n            \n                <p>So this becomes a very complicated matter because some Democrats are charging that the hack of Democratic stalwarts like John Podesta influenced votes.</p>                \n                \r\n\n            \n                <p>Republicans say nonsense - that the exposed emails simply pointed out political intrigue and press corruption.</p>                \n                \r\n\n            \n                <p>It is impossible to say if any votes were influenced by Podesta's rantings but it seems far-fetched to me.</p>                \n                \r\n\n            \n                <p>Despite the intel consensus, President-elect Trump is not accepting of the verdict against Putin.</p>                \n                \r\n\n            \n                <p>Mr. Trump will be briefed tomorrow by intelligence leaders and maybe that will change.</p>                \n                \r\n\n            \n                <p>For you and me, Americans who sincerely want fair elections and justice, the hacking should be a serious matter.</p>                \n                \r\n\n            \n                <p>Again Talking Points believes the Russians were involved with the intent to create as much chaos as possible for America.</p>                \n                \r\n\n            \n                <p>And nothing happens in Russia at that level unless Putin approves.</p>                \n                \r\n\n            \n                <p>But Putin is not holding a smoking gun because US intelligence has to protect its sources of information.</p>                \n                \r\n\n            \n                <p>Summing up, the Russians did it. &#160;Putin knew about it. &#160;And President-elect Trump has to decide if further action against Russia is necessary.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Putin, Trump and the Election", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/5", "date": "2017-01-06T12:58:57Z"}