{"vcmId": "b9df7b91-9d22-4286-9cbd-6de7f73b21b6", "url": "http://www.foxnews.com/transcript/2017/03/10/calls-for-comey-to-testify-on-leaks-and-cyber-attacks.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 9, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Impact Segment\" tonight, as we reported last night, so members of the House Judiciary Committee have asked the FBI Director James Comey to testify about classified information leaks and cyber-attacks.</p>                \n                \r\n\n            \n                <p>Joining us from Washington, two members of that committee, Congressman Eric Swalwell, Democrat from California. And Louie Gohmert, Republican from Texas.</p>                \n                \r\n\n            \n                <p>So, Congressman Gohmert, you did not sign a letter asking for Mr. Comey to appear. You do not think it is worthy?</p>                \n                \r\n\n            \n                <p><b>REP. LOUIE GOHMERT (R-TX), HOUSE JUDICIARY COMMITTEE:</b> Well, two places in the letter, it mentions wanting to be briefed by Comey about the Russian situation, and for anybody that does watch FOX, and we know that is a big audience, we have seen reports about the CIA actually says they have the capability to hack in and leave a Russian footprint. We had heard clearly from a number of people that there is absolutely no evidence of the Russians interfering with our election.</p>                \n                \r\n\n            \n                <p>I think it is a waste of time. What I'm more concerned about, Bill, is the people within the Intelligence Committee that have lied to us in Congress and lied to those office that's been on the Judiciary Committee for a while, when they have said, look, you'll never know. If it picks up an American citizen, that name will be masked, it will take a court order to release that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. But Comey could address that. You see, look, I understand what you're saying.</p>                \n                \r\n\n            \n                <p><b>GOHMERT</b>: They want to know about the Russian situation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You're never going to get to the bottom of that in the testimony before your committee.</p>                \n                \r\n\n            \n                <p><b>GOHMERT:</b> That is right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But what you will get is an overview of what the FBI is doing and how it sees this. How about you Mr. Swalwell? I mean, some Democrats don't even want to hear from Comey. Do you?</p>                \n                \r\n\n            \n                <p><b>REP. ERIC SWALWELL (D-CA), HOUSE JUDICIARY COMMITTEE:</b> I do and I have faith in our intelligence community. Because they are always guts. They're protecting our National Security. But the guts in this investigation continue to connect Donald Trump and his team, to Russia. And the biggest question now is whether they were working with Russia while the attack on our democracy was going on.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. Can you give me one piece of evidence that supports that theory? The that theory because I don't have it here.</p>                \n                \r\n\n            \n                <p><b>SWALWELL:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: One piece of evidence that Russia colluded with the Trump campaign.</p>                \n                \r\n\n            \n                <p><b>SWALWELL</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Give me one.</p>                \n                \r\n\n            \n                <p><b>SWALWELL</b>: And Bill, right now, there's prior personal, political, and business ties and the investigation that we would like to see is whether they --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But Congressman, give me one piece of solid information connecting the campaign and the rest of --</p>                \n                \r\n\n            \n                <p><b>SWALWELL</b>: Carter Page, a month if was revealed that Russia is attacking us, travels over with the campaign's permission to Russia. Now, I don't know why anyone would go to a country that is attacking us during a presidential campaign who is the President's foreign policy advisor. We need to run that one down.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Congressman Gohmert, do you know anything about Carter Page travelling to Russia?</p>                \n                \r\n\n            \n                <p><b>GOHMERT:</b> Well, I understand that he had no official tie with the Trump campaign but that he did have some conversations, some ties to Russia, but that is not the Trump administration. But, Bill, having watched your show most every night, often much on rerun. But still just as cogent when it's a rerun. But the real issue, the real threat to our Democratic Republic is that we have intelligence officers who have gained access to information by the powers Congress has given them. They've lied to Congress about how --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you know who is lying now? Can you give me a name?</p>                \n                \r\n\n            \n                <p><b>GOHMERT</b>: -- and now they're using it to manipulate --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. I got it, I got it, I got it, can you give me a name? Somebody has lied to you? Can you give me somebody?</p>                \n                \r\n\n            \n                <p><b>GOHMERT</b>: Well, what I can tell you is, we have been told -- going back to the Bush administration, that you never have to worry --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I got that, and Flynn was a private citizen --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>GOHMERT</b>: And now we have found out they are not masked. The conversations aren't --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, that is a big deal. I mean --</p>                \n                \r\n\n            \n                <p><b>GOHMERT</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It's a big deal.</p>                \n                \r\n\n            \n                <p><b>GOHMERT</b>: Because there are people from both administrations --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't know. You know guys --</p>                \n                \r\n\n            \n                <p><b>GOHMERT</b>: Never happened and now it's happening.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I appreciate you both coming on, but I don't know if we're ever going to get to the bottom of this.</p>                \n                \r\n\n            \n                <p><b>GOHMERT</b>: We got to. We really do need to get to the bottom of this.</p>                \n                \r\n\n            \n                <p><b>SWALWELL</b>: I agree on that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>GOHMERT:</b> This is dangerous stuff.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It is absolutely dangerous. There is no doubt about it. When a sitting president can't have a conversation with the president of Mexico without being to pay the next day. Dangerous.</p>                \n                \r\n\n            \n                <p><b>GOHMERT</b>: Bill, let me tell you one way to get to the bottom --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I've only got 20 seconds.</p>                \n                \r\n\n            \n                <p><b>GOHMERT</b>: What I have said repeatedly, you guys keep saying how important this is to have this power, if you don't give us the leakers and how this happened, I will join with my Democratic friends, and we will eliminate your power to do this.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. We appreciate it, guys. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Calls for Comey to testify on leaks and cyber attacks", "description": "Will the FBI investigate? 'The O'Reilly Factor' examines the latest", "date": "2017-03-10T13:17:42Z"}