{"vcmId": "ba2c32c5-85c7-4ec6-9a90-3da2ade63b4b", "url": "http://www.foxnews.com/transcript/2015/02/20/bill-oreilly-more-proof-american-media-is-corrupt.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>This man, 56-year-old David Corn, who works for the far left magazine \"Mother Jones\", smeared me, your humble correspondent yesterday, saying I fabricated some war reporting. \"Mother Jones\" which has low circulation, considered by many the bottom rung of journalism in America.</p>                \n                \r\n\n            \n                <p>However, in this Internet age, the defamation they put forth gets exposure. And so I have to deal with this garbage tonight. I'm sorry.</p>                \n                \r\n\n            \n                <p>Basically David Corn, a liar, says I exaggerated situations in the Falklands War and the Salvadoran War. Here is the truth. Everything I've said about my reportorial career, everything, is true. 33 years ago in June, Argentina surrendered to Great Britain ending the Falklands War. I was covering the conflict from Argentina and Uruguay for CBS News.</p>                \n                \r\n\n            \n                <p>After learning of the surrender, angry mobs stormed the presidential palace at Casa Rosada, trying to overthrow the government of General Leopoldo Galtieri. I was there on the street with my camera crews. The violence was horrific. Argentine soldiers fired into the crowd who were responding with violent acts of their own.</p>                \n                \r\n\n            \n                <p>My video of the combat led the CBS Evening News with Dan Rather that evening. Later on I filed a report that ran nationwide. That's what happened. I never said I was on the Falklands Islands as Corn purports. I said I covered the Falklands War, which I did.</p>                \n                \r\n\n            \n                <p>Now, in what I consider to be a miracle, I found this CBS internal memo from 33 years ago, praising my coverage that day. The cable was sent to the CBS bureau chief in Buenos Aires by the news desk here in New York City. Quote, \"Doyle, O'Reilly didn't have the time last night but would like to say many thanks for the riot piece last night.\" WCBS TV and WCAU TV both took the entire pieces and said they're stripping it for pick. They called to say thanks for a fine piece. \"Thanks again, your piece made the late feed a winner last night,\" unquote.</p>                \n                \r\n\n            \n                <p>Want more? Here it is. Shortly after my crew and I escaped grave danger on the streets of Buenos Aires, I wrote to CBS News (inaudible) Ed Joyce praising the crew's bravery. I have the letter quote, \"The crews are great. The riot had been very bad. We were gassed, shot at. And I had the best vantage point in which to report the story.</p>                \n                \r\n\n            \n                <p>So we have rock solid proof that David Corn smeared me. And some Web sites have picked up his defamation, did as well. Now, I had to spend hours last night on the phone with various reporters and crawling around my basement covered with dust trying to find documents from 33 years ago. Again it was a miracle I found them. All because an irresponsible guttersnipe, a far left zealot who has attacked fox news many times before spit the stuff out on the net.</p>                \n                \r\n\n            \n                <p>You know what? Nothing is going to happen to David Corn. \"Mother Jones\" and the far left websites couldn't care less about the truth. They're in the business to injure. This is a political hit job. At this point, TV coverage has been scant, but CNN tried to exploit the situation because a guy over there named Brian Stelter is another far left zealot masquerading as a journalist. CNN can do a lot better than this guy.</p>                \n                \r\n\n            \n                <p>Real journalists knew the story was BS from the jump. They knew Corn was trying to take the Brian Williams situation and wrap it around my neck for ideological reasons because he has a history of attacking fox news. In addition, Corn actually wrote that I hammered Brian Williams when everybody knows I went out of my way on Kimmel and The Factor to be compassionate to the man.</p>                \n                \r\n\n            \n                <p>Corn must think the folks are as dumb as he is. The whole scandal reminds me of another guy who completely got away with it. That man is Al Franken, who years ago accused me of faking my working class upbringing. He actually said in public many times I was not raised in Levittown. He ran around telling that to the media who gleefully printed his words. Despicable Franken, perhaps the biggest liar I've ever known wouldn't even retract when I produced this -- the deed to my parents' house.</p>                \n                \r\n\n            \n                <p>It says Levittown, Al. But you, a dishonest smear merchant wouldn't retract your false story. And I'm sure Corn won't either. What happened to Al Franken? Elected a senator from Minnesota. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: More proof the American media is corrupt", "description": "Talking Points 2/20", "date": "2015-02-21T02:22:50Z"}