{"vcmId": "bb839276-799d-4eb0-a4f6-357b4516973a", "url": "http://www.foxnews.com/transcript/2015/12/02/bill-oreilly-left-secret-immigration-plan.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>In order to win the presidency in 2016, both the republican and the democratic candidate will have to get a good amount of votes from Hispanic Americans.</p>                \n                \r\n\n            \n                <p>On thanksgiving, the \"New York Times\" ran an editorial that pretty much laid out what the liberal viewpoint is on people coming to live in America. Point number 1: The left no longer distinguishes between illegal aliens and those who come here legally.</p>                \n                \r\n\n            \n                <p>All foreign nationals who enter are now described by the \"Times\" and others as immigrants. And, if you use the term illegal alien, you are a bigot. Point 2: The left believes that any fence on the southern border is nativist bigotry. That is a hateful action towards non-Americans, especially Hispanics.</p>                \n                \r\n\n            \n                <p>Point number 3: The left wants open borders. No restrictions on knows who come here. No detention. No physical barrier. No deportation proceedings unless the serious crime other than illegal entry is committed. And, if you disagree with that you are promoting an anti-immigrant police state.</p>                \n                \r\n\n            \n                <p>Point 4: The left says all immigrants again illegal and legal should be welcomed and assimilated. And, not only that the government should give them money to settle in and they should immediately be eligible for all the entitlements Americans can secure.</p>                \n                \r\n\n            \n                <p>Point 5: All illegal aliens already here should be put on a pathway to citizenship. The left wants full amnesty. And, finally, point number 6: The left wants free lawyers for all immigrants, so they can gather up the entitlements and citizenship requirements. At the end of the editorial in the \"New York Times\" the paper asks is that so radical?</p>                \n                \r\n\n            \n                <p>The answer, of course, is yes. Open borders, full amnesty, complete entitlement access is indeed radical and dangerous to public order and safety. But, that is the vision of the Democratic Party. Not everyone, not everyone. But you will not hear many democrats go up against that, as the Kate's law debate demonstrated.</p>                \n                \r\n\n            \n                <p>Now, many believe this is a pure political strategy that flooding the nation with foreigners, many of whom will get the right to vote strengthens the Democratic Party. But there is much more in play. The radical left, immigration vision, would profoundly change all of America's traditions, all of them, and that is what the left wants.</p>                \n                \r\n\n            \n                <p>Because that ideology sees the American Judeo-Christian tradition as oppressive, exploitative and a white privilege legacy. Thus, the Uber left wants traditional America wiped off the face of the earth. That is what is truly going on. And, if Americans do not wise up quickly, the left wing vision of immigration may very well become a reality.</p>                \n                \r\n\n            \n                <p>And, that is &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The left's secret immigration plan", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 12/1", "date": "2015-12-02T13:23:00Z"}