{"vcmId": "bbf3166f-5869-4be3-8c9c-ed0b5c0cbb9f", "url": "http://www.foxnews.com/transcript/2015/07/17/donald-trump-reacts-to-shooting-in-chattanooga.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" July 16, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And in the \"Impact Segment\" tonight, there is no question that terrorism will be a major campaign issue in the upcoming presidential race.</p>                \n                \r\n\n            \n                <p>A new Fox News poll released today has Donald Trump leading the GOP pack with 18 percent, Scott Walker in second, Jeb Bush third.</p>                \n                \r\n\n            \n                <p>Joining us now on the phone from New Hampshire where he is campaigning is Donald Trump.</p>                \n                \r\n\n            \n                <p>Now, you asked me in the break whether the military installations that were attacked today by the terrorists were, quote, \"gun-free zones\" which means the military people that were in there were not allowed to carry guns. The answer is yes they were not allowed to carry guns in those zones. What is your reaction to the attack today?</p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL CANDIDATE (via telephone): </b>Well, it's a lack of respect, Bill, for our country, for our officials, for our leaders. It's just total lack of respect. It's a breakdown and, frankly, a gun-free zone. These are four great marines from what everybody tells me, unbelievable people and that they are not allowed to carry guns is absolutely ridiculous.</p>                \n                \r\n\n            \n                <p>So what happens is this guy walks in, he has got a gun. They are just sitting there as targets. It's absolutely disgraceful.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> This is lone wolf situation, even if it's tied to ISIS. I mean it's a guy who went out by himself and wanted to kill American military people and police. Do you have any solution to lone wolf stuff?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Well, look, what we need in our country is better intelligence and if we can believe the previous report, the father wasn't exactly an angel. So he was under watch and he was under investigation and it looks like, you know, this is something that maybe goes from the father to the son. But the father didn't look like an angel, let's see, I guess that's going to have to be determined.</p>                \n                \r\n\n            \n                <p>But this guy, I mean we need better intelligence. How do you grow up and nobody in the area sees this. It seems inconceivable to me. We need stronger protection and better intelligence.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What about the backlash against Muslim Americans? You know, we really haven't had had that many terror attacks since 9/11. We cited a few -- they have all been Muslim generated except for the Charleston situation which was a racist kid. What about the backlash against Muslims? Do you think that will happen?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, at some point it's probably going to happen. And you know you have the term Islamic terrorism which the President refuses to use, even though there seems to be quite a bit of it. If you look around the world certainly it's there. There is something going on but it seems so sad that a whole group of people have to be blamed.</p>                \n                \r\n\n            \n                <p>But it does seem to be happening a lot, Bill. And whether it's here or in other countries it certainly is there. And there is a form of Islamic terrorism. President Obama refuses to use the term and nobody can quite understand why.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, I'm sure you have a theory on it, Donald.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Well, I think I won't say my theory right now. But, he should certainly, you know, if we're going to fight elements that are causing tremendous problems, at least we have to start maybe being not so politically correct.</p>                \n                \r\n\n            \n                <p>And this is happening. It's happening all over. It's happening outside of our country big league. It's going to get worse in our country. And we better start fighting a lot tougher than we are fighting right now, Bill. We are going in the wrong direction in so many different ways. Not just this. But in so many different ways.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Why do you think the terrorism in the United States is going to get worse? Why?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Because I think they don't respect our law enforcement and they don't respect our country. And we are taking the power away from our police. We are taking the power away from the people that are supposed to be protecting us. It's getting worse and worse all the time. Whether it's Islamic or anything else, it's getting worse.</p>                \n                \r\n\n            \n                <p>We are losing law and order. They don't respect. You look at what's happening in Detroit. You look at what's happening in Baltimore or Chicago, it's getting worse all the time.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Can you restore respect for the police? Could a politician do that?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I think you can. You have to give them back their strength. You have to give them back their power. You have to restore law and order. You have to have respect for -- they are not respecting the police anymore. I love the police. What they do is incredible.</p>                \n                \r\n\n            \n                <p>And sure, you are going to have a couple of bad apples in any business, even in your business we have bad apples, right, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We have more than a few.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>But the fact is -- you have too many in your business. You have to restore law and order and you have to be intelligent. You have to bring back the word \"intelligence\". You have to bring it back because a thing like this shouldn't happen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. But you know, with these guys, they are all over the place. The police have their hands full with crime and everything else, it's hard but one speculative question and I don't like to ask these kind of questions but tonight with this ISIS tweet, if the FBI does show that this terrorist in Chattanooga did have ties to ISIS, that a game changer?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I think it's a game changer. I think probably the answer in some form is yes anyway and they are doing it more and more. You know, the lone wolves as they call them they are doing it more and more. And there have to be people -- I mean this guy didn't just grow up in a vacuum. I mean for the last year or two or three he was radicalized. I mean people in his neighborhood must see it. How does it happen? Does he just sit in a room all day long? I don't think so.</p>                \n                \r\n\n            \n                <p>People must see it happening. They have to be able to call law enforcement and find out what's going on and they are not doing it. And you know, it's a very serious situation. But we need intelligence. We don't have intelligence in this country in so many different forms, Bill. This is one of them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. You would reorganize all the intel agencies if you were president? You would reorganize them?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, I would certainly put people that are the smartest and the best. And we don't have that right now. We have unbelievable law enforcement agencies and amazing people. Some of our most amazing people but we are not letting them do their job, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p>Donald Trump -- thank you very much as always.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump reacts to shooting in Chattanooga", "description": "2016 White House hopeful sounds off on Tennessee terror attack", "date": "2015-07-17T12:19:37Z"}