{"vcmId": "bc0f15fe-6fae-4978-8162-559de241be3b", "url": "http://www.foxnews.com/transcript/2016/07/20/bill-oreilly-how-donald-trump-can-indeed-win-presidency.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><b>O'REILLY:</b> So against all odds, Donald Trump is now one person away from being president of the United States. To use the comment vernacular we have an awesome program for you tonight including Jesse Watters talking politics at the rock and roll Hall of Fame. But we begin with the Talking Points Memo.</p>                \n                \r\n\n            \n                <p>How Donald Trump can indeed win the presidency? Take a look at the Electoral College map for 2012 when Barack Obama won 332 electoral votes, Mitt Romney 206. Two hundred seventy are needed to get the big job. In order to defeat Hillary Clinton, Trump would have to win all the states Romney won. And add at least three more large states. That will not be easy because West of the Mississippi, Trump does not play as well as he does in the east. So states like Arizona and Utah, which Romney easily carried, may be competitive this time around.</p>                \n                \r\n\n            \n                <p>Writing in the \"Wall Street Journal\" today, John Brabender, a Republican strategist says that Trump's presidential hopes hinge on winning in Ohio, Pennsylvania, and Florida. According to recent polls all those states are in play. Trump could win them. If Donald Trump does prevail in Ohio, Pennsylvania, and Florida, and can fight off Hillary Clinton West of the Mississippi, he will be president. If Mr. Trump wins New York, which he thinks he can do, he will take up residence on Pennsylvania Avenue.</p>                \n                \r\n\n            \n                <p>However, New York very tough state for Republicans with so many minority voters. The Trump card, pardon the pun, is anxiety. Most Americans not happy with the direction their country has taken. In fact in a recent Associated Press poll 79 percent of Americans say they are frustrated with the U.S.A. for various reasons. If anxiety grows, and it well could with terror attacks, police assassinations, very shaky economy, Trump will get stronger and capitalize on the disenchantment. That's because Hillary Clinton is a conventional candidate.</p>                \n                \r\n\n            \n                <p>Pretty much pledge to carrying on President Obama's policies. Other recent polling has a race tie between Trump and Clinton. But as Talking Points has pointed out, these polls mean little at this point. The debates begin in September and they will mean everything. But Donald Trump does have a chance, a real chance to become president. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: How Donald Trump can indeed win the presidency", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 7/19", "date": "2016-07-20T19:10:35Z"}