{"vcmId": "c0a1b850-86a4-46a0-a242-32842b41361c", "url": "http://www.foxnews.com/transcript/2016/01/28/donald-trump-weighs-in-on-gop-debate-controversy-part-ii.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 27, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Continuing now with Donald Trump who is in Florida this evening. You know, a lot of people thought when you started to run that this was a joke, that you weren't going to get anywhere, that you were a buffoon. You know it all.</p>                \n                \r\n\n            \n                <p>OK. But not ...</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I don't think they thought I was a buffoon. What kind of a statement is that?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, some people did.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I built a great company ...</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Some people didn't like you.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: ...best-selling books. I had ...</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I understand.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>...one of the top television shows in television. Nobody ...</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But you were rundown as a showman ...</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: It's not a very -- Bill, it's not a very nice way of expressing. No, they thought I wouldn't run and then they thought ...</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: ...and if I did run, I'd just have a good time for a little while and then I get out. Unfortunately ...</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: OK, but now ...</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: ...by many, many points.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But now, you could absolutely secure this Republican nomination. So you are one person away and it's probably going to be Hillary Clinton from being a president of the United States, that's Abraham Lincoln, that's George Washington, that's FDR, OK.</p>                \n                \r\n\n            \n                <p>I submit to you that you need to change and get away from the personal, \"They hurt my feelings or unfair to me\", and make it about them, the folks. Not about you.</p>                \n                \r\n\n            \n                <p>And you elevate then to a place where you could win this if you do that. Am I crazy?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> You're not crazy at all, Bill, but it is about them. It's about making America great again. That's why I'm doing this, it's not because I want the position. It's because I know the potential of this country, how great the country can be. Our leader is not doing the job. I'm trying to be nice. Our leader is not doing the job.</p>                \n                \r\n\n            \n                <p>There is so much potential in this country. And I've gotten to see it so well. You know, I'm traveling all over. Right now, I'm going to South Carolina as soon as I'm finished with this. I'm in Florida, going to South Carolina. And then I go to Iowa tonight. I mean, I'm all over the country. I'm seeing unbelievable people. I'm seeing unbelievable potential.</p>                \n                \r\n\n            \n                <p>And, it's untapped potential because we're not allowing ourselves to be great. We have bad deals with China, we have deals but we lose hundreds of billions of dollars a year with China, with Japan, with Mexico, with Vietnam, with everybody. And all of that's going to change, Bill. And I am doing it for the people. I'm not doing it for myself. I'm doing it for the people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It's -- there's two tracks. When the folks -- when the American public elects a president, they elect two tracks. They elect policy and a person.</p>                \n                \r\n\n            \n                <p>Would you say that right now, Donald Trump, all right, is a person who can let petty things, and that's what I think this is all about, these petty things, influence him to the extent that he doesn't do what maybe he should do?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, let me put it a little differently. I don't like being taken advantage of. In this case, I was being taken advantage of by Fox. I don't like that.</p>                \n                \r\n\n            \n                <p>Now, when I'm representing the country if I win, if I'm representing the country as president, I won't let our country because it's a personality trait. I'm not going to let our country be taken advantage of by Iran and by when you look at that scene two weeks ago with the sailors on their knees in a begging position with their hands up and guns, rifles at their head, and we're giving them $150 billion two days later. That's the only reason we got them back.</p>                \n                \r\n\n            \n                <p>I don't want that to happen to our country. So, it is a personality trait but I don't think it's really a bad personality trait, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But you can be sidetrack sometimes, and I'm not talking about you, Donald Trump, but any human being can. And not see ...</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I agree.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>...what the real important thing is because -- look, Putin is going to come at you. The mullahs are going to come at you.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: It's all right. That's OK.</p>                \n                \r\n\n            \n                <p><b>O'REILL</b>: Certainly, the terrorists are going to come at you. And it's going to be personal. They're going to do everything they can to diminish you and to (inaudible). And you have to -- as a president, you'll have to rise above that, all right, and do what's best for the country.</p>                \n                \r\n\n            \n                <p>And this exposition that we're talking about today, people are going to say, \"You know Trump, he's just too self-absorbed to be president. He needs to look at the bigger picture.\"</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well ...</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And the bigger picture is, get your message to the folks.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> There's got to be something because you set the all-time record in cable history and so did CNN and ...</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So they want just to know you.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: ...so there's got to be something going on, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They want to know you.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: No, that's fine.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But by walking away from this debate, you're not giving them ...</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I'm not walking away. I was pushed away. I'm not walking away, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You're walking away. Would you do me a favor? Look ...</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Bill, I'm not ...</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>...because I bought you so many vanilla milk shakes -- I bought you so many vanilla milk shakes, you owe me.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: That's true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Will you just consider, I want you to consider, all right, think about it, say, \"Look, I might come back\", forgive, go forward, answer the questions, look out for the folks. Just want you to consider it. You owe me milk shakes. I'll take them off the ledger if you consider it.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, even though you and I had an agreement that you wouldn't ask me that, which we did, I will, therefore, forget that you asked me that. But it's up to Fox, it's not up to me, Bill.</p>                \n                \r\n\n            \n                <p>They -- what they did ...</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You're actually telling the truth there.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: ...we had an agreement. You actually ...</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You're actually telling the truth that I said ...</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> ...because I told you upfront, I said don't ask me that question because it's an embarrassing question to you and I don't want to embarrass you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But I'm not going to listen to anybody. Right, but I'm not going to listen to any political person tell me, \"Don't ask me anything.\" But, you're absolutely an honest man, that I said I -- I'll try not to do it with the milk shake thing, just overwhelmed me.</p>                \n                \r\n\n            \n                <p>But, I'm asking you to reconsider it.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> It's true. A lot of milk shakes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>If you don't want to, it's up to you. And I'll give you a compliment. I don't know any politician under these circumstances that would have come on in here and done what you did tonight. I just don't know any.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: And by the way, this is much tougher than the debate. Bill, this is much tougher being with you, because frankly, you're smarter. This is much tougher than doing the debate with Megyn Kelly, believe me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, that's why you should do it and have fun tomorrow night. And tell the folks ...</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I'm going to have fun, 9:00, Drake University. 9:00, Drake University, we're going to raise money a lot of money for the veterans. Watch.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right, you owe me 17 milk shakes then, and I want them.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>That's OK. I'll do that. Thank you, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, Donald.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump weighs in on GOP debate controversy, Part II", "description": "The GOP front-runner discusses the future of his campaign on 'The O'Reilly Factor'", "date": "2016-01-28T20:29:22Z"}