{"vcmId": "c15cf94e-3ae4-47ef-9116-014e578fa530", "url": "http://www.foxnews.com/transcript/2016/02/15/bill-oreilly-more-campaign-madness.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Hate to say it, but the debates are getting kind of tedious on both sides, canned answers rule, very few thoughtful responses, most of the questions easily deflected by well-rehearsed politicians.</p>                \n                \r\n\n            \n                <p>Last night in Milwaukee, Clinton and Sanders faced off once again under questioning by two PBS anchors. There were a couple of moments when things got interesting. One was a Sanders' criticism of President Obama spoken before the debate.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. BERNIE SANDERS (I-VT), DEMOCRATIC PRESIDENTIAL CANDIDATE:</b> There is a huge gap right now between Congress and the American people. What presidential leadership is about is closing that gap.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE</b>: And you don't think President Obama has successfully closed that gap?</p>                \n                \r\n\n            \n                <p><b>SANDERS</b>: No, I don't.</p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON (D), PRESIDENTIAL CANDIDATE</b>: The kind of criticism that we have heard from Senator Sanders about our president I expect from Republicans. I do not expect from someone running for the Democratic nomination to succeed President Obama.</p>                \n                \r\n\n            \n                <p><b>SANDERS:</b> That is -- Madam Secretary, that is a low blow.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No it wasn't. Mrs. Clinton's poke at Sanders was smart and will rally Obama loyalists to her cause. Hillary won that round. But she lost this one.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>WOODRUFF</b>: Nearly half of your financial sector donations appear to come from just two wealthy financiers, George Soros and Donald Sussman for a total of about $10 million. You have said that there is no quid pro quo involved. But, is that also true of the donations that wealthy Republicans give to Republican candidates, contributors including the Koch Brothers?</p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> I can't speak for the Koch Brothers, you are referring to a Super PAC that we don't coordinate with that was set up to support President Obama, that has now decided they want to support me. They are the ones who should respond to any questions.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Baloney. Soros coordinates with all powerful Democrats. He is a puppet master, a seeker of power behind the scenes.</p>                \n                \r\n\n            \n                <p>Secretary Clinton's answer was disingenuous -- word of the day -- disingenuous. And she completely dodged the issue. If she is going to condemn big PAC money going to Republicans, she can't take cash from Soros and rich Democrat PACs. Excuse me, I said she can't.</p>                \n                \r\n\n            \n                <p>Of course she can because her supporters don't care. That is the crux of this memo tonight. Devoted followers of a politician pretty much will accept anything from him or her. When Richard Nixon was force to resign his presidency over Watergate, about a third of Republicans still supported him.</p>                \n                \r\n\n            \n                <p>It's obvious in this campaign the followers of Bernie Sanders and Donald Trump to give two very vivid examples are not expecting precise political analysis. It is the tone those candidates strike that is driving their support.</p>                \n                \r\n\n            \n                <p>As I told Mr. Trump earlier this week when he appeared on The Factor the federal courts would never allow him to deport 12 million people. They would block that as all of those living in the U.S.A. right now, even illegally, are entitled to due process. Mr. Trump disagrees with me. That's fine. But legal precedent has been established so I have to report it.</p>                \n                \r\n\n            \n                <p>On the Sanders front, there is no way his draconian taxation vision could ever come close to covering his endless list of entitlements, including free public college tuition. Thus the current $19 trillion debt would explode even further if his policies were even implemented. No congress would ever allow that. But to Bernie's followers it doesn't really matter. Like a bad gift, it is the thought that counts.</p>                \n                \r\n\n            \n                <p>Well, Donald Trump would run America as a tough-minded business, changing the landscape by negotiating better deals both within and outside the country. Sanders is calling for a brand new system.</p>                \n                \r\n\n            \n                <p>I received a letter from Rhonda Hallett who lives in Jacksonville, North Carolina asking me to define Bernie's doctrine of Democratic socialism. Ok. That's basically what some countries in western Europe have, a political system that limits personal income through taxation in return for cradle to grave payouts from the governments. That's the trade. Even if you are a derelict, a lay-about, you will be supported by the government and in return you will do what the government tells you to do.</p>                \n                \r\n\n            \n                <p>Housing? You can get it supplemented but you are assigned to units. Day care? Sure. But your kids are assigned to centers. Same thing with your doctor, dentist -- if you cannot pay privately, you go where you are told to go. Education? Depends on your ability. Yes, public ed is free public in Britain, for example, but you will not like be going to oxford and you won't be going anywhere unless the government oks it.</p>                \n                \r\n\n            \n                <p>You can see that Democratic socialism where citizens still vote but are mostly told what to do by guys like Bernie Sanders is a system of subservience to a big central government. There is little power to the people.</p>                \n                \r\n\n            \n                <p>Now the majority of those supporting senator Sanders have no blanking idea what he actually wants. They are hypnotized by the prospect of free stuff, education, healthcare, because, of course, they deserve that, why? Because the system is rigged by billionaires. So why shouldn't Bernie provide for me and take from the greedy rich folk who have made their money by exploiting the peasants?</p>                \n                \r\n\n            \n                <p>That's right out of the Fidel-Che handbook. But again Talking Points submits many of those voting for the Bernmeister have no idea who Che was or who Karl Marx was or even who Fidel is.</p>                \n                \r\n\n            \n                <p>Getting ill-informed folks to follow you isn't hard as proved by the Kardashians. A dose of flamboyance mixed with some passion and more than a smidgen of resentment can rally some people who don't know very much.</p>                \n                \r\n\n            \n                <p>Talking Points has spent time in 80 countries around the world. There is no place, no place where opportunity is more available than America which is why millions of people have furtively entered this country. Even capitalistic power houses like Switzerland and Singapore pale beside the capitalistic colossus we have here.</p>                \n                \r\n\n            \n                <p>But capitalism is not easy and there is no Uncle Bernie to provide if you do not work hard and educate yourself to succeed. Sadly, many would forfeit their right to prosper in a major way for the false security of a government-controlled economy. But those folks, the Bernie people remain a distinct minority as we will see going forward.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: More campaign madness", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/12", "date": "2016-02-15T13:08:02Z"}