{"vcmId": "c2cb00ee-43e4-4cc9-8c8c-76ee2055822f", "url": "http://www.foxnews.com/transcript/2015/12/04/isis-collaborators-in-usa.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 3, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight, ISIS collaborators in the U.S.A. As we reported earlier this week a new study by George Washington University uncovered about 300 ISIS advocates living in America and authorities have arrested about 70 individuals on ISIS-related activities.</p>                \n                \r\n\n            \n                <p>For years police here in New York City have been monitoring radical mosques and other places where suspected terrorists might gather. The left-wing mayor of New York City now Bill de Blasio shut that program down.</p>                \n                \r\n\n            \n                <p>But joining us now to explain how it did work, the former police commissioner of the Big Apple, Ray Kelly. The commissioner is also the author of the new book, \"Vigilance: my life serving America and protecting its empire city\". And that's what the program was all about protecting New York City, right?</p>                \n                \r\n\n            \n                <p><b>RAY KELLY, FORMER NYPD COMMISSIER:</b> Exactly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So how did it work?</p>                \n                \r\n\n            \n                <p><b>KELLY: </b>Well, the program that the mayor eliminated was the demographics unit. We wanted to know who lived in New York City, the most diverse city in the world. It's very tribal. We knew that, for instance, suicide bombers were going from one town in Libya into Iraq in 2003. So we wanted to know in a more granular fashion who was in New York City -- perfectly legal.</p>                \n                \r\n\n            \n                <p>For instance, it gave us information that told us where the Chechen community was in the metropolitan area. Why was that important? The Boston Marathon bombers were coming to New York, if you recall. They told the individual who they hijacked the car from that they were coming to New York.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>KELLY: </b>We knew --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And they were Chechens.</p>                \n                \r\n\n            \n                <p><b>KELLY: </b>And were Chechens. So we knew where they might go. That sort of information is helpful.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You called it the demographic unit.</p>                \n                \r\n\n            \n                <p><b>KELLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And this was basically compiling information about where certain groups of people were living.</p>                \n                \r\n\n            \n                <p><b>KELLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right?</p>                \n                \r\n\n            \n                <p><b>KELLY:</b> Totally in public. It wasn't surreptitious. Police officers in civilian clothes some had language skills went out and spoke to people in the community.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What's going on, you know? Anybody new in town? That kind of thing.</p>                \n                \r\n\n            \n                <p><b>KELLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We did hear that there were some NYPD undercover that went into radical mosques. There were a few in Brooklyn that we've ID'd where the imams are preaching hate and that you guys sent in people to find out what was going on. Was that true?</p>                \n                \r\n\n            \n                <p><b>KELLY: </b>To follow leads. We go wherever those leads would take us. If it took us to a mosque, fine. If it took us to Saint Patrick's Cathedral, we go there as well, or to a synagogue. So, you can't have a refuge.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But you did, you did send undercovers into certain places.</p>                \n                \r\n\n            \n                <p><b>KELLY: </b>When it's appropriate. When it was appropriate.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>When it was appropriate. When you had reasonable cause to do so?</p>                \n                \r\n\n            \n                <p><b>KELLY: </b>Precisely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So was that helpful? Did you get information from, you know, radical places not just mosques but maybe clubs and things like that?</p>                \n                \r\n\n            \n                <p><b>KELLY:</b> Yes. Well, the ultimate test is we had 16 plots against New York City --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>16?</p>                \n                \r\n\n            \n                <p><b>KELLY:</b> -- and none succeeded on the Bloomberg watch. It was all part of a major comprehensive program.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I just want to be clear. So you disrupted 16 plots by policing in this manner, demographically, going where you thought trouble might occur and assembling information? You disrupted 16.</p>                \n                \r\n\n            \n                <p><b>KELLY:</b> It's important to know that in part with the FBI and we were lucky in some of those cases.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. So the new mayor comes in and he's a very liberal guy and he says no, no, no. This is profiling and we are not going to do this anymore. What is your response to that?</p>                \n                \r\n\n            \n                <p><b>KELLY: </b>That was inappropriate. Perfectly legal -- there was no reason to eliminate it. We changed the name to the area assessment unit but --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The area assessment unit?</p>                \n                \r\n\n            \n                <p><b>KELLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So you change it from the demographic squad to the area assessment.</p>                \n                \r\n\n            \n                <p><b>KELLY: </b>They had some more duties.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. But that's still not good enough, right? He says no, I don't want any eyes, even if a guy is out there screaming he wants to kill Americans, and I love ISIS, you are not allowed to chase him around or look at him.</p>                \n                \r\n\n            \n                <p><b>KELLY: </b>And this gave him a front page story in the \"New York Times\" - -</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- which is what he wanted.</p>                \n                \r\n\n            \n                <p>Now do you think anything is going to change now that we have this terrible thing in San Bernardino where this guy is going to be linked up to ISIS? He is just a regular guy. He's got a little baby, He's got a wife. Do you think de Blasio is going to wise up and the other people will wise up?</p>                \n                \r\n\n            \n                <p><b>KELLY:</b> I don't know. It's very challenging to identify someone like this. We will see how much information he has on the computer who he's he talking to. That --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I'm talking about the political mind set. Is it going to change?</p>                \n                \r\n\n            \n                <p><b>KELLY:</b> We can only hope. I don't know. If enough pressure is put on, we will see. But New York is the number one target in America. That's the consensus of the intelligence community. But we see a city like San Bernardino that was certainly not the center of the world.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No. But this guy was there. He was there and he was willing and able and planned it and he was going to do it.</p>                \n                \r\n\n            \n                <p><b>KELLY: </b>Correct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right -- Commissioner, Thanks very much. We appreciate you coming in.</p>                \n                \r\n\n            \n                <p><b>KELLY: </b>Thanks for having me -- Bill.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "ISIS collaborators in the USA", "description": "Former New York City Police Commissioner Ray Kelly discusses suspected terrorists on 'The O'Reilly Factor'", "date": "2015-12-04T13:36:09Z"}