{"vcmId": "c3a41d3e-554d-458a-822c-687a0620029b", "url": "http://www.foxnews.com/transcript/2015/01/09/how-to-deal-with-jihad.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 8, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Continuing now with our lead story, how to deal with the jihad and stop making excuses for the Muslim World. Joining us now from Washington, Haris Tarin, who works with the Muslim Public Affairs Council; and from southern California Hussam Ayloush who works for the Council on Islamic-American Relations. Mr. Ayloush, let me begin with you, where am I going wrong?</p>                \n                \r\n\n            \n                <p><b>HUSSAM AYLOUSH, COUNCIL ON ISLAMIC-AMERICAN RELATIONS:</b> Well, thank you for having me on the show, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure, any time.</p>                \n                \r\n\n            \n                <p><b>AYLOUSH: </b>I think what you said is a mixture of things, a lot of what you said is true. We have been saying it as Muslims. The truth is there is a problem of violent extremists who are narrow-minded, who are violent, who are murderers, they are the product of many factors -- ignorance, hatred, narrow-minded interpretation of religion, political repression, poverty, dictatorship. A lot of factors and they need to be addressed.</p>                \n                \r\n\n            \n                <p>And the truth also is the Muslims around the world, including in America are doing a lot to counter that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I disagree with that and let's get specific -- Pakistan. They imprisoned the doctor who helped us find Osama bin Laden, nothing happened to Pakistan for doing that Mr. Ayloush.</p>                \n                \r\n\n            \n                <p><b>AYLOUSH: </b>Well, the problem -- I agree with you the President could do more. And the problem is we are hesitant. We continue --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok.</p>                \n                \r\n\n            \n                <p><b>AYLOUSH: </b>-- to compromise on democracy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You and I agree on that.</p>                \n                \r\n\n            \n                <p>We continue to look away -- not compromise. We are looking away from the doctor who is in a dingy jail for helping the world rid itself of Osama bin Laden. Now, let's get to you -- wait I'll get back.</p>                \n                \r\n\n            \n                <p>Mr. Tarin, where am I going wrong?</p>                \n                \r\n\n            \n                <p><b>HARIS TARIN, MUSLIM PUBLIC AFFAIRS COUNCIL:</b> Well, Bill, it's not just that Muslims in Pakistan are doing nothing. There is Muslims on the front lines in Iraq, in Syria, in Afghanistan, in Pakistan who are dying. How many victims of --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, no. Mr. Tarin, the government of Pakistan -- wait, wait, wait --</p>                \n                \r\n\n            \n                <p><b>TARIN:</b> Let me answer the question, Bill. Let me answer the question.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Tarin here's the deal -- here's the deal on the No Spin Zone.</p>                \n                \r\n\n            \n                <p><b>TARIN:</b> I'm not spinning.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>When you say something that's ridiculous -- I'm going to interrupt you.</p>                \n                \r\n\n            \n                <p><b>TARIN: </b>That's not ridiculous. Allow me to finish my point.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, no, no, no -- Pakistan, stay in Pakistan. All right?</p>                \n                \r\n\n            \n                <p><b>TARIN: </b>Ok. I will stay with Pakistan.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They've harbored the worst terrorists on earth for 10 years.</p>                \n                \r\n\n            \n                <p><b>TARIN: </b>I agree. I agree with you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So we haven't done anything to Pakistan for doing that.</p>                \n                \r\n\n            \n                <p><b>TARIN:</b> I agree with you. Allow me to finish -- allow me to finish my point. My point is there has been over 50,000 Pakistani soldiers and policemen who have died as a result of the war on terror as a result of extremism. Yes, we should punish those who harbor terrorists and harbor Osama bin Laden. On the front lines in Iraq, in Syria, in places like that, Muslims are the primary victims of terrorism. And we have to work together.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That makes it even worse that the governments won't move against the jihadists.</p>                \n                \r\n\n            \n                <p><b>TARIN: </b>I agree with you.&#160;</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I'm not saying that there are individual Muslims but individuals can't solve the problem.</p>                \n                \r\n\n            \n                <p>Let's get back to you, Mr. Ayloush. You have an Iranian situation, all right, where these people are defying the world -- defying the world. They're going to get the nuclear weapon, all right. That's going to change worldwide terrorism all over the place. What are we doing against Iran, Mr. Ayloush? What are the other Muslim nations doing about it? Nothing.</p>                \n                \r\n\n            \n                <p><b>AYLOUSH: </b>Until we are serious in committing and supporting democracy in that region, we are not going to see change, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What does that mean? You want to invade the country?</p>                \n                \r\n\n            \n                <p><b>AYLOUSH: </b>No, not invade the country. You know, for the last many years people in that region have struggled against the dictatorships, against the repressive regimes in that area. They've paid with their only blood to fight extremism.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Some of them have but not all of them. If you wanted to have democracy in Iran the people could rise up and kill the mullahs. They won't.</p>                \n                \r\n\n            \n                <p><b>AYLOUSH: </b>They tried.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's what you have to do. That's why America broke away from Great Britain. We fought them. The Iranians won't fight the mullahs.</p>                \n                \r\n\n            \n                <p><b>AYLOUSH: </b>To the credit of the Iranian people there is something called the Green Revolution. They participated in that. They paid --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's not enough of them. There's not enough of them.</p>                \n                \r\n\n            \n                <p><b>AYLOUSH:</b> Well, I'll give you another example Bill. People in Egypt tried to have a democracy and what did we do. We supported a coup. These --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We supported a coup against the Muslim Brotherhood who were massacring Christians.</p>                \n                \r\n\n            \n                <p><b>AYLOUSH:</b> No, no, no. We supported a coup against democracy -- the first ever democratically-elected government.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You had Muslim Brotherhood massacring Christians.</p>                \n                \r\n\n            \n                <p><b>AYLOUSH:</b> Unless we are committed to democracy. Unless we are seriously committed to democracy not the democracy that brings our puppets we are not going to see an end of extremism.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Don't you get the Muslim Brotherhood is a result -- do you get the Muslim Brotherhood? Do you get them? They murder people.</p>                \n                \r\n\n            \n                <p><b>AYLOUSH:</b> If they play by the democratic rules and if they respect human rights, we will work with them. That's the reality.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> If the wizard of Oz can solve all the problems.</p>                \n                \r\n\n            \n                <p>All right. I get back to you Mr. Tarin. I submit to you that this world, all right, is being crippled by Islamic extremist and the world is too cowardly to unite against them. Would you say that's wrong?</p>                \n                \r\n\n            \n                <p><b>TARIN:</b> Bill, these people are extremists who have perverted a faith.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The world will not unite against them, will they?</p>                \n                \r\n\n            \n                <p><b>TARIN:</b> There are over 1.6 billion Muslims on this world who on a daily basis do great work. Seven out of the last 11 Nobel Peace prize winners were Muslims, Bill. What we have to do is come together with Muslim countries, with Muslim majority countries and our society as Americans.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Here is what we have to do Mr. Tarin.</p>                \n                \r\n\n            \n                <p><b>TARIN: </b>-- push back against extremist ideology. If we allow them to divide us, Bill. If we allow them to divide us --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They are already dividing us.</p>                \n                \r\n\n            \n                <p><b>TARIN:</b> No, no -- they are dividing us if we allow them to. That is their mission.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Here's what we have to do. We have to boycott Pakistan and make them the example. We have to say no to trade to Pakistan. No money in, nothing. Starve them out.</p>                \n                \r\n\n            \n                <p><b>TARIN:</b> We have to stand together as Muslims, as Jews, as Christians, as secularists.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Pie in the sky. Not going to happen. All right, gentlemen --</p>                \n                \r\n\n            \n                <p><b>TARIN:</b> That's not pie in the sky. That's exactly what we should be doing against these terrorists and against these extremists.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Pie in the sky, not going to happen.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>TARIN:</b> It will happen because America is an example of it happening, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, guys.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "How to deal with the Jihad", "description": "The problem of Islamic extremism and why some insist on making excuses", "date": "2015-01-09T14:03:13Z"}