{"vcmId": "c3e7dfdb-dbd7-4da7-8e06-becf00a37d64", "url": "http://www.foxnews.com/transcript/2016/10/31/oreilly-political-fallout-from-fbi-news.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 28, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching us. Bill will join us in just a moment and throughout the hour with tonight's breaking news story. Stunning new developments in the Hillary Clinton email scandal, as the FBI announced its reviewing newly discovered emails that could have a direct bearing on that case. The FBI's action resulting from a separate investigation into disgraced former Congressman Anthony Weiner, the husband of top Clinton aide Huma Abedin.</p>                \n                \r\n\n            \n                <p>Weiner is under federal investigation for allegedly sexting an under-aged girl in North Carolina. As part of the inquiry, the bureau seize devices from both Weiner and Huma Abedin where discovered numerous emails sent and received by Abedin apparently relevant to the Clinton email investigation. The FBI is not releasing many details yet and it is unclear if any of those emails were between Abedin and Mrs. Clinton or if any of them contained classified information. But Donald Trump and his supporters certainly praised that decision.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: As you might have heard earlier today, the FBI --</p>                \n                \r\n\n            \n                <p><b>(CHEERS AND APPLAUSE)</b></p>                \n                \r\n\n            \n                <p>After discovering new emails is reopening their investigation into Hillary Clinton.</p>                \n                \r\n\n            \n                <p><b>(CHEERS AND APPLAUSE)</b></p>                \n                \r\n\n            \n                <p>I have great respect for the FBI for writing this wrong. The American people fully understand her corruption and we hope all, all justice will finally be served.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> And just a short time ago in Iowa, Hillary Clinton addressed the news for the first time.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON</b>: The director himself has said he doesn't know whether the emails referenced in his letter are significant or not. I'm confident, whatever they are, will not change the conclusion reached in July. Therefore, it's imperative that the bureau explain this issue and question whatever it is without any delay.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Now, you may remember that on July 5th, the FBI Director James Comey recommended no criminal charges be brought against Mrs. Clinton despite saying she was, quote, \"Extremely careless in her handling of classified information.\" Then over the Labor Day Hollywood, he released documents that lead Bill O'Reilly to question Comey's entire handling of the case. Take a look.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BILL O'REILLY, FOX NEWS HOST, \"THE O'REILLY FACTOR\":</b> I have revised my opinion on Director James Comey because he released some very important information about Hillary Clinton last Friday afternoon before labor when few would see it. That was a political move. And even though I gave Mr. Comey the benefit of the doubt in the email investigation itself. I can no longer do so. He has lost all credibility. I mean, when he loses me, and he lost me, Mr. Comey. I'm gone. All right?</p>                \n                \r\n\n            \n                <p>I don't believe you should be running that agency any longer. I don't believe that this is an honest investigation. I believe that this is political. I believe they never wanted to find out what happened. It's obvious the FBI booted the investigation. I believe intentionally now. The campaign itself, the Hillary Clinton machine itself is admitting this is bad and they have got to do something and Comey doesn't think it has anything to do with the investigation?</p>                \n                \r\n\n            \n                <p>As everyone knows, Hillary Clinton did not tell the truth about her email. With the exception of one person. James Comey.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Joining us now on the phone is Bill O'Reilly. So, Bill, we just heard your analysis of FBI Director James Comey. How did you know Comey booted the investigation?</p>                \n                \r\n\n            \n                <p><b>O'REILLY </b>(on the phone): Well, it was quite apparent that you have a series of events and they are -- it is circumstantial evidence, but so much circumstantial evidence that Comey did not want to make this indictment. But the big smoking gun is that Comey did not call for a grand jury. I have spoken to dozens of FBI agents both retired and in the service now to a man they say that is extremely unusual in a complicated case like this. So now what you have is you have a political portion of this today and then you have a legal portion. Let's take the politics first, Eric.</p>                \n                \r\n\n            \n                <p>If you look at the new FOX News poll, the enthusiasm deficit between Trump and Clinton is about eight percent. Seven percent. That means that seven of Trump supporters are more enthusiastic to vote than Hillary Clinton. Keep that in mind. Anything like this erodes enthusiasm for Hillary Clinton. All right? Now her hard core people are still going to vote for her. But we are talking Independents. And we're talking Democrats who don't particularly like or trust her. So, that enthusiasm level drops. And what happens then? Lower turnout. All right? So that's what happened today politically.</p>                \n                \r\n\n            \n                <p>So, Trump seizes upon this and his -- if he doesn't blow it in the next 10 days, which he could, his message should be she is corrupt and if you elect her, there is a chance she may be indicted while she is the president because the situation is fluid. It's fluid. Comey made a huge mistake by not calling the grand jury. Because the grand jury folks, regular Americans would have then heard the evidence that Comey himself decided wasn't enough to indict because she didn't mean it.</p>                \n                \r\n\n            \n                <p>Now, let's get on to what was found today. Huma Abedin is one of Hillary's best friends. So you've got to know that they were emailing all the time, all the time. She had three servers and -- no, she had one server and Weiner had three. You got to figure that Abedin passed some of Hillary's stuff on to her husband Weiner. All right? That's why Weiner's involved. So the FBI goes in to investigate Weiner on this 15-year-old girl thing and they see stuff from Huma Abedin coming to Weiner about Hillary Clinton. You have to assume this.</p>                \n                \r\n\n            \n                <p>This is an assumption I'm making. And then they go back and they look at Abedin's phone and they see unbelievable amounts of emails from Clinton to Huma. Now, if you're the FBI and this is all benign, has nothing to do with national security or top secret, you don't do anything. If it's just what are you doing tonight? What kind of dress are you going to wear or look at this, Anthony, Hillary Clinton has a good idea to do X, Y, and Z, that's not going to rise. So you know there is something in there. Has to be.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Because Comey would never put his butt on the line. Now, here's the kicker. I have talked to a very, very influential FBI guy the other day. He said there is almost a mutiny within the FBI over James Comey's behavior in this investigation. He says that so many agents are angry that Comey knows he has lost all credibility within the agency. And that if he didn't put this out that they were going to go public with it. And that Comey's career would have been done.</p>                \n                \r\n\n            \n                <p>He had to put it out. That's not saying that she is going to be charged. I'm not saying any of that. What I am saying is that the FBI rank and file do not like the way James Comey conducted this investigation, do not feel it rose to the FBI standards, and this new stuff is enough to open, reopen the investigation, which is devastating for the Clinton campaign.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Devastating. Devastating. First of all on a scale of one to 10, I would like you to weigh in politically forget legally for a second but politically scale of one to 10, you have got to push it up towards the eight, nine, ten area especially just 11 days left to go before the election.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's hard to say because the candidates are so polarizing but I do -- as I said in the beginning, I think it's going to suppress turnout for Hillary Clinton. People are just going to, you know, I have had enough. I don't want to vote for Trump, but I'm not going to go vote for her. And she needs a big turnout in states like Pennsylvania and New Hampshire. The other thing is that politically speaking, Trump now can run with this for 10 days. And raise the specter of absolutely chaos if Hillary Clinton is elected and the FBI then finally does convene a grand jury because it's reopened now.</p>                \n                \r\n\n            \n                <p>They can do that now. And the pressure is going to build on them. And the final thing is, the far left is going crazy. They're going nuts. They're accusing Comey of all kinds of things. Comey was their best friend up until three hours ago. Now he is the devil.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And you are seeing this unbelievably visceral reaction. I must say that Hillary Clinton was smart today in which she did. That was a smart play. Hey, get it out there. Because she knows the FBI is not going to get it out there.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: This is a very interesting point you make that she did go to the podium. She said, first of all, she said that the emails are factored in already. A lot of people on the right would disagree with that but it's very interesting that both Hillary Clinton and Podesta today have said get these emails out. Let the American public know. But so was Pence.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. That's a smart play because they know they're not going to get them out.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> But one of them is going to lose in that. One of them is going to be a loser in that. If they bring them out now, someone is going to lose. Who loses?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, they can't. They can't. If you are investigative agency, you have to compare those emails to other things that she said Hillary Clinton has said. You've got to do a whole bunch of things before you arrive at any conclusion. You can't just throw them out there. That's trial by meeting. But Hillary Clinton now, you know, what can they do? They're going to have to say look, we didn't do anything, we want this all out, hoping that they can go up to Election Day and people will buy that. And I'm not saying whether it's true or not. I'm not. I'm just saying that right now Trump has the advantage if the Trump campaign then zeros in on corruption, corruption, corruption, corruption, in the next 10 days.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> You know, very interesting you say that because we have Kellyanne Conway, senior advisor to the Trump campaign coming up. Bill, I want to say thank you very much. We're going to check back in with you in a little bit later in the program to get your assessment of how this story will develop over the weekend. Looking forward to it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "O'Reilly: The political fallout from the FBI news", "description": "Bill O'Reilly joins 'Factor' guest host Eric Bolling to discuss the potential fallout from the shocking news that the FBI has decided to re-open the investigation into the Hillary Clinton private email server scandal", "date": "2016-10-31T12:15:30Z"}