{"vcmId": "c470a27c-90bf-4f82-8cb1-10e157bce485", "url": "http://www.foxnews.com/transcript/2016/03/21/never-trump-movement-impact-on-2016-election.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 18, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>ERIC BOLLING, FOX NEWS HOST:</b> Hi, I'm Eric Bolling are in for Bill O'Reilly. Thanks for watching this special edition of the Factor \"Election 2016.\" Is the Never Trump movement only helping Hillary Clinton? Despite facing an onslaught of attack ads by GOP establishment groups, Donald Trump has dominated the Republican field racking up delegates with one primary win after another. So, is it time for the anti-Trump forces in the GOP give up and rally behind the frontrunner?</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>ALEX BURNS, THE NEW YORK TIMES:</b> It clearly bothers Trump that he has been sort of laughed at and dismissed and played down for so long but in a way it's been the biggest gift to his campaign that he wasn't taken seriously for months. If there had been organized effort starting last July to just drive a stake through this campaign it could have been a lot more difficult for him. But at this point after he has been sort of indulged and validated for so long, it's a little tough now to flip back on that.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Joining us now for reaction from Miami, Tim Miller, former communications director for Jeb Bush. And a senior adviser to Our Principles PAC, the anti-Trump group. And from Boston, Adriana Cohen a Boston Herald columnist.</p>                \n                \r\n\n            \n                <p>So, Tim, the attack ads, the attacks. The money you are spending to attack Trump, isn't Hillary Clinton laughing all the way to the election?</p>                \n                \r\n\n            \n                <p><b>TIM MILLER, FORMER COMMUNICATIONS DIRECTOR FOR THE JEB BUSH CAMPAIGN:</b> Hillary Clinton is laughing and that's because she sees a prospect of facing Donald Trump in the general election. Hillary Clinton is a disaster of a candidate. She is extremely unlikeable. She's under investigation. And, yet, if you look at the polls, Donald Trump's favorite thing to talk about, she is crushing him. He is the only person she beats.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Tim, Tim, Tim!</p>                \n                \r\n\n            \n                <p><b>MILLER</b>: And she is annihilating him every time. So, if he is nominated, that's a biggest gift to her.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Tim, eight months away, Tim. Eight months to go, Jeb Bush was leading Donald Trump in a head-to-head competition.</p>                \n                \r\n\n            \n                <p><b>ADRIANA COHEN, BOSTON HERALD COLUMNIST</b>: Right.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>You remember that?</p>                \n                \r\n\n            \n                <p><b>MILLER</b>: Hey, Eric, has been running a campaign for the last eight months. People have seen him on TV every night. People have rendered a judgment. The American people don't like him. He is about 20 percent favorable, 60 something unfavorable.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Look at a poll that's eight months away and Donald Trump hasn't even focused on Hillary Clinton at all and that's what you are going to run with? By the way, let me ask you this, Tim.</p>                \n                \r\n\n            \n                <p><b>MILLER</b>: It's what Donald Trump likes to talk about, Eric.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: You are a good guy. You are a good guy. But you are working for a PAC that probably has tens of millions if not more that is going after a GOP frontrunner. Just inherently as a conservative, I don't like that.</p>                \n                \r\n\n            \n                <p><b>MILLER</b>: Well, hey, Eric. Let me answer that really quick because A, our PAC is supported mostly by conservatives who funded Tea Party candidates. The rickets family who funds this PAC big supporters of Ted Cruz when he ran against an establishment guy. This isn't about an establishment. One third of the Republican Party in the exit polls on Tuesday said, they would go third party if Donald Trump ran. Eric Erickson, Glenn Beck, Ken Blackwell, these are great conservatives who are saying Never Trump because Donald Trump is not a conservative. He has been around 70 years in his life --</p>                \n                \r\n\n            \n                <p><b>COHEN</b>: Oh, that's not true.</p>                \n                \r\n\n            \n                <p><b>MILLER</b>: And he has never demonstrated that he is a conservative.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Go ahead, Adriana.</p>                \n                \r\n\n            \n                <p><b>COHEN</b>: That's baloney.</p>                \n                \r\n\n            \n                <p><b>MILLER:</b> Explain to me how he's a conservative, Adriana, I would love to hear.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Go ahead.</p>                \n                \r\n\n            \n                <p><b>COHEN:</b> That is a baloney. You know, it's just laughable when Rinos in Washington like Speaker Ryan and Mitch McConnell, they don't like Trump because they think he is not conservative enough. You have got to be kidding me. These people have been green lighting Obama's left wing agenda for the past seven years. They funded ObamaCare. They funded amnesty, they funded Planned Parenthood despite the gruesome videos. And in the recent omnibus bill. They even funded a Syrian refugee resettlement program knowing full well that their government can't even properly vet these people. And so --</p>                \n                \r\n\n            \n                <p><b>MILLER</b>: Hey, Adriana let me go through that list on ObamaCare. Donald Trump supported the Democrats who pushed through on ObamaCare, on healthcare. He said, he liked socialized healthcare.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>COHEN</b>: He wants to repeal it. He wants to repeal ObamaCare.</p>                \n                \r\n\n            \n                <p><b>MILLER</b>: On Planned Parenthood, Donald Trump has been the only Republican candidate defending Planned Parenthood. The only one.</p>                \n                \r\n\n            \n                <p><b>COHEN</b>: No. He doesn't defend abortion. No, he doesn't defend abortion.</p>                \n                \r\n\n            \n                <p><b>MILLER</b>: Yes. He said we should fund Planned Parenthood. Donald Trump's the only candidate who has said that he is not a conservative, Adriana.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> We can vet Donald Trump's stance on all these things at another time, we'll do it online, we'll go to BillO'Reilly.com. We'll check it out maybe something will be there. I'm not sure. But Tim, the establishment class, the elites, the group that you are representing. The Jeb Bush that became Romney that has now become this Super PAC that's going after the outsiders, originally he was going after Trump and Cruz. Now have you decided Cruz is your only alternative to Trump. So, you're backing someone that you guys didn't like before.</p>                \n                \r\n\n            \n                <p><b>MILLER</b>: Like I said, this group is funded by people who supported Ted Cruz and his Senate run. They supported Scott Walker's campaign. So, no, that's not true at all.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Well, you have to admit, Tim.</p>                \n                \r\n\n            \n                <p><b>MILLER:</b> They're going after Donald Trump because he is not a conservative, Eric.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> You have to admit that you are representing his class -- the D.C. establishment class, are you not?</p>                \n                \r\n\n            \n                <p><b>MILLER:</b> No. I'm not representing the elite class. If anything, Eric, as you know, the elite class in D.C., the Mitch McConnells, the Karl Roves of the world they don't like Ted Cruz.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Hold on! Hold on! Hold on!</p>                \n                \r\n\n            \n                <p><b>MILLER:</b> I'm representing conservatives around the country --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Hold on right now. I know Karl Rove very well.</p>                \n                \r\n\n            \n                <p><b>MILLER:</b> -- who don't think Donald Trump is a conservative, maybe a terrible president.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Mitch McConnell, Karl Rove, I know those guys. And I'm not, so you are saying that our principles PAC, which you represent now which was started by Katie Packer who was a Romney senior advisor isn't establishment?</p>                \n                \r\n\n            \n                <p><b>COHEN: </b>Exactly. It is establishment.</p>                \n                \r\n\n            \n                <p><b>MILLER</b>: What I'm saying is that it is not just about the establishment versus Trump, there is a wide swath of the Republican Party of people like, who are supporting us like Ken Blackwell who you can't get more conservative than him in Ohio. Glenn Beck, Erick Erickson. These guys --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> All right. I heard those guys. I heard those guys. They are very good guys. I love all of them. They are good conservatives.</p>                \n                \r\n\n            \n                <p><b>MILLER:</b> So, give me a break. On your network --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>COHEN:</b> No, no --</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Adriana --</p>                \n                \r\n\n            \n                <p><b>MILLER: </b>-- Charles Krauthammer. Steven Hayes. These guys were conservatives.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Adriana, if you are Hillary Clinton, do you put money in this Super PAC?</p>                \n                \r\n\n            \n                <p><b>COHEN:</b> Exactly.</p>                \n                \r\n\n            \n                <p><b>MILLER</b>: Hillary Clinton has Donald Trump campaign.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>COHEN: </b>Mitt Romney the two-time loser who is mettling in this election and all the establishment elites who are wetting their pants because they're afraid finally they're going to start losing power. They're going to lose the nomination to Donald Trump, they are basically, this PAC, your PAC is directly helping Hillary Clinton. Because I will tell you what's going to happen when the establishment elites like Mitt Romney effectively you know, sabotages election at the convention. They're going to be nullifying millions of Trump supporter's voters, votes. And we're -- that's going to alienate a whole swath of people. And what's going to happen is, we are going to punch back during the general election. We are not going to show up at the polls because we are not going to be forced into electing Ted Cruz or another candidate that we didn't pick. And Hillary is going to win.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Adriana, hold on. I want to play a sound bite, I want you both to react, that's pretty good. Listen.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SAM CLOVIS, NATIONAL CO-CHAIR, DONALD TRUMP CAMPAIGN:</b> We have people who are elitist. Who are part of the ruling class of this country or pretenders to that throne who think they are part of the ruling class, who are openly and willingly going out here and telling the American people, who have voted for Donald Trump, that they are stupid and that they don't know any better. I want to tell you, if that's the path they want to go down, there will be consequences for that kind of thinking.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: All right. Sam Clovis, the Trump national campaign co-chair. You know, there are a lot of people who agree with what he is saying.</p>                \n                \r\n\n            \n                <p><b>COHEN</b>: It's true.</p>                \n                \r\n\n            \n                <p><b>MILLER:</b> Hey, I totally -- I totally understand what Sam is saying there, Eric. And I that voters who are upset about what's happening in Washington, D.C. have a right to be. Because there is been a lot of terrible things happening in Washington on both sides. But guess what, if they think that the answer, the person who is going to fix it is Donald Trump. They are sorely mistaken. This is the person who is not --</p>                \n                \r\n\n            \n                <p><b>COHEN</b>: Oh, but you have got to be kidding me, Tim. Do you think that the establishment is going to fix it?</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>MILLER</b>: Hey, Adriana, think he is not a conservative. This guy, his entire life --</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Go ahead, Adriana.</p>                \n                \r\n\n            \n                <p><b>COHEN: </b>What have they done? What have they changed? All they have done is funded Obama's left wing agenda. Okay?</p>                \n                \r\n\n            \n                <p><b>MILLER:</b> No, if Donald Trump funded its left wing agenda, Adriana. I don't know what you are listening to.</p>                \n                \r\n\n            \n                <p><b>COHEN</b>: He's not a politician.</p>                \n                \r\n\n            \n                <p><b>MILLER</b>: His whole life he funded these guys.</p>                \n                \r\n\n            \n                <p><b>COHEN:</b> He's not a politician.</p>                \n                \r\n\n            \n                <p><b>MILLER:</b> Donald Trump, here is the thing, Eric.</p>                \n                \r\n\n            \n                <p><b>COHEN:</b> It's Paul Ryan, these people are in power.</p>                \n                \r\n\n            \n                <p><b>MILLER</b>: Here is the thing Eric, you're a Rand Paul guys. You are a Rand Paul guy. Say whatever you think about Rand Paul, this is somebody who respected the constitution and understood what this country was about. And that's putting the rights back in the hands of the people not the government.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Well, let's be clear --</p>                \n                \r\n\n            \n                <p><b>MILLER:</b> Donald Trump is all about putting the rights in the power of the government. He doesn't respect the First Amendment, the Second Amendment, the Tenth Amendment --</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Hold on, guys. Guys, hold on. Let's be clear. I'm an outsider guy. I don't like the establishment. We have -- conservatives have been promised a load -- a bill of goods and we haven't really got them.</p>                \n                \r\n\n            \n                <p><b>COHEN:</b> Right.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>So, I like the outside. That's where I am.</p>                \n                \r\n\n            \n                <p><b>MILLER: </b>But issues matter, Eric. Policy matters. You can't just be goofed because you are outside.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> But hold on, Tim. When are you going to give up -- when are the elites just going to realize we're just not there in to you anymore?</p>                \n                \r\n\n            \n                <p><b>MILLER</b>: Look, I'm never going to give up fighting against somebody who doesn't respect the constitution. Eric, never going to do it. And neither of these other conservative people who I have laid out already in this interview.</p>                \n                \r\n\n            \n                <p><b>COHEN:</b> Donald Trump is going to beat Hillary Clinton in the general.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> We do realize with this election, the emotions are running high and say, thank you very much Tim and Adriana for a very good debate. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The 'Never Trump' movement's impact on the 2016 election", "description": "Are attacks on the GOP frontrunner actually helping Hillary Clinton? 'The O'Reilly Factor' investigates", "date": "2016-03-21T12:11:04Z"}