{"vcmId": "c6145d80-98f5-439c-9185-78bcb2bb6c52", "url": "http://www.foxnews.com/transcript/2014/11/21/charles-krauthammer-reacts-to-president-remarks.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 20, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> President Obama speaking for about 15 minutes. Joining us now from Washington with reaction, Charles Krauthammer.</p>                \n                \r\n\n            \n                <p>So, putting the constitutional deal aside for now, what is the damage to the country the President signing that order tomorrow?</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, FOX NEWS CONTRIBUTOR: </b>Well I think on policy, it is very clear that he is making an announcement to all of THOSE people around the world waiting to enter the U.S. Legally that they are chumps and that if you want to get in this country, you want to stay in this country, the way to do it is to come across here illegally and ultimately you will be legalized.</p>                \n                \r\n\n            \n                <p>I find the President's audacity here rather remarkable. He tells us at the end in that little oration that we heard that I have to explain why I feel so strongly about this issue. So strongly, in fact, that he invokes scripture to support his executive order.</p>                \n                \r\n\n            \n                <p>If he felt so strongly about the issue, why did he delay announcing this until after he got the past the election, because he knew that had he announced it earlier and after all, it's supposed to be so urgent, it would have damaged the Democrats' chances in the election. Why did he not do this before the 2012 election? Because he didn't want to jeopardize his own re-election.</p>                \n                \r\n\n            \n                <p>But most important, if he feels so strongly about this and scripture dictates that this ought to be done, why did he do nothing about this in 2009 and 2010 when he had control of the White House, the House, and the Senate and he could actually have done this constitutionally by passing legislation. He wants the issue and he wants to use it and that's what he has got.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Anyone listening to you tonight, and what you just said, will then take away that the President is a complete phony, that he is doing this for venal reasons, not compassionate reasons, and that if you put that together, he is a bad person. Is that what you mean to say?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> No of course not. What I'm saying is he a very skilled politician who has used the issue for six years the way many politicians do, but it becomes somewhat offensive when he pretends it's for such high principle. And the facts I brought up are the ones that show --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So you don't think that any --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> -- that when he had the opportunity to do this he didn't do it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And all of that is factual. So you don't think he is a principled man though. You think he is doing this for political reasons?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Look, whatever the motives are, the fact is that you can have honorable debates about the substance of a policy. I have been writing for 10 years that I would support legalization of 11 million illegal immigrants for some of the reasons that the President had spoken of because we are a generous, a great nation and we don't want to see people living in the shadows. But only, only if the country can be assured that this will be the last cohort, the last 11 million who will come in illegally.</p>                \n                \r\n\n            \n                <p>And if that's the case, I think there will be a consensus in the country, shut the border. It will reduce the river of illegal immigration to a trickle and the country will rally around legalization. But not if they think that this is, as this executive order actually is, an invitation for anybody to come across the border and to know that ultimately they will be legalized.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok now the President seems to have convinced himself that the border is secure, you know. Citing the statistics on the deportations and the amount of people crossing -- they are as low as they have been in 40 years, and on and on and on. He has convinced himself that hey we don't have a problem down there. And you say?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> He convinces himself of a lot of things. And this is one of them. The deportation numbers are completely distorted because up until Obama, the deportations that were counted were those from within the country. They changed the recording system, and anybody who today comes across and is returned immediately, who in the past was not counted is now counted among the deported so the numbers are inflated. And we all know why there was a decline in the river of illegal immigration over the last several years. It was because of the recession.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The jobs weren't available.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>And we all know -- and we all know that as the economy recovers, we're going to have the crisis that we had this summer over and over again. And not just with children, but there will be a lot of people who will come across thinking as the President said they are going to be allowed out of the shadow.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Sure because they're not going to read the micro of this the word is going to get out -- come on in.</p>                \n                \r\n\n            \n                <p>Charles, thank you as always.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Charles Krauthammer reacts to the President's remarks", "description": "President Obama announces unilateral action on immigration", "date": "2014-11-21T13:24:46Z"}