{"vcmId": "c6f97964-17d7-445b-a535-874888fd16d2", "url": "http://www.foxnews.com/transcript/2016/04/20/bill-oreilly-is-supreme-court-compromised.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Is it really looking out for you? They are the ultimate power in America. Justices on the high court and what they say goes even in matters of life and death. Hello Roe v. Wade. The Supreme Court has one major limitation, however, it cannot make law from scratch. It can only uphold or strike down what Congress and state legislatures have already passed.</p>                \n                \r\n\n            \n                <p>Enter President Obama who is trying to redefine immigration law by ordering a quasi-amnesty for about four million illegal aliens. Thus, by signing an executive order, here's the pen, Bing. The President is changing federal immigration law. Something that on paper only Congress has the power to do. So, led by Texas, 26 states have sued the federal government saying the President has exceeded his authority under the constitution. Yesterday, the Supreme Court heard arguments in the case.</p>                \n                \r\n\n            \n                <p>Sadly, it is a forgone conclusion that the four liberal judges on the court will decide the issue based on their own political beliefs. Not what the constitution says. This has been a pattern of behavior for decades. Here's the proof. Listen to this. The solicitor general of Texas, Scott Heller, argued in court, quote, \"Congress has to grant the statutory authority first for the President to be able to act.\" But the very Liberal Justice Sonia Sotomayor replied, \"Those nearly 11 million unauthorized aliens are here in the shadows. They are affecting the economy whether we want them to or not.\"</p>                \n                \r\n\n            \n                <p>The answer is if Congress really wanted them not to have an economic impact, it would allot the amount of money necessary to deport them. But it hasn't. While that may or may not be true, so what? Justice Sotomayor is not supposed to be concerned with forging policy for this nation. She does not have oversight over what Congress should do. Her job is to rule on established law, not create it. Talking points urges all Americans to figure this out. We now have a Supreme Court that is activists, political, not unbiased. And devoted to protecting the balance of power vital to a free society. We don't have that.</p>                \n                \r\n\n            \n                <p>There is no question that Sotomayor, Ginsburg, Kagan and Breyer will rule in favor of President Obama because they like his view on illegal immigration. Even if it goes against the well-defined separations of power. And that is flat out dangerous. Or am I wrong? And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Is the Supreme Court compromised?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 4/19", "date": "2016-04-20T12:38:32Z"}