{"vcmId": "c834fa38-ef54-4ef6-8306-c8bb26e117bc", "url": "http://www.foxnews.com/transcript/2014/11/20/bill-oreilly-president-obama-immigration-order.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The President set to speak to the President tomorrow on Thursday about 8:00 p.m. It's widely expected he will legalize about five million undocumented people many of whom have children who are American citizens. There will also be other immigration orders in his executive action.</p>                \n                \r\n\n            \n                <p>As everybody knows, this is extremely controversial. And a new NBC/\"Wall Street Journal\" poll out today breaks it down this way. Do you approve or disapprove of the President taking executive action on immigration? 48 percent disapprove, 38 percent approve, 14 percent no opinion or unsure.</p>                \n                \r\n\n            \n                <p>Putting emotion aside, the issue is not really about the five million undocumented human beings it's about President Obama challenging the Constitution. \"Talking Points\" has said it before the President should wait and give the new Congress a chance to pass a fair immigration law. If Congress doesn't do that, Mr. Obama's legal position would then be stronger, allowing him to take unilateral action.</p>                \n                \r\n\n            \n                <p>But the way things stand now, surely the President will lose in the courts. I believe Mr. Obama knows that and well understands how divisive his actions will be. But he doesn't seem to care. And history will not look kindly on a sitting president causing a constitutional ruckus. Trust me on that.</p>                \n                \r\n\n            \n                <p>That's the first &#8220;Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: President Obama's immigration order", "description": "Talking Points 11/19", "date": "2014-11-20T13:16:58Z"}