{"vcmId": "c8900fe3-7fcd-4d02-bd50-81d5339083eb", "url": "http://www.foxnews.com/transcript/2016/02/06/bill-oreilly-some-new-polling-out-new-hampshire.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>With the big vote coming this Tuesday, polling takes on some gravitas at this point. Wall Street Journal/NBC has Trump ahead in New Hampshire with 30 percent, Rubio 17, Cruz 15, Kasich 10, Bush 9, Christie 4, Carson 4, Fiorina 2 percent. CNN has it Trump 29, Rubio 18, Cruz 13, Kasich 12, Bush 10, Christie 4, Fiorina 4, Carson 2.</p>                \n                \r\n\n            \n                <p>On the Democratic side CNN Sanders 61, Clinton 30. NBC Sanders 58, Clinton 38. It should be noted the new Boston Globe poll has it closer -- Sanders ahead by the nine points.</p>                \n                \r\n\n            \n                <p>Now, I expect Donald Trump to win the New Hampshire primary but the surge of Marco Rubio is worth noting. No question the Iowa vote helped him. Ted Cruz continues to campaign energetically as do Kasich, Bus and Christie. Possible -- not probable -- there will be a surprise in New Hampshire.</p>                \n                \r\n\n            \n                <p>On the Dem side Bernie Sanders is running strong, don't ask me why. Nobody can quite figure out why the voters in the \"live free or die state\" want a socialist to become president.</p>                \n                \r\n\n            \n                <p>Last night it was very entertaining watching Bernie at the debate saying what he always says. The billionaires are running the country. The economy is rigged. I will stop that.</p>                \n                \r\n\n            \n                <p>On the other side, Hillary Clinton was Hillary Clinton. You either like her or you don't. On that subject, Quinnipiac did a national poll, pitting Sanders and three Republicans against Secretary Clinton.</p>                \n                \r\n\n            \n                <p>She is ahead of Sanders 44 to 42, but that's a tie with the margin of error factor. She beats Donald Trump 46-41. She ties Cruz 45-45, but loses to Marco Rubio 48-41.</p>                \n                \r\n\n            \n                <p>Talking Points has said it before and Ed Henry's reporting backs it up, the Clinton campaign does not want to run against Rubio. For all of you partisans out of there, that's not a knock on your candidate. It is simply a fact.</p>                \n                \r\n\n            \n                <p>Yesterday on the campaign trail, in New Hampshire, Donald Trump was his typical flamboyant self.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> We are going to have businesses that used to be in New Hampshire that are now in Mexico come back to New Hampshire and you can tell them to go<b> (EXPLETIVE DELETED)</b> themselves.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now in all of my years of reporting that is the first time I have ever seen a presidential candidate make use of the f word while campaigning. Trump, indeed, is unique.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Some new polling out of New Hampshire", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/5", "date": "2016-02-06T22:39:59Z"}