{"vcmId": "c8b0a92a-44c5-42fb-91e1-0a560931812a", "url": "http://www.foxnews.com/transcript/2014/11/06/bill-oreilly-democrats-get-their-butts-kicked.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>And you know what? You know what? They earned the thrashing. The Democratic Party led by President Obama has failed to lift the American economy, has not provided enough protections for the American people. The Democratic leader in the senate, Harry Reid, blocked most meaningful reform bills, allowing bad policies to continue. And the American people know it. About 65 percent of voters yesterday told exit pollers, the country is going in the wrong direction. So there is no debate. That's why the Republicans have now assumed power in America.</p>                \n                \r\n\n            \n                <p>This afternoon, President Obama reacted to that reality.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>ED HENRY, FOX NEWS CHIEF WHITE HOUSE CORRESPONDENT:</b> I haven't heard you say a specific thing during this news conference that you would do differently. You've been asked it a few different ways.</p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>Ed, what I would like to do is to hear from the Republicans, to find out what it is that they would like to see happen.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Sure -- fine. When all the dust settles, it will likely be 54 Republican senators, 44 Democratic senators, two independents that vote Democrat. On the governor front, looks to be 31 Republicans, 18 Democrats, one Independent. And in the house it looks to be 244 for the G.O.P., 179 for the Democrats around there.</p>                \n                \r\n\n            \n                <p>So you can see that the Republican Party is now in a position to make things happen. And tomorrow \"Talking Points\" will suggest exactly what Republicans must do to win the folks over.</p>                \n                \r\n\n            \n                <p>But this evening is worth discussing exactly why President Obama took it on the chin. First of all his economic policies have not worked. Take home pay for most working Americans has dropped on his watch. That is the only important economic indicator for the folks. Many Americans don't have enough money to fulfill their obligations. And the reason is, Mr. Obama wants the feds to run the economy.</p>                \n                \r\n\n            \n                <p>Even today, after the Republican landslide, the liberal \"New York Times\" is screaming that the government has to, quote: \"create jobs.\" Moronic. The private sector creates jobs. And when jobs are plentiful, salaries go up because there is competition for the individual worker.</p>                \n                \r\n\n            \n                <p>And then there is President Obama's style. You simply do not play golf after announcing that an American has been beheaded by ISIS terrorists. That is inappropriate. And the American people took notice. Also, when there is a threat of an epidemic, Ebola, you, the President, take quick decisive action. You do not allow the Centers for Disease Control to confuse everybody. And that's exactly what happened. By the way, I'm still looking for Dr. Thomas Frieden. Anybody seen him? Finally, you do not -- do not play the race card.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> I believe and I firmly believe this, if we did not have an African-American president in the White House as we speak right now, Mary Landrieu would not be in trouble. Kay Hagan would not be in any kind of trouble.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Elements of the far left are addicted to the race excuse. It's offensive and it has harmed the image of the Obama administration.</p>                \n                \r\n\n            \n                <p>Exit polling yesterday says that American voters are most concerned about the economy and they should be. On his watch President Obama is desperately trying to redistribute income. And in the process is creating a welfare state in America. That welfare state is unsustainable. And can you see that in the national debt. Which will, most likely be, more than $20 trillion once President Obama leaves office. Add it all up, and you have the vote last night and that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The Democrats get their butts kicked", "description": "Talking Points 11/5", "date": "2014-11-06T12:50:07Z"}