{"vcmId": "c8dfc2c0-48b0-45ef-bbef-840217e30678", "url": "http://www.foxnews.com/transcript/2015/06/12/bill-oreilly-younger-americans-disrespecting-authority.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As you may know if you watch The Factor often, we have two running themes going on right now.</p>                \n                \r\n\n            \n                <p>First, that the nation's police officers have been so demonized by zealots in the liberal media that some on the job are tentative.</p>                \n                \r\n\n            \n                <p>Secondly, that young people in America, especially teenagers, now have a defiance toward authority not seen since the Vietnam days.</p>                \n                \r\n\n            \n                <p>Here in New York City, the uber liberal Mayor Bill de Blasio has alienated his own police department of nearly 35,000 officers by running them down verbally and instituting policies that make it more difficult to deal with criminals on the street. In addition, New York City cops are seeing a growing disrespect.</p>                \n                \r\n\n            \n                <p><b>(BEGIN AUDIO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BRATTON: </b>It's just a less respect for authority. I think some of it is coming out of the fact that we have so many home environments in this country that are not home environments in the traditional sense, that there is no direction at home.</p>                \n                \r\n\n            \n                <p><b>(END AUDIO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Talking Points has been saying that for years and it's true. If an American child does not have guidance and supervision in the home, there is a good chance that kid will get involved with antisocial behavior quickly. So, for police authorities, things are not good out on the street across the country right now. And when you add in liberal mayors and prosecutors, who handcuff the cops, pardon the pun, things get even worse.</p>                \n                \r\n\n            \n                <p>Case in point, Marilyn Mosby, prosecuting six Baltimore police officers in the death of Freddie Gray. Ms. Mosby, we now learn, was so concerned about drug activity in poor Baltimore neighborhoods, she ordered police to step up aggressive action against street pushers. Freddie gray was one of those dealers with a long rap sheet of drug involvement including heroin. So that's the most likely reason the cops chased Gray and put him into custody. He died a short time later.</p>                \n                \r\n\n            \n                <p>Asked about her order, Miss Mosby stonewalled.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MARILYN MOSBY, BALTIMORE CITY STATE'S ATTORNEY:</b> I'm not going to litigate this case in the media. I will litigate it in the courtroom. So I'm not going to discuss my evidence or the strategy or any of that.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>Speaking on this issue of drug use and cutting down on drug abuse, you ordered the police department to follow the Mountain Street and North Street area.</p>                \n                \r\n\n            \n                <p><b>MOSBY: </b>I cannot talk about the specifics of any of this case, prosecutorial ethics precludes me from doing so.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That is not true. Miss Mosby can certainly define what her antidrug policy was before the Freddie Gray incident. The woman is dodging, no question.</p>                \n                \r\n\n            \n                <p>If you were around the late 1960s or early 70s you know history is repeating itself. Back then the American establishment embraced the war in Southeast Asia that forced millions of young Americans to be drafted. The war turned out to be a fiasco because of the politicians not the U.S. military. So distrust among young Americans skyrocketed. That led to a breakdown of authority and the rise of the sex, drugs, and rock `n' roll era.</p>                \n                \r\n\n            \n                <p>Today we have the era of self-absorption where many Americans simply don't care about society in general. They are locked into their own worlds, encouraged by high tech. The collapse of authority in America will lead to very bad consequences. We're just seeing the beginning of this situation.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Younger Americans disrespecting authority", "description": "Bill O'Reilly's Talking Points 6/11", "date": "2015-06-12T12:25:11Z"}