{"vcmId": "c9f93e38-fd77-498a-818c-6301d506d51a", "url": "http://www.foxnews.com/transcript/2015/02/19/religious-leaders-demanding-action-against-isis.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 18, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>&#160;Continuing now with our lead story, confronting the worldwide jihad. &#160;Joining us from Los Angeles Rabbi Marvin Hier, the head of the Simon Wiesenthal Center; and from San Francisco Sally Vance- Trembath, a professor of religious studies at Santa Clara University.</p>                \n                \r\n\n            \n                <p>So, we will begin with you, Professor. &#160;I don't have any confidence in the politicians, not only in the United States but around the world in confronting the Muslim terrorists. &#160;They seem afraid to do so. &#160;So, now I'm asking the clergy to rise up in defense of the poor innocents who are being slaughtered. &#160;Do you agree with me?</p>                \n                \r\n\n            \n                <p><b>SALLY VANCE-TREMBATH, SANTA CLARA UNIVERSITY:</b> &#160;I certainly think that religious leaders should exercise their voice to talk about what true religion is; what truth claims about reality are. &#160;But I do want to caution that these terrorists -- it's not religion, it's a form of -- a kind of a cult of death that has more to do with politics than it has to do with any kind of faith claims and truth about God is and how God operates in the real world. &#160;</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>&#160;But isn't it true that it's good versus evil, Professor? &#160;<br> Isn't it true that innocent people, human beings are being slaughtered by evil doers, using the name of God to do their killing? &#160;So if that is true, it's a good versus evil moral situation that we absolutely need religious leaders like Pope Francis did this week to speak out and tell the politicians you have got to stop it.</p>                \n                \r\n\n            \n                <p><b>VANCE-TREMBATH: </b>&#160;I certainly agree with that. &#160;One of the roles of religion is to name evil. &#160;</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>&#160;I'm glad you agree with that.</p>                \n                \r\n\n            \n                <p>Now, Rabbi, Jews all over the world are target number 1 for these jihadists. &#160;And I'm asking every rabbi and every Jewish leader to come together and demand that President Obama and the other Western leaders do something about it. &#160;Am I wrong? &#160;</p>                \n                \r\n\n            \n                <p><b>RABBI MARVIN HIER, SIMON WIESENTHAL CENTER: </b>&#160;You are absolutely right, Bill. &#160;These are not random acts. &#160;It's true that the majority of the world's Muslim population are against jihad. &#160;But a whopping minority, according to the Pew study, 22 percent are in favor of a form of jihad. &#160;Now what does that mean? &#160;That means that it could be if you look at the numbers that more people are in favor of jihad than represented the Axis Powers in 1939 when they took on Western civilization. &#160;That is a pandemic. &#160;</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> &#160;Yes. &#160;I don't know if people understand a million and a half, billion and a half Muslims around the world if you have got 22 percent of them saying yes, we are going to kill Christians and Jews because we want to impose our perverted twisted sense of religion you have a major problem.</p>                \n                \r\n\n            \n                <p>Let me ask you this though Rabbi. &#160;Some of the opposition to aggressive action against ISIS and al Qaeda comes from the left and the far left in America -- the progressive movement, which is very popular among some American Jews. &#160;How do you explain that? &#160;</p>                \n                \r\n\n            \n                <p><b>HIER:</b> &#160;Listen, I can't speak for them. &#160;That's not my point of view, Bill. &#160;I want to say very clearly that had the world listened to Winston Churchill in the 30s, 50 million peoples' lives would have been spared. &#160;<br> You know, when I see this appeasement and the fact that no one is willing to call it what it is, this is a war against Islamic fundamentalism, not mentioning the name does a disservice to the battle.</p>                \n                \r\n\n            \n                <p>Who are we fighting? &#160;We are not fighting millions of Christians who are terrorists we are not fighting millions of Jews who are terrorists. &#160;We happen to be fighting a significant minority of Islamic fundamentalists that are perverting their religion and it will take the rest of the Muslim population, those who are against jihad, to aggressively take them on. &#160;</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> &#160;I agree 100 percent with that.</p>                \n                \r\n\n            \n                <p>Now, Professor Trembath, religion by its very nature in America is peace-loving. &#160;All right -- both the Christian faith and the Jewish faith, there aren't many Muslim Americans. &#160;I think a million and a half here. &#160;<br> But Muslim Americans aren't violent people. &#160;I mean very, very little violence in those communities.</p>                \n                \r\n\n            \n                <p>But now we are calling for people of faith and clerics in America to demand that Washington protect innocent people from evil. &#160;And I think a lot of religious leaders are very uneasy to do that. &#160;</p>                \n                \r\n\n            \n                <p><b>VANCE-TREMBATH: </b>&#160;Well, it's certainly -- I mean I agree with you that that there is a long strain in the Judeo-Christian tradition that pushes back against violence -- to the widow, the orphan, the stranger, the marginalized. &#160;That's a central feature of the truth claim we make about reality as Christian, Jews and Muslims who believe that the human person has the distinct reality of being the intersection of the human and divine. &#160;<br> That God dwells in the activities of loving and knowing and hoping and doing good and creating beauty.</p>                \n                \r\n\n            \n                <p>I mean Muslims, Jews and Christians all share that truth claim about reality. &#160;That is certainly true and sometimes that doing goodness requires us to push back against violence. &#160;It's complicated in how we work it out. &#160;</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>&#160;It's evil. &#160;</p>                \n                \r\n\n            \n                <p>Rabbi, I'm going to let you close out the segment. &#160;Am I wrong for doing this Rabbi? &#160;I'm putting pressure on my religion, the Catholic Church, which I think has been very weak. &#160;I think Pope Francis as I said has been strong but in America very, very weak on this. &#160;They don't preach in the pulpit. &#160;They are afraid. &#160;I'm putting pressure on my people.</p>                \n                \r\n\n            \n                <p>And I'm calling for protestants and Jews this weekend to stand up and level with their congregations that there is evil it's killing people and you have to confront President Obama and congress. &#160;You have got to tell them this has got to stop. &#160;And the world has to unite against it.</p>                \n                \r\n\n            \n                <p>Just as you said with the Nazis, if the world had united against it in the 30s that wouldn't have happened. &#160;They didn't. &#160;It's exactly the same thing. &#160;Last word -- Rabbi. &#160;</p>                \n                \r\n\n            \n                <p><b>HIER:</b> &#160;You are absolutely right. &#160;The Almighty was a realist. &#160;The Ten Commandments are equally divided five positive, five negative. &#160;Why is that? &#160;Because God knew this is the planet earth, evil exists. &#160;You can't just be a do-gooder if you are not prepared to stand up and take on evil. &#160;That is what is required at this moment in history. &#160;</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>&#160;All right. &#160;We appreciate you both. &#160;Very good debate.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Religious leaders demanding action against ISIS", "description": "Will the American clergy begin to get involved in countering the Jihad?", "date": "2015-02-19T13:08:46Z"}