{"vcmId": "ca80c8f0-4d29-454e-9c33-34aca186e0fb", "url": "http://www.foxnews.com/transcript/2015/08/31/more-outrageous-comments-from-hillary-clinton.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 28, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>We begin tonight with more outrageous comments from Hillary Clinton as questions about her secret e-mail server and falling poll numbers follow her everywhere. Hillary is unleashing inflammatory attacks against the GOP.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON (D), PRESIDENTIAL CANDIDATE</b>: I know that there are some on the other side who are seriously advocating to deport 11, 12 million people who are working here. I find it the height of irony that a party which espouses small government would want to unleash a massive law enforcement effort, including, perhaps National Guard and others to go and literally pull people out of their homes and their work places, round them up, put them, I don't know, in buses, boxcars, in order to take them across our border. I just find that not only absurd but appalling.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Well, this comes a day after Hillary compared Republicans to terrorists.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> Extreme views about women -- we expect that from some of the terrorist groups. We expect that from people who don't want to live in the modern world. But it is a little hard to take coming from Republicans who want to be the President of the United States.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Really? But Hillary supporters quickly doubled down.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JENNIFER GRANHOLM (D), FORMER GOVERNOR OF MICHIGAN:</b> She wasn't calling them terrorists. She was saying why is the Republican Party so out of date? And, truly, I mean if you look at what these candidates are espousing, no exceptions for rape or incest? I mean come on.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Ok. So no apology is necessary.</p>                \n                \r\n\n            \n                <p><b>GRANHOLM:</b> No. I mean that's kind of ironic, Chris, don't you think coming from the party with Donald Trump with such inflammatory wild rhetoric. No, I think she is totally right to call them out on their extremism.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Well, Republicans were quick to pounce.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. MARCO RUBIO (R-FL), PORESCAND:</b> They won't call terrorists \"terrorists\", going all the way back to Benghazi and even before that but they call their political opponents \"terrorists\".</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> So is this another unforced Clinton error or is the former secretary of state telling Democratic primary voters exactly what they want to hear?</p>                \n                \r\n\n            \n                <p>With us now Jeff Smith, the former Democrat state senator from Missouri and a professor at the New School here in New York City; and from Tampa, Florida Adam Goodman, a Republican strategist.</p>                \n                \r\n\n            \n                <p>Adam -- I'm going to start with you right off the bat. That first Hillary Clinton sound bite. She mentioned boxcars. Now a day ago she compared GOP to terrorists. Boxcars -- the first reference I think of is Nazis bringing Jews to their ultimate demise. Was this an unforced error or was that perfectly placed by the Clinton campaign?</p>                \n                \r\n\n            \n                <p><b>ADAM GOODMAN, REPUBLICAN STRATEGIST</b>: It's unbelievably unhinged. I mean you are hearing the hyperbole of desperation from a campaign that's flailing in message and falling in the polls. She is upside down, Eric in terms of believability. Six out of ten Americans don't trust her. She is upside down in terms of likability and increasingly she's going the wrong way in terms of inevitability at a time when Americans want real and genuine. What they are really seeing from Hillary is deceit and dishonesty, and she has got to do better than that if she expects to not only be the nominee of her party but to be a serious combatant for president of the United States.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Jeff, now you were state senator but now you are a professor. You hear Hillary Clinton use the term \"boxcars\". What comes to your mind?</p>                \n                \r\n\n            \n                <p><b>JEFF SMITH, NEW SCHOOL PROFESSOR: </b>Well, clearly, it may not have been the best way to phrase things, but everyone is making such a big deal out of the words she is using. What I think Republicans are doing right now is desperately -- I think Republicans have --</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>You don't have a problem with the word \"boxcar\"?</p>                \n                \r\n\n            \n                <p><b>SMITH:</b> -- are making a desperate attempt to distract from their own party's rhetoric. Look in 2013 --</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Let's stay on Hillary though. Yesterday she compares GOP to terrorists. I mean that was outrageous enough. I listen to it I go really -- did she really just do that? And then she doubled down even worse and talking about a Republican strategy to -- on immigration and she compares that to Nazis?</p>                \n                \r\n\n            \n                <p><b>SMITH</b>: And the Republican strategy on immigration to deport 12 million people is totally ridiculous and everyone knows it. In 2013 Reince Priebus says we have got to change the tone. They did the autopsy, the RNC autopsy of the 2012 election. He said the one policy thing we have got to do differently is to do something about immigration.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Off the cuff remark or planned comment -- boxcars?</p>                \n                \r\n\n            \n                <p><b>SMITH</b>: Probably an off the cuff remark.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> What do you say, Adam?</p>                \n                \r\n\n            \n                <p><b>GOODMAN: </b>Off the cuff remark? I mean can you imagine what that means to Jews not only in this country but across the world? Can you imagine what that means to people who lived through the history of all of that? It's not only insulting and out of place, it's wrong. But it really reveals a candidate that's kind of flailing and in trouble.</p>                \n                \r\n\n            \n                <p>And, actually, you know, we have heard a lot recently, Eric, about the possibility that Joe Biden may enter into the race for president. I can tell you it may actually be the best thing that ever happened to Hillary, because, right now, as she seeks a coronation to the nomination, she is doing very, very badly. She is going to need someone to up her game. If she does not, she is not going to be ready for prime time when it comes.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Adam -- Marco Rubio -- we played a sound bite of Marco Rubio saying the Democrats can't even call terrorists \"terrorists\" but they want to call GOP \"terrorists\". Do you want to weigh in on that?</p>                \n                \r\n\n            \n                <p><b>GOODMAN:</b> I do. I mean this is the time whether you like Donald Trump or not he is bringing it and kind of bringing it straight. People want straight talk right now more than ever at a time when most Americans are kind of shaking in their boots about our inability as a country to get things done.</p>                \n                \r\n\n            \n                <p>So I think Marco is absolutely on the right track. Call things for what they are. And then let's find out what the remedies that are needed to turn this country around and go for it.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Jeff --</p>                \n                \r\n\n            \n                <p><b>GOODMAN: </b>Hillary seems to be really concerned about choosing tough words as opposed to being ready to bring tough action.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> And maybe, Jeff, let me ask you. Using the word -- you know, comparing GOPers to terrorists. Using the term \"boxcars\" -- Nazi reference. Maybe it's because of the recent Q poll that showed that the most common word associated with Hillary Clinton amongst Democrats and Republicans is \"liar\", is \"untrustworthy\".</p>                \n                \r\n\n            \n                <p><b>SMITH: </b>Well, first all, I would say that Bill Clinton didn't have the best reputation for being trustworthy in this country but it didn't stop him from getting elected and reelected and presiding over eight years --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Bill Clinton was a master politician. You're not going to say that Hillary -- you are not putting Hillary Clinton in the same category as Bill Clinton as far as a politician?</p>                \n                \r\n\n            \n                <p><b>SMITH:</b> It doesn't mean that someone can't be elected. He presided over 8 years of peace and prosperity which you can't say for his predecessor.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>All right. Is she trying to change like you are right now, trying to change the debate from her poll numbers and her untrustworthiness and liar and all these sort of things where she is underwater into hey if she says things like \"terrorists\" and \"boxcars\" we forgot about the Q poll that came out yesterday.</p>                \n                \r\n\n            \n                <p><b>SMITH:</b> I don't think that's the concerted strategy. What I think is important to recognize is you can't beat somebody with nobody. And right now the word that's most closely associated with the Republican frontrunner, Donald Trump and Jeb Bush are \"arrogant\" and \"Bush\". And since Jeb's brother left office with an approval rating about equal to what Nixon's was during impeachment, I don't think Republicans should be --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> See this -- Adam, this is how they're good. This is how the left does it. You ask them a question and they bring it right back to something else. We are on Hillary and her comments and then we brought it back to Bush and Trump. Last thought, Adam, very quickly.</p>                \n                \r\n\n            \n                <p><b>GOODMAN: </b>Well, that's what we just heard is instead of answering questions they like to demonize. What Hillary has tried to do Eric, she's tried to deflect, ignore, and attack. Right now she is on the attack. None of those things have worked. You better come up with something better or Joe Biden is not only going to get into this race, he's going to be everything she can handle.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Adam and Jeff -- thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "More outrageous comments from Hillary Clinton", "description": "Former Secretary of State unleashes inflammatory attacks against the GOP", "date": "2015-08-31T12:06:07Z"}