{"vcmId": "cae7cf19-34e2-448b-9aab-863df2f01c43", "url": "http://www.foxnews.com/transcript/2015/03/06/bill-oreilly-hillary-clinton-latest-drama.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>From January 2009 to February 2013, four years Hillary Clinton served as secretary of state. During that time, she apparently did not use secure government e-mail, instead choosing to use her own private account which was not a violation at the time -- it is now as the law has changed.</p>                \n                \r\n\n            \n                <p>But even before the change, all private e-mail by federal employees was mandated, supposed to be mandated, to be preserved. You couldn't erase anything. And then there is the question of security. It's much easier to tap into an e-mail account that's not secure. That's why the law has changed.</p>                \n                \r\n\n            \n                <p>So once again, Hillary Clinton is in the middle of a controversy. This one comes just a few days after it was revealed that the countries of Algeria and Qatar donated money to the Clinton Foundation. Some of that money was sent before Hillary Clinton left the State Department -- a conflict of interest.</p>                \n                \r\n\n            \n                <p>So you can see that as Gilda Radner once said it's is always something. And that is beginning to worry some Democrats.</p>                \n                \r\n\n            \n                <p><b>ROBERT GIBBS, FORMER WHITE HOUSE PRESS SECRETARY:</b> I think it is obviously highly unusual. I think it's much easier for critics to explain why they don't exist than it might be for her to explain why she used a private e-mail?</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> Why did she use a separate e-mail? How did she secure that e-mail? Was there another e-mail through which she communicated with people? By not answering these questions, they are allowing this story to fester in ways that are unhelpful.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Again, those are Democrats. Now \"Talking Points\" believes the Hillary Clinton situation is pretty well defined in the U.S.A. Americans know her. They know her husband. And they know the Clintons as the \"Wall Street Journal\" points out often walk a thin ethical line. To quote the \"Journal\", \"This is how the Clintons roll.\"</p>                \n                \r\n\n            \n                <p>It will be very hard for federal investigators to uncover any e-mails that Secretary Clinton may have not provided to the government as she is compelled to do. But, if Mrs. Clinton did, indeed, hold back e-mails and investigators find that that will absolutely hurt her presidential run. And if she held e-mails back on Benghazi, she might even be prosecuted. But those are big ifs and if history is any guideline, it will take years to get to the bottom of e-mail gate.</p>                \n                \r\n\n            \n                <p>In the meantime, Hillary Clinton will run, millions of Americans will support her. And the sun will come up tomorrow. That's just the way of the world.</p>                \n                \r\n\n            \n                <p>But it should be noted that in a very dangerous time for America, it is imperative that we, the people, elect a president who is going to look out for us. Not become bogged down in one controversy after another. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Hillary Clinton's latest drama", "description": "Talking Points 3/5", "date": "2015-03-06T13:23:06Z"}