{"vcmId": "cb78b444-559a-4588-bf97-b1907670a1a1", "url": "http://www.foxnews.com/transcript/2015/07/15/bill-oreilly-enabling-evil.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>I hope you saw the interview with the parents of Kate Steinle last night. If not, it's posted on billoreilly.com. During that interview Kate's father spoke about the evil of his daughter's murder.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JIM STEINLE, FATHER OF KATE STEINLE: </b>Faith has kept us strong and the people have kept us strong but Kate's bright light, you know, the battle of evil and goodness -- what happened to Kate was evil personified. But her bright light that has shone all over the world, has helped us.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Talking Points believes every sane person knows that gunning down an innocent 32-year-old woman on the street is an act of pure evil. Yet, there are many Americans who will not act to prevent that kind of evil from taking place.</p>                \n                \r\n\n            \n                <p>We begin with the media, which generally does not oppose sanctuary cities.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> These sanctuaries on the border that allow illegals to stay and if, in fact, they end up getting caught, they cannot be forced.</p>                \n                \r\n\n            \n                <p><b>CHRIS CUOMO, CNN HOST: </b>You are talking about sanctuary cities that exist all over the countries?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> That's correct.</p>                \n                \r\n\n            \n                <p><b>CUOMO: </b>That's a misnomer. Those are cities that are in dispute with ICE about how you deal with people that they're holding.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> They are part of the United States you can't be in dispute with the federal government.</p>                \n                \r\n\n            \n                <p><b>CUOMO: </b>But they're not safe havens, the way you are describing.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>They most certainly are safe havens.</p>                \n                \r\n\n            \n                <p><b>CUOMO: </b>They are not.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's troubling that Mr. Cuomo would say that after the man accused of killing Kate Steinle openly said he was in San Francisco a sanctuary city because he knew he could come and go at will. Maybe Mr. Cuomo forgot about that. Let's give him the benefit of the doubt but he should certainly rethink his sympathies.</p>                \n                \r\n\n            \n                <p>The sanctuary city policy is supported by people who believe that poor illegal immigrants should not be held accountable for violating U.S. Immigration law. That's what this is all about. Folks cloaking themselves in compassion thinking they are being humane to the poor who want better lives.</p>                \n                \r\n\n            \n                <p>But in the process they totally ignore the danger of an unsecured border and that danger is clear. Hundreds of thousands of bad people have entered the U.S.A. The alleged killer of Kate Steinle illegally crossed the border six times. As I said before if a low level thug, a dope pusher and an addict can get in here six times we don't have border security. It doesn't exist. If he has a place that welcomes him, San Francisco, we don't have any security or safety at all.</p>                \n                \r\n\n            \n                <p>It is insulting when pro-sanctuary city people equate poor immigrants with violent criminals. They intentionally deflect the issue away from the danger of giving brutal, undocumented people easy access to this country. They simply don't care about making judgments about those who trespass.</p>                \n                \r\n\n            \n                <p>A good example of that the San Francisco city supervisors. They are unrepentant over the death of Kate Steinle. The Factor contacted all of them asking politely for an interview. They all declined so we went to them.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>Do you feel like the national media has down a little too hard on sanctuary cities and what the main intention is?</p>                \n                \r\n\n            \n                <p><b>JANE KIM, SAN FRANCISCO BOARD OF SUPERVISORS: </b>I think the issue here is gun control. No individual with that type of record should be able to access or be able to have possession of a gun.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>A few words as representative of the city.</p>                \n                \r\n\n            \n                <p><b>KATY TANG, SAN FRANCISCO BOARD OF SUPERVISORS:</b> Of course Fox News would be this rude.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>We tried to call your office. We got no response.</p>                \n                \r\n\n            \n                <p><b>TANG:</b> Because you are interviewing the wrong (EXPLETIVE DELETED) person.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So you see those women will not take responsibility for the danger they allow. And it gets worse. A supervisor named Scott Wiener attacks the messenger.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Supervisor, we don't want to be a pest. Just literally a minute would be great.</p>                \n                \r\n\n            \n                <p><b>SCOTT WIENER, SAN FRANCISCO BOARD OF SUPERVISORS:</b> Fox News is not real news and you are not a reporter. I talk to real news only. Fox News is not real news.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> We want to know if you show remorse. Are you upset that the President didn't reach out to the families?</p>                \n                \r\n\n            \n                <p><b>WIENER:</b> Fox News is not real news.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What a pinhead. Now, there comes a point where people get the government they deserve. That has surely happened in San Francisco. The ultra-left controls the city and an innocent woman, Kate Steinle is dead because of policies that endanger the public.</p>                \n                \r\n\n            \n                <p>You would think those people would rethink their insane ideology but they will not. They will never admit a mistake. The San Francisco crew is aided by a compliant media. As you may know we have proposed Kate's law new federal legislation that would mandate any felon who is deported and comes back receives a mandatory five year prison term -- period. That's opposed by the ACLU, the \"New York Times\" and other uber liberal left media.</p>                \n                \r\n\n            \n                <p>Again, it gets worse. The hate site Salon bannered this headline \"Bill O'Reilly sends the vile Jesse Watters to grandstand in San Francisco over Kate Steinle's murder.\" The hate site Media Matters bannered this \"Fox figures lead the charge praising Trump's immigrant smears for igniting immigration debate\".</p>                \n                \r\n\n            \n                <p>Then liberal newspapers like the \"San Jose Mercury News\" spread the propaganda. Quote from that paper \"Bill O'Reilly: the murder of Kate Steinle proves Donald Trump is right about Mexicans.\" Of course, I never said that. The \"San Jose Mercury News\" fabricated it -- mimicking a hate Web site.</p>                \n                \r\n\n            \n                <p>So here is a suggestion for the Mercury News, Yahoo News and others who print that garbage, you wouldn't use anything from Storm Front, another hate Web site, would you? So why are you using stuff from Salon, which is just as ugly? Why are you legitimizing rank propaganda? You should be ashamed yourselves.</p>                \n                \r\n\n            \n                <p>Tomorrow we will tell you which politicians running for president support Kate's law. We will also tell you what Speaker of the House John Boehner thinks about it. Boehner's interesting. He could take a leadership position here. Will he? The same can be said of Senate Majority Leader Mitch McConnell who has indicated he will get behind Kate's law. We've also asked Hillary Clinton and Bernie Sanders to weigh in.</p>                \n                \r\n\n            \n                <p>It's a damn shame that all Americans cannot support a policy that would protect people like Kate Steinle. If you saw the heart-breaking interview with her parents last night, how could you not support tough measures against criminal illegal aliens. Yet, some Americans will not and even attack me and Fox News for trying to solve this despicable problem.</p>                \n                \r\n\n            \n                <p>Finally, the senate judiciary committee announced today it will begin hearings next week on the lax enforcement of the nation's immigration laws. The committee is going to ask Kate Steinle's parents to testify. Thank God.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Enabling evil", "description": "Bill O'Reilly's Talking Points 7/14", "date": "2015-07-15T12:12:52Z"}