{"vcmId": "cb9f48df-bd7a-4d95-a321-86aa54d1ce0d", "url": "http://www.foxnews.com/transcript/2015/12/22/did-president-obama-play-race-card-against-donald-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 21, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: In the \"Impact Segment\" tonight, President Obama's year-end interview with NPR was chock full of controversy as the commander-in-chief attacked Donald Trump for exploiting the fears of regular Americans about wages, income and the economy overall.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES: </b>I think somebody like Mr. Trump has taken advantage of that. I mean that is what he is exploiting during the course of his campaign.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> That wasn't all. The President also threw down the race card when asked why some Americans fear him.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>Are there certain circumstances around being the first African-American president that might not have confronted a previous president? Absolutely.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Joining us now the factor's dynamic duo: Juan Williams here in New York and Mary Katharine Ham in Washington. Juan I'm going to go to you first. Wow -- the race card? On the year-end summary with NPR?</p>                \n                \r\n\n            \n                <p><b>JUAN WILLIAMS, FOX NEWS ANALYST</b>: You don't think that's true -- Eric? Of course it's true. The guy is a Muslim, the guy is the other. He is never fully accepted. You look at the reality and the elections in 2008 and 2012 he loses white men, especially the white southern states overwhelmingly. You get Boehner, now Ryan, Boehner, McConnell --</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: It's the end of year and this is what he wants to talk about. It's the year-end summary of --</p>                \n                \r\n\n            \n                <p><b>WILLIAMS: </b>No. The question was has race been a factor? He would have been a liar had he said oh no, let's just pretend race doesn't exist in America.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Mary Katharine Ham, he mentioned -- in his own sort of way that race may have had something to do with the success of the economy when he talks about policy, wages, income -- I don't know, it just feels weird to be doing that now.</p>                \n                \r\n\n            \n                <p><b>MARY KATHARINE HAM, FOX NEWS ANALYST:</b> Yes, I think it's a bit of scapegoating and it's an excuse that doesn't speak to the actual failures of policy. Juan is right but, sure, America has not entirely buried its racial concerns. That is the case.</p>                \n                \r\n\n            \n                <p>But that's also a useless comment like he actually needs to address what's going on here. And by the way you when it comes to unprecedented treatment of Barack Obama, I remind everybody that Republicans impeach a white southern dude in the 90s if we all remember so it's not exactly relegated to just this issue.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Juan, do you think it's helpful or divisive when you bring up the race card, when you play the race card on a year-end summary of what's going on in the world and look forward to 2016?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> I think he was asked a question and he answered honestly. Mary Katharine makes the point let's talk policies, let's about the difference in policies. If you talk about the differences in policies you're going to talk about different demographics with different needs, different race.</p>                \n                \r\n\n            \n                <p>Obama, I think, has been afraid to deal with race for most of his tenure for fear that he would be called the black president. He has insisted that he is the president of all the people. So you will get comments, Eric, from the black community saying this guy has not delivered.</p>                \n                \r\n\n            \n                <p>In fact, when O'Reilly is sitting there he oftentimes says to me do you know what the black unemployment rate is, it is double white especially black people, why isn't your president doing something about it?</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Mary Katharine, he blames race, yet he wants to ignore race as Juan points out.</p>                \n                \r\n\n            \n                <p><b>HAM:</b> Well, I think also there have been times when it comes to sensitive racial issues -- I have used Ferguson as an example where he could have been a calming force, he sort of jumped to conclusions, got ahead of his own Department of Justice on the facts of that case and I think that can cause a problem and actually exacerbate things. He has not always ignored race or wanted to not be part of it. He has actually jumped to conclusions and made some things more inflamed.</p>                \n                \r\n\n            \n                <p>So I think that's something that this administration has been guilty of. It is part of the racial equation of this country as well.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Do you know what else I have heard a lot of Juan. I heard a lot of it wasn't my fault. It's not my fault. It wasn't my fault. It's the media's fault. We didn't watch enough cable television to really understand the anxiety of Americans. He is good at placing blame elsewhere.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> Well, I think what he did was take responsibility for the fact at that press conference when he talked about well, I have got a strategy. We have got a plan. And didn't reflect the kind of anxiety and fear that's in the American atmosphere right now. I think he understood that he screwed up.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>He screwed up, Mary Katharine Ham or he's kind of tongue-in- cheek saying I should have watched more cable news -- ha, ha.</p>                \n                \r\n\n            \n                <p><b>HAM</b>: I think what he always makes a mistake of saying is that all of his failures, such that they are, are just perception of failure. I don't think that's the case. There are actual problems in the economy that he promised to fix that he had not. He promised the moon and he didn't deliver. He fell very, very short.</p>                \n                \r\n\n            \n                <p>And so people do have real issues with that. And it's not just fear, it's frustration about realities on the ground. It cannot just all written off as fear and racism and I think that's where he makes a mistake. He owned up to a bit of that but not much.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS: </b>See from my perspective I think he's had a success. I mean you look back on this, you look at the economy. My gosh, the Fed had to raise the interest rates. You look at the Paris peace accord, you look at the Iraq deal, you look at the Trans Pacific deal. So many successes and yet here we are bumming on the guy.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Well no, here's the reason why I'm pointing this out is because during this interview, he literally said, you know, the media hyper blames -- blows things up, makes them bigger than they should be, i.e., radical Islamic terror. Saying it's not as bad as the media is making out to be. Meanwhile, he is willing to talk about gun control and mass shootings quite often.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> How do you think more people die in the country from terrorism or from guns and mass shootings?</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> More gang-related mass shootings.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> Thank you -- that's what I think.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>More gang-related mass shootings, but more gun control is not going to help any one of those things. My point is he says we're overblowing the terror threat because the media is doing it for ratings, his words for ratings. Meanwhile if there is a mass shooting he will go out and talk about it three or four days at a time. Who is overblowing a threat?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> I think that the bigger threat -- go ahead, Mary Katharine.</p>                \n                \r\n\n            \n                <p><b>HAM:</b> The left is more than happy to complain about fear mongering on the right and then use fear mongering for climate change or for Republican budgets or for gone control just willy-nilly as soon as something happens. I think there is a little bit of that on the both sides and the President has been guilty of it many times.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: And Juan we hear today that ISIS stole tens of thousands of blank passports. I mean, it's worse and worse. But if you listen to President Obama, no we have this all -- we have them where we want them.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS: </b>Well, we have a strategy. We don't have them where we want them but do you want to put troops on the ground? I think the President's point is this threat is not deserving of the loss of tens of thousands of American guys.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>You are a football guy, right?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS: </b>I love it.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> You're a football guy. It's the fourth quarter, we are down by 20 and the coach is still running the ball and you're trying to figure out when is he going to start throwing the ball? That's the feeling.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> Eric Bolling -- you've got to love America and realize we are the strongest economy in the world, we're the strongest military -- those guys are fleas compared to us. We're the big dog.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Mary Katharine, very quickly, we're down by 20, that's three Hail Mary passes we can still win by one.</p>                \n                \r\n\n            \n                <p><b>HAM:</b> Well, I think the problem is we are in the red zone, people, and Americans want you to address it with urgency as if we are in the red zone.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Perfect analogy. We're going to leave it there.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> I'm telling you go Georgia. Go Georgia.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Did President Obama play the race card against Donald Trump?", "description": "Commander in chief says GOP candidate is exploiting Americans' fears; 'The O'Reilly Factor' investigates", "date": "2015-12-22T13:17:17Z"}