{"vcmId": "ccfbd990-dc76-4288-bdf0-a310b7fac397", "url": "http://www.foxnews.com/transcript/2015/12/11/assessing-donald-trump-media-presence.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 10, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thanks for staying with us, I'm Bill O'Reilly in the \"Weekdays with Bernie\" segment tonight. Millions of people all over the world watch my interview with Donald Trump last night. One of those, the purveyor of BernardGoldberg.com who joins us from Miami. So, did you fall asleep during that interview? I know it was up late, it was like 8:00, 8:15.</p>                \n                \r\n\n            \n                <p><b>BERNIE GOLDBERG, FOX NEWS CONTRIBUTOR: </b>Yes. Cheap shot. Totally cheap shot. No, I didn't. As a matter of fact, I thought the interview was better than most. I thought you challenged him. It certainly was better than the valentines he gets from his friends in conservative media. But I think we have reached a critical point in this campaign and I would have gone beyond where you went. I wouldn't expect an answer to my question by the way because he doesn't answer anything he doesn't want. But I would have said to him, Mr. Trump you have insulted a genuine war hero John McCain.</p>                \n                \r\n\n            \n                <p>He could have walked out of that prison camp but wouldn't do it unless he took all these men with him. You insulted a Republican woman running for president because you don't like her face. Despite your denials Mr. Trump, you went into a spastic routine and made fun of a reporter or journalist with a physical disability and nothing you do, nothing you do or say hurts you with your supporters. We understand, Mr. Trump, that you have tapped into frustration with Barack Obama and frustration with the media. We understand that. But do you understand that you are playing with fire.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. Let me stop you.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: What you are doing and saying, let me just finish the last sentence. What you're doing and saying may do harm not just to the Republican Party but also to the United States of America itself.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. If I ask that question though, the interview would have been over. I would have had gone to a break with Salone.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> You been known to --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But I asked all of those questions that you mentioned I had asked in previous interviews and actually we had discussed it. But here's the deal with Trump. You agree, apparently with my Talking Points memo that he has been enabled by Obama and the media. So you and I are simpatico on that, right?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Right. Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: I would add one thing -- mostly, they are upset with what they see as weakness in the Republican Party but those other two absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And corruption though. Corruption weakness in the Republican Party certainly for not confronting the ineptitude and corruption of the establishment Democrats, including President Obama. So this is driving it. So, you are right. No matter what he says, Donald Trump, no matter what he says, isn't going to hurt him in the polls because his core crew, which tops out at about 30 percent, not enough to win the general election, by the way, all right?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Exactly. Exactly. Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They want him to be the avenger and they want him to be outrageous and they want him to say bad things about Muslims and they want all of this.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Exactly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, as long as everybody understands that there aren't any rules that Donald Trump has to adhere to, none, he is trying to get the nomination and he understands more provocative he is the higher he is going to go in the polls.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Yes. And here is where it doesn't make sense. Look, the people who support him detest Barack Obama. We agree on that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> But what if it was Barack Obama, what if it was Barack Obama who said John McCain, he is not a war hero, conservative supporters of Donald Trump would accuse the president of treason. What if it was Barack Obama who made fun of a Republican woman running for president said, you don't want that face in the White House.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But I don't understand --</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: They would demand his resignation. What if it was --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's two different things though. It's two different things.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> It isn't. It's the hypocrisy of if Barack Obama said these things, they would hate Obama for it but if Donald Trump says it, they love it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>If Barack Obama says, it's Thursday, the people who don't like him they are going to find a reason to disagree. The crux of this matter is this. There is deep anger in the country, not only in the conservative precincts, Bernie. All right?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>There is anger in the independent precincts. There is anger in the democratic precincts unless you are a Kool-Aid drinker for the left. Okay? And Trump is exploiting that anger. And the rest of the field hasn't figured it out yet or won't do it.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Absolutely. You are absolutely right. You are absolutely right. But it's not good for America. Look, you said on this program a month or so ago that Donald Trump was a net plus for the Republican Party, you are wrong, you are wrong in a big way. He is not only a minus, he is a giant net minus. And here is my prediction. If Donald Trump wins the nomination, say hello to President Hillary Clinton. And then Trump supporters will blame the liberal media, they will blame the Republican establishment, they will blame the PC culture. They will blame everything and everybody except themselves. But if he wins the nomination, they are the ones. They are the ones.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It's possible.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: But they will be the ones who are responsible for the train wreck that is approaching.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But just remember something. It is not bad for the Republican Party or for the country to have an unconventional candidate get out there and speak his mind even if you disagree. And he doesn't have power. He doesn't have any influence other than his own verbiage right now. So, that's why I said what I you said.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: He is he hurting the Republican Party.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Assessing Donald Trump's media presence", "description": "Bernie Goldberg reacts to the GOP candidate's interview on 'The O'Reilly Factor'", "date": "2015-12-11T13:55:44Z"}