{"vcmId": "cfe22255-867d-4563-8a8a-9e604e1c5c7a", "url": "http://www.foxnews.com/transcript/2017/03/08/judicial-watch-suing-federal-government-over-leaks.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 7, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight, a Watchdog group called Judicial Watch, has filed a Freedom of Information Act lawsuit against the CIA, the Justice Department, and Treasury Department. Judicial Watch wants records pertaining to alleged wiretaps during the presidential campaign.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington, president of the group, Tom Fitton. Now, you've called this situation, a quote, \"scandal.\" Please define that for us.</p>                \n                \r\n\n            \n                <p><b>TOM FITTON, PRESIDENT, JUDICIAL WATCH:</b> Well, the scandal we all know about, and the only one of substance beyond the hacking of the Podesta emails directly, is the leaking of classified information, including the fact that there were wiretaps and the results of those wiretaps. As you pointed out, the transcripts of the phone call between General Flynn and the Russian ambassador, and we ask specifically for those types of records. We got the proverbial hand to the face. But we did get an interesting response from the National Security Agency Bill, and it goes to the conversation you had with Senator Cotton. And the NSA told us they can't confirm or deny they have any records about that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, maybe they are not involved. Look, I don't know what Senator Cotton knows, but clearly he knows what agency tapped the Russian ambassador and General Flynn. He knows.</p>                \n                \r\n\n            \n                <p><b>FITTON: </b>Well, the NSA is essentially telling us, we can't tell you if we have them, we can't tell you if we don't have them, because to do so would tell you about our capabilities.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. But that's what they all --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>FITTON:</b> -- highly suggestive.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You know that. The FBI can't comment on the investigation -- they all do that. I think that people need to understand that a Russian Embassy, all right, is Russian territory. That is not America, okay? So, therefore that agencies like the CIA and the NSA, they can go in and they can tap, and they have been tapping for 50 years, all of these people, and people should know that, should know how this thing can be done so there is a myriad of suspects here. Do you come, through your investigation, have you narrowed it down on what you think happened? I don't want you to speculate. It's got to be based on information that you have accumulated.</p>                \n                \r\n\n            \n                <p><b>FITTON:</b> We just sued, so we are waiting to get responses back from the agencies, and it is going to be hard for them to say no. And the irony is that, you know, President Trump's appointees, the ones that are going to be figuring out how to respond to our litigation here. And it's frankly just the beginning, because there are other requests we have pending. We have well over a dozen requests under the Freedom of Informational Act to get access for instance we want the transcript. If it's not classified, release it, and if it is classified, potentially declassify it in part or in hole.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Do you want to know what we are on the conversation?</p>                \n                \r\n\n            \n                <p><b>FITTON</b>: There are a lot of opportunities for truth telling.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. But I want to know more importantly than that.</p>                \n                \r\n\n            \n                <p><b>FITTON:</b> And we want to know who had access to this information.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. I want to know who leaked it. I want to know who put it up there.</p>                \n                \r\n\n            \n                <p><b>FITTON: </b>That is exactly right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know, so President Trump accuses President Obama of doing it, but there is no evidence to show -- and President Obama is a pretty smart guy. I don't think he would, you know, but his minions certainly could have. They tapped Angela Merkel. I mean, so how long do you think it is going to take your crew to cut through this bureaucratic fog and get these documents so we can figure out what happened?</p>                \n                \r\n\n            \n                <p><b>FITTON:</b> I think we will start getting responses from the government in months. And I think we'll get more direct responses than Congress. Remember when Congress gets documents, they don't necessarily release them all, and when they give the documents to us, we get them out to the public. So, it's important to know that there is this independent entity out there that's asking the questions, that we are not relying on the politicians to figure out what is up and what is down.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Well, please let us know what you come up with, Mr. Fitton. We appreciate you appearing this evening.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Judicial Watch suing federal government over leaks", "description": "Tom Fitton joins 'The O'Reilly Factor' to discuss the wiretapping allegations and the Trump administration", "date": "2017-03-08T13:23:32Z"}