{"vcmId": "d13178bf-e367-4a0c-82ab-939ae38da681", "url": "http://www.foxnews.com/transcript/2017/01/18/bill-oreilly-super-bowl-interview-with-donald-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Fox News, Fox Sports and the Trump Transition Unit announced today that on Super Bowl Sunday, 4 pm Eastern Time, I, your humble correspondent, will interview the president.</p>                \n                \r\n\n            \n                <p>You may remember, I did this back in 2014 with Barack Obama, and it was controversial because I pushed the president on a number of issues, including the terror attack at Benghazi.</p>                \n                \r\n\n            \n                <p>Feb. 2, 2014</p>                \n                \r\n\n            \n                <p><b>O&#8217;REILLY</b>: &#8220;Your detractors believe that you did not tell the world it was a terror attack because your campaign didn't want that out.&#8221;</p>                \n                \r\n\n            \n                <p><b>OBAMA</b>: &#8220;Bill, think about ...&#8221;</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>&#8220;That's what they believe.&#8221;</p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> &#160;&#8220;-- and they believe it because folks like you are telling them that.&#8221;</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: &#8220;No, I'm not telling them that.&#8221;</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: &#160;&#8220;I'm asking you whether you were told ...&#8221;</p>                \n                \r\n\n            \n                <p><b>OBAMA</b>: &#8220;But -- and what I'm saying is ...&#8221;</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> &#160;&#8220;-- it was a terror attack and you ...&#8221;</p>                \n                \r\n\n            \n                <p><b>OBAMA</b>: &#160;&#8220;-- and what I'm saying is that is inaccurate.&#8221;</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> &#160;&#8220;All right.&#8221;</p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> &#160;&#8220;We -- we revealed to the American people exactly what we understood at the time.&#8221; &#160;</p>                \n                \r\n\n            \n                <p>This time around, I expect to ask President Trump a number of policy questions but also about how he is processing his amazing achievement.</p>                \n                \r\n\n            \n                <p>A man with no political experience winning the most powerful office in the world.</p>                \n                \r\n\n            \n                <p>So it should be a very interesting conversation, and I really appreciate FNC's confidence in me.</p>                \n                \r\n\n            \n                <p>With just three days to go before Donald Trump becomes the 45th president of the United States, there is still controversy over his very being.</p>                \n                \r\n\n            \n                <p>A new Washington Post/ABC News poll says Mr. Trump's favorable rating will begin at 40% - unfavorable 54%.</p>                \n                \r\n\n            \n                <p>That is the lowest favorable number for an incoming president in modern times.</p>                \n                \r\n\n            \n                <p>Trump Tweeted, quote \"the same people who did the phony election polls, and were so wrong, are now doing approval rating polls. &#160;They are rigged just like before.\"</p>                \n                \r\n\n            \n                <p>Be that as it may, it doesn't matter.</p>                \n                \r\n\n            \n                <p>When you strip it all down, there are only two things that will define Donald Trump.</p>                \n                \r\n\n            \n                <p>First, improving the economy by cutting taxes and creating job opportunities.</p>                \n                \r\n\n            \n                <p>Second, marginalizing threats to our safety - whether it's ISIS, immigration, anarchy or an out of control murder rate in Chicago.</p>                \n                \r\n\n            \n                <p>Americans want to feel secure and want to believe they have a fair shot in the marketplace.</p>                \n                \r\n\n            \n                <p>Donald Trump's entire first term rides on economic improvement and fulfilling campaign promises to stop out-of-control situations.</p>                \n                \r\n\n            \n                <p>If he does that, no polling will matter. &#160;No protests will matter. &#160;No pundits will matter.</p>                \n                \r\n\n            \n                <p>It's all about the economy and security.</p>                \n                \r\n\n            \n                <p>Summing up, President-elect Trump has a tremendous opportunity to build a legacy based on achievement.</p>                \n                \r\n\n            \n                <p>The Trump haters, the crazed ideologues and the anti-American zealots will all fall by the wayside if Donald Trump can succeed in building prosperity.</p>                \n                \r\n\n            \n                <p>Simple as that.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: A Super Bowl Interview with Donald Trump", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/17", "date": "2017-01-18T12:50:59Z"}