{"vcmId": "d177fe9b-6269-4e7e-9c3b-7a35438ad27b", "url": "http://www.foxnews.com/transcript/2016/08/18/bill-oreilly-donald-trump-goes-back-to-his-populist-approach.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>In a speech last night outside of Milwaukee the candidate spoke forcefully about the problems facing America.</p>                \n                \r\n\n            \n                <p>Trying to broaden his appeal, Mr. Trump directed some of his remarks at African Americans:</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>&#8220;I am asking for the vote of every African-American citizen struggling in our country today who wants a different and much better future. &#160;It&#8217;s time for our society to address some honest and very difficult truths. &#160;The Democratic Party has failed and betrayed the African-American community.&#8221;</p>                \n                \r\n\n            \n                <p>Mr. Trump pointing to the median household income for blacks falling during President Obama's tenure.</p>                \n                \r\n\n            \n                <p>Black home ownership has also fallen.</p>                \n                \r\n\n            \n                <p>And the black poverty rate has risen slightly.</p>                \n                \r\n\n            \n                <p>As far as crime is concerned, blacks make up 13% of the population but 38% of all violent crime arrests are African-American individuals.</p>                \n                \r\n\n            \n                <p>In education blacks have the highest high school drop out rate and score lowest among American ethnic groups in math and writing on the SATs.</p>                \n                \r\n\n            \n                <p>So it would seem that Donald Trump has a point.</p>                \n                \r\n\n            \n                <p>The stats say that under a progressive Democratic president, black Americans are less well off then they were under President Bush the younger.</p>                \n                \r\n\n            \n                <p>Now it would be hard to believe that black Americans would rally behind Donald Trump because he has been successfully demonized in many African American precincts.</p>                \n                \r\n\n            \n                <p>Also Trump's style does not seem to appeal to minority voters in general. &#160;There is no question about that.</p>                \n                \r\n\n            \n                <p>But on the issues it is clear that liberal policies have not really helped the African-American community.</p>                \n                \r\n\n            \n                <p>However, Talking Points believes that change is not in the air, that blacks and other minorities will go big for Hillary Clinton despite the current state of the union.</p>                \n                \r\n\n            \n                <p>Will anything change that?</p>                \n                \r\n\n            \n                <p>No.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Donald Trump goes back to his populist approach", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 8/17", "date": "2016-08-18T11:58:25Z"}