{"vcmId": "d2470904-b2cf-4252-b847-cb3d0178a295", "url": "http://www.foxnews.com/transcript/2015/01/13/mainstream-media-reporting-islamic-extremism.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 12, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Thanks for staying with us, I'm Bill O'Reilly in the \"Weekdays with Bernie\" segment tonight. He told you in the talking points memo some liberal media outlets are very worried about the backlash to Muslims in general because of all the Islamic terrorism around the world. That's the headline for them not confronting the Jihad and stopping it. And it's strange because you don't get sympathy for Christians or Jews from that crew very often.</p>                \n                \r\n\n            \n                <p>Joining us now from Miami to explain why, the purveyor BernardGoldberg.com, Mr. Goldberg, and you say.</p>                \n                \r\n\n            \n                <p><b>BERNIE GOLDBERG, FOX NEWS CONTRIBUTOR:</b> Let's get the easy stuff out of the way first. There's no love lost between liberal journalists and the Catholic Church basically for three reasons. One, the church is against abortion. Two, the church is against gay marriage and three, the church is against allowing women to become priests. These are not search values, these are liberal and liberal journalist values. And because so many journalists are not only liberal but also secular liberals. You get the impression, like the church a lot more if the church adopted their liberal values. But it doesn't work that way. As for the Muslims, a lot of liberals at the \"New York times\" and other places see Muslims as oppressed. They see them as in the crosshairs of right wing bigots, whether it's in Europe or in America and being the liberals that they are they determine that they will be the protectors so they will write editorials about how their potentially in danger because of what happened in Paris and all that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. But it doesn't really add up on that. I understand the Catholic analysis is perfect. Because the secular liberal national press corps many of whom are atheists, they really despise Catholics and Christians in general, fundamental partisans as well. But Islam is the most repressive religion on earth. I mean, if you are gay, they find out you are gay.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Exactly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It's not that they are not going to let you get married. You will be lucky if you got your hands and legs attached to you. Women brutalized, abortion unheard of. I mean, come on!</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Bill, this is what makes it almost, I want to make clear, almost funny. The worst thing -- I don't share the views of the Catholic Church on these social issues, okay? So I have no problem with gay marriage. I'm for it, actually. The Catholic Church is against it. But the worse you can accuse the Catholic Church of is discrimination if you are a liberal. The worst you can accuse of his discrimination. If two guys are walking down the Arab street in the Middle East holding hands, they will wake up dead in the morning.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They won't have hands to hold. I mean, in Iran they will be thrown in a dungeon. But let's advance the story a little bit more. When the priest pedophilia scandal broke as horrible as it was and everybody should know that I am Roman Catholic but I was in the forefront getting that cardinal law booted out of this country. I led that charge against that man because it was just outrageous what they were doing. I read nowhere gee, you know the good Catholics are getting tarnished by this. We have to stick up for the good Catholics, the sincere people who followed Jesus. But you didn't get any of that.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> So here's a theory. Okay? And tell me what you think of this theory. The media we know that they have a liberal bias, but it isn't blatant most of the time. So, they can't come out and say look, we're for abortion rights and we are for gay marriage and we are for equality of women, so that's why we don't like the church, to use your word, that's why we detest the Catholic Church, they can't say that so any time there is a scandal, they jump on it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Big time.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>They salivate. They salivate at the opportunity. Unfortunately, there have been enough scandals to keep them busy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Absolutely.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> But they salivate over that the way they salivate over a scandal that involves conservative republicans instead of liberal democrats.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. And then the Muslim religion, yes, you know, let's not be mean to the Muslims but the Muslims are very mean to other people and it doesn't add up. It doesn't equate. But I think you nailed it. I think you nailed it. They feel that Muslims are oppressed by the big Satan America that we did it. And we caused it.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Bernie Goldberg, everybody</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The mainstream media's reporting of Islamic extremism", "description": "Bernie Goldberg on why the liberal media is sympathetic to Muslims", "date": "2015-01-13T13:15:29Z"}