{"vcmId": "d529b8ef-6d5b-4dbf-9aee-eb180f060970", "url": "http://www.foxnews.com/transcript/2016/08/19/bill-oreilly-who-would-protect-us-better-trump-or-clinton.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>While the left-wing media wants to put a stake through the Trump campaign's heart, the truth is he does have a chance to win the presidency.</p>                \n                \r\n\n            \n                <p>That chance hangs on two issues - the economy and combatting Islamic terrorism.</p>                \n                \r\n\n            \n                <p>If there is another terror attack on U.S. soil, Americans will react and that, of course, could change voting patterns.</p>                \n                \r\n\n            \n                <p>Almost a year ago after the Paris attack I put forth a plan to defeat the ISIS savages.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>&#8220;Here is the strategy you should employ immediately. &#160;The president of France clearly stated the ISIS attack was an act of war. &#160;France is a member of the 28-nation NATO alliance. &#160;Article 5 of that alliance says that an attack on one country is an attack on all. &#160;So all 28 nations should now begin to organize a campaign to crush the ISIS killers. &#160;That should include ground troops, bombings, no-fly zones, border security for Turkey, Jordan, Iraq and a central command and control center based in Europe. &#160;Once NATO declares war on ISIS things will radically change.&#8221;</p>                \n                \r\n\n            \n                <p>Obviously the Obama administration ignored that advice and continued a far less aggressive action against ISIS.</p>                \n                \r\n\n            \n                <p>Here is a stunning fact - there are 28 nations in the NATO alliance. &#160;Only eight are actively fighting against ISIS.</p>                \n                \r\n\n            \n                <p>The USA, Britain, France, Canada, Belgium, Denmark, the Netherlands and Turkey.</p>                \n                \r\n\n            \n                <p>Australia is not part of NATO but does contribute.</p>                \n                \r\n\n            \n                <p>So where are the other 20 NATO countries?</p>                \n                \r\n\n            \n                <p>Why are they not fighting the killers?</p>                \n                \r\n\n            \n                <p>President Obama is silent on that question. &#160;And it is appalling that NATO has not been organized to defeat the ISIS threat.</p>                \n                \r\n\n            \n                <p>Writing in the Wall Street Journal yesterday, Democratic Senator Diane Feinstein agrees:</p>                \n                \r\n\n            \n                <p>\"It is now time to recognize that an increased US presence, acting with NATO countries and other partners, could enhance the effort to eliminate Islamic state. &#160;Creating a NATO rapid-reaction force to serve as an attack force against Islamic State would make a major impact. &#8230; [And] would help to eliminate ISIS safe havens and to stanch the flow of refugees into Turkey and Europe.\"</p>                \n                \r\n\n            \n                <p>Senator Feinstein is correct. &#160;We were hoping she would come on The Factor to talk about it but she has declined.</p>                \n                \r\n\n            \n                <p>You may have noticed that is a pattern among Democratic senators.</p>                \n                \r\n\n            \n                <p>I'm not paranoid but there seems to be an organized effort to keep Democratic politicians off this network.</p>                \n                \r\n\n            \n                <p>Anyway, both Hillary Clinton and Donald Trump have also put forth strategies.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>&#160;&#8220;My administration will aggressively pursue joint and coalition military operations to crush and destroy ISIS. &#160;International cooperation to cut off their funding, expanded intelligence sharing, and cyber warfare to disrupt and disable their propaganda and recruiting.&#8221;</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> &#8220;We cannot contain ISIS. &#160;We must defeat ISIS. ((EDIT)) We need to rely on what actually works, not bluster that alienates our partners. &#160;And doesn't make us any safer.&#8221;<br> Mrs. Clinton would most likely take a more aggressive stance against ISIS than President Obama but she has not really spelled that out yet.</p>                \n                \r\n\n            \n                <p>What this comes down to is will. &#160;Barack Obama simply does not have the motivation to quickly destroy the ISIS savages, thereby sending a message to the world.</p>                \n                \r\n\n            \n                <p>That is clear.</p>                \n                \r\n\n            \n                <p>But the present danger is also clear. &#160;The next terror attack is coming at any time. &#160;There will be more innocent people slaughtered while NATO does little to stop the carnage.</p>                \n                \r\n\n            \n                <p>And what about those poor refugees that Senator Feinstein mentioned? &#160;Who&#8217;s helping them? Who&#8217;s providing safe zones near where they live?<br> Nobody.</p>                \n                \r\n\n            \n                <p>Summing up, Americans are engaged emotionally with the terror fight and that will affect the upcoming vote.</p>                \n                \r\n\n            \n                <p>Both candidates should make ISIS a top priority.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Who Would Protect Us Better, Trump or Clinton?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 8/18", "date": "2016-08-19T12:39:03Z"}