{"vcmId": "d6818abd-0235-4071-ad5b-310c75fbd59e", "url": "http://www.foxnews.com/transcript/2015/09/01/bill-oreilly-how-donald-trump-campaign-is-actually-helping-democratic-party.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It seems Mr. Trump has taken a break this week as no public rallies are scheduled. His flamboyant, sometimes bombastic personality has overshadowed every other person running for president as we all know. Trump's style has captivated millions of Americans and his campaign has been very successful thus far. So successful, that it has almost obliterated the fact that the Democratic president and the party in general, have failed to improve America. With Trump getting so much attention, the Democratic record has been obscured.</p>                \n                \r\n\n            \n                <p>Consider this. About two million more citizens live in poverty since President Obama took office. Poverty among women has increased by 1 million. Among blacks the poverty rate is up nearly 1.5 percent since President Obama was first elected. Median income for all working Americans has dropped an average of $2,000 since 2009. That's an economic disaster. Yet, few Americans really know the stats.</p>                \n                \r\n\n            \n                <p>How about illegal immigration -- Mr. Trump's big issue? According to the Center for Immigration Studies about 2.5 million undocumented immigrants have entered the U.S.A. during President Obama's tenure. That includes more than 150,000 unaccompanied minors, kids. The Pew Research Center estimates more than 300,000 babies are born each year to at least one parent who is an undocumented immigrant. Those babies, of course, immediately become American citizens.</p>                \n                \r\n\n            \n                <p>The cold truth is President Obama has not improved the illegal immigration chaos in this country and has actually made it easier for alien criminals to hurt Americans by supporting the sanctuary city concept and failing to support Kate's Law which would harshly punish alien aggravated felons who defy deportation. Why aren't the Democrats supporting that?</p>                \n                \r\n\n            \n                <p>Overseas there is a war raging in Syria and Iraq that was ignited when President Obama ordered all U.S. Troops to leave Iraq. Is then moved in, creating violence and horror. Shortly after the President ordered the Americans out, Vice President Biden said this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOE BIDEN, VICE PRESIDENT OF THE UNITED STATES:</b> I am very optimistic about Iraq. I think it's going to be one of the great achievements of this administration. You are going to see 90,000 American troops come marching home by the end of the summer. You're going to see a stable government in Iraq that is actually moving toward a representative government.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Of course, Mr. Biden's assessment turned out to be dead wrong -- the optimum word being \"dead\". The situation in that region is much worse now than it was when President Obama took office. The reason beside the foolish pullout, Mr. Obama under estimated the ISIS threat.</p>                \n                \r\n\n            \n                <p>January 2014, the \"New Yorker Magazine\" magazine published this quote by the President. \"The analogy we use around here sometimes, and I think it's accurate, as if a JV team puts on Laker's uniforms that doesn't make them Kobe Bryant.\" So far the ISIS savages have executed thousands of civilians, raped thousands of women, generally terrorized at least a half dozen nations in the Middle East and North Africa. All of that on President Obama's watch.</p>                \n                \r\n\n            \n                <p>As far as Iran is concerned most Americans are opposed to the nuke deal the Obama administration wants approved. According to a Fox News poll released this month 58 percent of Americans reject the Iran nuke deal. Just 31 percent approve, 10 percent don't know.</p>                \n                \r\n\n            \n                <p>In September Congress will vote on the nuke deal but it doesn't really matter. President Obama will get it done no matter what.</p>                \n                \r\n\n            \n                <p>On social issues, the Democratic Party has veered sharply left. When Planned Parenthood was exposed for selling the body parts of dead babies. Few Democrats condemned the action. Hard to believe but some people echo this Canadian pro-choice person.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>It should be the woman's decision to make that choice no matter what, period. Now, if that means taking action up to a month before the child is born, that should be her decision.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> How about a week?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> A week? That's her decision, again.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>How about a day?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>Also her decision.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Hard to believe. Now, Hillary Clinton will not criticize Planned Parenthood and is using the issue to reignite the war on women fiction by portraying anyone opposed to Planned Parenthood as anti-woman.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON: </b>We expect that from some of the terrorist groups. We expect that from people who don't want to live in the modern world. But it's a little hard to take coming from Republicans who want to be the President of the United States.</p>                \n                \r\n\n            \n                <p><b>GOV. CHRIS CHRISTIE (R-NJ), PRESIDENTIAL CANDIDATE: </b>There is a uniter, isn't it? Comparing Republicans to terrorist groups -- there's a real uniter. That's the woman you want sitting in the Oval Office to bring our country back together. That's a disgrace and she is a disgrace.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now Governor Christie's criticism of Hillary Clinton didn't get a lot of exposure. If Donald Trump had said it, it would have. So you can see that the Trump phenomenon has obscured the Democratic performance on the economy, on immigration, on foreign policy, on social issues.</p>                \n                \r\n\n            \n                <p>The undeniable truth is the Democratic Party is now embracing ultra- left positions -- ultra-left. And has failed to deal with vexing problems effectively. JFK and Harry Truman would be ashamed. Just the record itself should be enough to get a Republican-elected president in 2016. Certainly enough last November when the Democrats lost the senate. But again, Donald Trump's transcendence has obscured the entire record are.</p>                \n                \r\n\n            \n                <p>Right now the political debate is all about sizzle rather than steak. That's not Donald Trump's fault by the way. He's s campaigning in a very effective way for him. Few political experts thought Trump would be dominating the political discourse like he is. Guys like Trump and Ben Carson are gaining traction because many Americans no longer trust traditional politicians who are afraid to speak honestly and bluntly.</p>                \n                \r\n\n            \n                <p>The folks know there is danger for the country. If the economy, ISIS, Iran horrendous actions by Planned Parenthood and other troubling problems are not dealt with effectively. President Obama and the Democratic Party have severely weakened this nation. Every single fact points to that.</p>                \n                \r\n\n            \n                <p>We're approaching $20 trillion in debt. Entitlement spending is out of control. Taxes are rising. Working Americans losing ground.</p>                \n                \r\n\n            \n                <p>Finally, if you still don't believe me, consider this. In a recent Quinnipiac poll American voters were asked: are you satisfied or dissatisfied with the way things are going in the nation today? An astounding -- and I mean that -- astounding 71 percent are dissatisfied or very dissatisfied. 26 percent say things are ok. Only 2 percent of Americans are very satisfied with where the country is today -- 2 percent.</p>                \n                \r\n\n            \n                <p>Talking Points\" rests its case. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: How Donald Trump's campaign is actually helping the Democratic Party", "description": "Bill O'Reilly's Talking Points 8/31", "date": "2015-09-01T12:15:48Z"}