{"vcmId": "d8ae4e56-2d66-4675-88fc-e169072f6d60", "url": "http://www.foxnews.com/transcript/2016/03/01/bill-oreilly-state-republican-party.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>I have to say I'm a bit surprised that Don Rickles is apparently running for president as a Republican.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>So, I'm looking at Little Marco and I say, Man, there is something that is happening with him. And he is like melting.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> He is always calling me Little Marco. And I will admit the guy is taller than me, he's like 6'2\", which is why I don't understand why his hands are the size of someone who is 5'2\". You know what they say about men with small hands.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>You ought to see him back stage. He was putting on makeup with a trowel. I will not say that he was trying to cover up his ears. I will not say that.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> He doesn't sweat because his pores are clogged from the spray tan that he uses.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'RIELLY: </b>Now, that's not exactly the Lincoln-Douglas debate, is it? But here's why it's happening.</p>                \n                \r\n\n            \n                <p>In the beginning of the campaign Donald Trump did something very brilliant. He staked out two essential issues that he knew Republican voters were angry about. The border, and the economy.</p>                \n                \r\n\n            \n                <p>Rather than getting into policy, Mr. Trump kept it simple. He will build a wall and deport illegal aliens. He will make deals that will turn the economy around and punish countries like China and Mexico that he believes are treating the U.S.A. unfairly. That quickly got the new candidate a lot of attention and a lot of criticism. Trump then immediately counter attacked using hot rhetoric that most politicians would never even consider using. That got him even more popularity. The more he insulted folks, the higher his poll numbers climbed. So he is two for two. He chooses emotional issues, simplifying them for potential voters then scorches anyone that doesn't like it.</p>                \n                \r\n\n            \n                <p>Even if you don't like Mr. Trump, you have to admit the strategy has been brilliant. And he would not be leading in the polls today he had not employed it. The other Republican candidates were taken by surprise as he hammered Jeb Bush and anybody else Trump considered to be a rival.</p>                \n                \r\n\n            \n                <p>After months of watching Trump's poll numbers go up, finally Senators Rubio and Cruz began a counter attacked in the same way. The problem for both Rubio and Cruz is that Americans really don't know them. And the media has attention to Donald Trump that getting well-known is almost impossible. Unless, of course, you hurl insults, which is what Marco Rubio is now doing. For his part, Cruz is hammering Trump in a different way.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. TED CRUZ, (R-TX) PRESIDENTIAL CANDIDATE:</b> There have been multiple media reports about Donald's business dealings with the mob, with the Mafia. Maybe his taxes show those business dealings are a lot more extensive than has been reported.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, I don't believe anyone's tax returns are going to give an insight into organized crime.</p>                \n                \r\n\n            \n                <p>Mr. Cruz obviously casting aspersions, word of the day, aspersions on Mr. Trump. But all of this negative stuff hasn't really altered the race so far. Recent polls say Mr. Trump is leading in all of the Super Tuesday states with the exception of Texas. Ted Cruz's home state.</p>                \n                \r\n\n            \n                <p>So it looks like tomorrow Trump will prevail again and it's how close Cruz and Rubio can keep the vote that is uncertain. The South, friendly territory for Donald Trump, but when the vote shifts to the northeast and midwest, the challenge might get more difficult. But, by that time, he might have sown things up. If that happens, if Trump is the Republican nominee, we can expect a media assault on him that will be unprecedented in America. Every single day the press will hammer Trump, exposing every part of his life. Trump is getting ready.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> So that when the \"New York Times\" writes a hit piece, which is a total disgrace, or when the \"The Washington Post,\" which is there for other reasons, writes a hit piece, we can sue them and win money instead of having no chance of winning because they are totally protected.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, Mr. Trump talking about what he would do as President, attempt to change the libel laws. But he can't do that now. And believe me, the press is just waiting.</p>                \n                \r\n\n            \n                <p>A preview is this David Duke stuff, a complete non story. I have spoken with Trump hundreds of times. And I have never heard him run down anyone because of race. He doesn't care about that. The GOP madness is, of course, good news for Hillary Clinton, who has major problems of her own but who the American press will get behind.</p>                \n                \r\n\n            \n                <p>Newspaper endorsements for president will run about 20 to 1, Clinton. So the question becomes can Donald Trump bring in millions of new voters to overcome his deficit among the press, minorities and other groups that don't like him? Trump says he can do it. And he has confounded his critics thus far.</p>                \n                \r\n\n            \n                <p>Well, that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The state of the Republican Party", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/29", "date": "2016-03-01T19:42:36Z"}