{"vcmId": "db8e63a2-e837-4801-b1fb-7771991bf46b", "url": "http://www.foxnews.com/transcript/2016/05/03/bill-oreilly-far-left-violence-out-control-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Yesterday, in Seattle, a May Day anti-capitalism protest turned violent.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>Seattle police right now rolling glass blow balls. There it is.</p>                \n                \r\n\n            \n                <p><b>(EXPLOSIONS)</b></p>                \n                \r\n\n            \n                <p><b>(SHOUTING)</b></p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: A number of police officers were injured in the fracas. One hit by a Molotov cocktail. Some protesters arrested but nothing will really happen to them. In California, and Indiana, protests included young children.</p>                \n                \r\n\n            \n                <p><b>(BLEEP)</b></p>                \n                \r\n\n            \n                <p><b>(SCREAMING)</b></p>                \n                \r\n\n            \n                <p><b>(BLEEP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's just disgraceful to have those kids out there. Disgraceful. Protesting can be a good thing. Think Boston Tea Party. But it's how do you it certainly some voting for Donald Trump are protesting but they are using the ballot. Some on the far left, however, want to destroy not protest. The subversives in Seattle were organized, plan their mayhem. But again, their local system out there is so off the chart Left, little will happen to those people. Even though they hurt cops. There comes a point when a political movement becomes destructive and that point has now been reached with the far left.</p>                \n                \r\n\n            \n                <p>We have a very personal example for you tonight. Jesse Watters was confronted in Washington over the weekend by a far left zealot who hectored him and provoked a physical confrontation. Here is a back story. In August of 2006, I did a commentary on the radio factor that warned young Americans not to get intoxicated and put themselves in danger. I was clearly talking about personal safety. Based on the murder of 18-year-old Jennifer Moore from New Jersey. Ms. Moore and a girlfriend came into New York City, got loaded, they separated, and she wound up dead.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Jennifer Moore, 18, on her way to college, she was 5'2\", 105 pounds, wearing a mini skirt and a halter top with a bare midriff. Now again, there you go. So every predator in the world is going to pick that up at 2:00 in the morning. She is walking by herself on the west side highway and she gets picked up by a thug. All right? Now she is out of her mind drunk. And the thug takes her over to New Jersey in a cab and kills her and rapes her and does all the terrible things to her. And the thug is so stupid he uses her cell phone and the cops trace it back to him and they arrest him and charge him with murder.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, her killer, Draymond Coleman pleaded guilty and was sentence to 50 years in prison. Three years after Ms. Moore's tragic murder in 2009, I was doing a fundraiser for the \"It Happened to Alexa Foundation,\" which helps rape victims all over the U.S.A. It's a fine charity. Badly needed in America. And I have been supporting it for years. A crazy left website called think progress tried to jam the fundraiser by saying that I had partially blamed Jennifer Moore for her own murder. A despicable lie. Doesn't get lower, more vicious than that. The woman who wrote the smear piece Amanda Terkel was interviewed a short time later by Jesse Watters.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> You wrote a blog about Bill O'Reilly going to speak for this rape function, this charity group. And you attacked him personally and you attacked the foundation and you brought a lot of pain and suffering to this group. What's your reaction?</p>                \n                \r\n\n            \n                <p><b>AMANDA TERKEL, SENIOR POLITICAL REPORTER, HUFFINGTON POST:</b> What I remember writing was highlighting a comment that Bill O'Reilly had said. And that's what I remember doing. I don't remember attacking the foundation.</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> What did Bill O'Reilly say?</p>                \n                \r\n\n            \n                <p><b>TERKEL:</b> I can't remember exactly what he had said.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And that was the end of that. Until Saturday night in Washington. Citing that interview with Terkel, this man, Ryan Grim who works for \"The Huffington Post\" confronted Jesse Watters at a party after the Correspondents' Dinner. A scuffle ensued and Watters will brief us on that a bit later on. The whole thing is insane. This Grim character had no business bothering Jesse Watters about anything. But that is what the far left does.</p>                \n                \r\n\n            \n                <p>They seek to harm people with whom they disagree. Talking Points has had enough. All far left kooks that cause trouble and break the law will be held to account here. And a special memo to the local precincts. You should really prosecute people who hurt police officers and bystanders aggressively. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly:  Far left violence out of control in America", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 5/2", "date": "2016-05-03T19:02:34Z"}