{"vcmId": "dc2772b3-24af-4787-aaf3-732330a4a5f8", "url": "http://www.foxnews.com/transcript/2016/01/15/fallout-from-iran-detaining-10-us-sailors.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 14, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Factor Follow Up Segment\" tonight, the ten U.S. sailors taken into custody by Iran on Tuesday are now in Qatar. The situation so murky - - how could two small U.S. naval vessels go 50 miles off course in Iranian waters. So far, not much clarity from the military although Secretary of Defense Ash Carter said today there was navigational errors.</p>                \n                \r\n\n            \n                <p>That means two boats -- two small boats, navigational errors, 50 miles -- just an error.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington, Mark Dubowitz from the Foundation for Defense of democracies; and Christopher Harmer, senior naval analyst at the Institute for the Study of War.</p>                \n                \r\n\n            \n                <p>Mr. Harmer, we begin with you. Do you believe that Iran violated the Geneva Convention in this case? There is some back and forth on that.</p>                \n                \r\n\n            \n                <p><b>CHRISTOPHER HARMER, INSTITUTE FOR THE STUDY OF WAR</b>: Yes I do believe Iran violated the Geneva Convention in this case but I don't think that's the key take away here. I think the key takeaway is U.S. weakness and accommodation of a terrorist regime invites further aggression by Iran. Iran has been a state sponsor of terror for 35 years and is the primary foreign sponsor of (inaudible)</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. So let's put you in charge then. And why there is a controversy about Geneva Convention is because there is no declared war. And in a declared war, you are not allow to show pictures of prisoners as the Iranians obviously did and then take a statement from the naval commander saying yes we made a mistake as the Iranians did.</p>                \n                \r\n\n            \n                <p>You can't do that when war has been declared but -- and there is some wiggle room well, it isn't war and all of this. I am going to put you in charge. I'm going to do the same thing to you, Mr. Dubowitz.</p>                \n                \r\n\n            \n                <p>Mr. Harmer, so you get the call, they got the ten guys all right? What the Obama administration did was be nice, it played nice, picked up the phone - - can you get them out of there quickly, please do that. Da-da-da-da-da. Was it the wrong strategy?</p>                \n                \r\n\n            \n                <p><b>HARMER</b>: Ok. So in the short term you don't ask Iran to return our sailors, you demand that Iran return our sailors immediately. They had no right to detain them that long. And you don't exhibit weakness in the face of the enemy. That simply encourages further weakness.</p>                \n                \r\n\n            \n                <p>If by in charge you mean as in president in charge, I would simply say yes we have accommodated Iran for so long. We have accommodated their aggressive behavior. We have accommodated their state sponsorship of terror that we are now in a position where we just don't have as much credibility as we need to face off against the Iranians.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok. So you demand - you don't ask.</p>                \n                \r\n\n            \n                <p>How about you Mr. Dubowitz?</p>                \n                \r\n\n            \n                <p><b>MARK DUBOWITZ, FOUNDATION FOR DEFENSE OF DEMOCRACIES</b>: Well I think that's right. I mean the one thing you don't do is what Secretary Kerry did was express \"gratitude\", quote unquote. I think what you do is you express outrage that Iran is violating the rights of your sailors, have them on their knees with their hands behind their backs under gunpoint. And you make it very clear the United States of America will not accept these brazen provocations.</p>                \n                \r\n\n            \n                <p>The problem is this administration has now accepted a long list of brazen provocations from the Iranians including the firing of ballistic missiles.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok. Now, you both know they are holding four Americans in their prisons and they don't let them out. If you demand and insult, maybe they hold the ten sailors, so, you know, the Obama administration is going to say, look, we got them out of there in 24 hours, the sailors. We got them out of there. If we had insulted the mullahs, maybe we wouldn't have.</p>                \n                \r\n\n            \n                <p>Is there anything, Mr. Farmer to that -- Mr. Harmer to that? Any credibility to that?</p>                \n                \r\n\n            \n                <p><b>HARMER:</b> Yes, there is some credibility to that. But I don't think you can analyze this problem by starting in the middle. You have to start at the beginning. What incentivized Iranian behavior and aggression in the first place?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I got that. I got that. You deal with ten guys that they have. And your theory on them, I mean they can be there forever. You know how they are.</p>                \n                \r\n\n            \n                <p><b>HARMER</b>: It's better that they remain in prison forever as hostages than the United States apologize to Iran.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Interesting. Mr. Dubowitz, you say?</p>                \n                \r\n\n            \n                <p><b>DUBOWITZ</b>: Well, I say, you know what, get them out first and then once they are out, then it's time to actually crack the whip.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Like what?</p>                \n                \r\n\n            \n                <p><b>DUBOWITZ</b>: Well, for example, let's start imposing serious sanctions on Iran.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Re-impose sanctions? Then they will tear up the nuke deal.</p>                \n                \r\n\n            \n                <p><b>DUBOWITZ</b>: No, we are fully entitled to impose sanctions for ballistic missiles, for terrorism, for hostage taking, for human rights abuses. That's not inconsistent with the nuclear deal.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So you would re-impose sanctions after this incident with the sailors? You would blow the whole nuke thing up -- pardon the pun?</p>                \n                \r\n\n            \n                <p><b>DUBOWITZ</b>: Again, Bill, we have the legal right under this agreement to impose non-nuclear sanctions.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- we do, but there is a legal right and there is a practical right. I see what you are saying. I think the Obama administration has mishandled Iran from the jump. But I'm glad these ten guys are out of there in less than 24 hours. I think if you took a hard line with Iran they wouldn't have been. I'm giving you the last word, Mr. Harmer -- go.</p>                \n                \r\n\n            \n                <p><b>HARMER:</b> I'd simply say Iran is a state sponsor of terror, the more weakness we display towards them the more we incentivize and encourage that dysfunctional and aggressive behavior. We're going to reap what we sow with the Islamic Republic of Iran.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Appreciate it guys -- thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Fallout from Iran detaining 10 US sailors", "description": "Are Americans being misled by the Obama administration about the incident? 'The O'Reilly Factor' investigates", "date": "2016-01-15T13:21:30Z"}