{"vcmId": "dc56287f-aed7-4eec-b19c-e958ba2dd520", "url": "http://www.foxnews.com/transcript/2015/02/25/bill-oreilly-isis-atrocities-continue-as-cowardly-world-does-little.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Perhaps as many as 90 Christians in Syria have been taken hostage by the ISIS jihadists. We should all pray for those people who may very well be beheaded or burned alive.</p>                \n                \r\n\n            \n                <p>Also the United Nations high commissioner for human rights has issued a report that says the following. ISIS atrocities include rape, slavery, trafficking of women and children, forced recruitment of children, killings of civilians and kidnappings.</p>                \n                \r\n\n            \n                <p>The U.N. agency says young girls are being forced into marriages; young boys being trained as jihadi fighters. We have seen video of that. And it is appalling. These young boys are being brainwashed, trained to kill. They are powerless to stop ISIS from abusing them.</p>                \n                \r\n\n            \n                <p>Meanwhile the world dithers. There is no organized campaign on the ground to stop the atrocities or to defeat the ISIS savages. What a disgrace.</p>                \n                \r\n\n            \n                <p>In an excellent bit of reporting from northern Iraq, NBC correspondent Richard Engel interviewed two women who escaped from the ISIS abusers.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>RICHARD ENGEL, NBC CHIEF FOREIGN CORRESPONDENT:</b> ISIS is reviving the barbaric tradition of the slave trade, proudly showing its fighters in this ISIS video discussing the Yazidi women they are about to buy.</p>                \n                \r\n\n            \n                <p>We showed Farida the video. She instantly recognized the men.</p>                \n                \r\n\n            \n                <p>\"All of the girls were screaming and crying because they didn't want to go with them,\" she says, \"so they beat the girls and dragged them away by force.\"</p>                \n                \r\n\n            \n                <p>Farida was raped repeatedly for three months.</p>                \n                \r\n\n            \n                <p>\"They sold me from one man to the next,\" she says. The ordeal was even harder for the younger ones.</p>                \n                \r\n\n            \n                <p>There is a word we don't use a lot in the news media but it fits here. This is evil. It was absolute evil by design. This was not a war crime that happened by accident. This is ISIS policy.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Again, excellent reporting by Richard Engel. And he is right. The news media does not like to use the word \"evil\" but that's what the world is witnessing.</p>                \n                \r\n\n            \n                <p>Once again, Talking Points will remind that you that these ISIS thugs are the same as the Nazis who slaughtered millions of people before and during World War II. There's no difference in the mentality, none at all. And once again, the world is standing by doing little while the ISIS menace grows spreading all over the Middle East and North Africa.</p>                \n                \r\n\n            \n                <p>President Obama is not taking the lead. His stated 60 nation coalition is invisible. And the other nations of the world are even worse.</p>                \n                \r\n\n            \n                <p>How long are these atrocities going to continue before the world unites against these savages? How long?</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The ISIS atrocities continue as a cowardly world does little", "description": "Talking Points 2/24", "date": "2015-02-25T13:11:56Z"}