{"vcmId": "dce38dad-efb9-4da1-9c49-a46fb96b7554", "url": "http://www.foxnews.com/transcript/2015/11/04/bill-oreilly-is-usa-in-good-shape-or-going-down-drain.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The big reason Donald Trump and Ben Carson are polling well is that many Republicans now only want an effective leader in the White House they also want someone to dismantle the policies of President Obama. They want an avenger not just a politician to be elected president.</p>                \n                \r\n\n            \n                <p>Thus we have two outsiders leading the latest political polling. According to the NBC/Wall Street Journal, Carson support now stands at 29 percent, Trump 23 percent, Rubio 11 percent, Ted Cruz 10 percent, Jeb Bush 8 percent; the rest of the candidates are at 3 percent or below. So we can expect some of them to drop out soon.</p>                \n                \r\n\n            \n                <p>Now, Trump and Carson both believe America is in serious trouble. But Jeb Bush sees it a bit differently. While the governor does recognize the economy is soft and there is chaos overseas he believes America is close to turning it around.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BUSH: </b>They say our best days are behind us. Look, let's be clear. Let's be clear. I acknowledge the difficulties and challenges we face. But I reject that kind of thinking. I believe America's best days are not behind us but squarely in front of us.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>Oh, yes.</p>                \n                \r\n\n            \n                <p><b>BUSH:</b> If we elect the right leadership.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Talking Points believes that America's potential is indeed enormous. However, there are many serious problems that our impotent congress simply refuses to deal with.</p>                \n                \r\n\n            \n                <p>Three examples: after all these years the southern border with Mexico, still not secure. That's a scandal -- a scandal -- and has led to many social and economic problems not to mention security difficulties.</p>                \n                \r\n\n            \n                <p>Problem number two: the economy. The Obama administration has run up a staggering debt which will soon hit $20 trillion. In fact, Mr. Obama will add nearly as much debt to this country as all of the American presidents combined by the time he leaves office -- an astounding legacy that will damage the nation big time down the road. And all of the trillions of dollars the Obama administration has spent on social justice and instituting a nanny state has led to even more poverty.</p>                \n                \r\n\n            \n                <p>Problem number three: the jihad threat overseas beyond any doubt, ISIS has grown in power, and that American policies have failed in the Middle East and Afghanistan. The new nuke deal with Iran could be one of the worst foreign policy blunders of all time. It's speculation, I know that. However, like the debt, trouble down the road is almost guaranteed.</p>                \n                \r\n\n            \n                <p>So whoever the new president is will have huge problems to deal with on every front. That American leader will have to get tough with ISIS and other jihadists; also Putin. And will have to solve problems like the southern border and immigration in general. If the new president can accomplish those things, and that's a huge if, America's potential might be unleashed. But it will take a strong, tough leader to do that especially with the inept Congress.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Is the U.S.A. in good shape or going down the drain?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/3", "date": "2015-11-04T12:50:02Z"}