{"vcmId": "de8af722-a272-4d29-ba97-d218ce097cb4", "url": "http://www.foxnews.com/transcript/2015/05/27/bill-oreilly-war-and-peace-in-usa.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>We hope everybody had a nice Memorial Day weekend as the nation paused to honor Americans who lost their lives defending this country.</p>                \n                \r\n\n            \n                <p>On Thursday, Gary Sinise and I hosted a fundraiser here in New York City to help severely wounded American vets. The party raised more than a million dollars, including a $100,000 donation by a businessman in Dallas, David Elliott. And all over the country, good things were happening in memory of those families who have sacrificed so much.</p>                \n                \r\n\n            \n                <p>But in Washington bad things are occurring as America's power overseas is in free fall decline. The worst situation: the war on terror. ISIS savages are creating mass chaos throughout the Middle East, Northern Africa and now Nigeria. Even though President Obama promised to confront ISIS and downgrade it -- that has not happened.</p>                \n                \r\n\n            \n                <p>ISIS continues to expand, murdering thousands of innocent people, creating chaos wherever it goes. In response the President speaks of climate change to the Coast Guard Academy graduating class last week and touts his international record.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES: </b>Today is the first Memorial Day in 14 years that the United States is not engaged in a major ground war. So on this day we honor the sacrifice of the thousands of American service members, men and women, who gave their lives since 9/11, including more than 2,200 American patriots who made the ultimate sacrifice in Afghanistan.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What the President did not say is that ISIS is now expanding into Afghanistan. The northern part of that country now a free fire zone as the Taliban and other Islamic militants seized territory from the government. In fact, there are very few victories in the war on terror these days.</p>                \n                \r\n\n            \n                <p>Syria under siege by ISIS; Iraq, tottering as ISIS controls about a third of the country; Yemen no functioning government; Libya, no functioning government; Nigeria, ISIS is aiding the savage group Boko Haram and they are threatening to destabilize the entire country.</p>                \n                \r\n\n            \n                <p>Meantime Iran is gaining power throughout the Middle East by supporting terror groups like Hezbollah and Hamas. Iran, now the only power inside Iraq that is actually putting up a fight against ISIS. In the meantime President Obama and his acolytes continue to insist they have a handle on the terror problem and ISIS in particular.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>PELOSI:</b> It's an enormous challenge and we have to fight it on every front, including the front of social media. That is a place where they have really made more advances than you would have suspected and that is where we have to fight them as well.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So while ISIS is burning human beings alive, Congresswoman Pelosi is concerned about the social media aspect of the struggle.</p>                \n                \r\n\n            \n                <p>Also we are not fighting ISIS on every front. We are not confronting them on the ground with very few exceptions. As usual Congresswoman Pelosi living in the Land of Oz -- she has no blanking clue what's happening. Same thing with Senate Minority Leader Harry Reid.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. HARRY REID (D-NV), MINORITY LEADER:</b> The situation in the Middle East is disruptive as we speak. It's a tough situation. The President has done the best he can with the tools that he is given by the Constitution, what Congress has allowed him to do.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Are you kidding me? There are many members of Congress pounding the table for more action against ISIS and other jihadist groups. So here we have the three most powerful Democrats in the nation -- Mr. Obama, Pelosi, and Reid, all saying various things that make absolutely no sense at all.</p>                \n                \r\n\n            \n                <p>Now, the unintended consequences of the disastrous foreign policy we have. President Obama likes to point to a 60-nation coalition that apparently has signed up to confront ISIS. Outside of a few countries that are undertaking a few bombing missions, there is little sign the coalition is effective.</p>                \n                \r\n\n            \n                <p>Maybe Italy, Spain and Germany have noticed the millions of people trying to illegally cross into Europe from Africa and the Middle East, many of them fleeing terrorism -- much of it generated by ISIS. As thousands drown in the Mediterranean Sea, the leaders of the European Union fiddle, imitating Nero too corrupt or incompetent to do anything about the terror threat.</p>                \n                \r\n\n            \n                <p>The whole world is changing. The jihad is advancing. Yet, the 60- nation coalition is as impotent as any group ever be. There isn't enough viagra in the world.</p>                \n                \r\n\n            \n                <p>As American power recedes abroad, tyrants like Putin in Russia take advantage. This is another unintended consequence of President Obama's weak foreign policy. Recently Secretary of State John Kerry met with Putin promising him sanctions would be lifted if he promised to stop seizing more territory. That must have delighted Vlad Putin who I have nicknamed Vlad the invader as he saw once again the U.S.A. desperately trying to appease him. Putin, of course, will take whatever Kerry gives him and then do whatever he wants knowing that America and Europe are too afraid to confront his illegal ambitions, too soft to stop his illegal activities.</p>                \n                \r\n\n            \n                <p>Same thing with China -- that country is now expanding in the specific, seizing territory that does not belong to it and developing its military in a dramatic way. China seeks to dominate Southeast Asia and understands it can now expand without any consequence from the West. This is a perfect storm of weakness.</p>                \n                \r\n\n            \n                <p>Not only is the U.S.A. reluctant to use its power, but NATO and the other western countries do not want to confront evil either. Thus the evil doers are on the march. Talking points is simply aghast that the American foreign policy is so bad. While, it's true we can no longer police the world with ground troops we can use our economic and diplomatic power to hurt countries that violate international law. We can also lead the world into confronting ISIS and other barbarians in a meaningful way. It's all about will, tactics and leadership. None of which is coming out of Washington right now.</p>                \n                \r\n\n            \n                <p>All the foreign chaos is going to be a huge problem for former secretary of state Hillary Clinton as she campaigns for president. If she points to the so-called Russian reset, knowledgeable people will wince. If she points to the war on terror, she is highlighting a disaster.</p>                \n                \r\n\n            \n                <p>But, in the end, it all comes back to President Barack Obama. The most reluctant commander and chief this nation has ever had. It's somewhat understandable as President Obama comes from ideology that usually sees American military might as a negative. The far left in the U.S.A. historically have opposed using American power abroad.</p>                \n                \r\n\n            \n                <p>And now, after thousands of military folks were killed and maimed in Iraq and Afghanistan, the left is joined by some conservatives and independent Americans who believe we should stand down overseas. But, by withholding American power abroad, the President is plunging the world into a very dark place. When order collapses, so does civilized society, and we are seeing that all over the planet.</p>                \n                \r\n\n            \n                <p>Next up: a phony nuke deal with Iran that will empower that villainous country. God help the next president of the United States.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: War and peace in the U.S.A.", "description": "Bill O'Reilly's Talking Points 5/26", "date": "2015-05-27T12:15:58Z"}