{"vcmId": "deee8202-9648-4943-98f3-3dd52e7cc63f", "url": "http://www.foxnews.com/transcript/2015/01/13/bill-oreilly-islamic-terrorism-and-obama-administration.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As you may know, about one and a half million people demonstrated in Paris, France on Sunday demanding an end to radical Islamic terrorism. 40 leaders led the march which received worldwide coverage but among those leaders there was one big absence -- the U.S.A. President Obama, Vice President Biden, Secretary of State Kerry and Attorney General Holder did not attend. And Holder was already in Paris. All he had to do was take his latte and walk across the street but he didn't show up. The outcry has been fierce.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>LT. COL. RALPH PETERS, FOX NEWS STRATEGIC ANALYST:</b> I was ashamed. I mean how can Obama do this, not only not go himself, but forbid our other top officials from going? I mean there is simply no excuse for it.</p>                \n                \r\n\n            \n                <p><b>JONATHAN KARL, ABC NEWS CORRESPONDENT:</b> Looks like a missed opportunity for the President to show a powerful symbolic display of unity with the world against terrorist.</p>                \n                \r\n\n            \n                <p><b>JAKE TAPPER, CNN ANCHOR: </b>I would add and I don't mean this as a criticism of the Obama administration. But just as an American, I do wish that we were better represented in this beautiful procession of world leaders.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Today White House spokesman josh Earnest admitted the administration made a mistake. But come on, it's not just a mistake. There is a pattern of behavior here. From the very beginning of his tenure President Obama has been reluctant to declare war on the jihad. Even after the Prime Minister of France said his nation is now at war, the Obama administration would not do so.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CHUCK TODD, NBC NEWS HOST: </b>The French prime minister this morning declared that France is at war with radical Islam. Would you say the United States is at war with radical Islam?</p>                \n                \r\n\n            \n                <p><b>HOLDER: </b>Well, I would say that we are at war with terrorists who commit these heinous acts and who use Islam. They use a corrupted version of Islam to justify their actions.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Once again, Holder saying we are at war with terrorists but not Islamic jihadists. The Obama administration simply will not say it but why? Why?</p>                \n                \r\n\n            \n                <p>Well, there is a reason. Part of the left wing philosophy is that America is partially responsible for Islamic terrorism. Some liberal pundits believe that because the U.S.A. has protected the oil sheiks and supported dictators like Mubarak in Egypt we are responsible for al Qaeda, ISIS and other savage groups who experience repression. Of course, that's a very simplistic view but it has taken deep room in the left wing precincts.</p>                \n                \r\n\n            \n                <p>The truth is America and the West need oil. So since World War II American presidents have dealt with OPEC and supported stability in Muslim nations rather than radical Islamic chaos. Oil is vital so compromises were made.</p>                \n                \r\n\n            \n                <p>President Obama is a man of liberal thought and obviously tentative about confronting the jihad. But here is something very interesting. While the left continues to soft pedal Islamic terrorism, they are appalled by Christian fundamentalism. And generally speaking support the Palestinians over the Jews.</p>                \n                \r\n\n            \n                <p>I mean, once again today, this is what the \"New York Times \"editorialized, quote, \"Perhaps the greatest danger in the wake of the massacres is that more Europeans will come to the conclusion that all Muslim immigrants on the continent are carriers of a great and moral threat,\" unquote.</p>                \n                \r\n\n            \n                <p>From the beginning of the Paris terror the \"Times\" has been very concerned about the backlash to Muslims and not very concerned about how to combat the jihad at least on its editorial pages.</p>                \n                \r\n\n            \n                <p>When the Catholic priest pedophilia scandal broke, did you ever read in the \"New York Times\" or any other left wing publication that they were concerned good Catholics might be affected adversely? Did you ever read that? I didn't.</p>                \n                \r\n\n            \n                <p>But later on Bernie Goldberg and I will discuss the situation.</p>                \n                \r\n\n            \n                <p>But, for now, the Obama administration makes yet another mistake, does not stand with the world to declare war on the Islamic jihad -- unbelievable.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Islamic terrorism and the Obama administration", "description": "Talking Points 1/12", "date": "2015-01-13T13:09:56Z"}