{"vcmId": "e0c39030-01ab-4716-ad69-7bc4939c7077", "url": "http://www.foxnews.com/transcript/2015/04/14/bill-oreilly-hillary-clinton-for-president.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Yesterday, Mrs. Clinton told the world what the world already knew. She is running for president.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON (D), PRESIDENTIAL CANDIDATE: </b>Americans have fought their way back from tough economic times. But the deck is still stacked in favor of those at the top. Every day Americans need a champion and I want to be that champion. So you can do more than just get by. You can get ahead and stay ahead.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, it will be interesting to see if Mrs. Clinton embraces the economic policies of President Obama. After more than six years, income for working Americans is down about $1,700 per capita from when Mr. Obama took office. Obviously the President's vision for working Americans hasn't worked all that well.</p>                \n                \r\n\n            \n                <p>So, how will Hillary Clinton be different? Explaining that is just one of the problems Mrs. Clinton will have. The other problem is her legacy.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JEB BUSH (R), FORMER GOVERNOR OF FLORIDA:</b> We must do better than the Obama/Clinton foreign policy that has damaged relationships with our allies and emboldened our enemies.</p>                \n                \r\n\n            \n                <p><b>SEN. RAND PAUL (R-KY), PRESIDENTIAL CANDIDATE</b>: I think the thing is about the Clintons is that there is a certain sense that they think they are above the law.</p>                \n                \r\n\n            \n                <p><b>SEN. TED CRUZ (R-TX), PRESIDENTIAL CANDIDATE:</b> We're ready for Hillary. We know exactly what to expect. Hillary Clinton represents the failed policies of the past.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, let's take a hard look at Hillary Clinton's record. She served in the senate for eight years representing New York State. In that time, she worked pretty well with Republicans on a number of issues. She succeeded in getting more money for vets and did some good things in education.</p>                \n                \r\n\n            \n                <p>But, on the whole, Hillary Clinton was not out front on any game- changing legislation. She did, however, vote for the Iraq war and defended that vote. She also criticized President Bush, the Younger for being too soft, too soft on border security. Isn't that interesting?</p>                \n                \r\n\n            \n                <p>Then, Hillary Clinton became secretary of state, and here her resume becomes more intense. The truth is Mrs. Clinton and President Obama engineered very few foreign policy successes.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The question is, give me one accomplishment that Hillary Clinton succeeded in, in her tenure and you're giving me carbon footprint, women's rights -- some kind of unnamed Asian country that likes us more.</p>                \n                \r\n\n            \n                <p><b>KONST: </b>Myanmar -- we have the situation -- listen we're talking to Myanmar. Myanmar is open --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Myanmar.</p>                \n                \r\n\n            \n                <p><b>KONST:</b> It's a democratic state.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's what she is going to do? Myanmar?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> You may not think that what's happening in Libya is all that great right now but she did --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, it's not.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> It's not.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Exactly.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You may remember that Hillary Clinton led the movement to remove Ghadafi in Libya and then dodged and weaved about the assassination of American Ambassador Chris Stevens in Benghazi. The record shows there was poor security in Libya and that Secretary Clinton did little about that.</p>                \n                \r\n\n            \n                <p>And then there is the war on terror which has become a debacle under President Obama. And then there is Putin which has become another debacle. So, I'm not sure progress in Myanmar overrides those things.</p>                \n                \r\n\n            \n                <p>However, to be fair, and we want to be fair, Hillary Clinton should be asked questions about foreign policy so the folks can evaluate whether the mess abroad is her fault or the fault of the President. Remember, the secretary of state takes orders from the chief executive. But I don't expect very many people are going to be fair to Hillary Clinton on both sides.</p>                \n                \r\n\n            \n                <p>Supporters will vote for her no matter. Her record doesn't really matter to them. Of course, that's not a fair vote. Opposing her are some Americans who despise the Clintons and their liberal view of the world; so no matter what Mrs. Clinton accomplished, it will be derided in those precincts.</p>                \n                \r\n\n            \n                <p>In the middle however are the voters who will decide the 2016 presidential election. And all of them know who Hillary Clinton is. That's why a program like \"Saturday Night Live\" does something like this:</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> Since we are announcing your candidacy via social media, we thought it would be fun if you actually filmed the video yourself on your own phone. That way it seems more personal and intimate.</p>                \n                \r\n\n            \n                <p><b>KATE MCKINNON, \"SATURDAY NIGHT LIVE\": </b>Personal and intimate, yes, I better take off this jacket then.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> Great, Mrs. Clinton. Ok. Now, hold up your phone and you can just look natural.</p>                \n                \r\n\n            \n                <p><b>MCKINNON: </b>Ok.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>You maybe want to soften a little. Ok, a little more. Ok, maybe a lot more. Great. Ok. And action.</p>                \n                \r\n\n            \n                <p><b>MCKINNON:</b> Citizens, you will elect me. I will be your leader.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>Ok. Great. Let's stop there.</p>                \n                \r\n\n            \n                <p><b>MCKINNON: </b>Ok. Ok.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> Ma'am, I think you may be coming off as just a little hard.</p>                \n                \r\n\n            \n                <p><b>MCKINNON:</b> Oh, shoot, what part? What part?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>Sort of all of it.</p>                \n                \r\n\n            \n                <p>Let's keep going and this time maybe focus on all that you have done for women's rights.</p>                \n                \r\n\n            \n                <p><b>MCKINNON: </b>Ok, ok. I am running because I want to be a voice for women everywhere.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Did someone say women everywhere?</p>                \n                \r\n\n            \n                <p><b>MCKINNON:</b> Hello, Bill.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Hillary would make a great president. And I would make an even greater first dude.</p>                \n                \r\n\n            \n                <p><b>MCKINNON: </b>Thank you, Bill. That's nice.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Hillary isn't it crazy that phones can take videos now. I mean if they could have done that in the 90s, I would be in jail.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Brilliant. Brilliant. Kate McKinnon, one of the best comedic performers have I ever seen.</p>                \n                \r\n\n            \n                <p>But politics in America is no joke. This country is in trouble, economically and overseas while the left will never admit that it's true. And whoever the next president is, is going to inherit one big mess. The jihadists are threatening millions of people. Iran is close to having a nuclear weapon. Working Americans are still struggling to make money in the marketplace and our traditional American values are under siege nearly everywhere.</p>                \n                \r\n\n            \n                <p>If you are a Christian or a white man in the U.S.A. it's open season on you. Therefore Hillary Clinton has an advantage. She can run a general campaign, first woman in the White House and I'm going to help you by increasing the entitlement society. It will take a very articulate and tough-minded Republican to defeat her.</p>                \n                \r\n\n            \n                <p>One final thing, we at The Factor as I said we're going to be fair to Hillary Clinton. But we're going to be tough as we are on all political candidates. I don't think gender matters one bit. And if this war on women business is resurrected we will have something to say about it. Also Mrs. Clinton would be well-advised, well-advised to distance herself from Media Matters and the other gutter snipe organizations who use despicable, dishonest tactics to attack those with whom they disagree. If you embrace the smear merchants, Mrs. Clinton, we will have something to say about it.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Hillary Clinton for president", "description": "Bill O'Reilly's Talking Points 4/13", "date": "2015-04-14T12:21:24Z"}