{"vcmId": "e167b683-2fd6-41f1-ba6c-cee580af392b", "url": "http://www.foxnews.com/transcript/2016/04/04/ted-cruz-on-battle-for-wisconsin.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 1, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: In the \"Impact Segment\" tonight, the battle for Wisconsin. The state's critical primary is just four days away and Senator Ted Cruz has plenty to be happy about. According to a new FOX Business Network poll, he has pulled ahead with 42 percent support among likely Wisconsin GOP primary voters. Donald Trump is at 32 percent. John Kasich at 19. With Cruz gaining momentum in Wisconsin this week. Trump ramped up the negative attacks.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Lying Ted. You're a liar. Bible high. Bible high. Puts it down and then he lies. You know, he is a liar. I never met a liar like him. I met a lot tougher people than him but I never met a guy who lies this much.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Joining us now on the phone from Pennsylvania is Senator Ted Cruz. Senator, when you hear Donald Trump make these statements, when he calls you lying Ted and so forth. How does it make you feel?</p>                \n                \r\n\n            \n                <p><b>SEN. TED CRUZ (R-TX), PRESIDENTIAL CANDIDATE (on the phone)</b>: Oh, it just shows that Donald is desperately scared. That's the pattern Donald follows over and over again. That when he is in trouble, he starts yelling, he starts screaming. He starts insulting. He starts cursing. You know what? I don't think the voters really care. We are looking for the next commander-in-chief of this country. We are looking for a president who can bring us together and who can lead to bring jobs back to America to defend the constitution and the bill of rights to keep America safe. And I think Donald is just a clowning himself with his daily insults and attacks. What I'm encouraged by is the momentum we're seeing on the ground. Every day the momentum is growing with our campaign as Republicans are coming together and uniting behind our campaign.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: We had Donald Trump on the show yesterday and he said it's just literally after he walked out of the meeting with the RNC. And he told us it was a quote, \"terrific meeting.\" He seemed very upbeat about the meeting. What do you take that as to the meaning behind that?</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> I could not possibly care less. My focus is not on Donald. It is on the momentum we are seeing. It is on unifying Republicans. In the state of Wisconsin, we are surging, we have momentum. We are 10 points up. Just this week, the \"New York Times\" 538 predicted that we are the most likely candidate to win the Republican primary in the state of California, the largest load of delegates in the entire -- in the entire country, and also in the past week FOX News came out with a poll showing me beating Hillary Clinton by three points, 47 to 44 percent.</p>                \n                \r\n\n            \n                <p>And I will tell you, Eric, the most important part of that is it showed me beating Hillary among young people by 14 points. You know, the last two elections Barack Obama won young people 70-30. If the Democrats can't win young people, if we're beating -- if we're beating the Democrat by 14 points among young people, they are not going to win in November and Hillary is going to lose and we are going to turn the country around.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Senator, if you get to the convention with less than 1237. Right now it's uphill battle to hit that number. You have to win 80 something, plus, percent of delegates going forward. If you don't show up there with 137, do you think the RNC will nominate you as the next, as their nominee?</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Well, Eric, I think there are one of two paths that are likely. The first that we are focused on, is earning 1237 delegates before the convention. And, if you win, you'll end up most of the upcoming states are winner-take-all or winner take most. So, for example, in Utah we won. We got 100 percent of the delegates all 40. In Wisconsin with the lead we have got, we are likely to get most if not all of the delegates if that lead holds up. Going forward, in the state of California, if we end up winning, even by just one point in each of the Congressional districts, we end up getting all of the delegates out of California.</p>                \n                \r\n\n            \n                <p>So, our first option, what we are focused on is winning the nomination. But the second option, it is entirely possible that we go to the convention and nobody has 1237 votes. If that's the case, we're going to have a ton of delegates. Donald Trump is going to have a ton of delegates and then it is going to be a battle at the convention to see who can earn a majority, a majority of the delegates that were elected by the people. They are only going to be two names on that ballot, my name and Donald Trump's name.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Are you sure of that, Senator? Senator, are you sure of that? And this is a thing we have been going back and forth for a long time. Are you sure that if you are not 1237 and Donald is not 1237 that means Kasich has a few, are you sure they are going to see the RNC and they could, we are going to bring a new name in here?</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Well, except, under the rules the only names allowed on the ballot are people who have won eight states. There are only going to be two candidates who have won eight states me and Donald Trump.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> I know, Senator, but the rules can be amended or changed at the rules committee prior to the convention. That rule you are speaking of is rule 40. Rule 40 is a quote-unquote, \"temporary rule\" that has to be approved at the convention. They can say, you know what? 1237 is no longer the number, now we want 1500.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Well, you know, there is an irony to it in that rule 40 was put in in 2012 by the Romney campaign in order to stop Ron Paul --</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Right.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> -- and it would be quite an ironic rule if the rule exists to protect the establishment but when it hurts the establishment suddenly they change it, they are not going to do that. You can't change the rules and try to disenfranchise the voters. The voters have voted. And the only way to win the Republican nomination is to earn a majority of the delegates and that is what I believe we're going to do either in the states leading up to the convention or if we get to the convention. One of the easiest ways to understand why we are in such a strong position in the convention is if Donald and I both have a ton of delegates, the question then becomes where do the Rubio delegates go?</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Right.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Where do the Kasich delegates go? And I believe the overwhelming majority of them come to us and we will win a majority of the delegates who have been elected by the people and will win the nomination. A big part of the reason is, Donald loses to Hillary badly by double digits and I beat Hillary Clinton.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> I understand. Senator, I only have about 30 seconds left. You have gotten a lot of establishment types that have endorsed you, backed you, Romney, Nikki Haley, Rubio wants to give you his delegates. Do they really like you or is it the case of my enemy of my enemy is my friend?</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Look, this is not a Girl Scout club. This is not about having a Tea Party. This is about turning the country around. And we are building a coalition that includes of the 17 original Republicans, who ran for president, five of them have endorsed me now. Rick Perry and Carly Fiorina and Lindsey Graham and Jeb Bush and Scott Walker. But we also have the support of strong principled conservatives people like Senator Mike Lee and Mark Levin. We are assembling the old Reagan coalition. And that's what it takes to win -- Eric.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Very good, Senator. Good luck on the trail. Sir, thank you very much.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Thank you, God bless.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> And you as well.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Ted Cruz on the battle for Wisconsin", "description": "GOP candidate joins 'The O'Reilly Factor' to discuss his campaign and his bid for the GOP nomination", "date": "2016-04-04T12:18:06Z"}