{"vcmId": "e168bc3a-fd94-4304-bc4f-46f9cdd03817", "url": "http://www.foxnews.com/transcript/2017/03/27/gop-pulls-vote-on-their-health-care-bill.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 24, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p> <b>ERIC BOLLING, FOX NEWS HOST:</b> Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching this O'REILLY FACTOR special, \"Drama on the Potomac.\" And what a dramatic day it has been as Republicans surprised everyone by pulling the vote on their health care plan. House Speaker Paul Ryan gave a blunt assessment about today's setback and the effort to repeal and replace ObamaCare.</p>                \n                \r\n\n            \n                <p> <b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> REP. PAUL RYAN (R-WI), SPEAKER OF THE HOUSE:</b> We came really close today, but we came up short. I spoke to the President just a little while ago. I told them that the best thing I think to do is to pull this bill, and he agreed with that decision. This is a setback, no two ways about it, but it is not the end of the story because I know that every man and woman in this conference is now motivated more than ever to step up our game, to deliver on our promises.</p>                \n                \r\n\n            \n                <p> <b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> BOLLING:</b> Meanwhile, President Trump remained optimistic.</p>                \n                \r\n\n            \n                <p> <b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> PRES. DONALD TRUMP (R), UNITED STATES:</b> I work as a team player and would have loved to have seen it past. But again, I think you know I was very clear, I think there wasn't a speech I made, or very few where I didn't mention that perhaps the best thing that can happen is exactly what happened today, because we'll end up with a truly great healthcare bill in the future, after this mess known as ObamaCare explodes. So I want to thank everybody for being here. It will go very smoothly, I really believe. I think this is something -- it certainly was an interesting period of time. We all learned a lot.</p>                \n                \r\n\n            \n                <p> <b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> BOLLING:</b> President Trump was also pressed on the impact of the House Freedom Caucus on the health care bill's failure.</p>                \n                \r\n\n            \n                <p> <b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> UNIDENTIFIED MALE</b>: Do you feel betrayed by the House Freedom Caucus at all? They seem to be the most difficult to get.</p>                \n                \r\n\n            \n                <p> <b>TRUMP:</b> No, I'm not betrayed. They're friends of mine. I'm disappointed because we could have had it. So I'm disappointed. I'm a little surprised, to be honest with you. We really had it. It was pretty much there within grasp.</p>                \n                \r\n\n            \n                <p> <b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> BOLLING:</b> Joining us know with reaction, Kentucky Senator Rand Paul who is a close ally of the House Freedom Caucus. Now, Senator, do you think the President was indirectly referring to you specifically in those remarks?</p>                \n                \r\n\n            \n                <p> <b>SEN. RAND PAUL (R), KENTUCKY</b>: No, but what I would say is I think I still have a great deal of optimism that we will come to a repeal of ObamaCare. I mean, there's probably been nothing that has united Republicans more than our desire to repeal ObamaCare. I think it led to our electoral success of taking over the House in 2010, the Senate in 2014, and winning the White House in 2016. So, I think we are united on repeal. We are not so much united on the replacement part, but I still think it can be worked out.</p>                \n                \r\n\n            \n                <p> So, I am hoping that both sides will say, we will continue to talk. I think that President Trump has been very open too many of our ideas. I just think we didn't have enough time and we set an artificial deadline and instead of saying were going to work until we finally get this, I don't see reason why we can't work next week, the week after, the week after. But we should work on repealing ObamaCare and I'm going to continue to before that as well as replacing it. There are some great ideas for replacement.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: So, a lot of people -- we watched over the last three weeks, we watch the House Freedom Caucus saying, we are not on board yet. Explain to us by we should be? They never got the answers they were looking for. But now in the aftermath of the failed or pulled both, people will say, obviously they're going to say, hey, it's the House Freedom Caucus that's held out, that is the reason why we now have ObamaCare going forward. What do you say to those people?</p>                \n                \r\n\n            \n                <p> <b>PAUL</b>: You know, I think the Freedom Caucus wants what all conservatives wants and that is a repeal of ObamaCare that ultimately lowers the price of insurance for people. If you look at the number one problem of ObamaCare, it's that people in the individual markets go out to buy insurance and the premiums are soaring through the roof. That's the real problem. And that's why what I promoted as the number one replacement is letting people joined buying groups.</p>                \n                \r\n\n            \n                <p> And one of the unreported stories of this week is that the House of Representatives actually passed my replacement version or a similar version for letting people join buying groups or co-opts to bring prices down. What I am advising Senator McConnell and leadership is, that bill should be brought up next week. This is a bill that is a big part of replacement. We should bring that up next week and see how the Democrats will respond to that.</p>                \n                \r\n\n            \n                <p> <b>BOLLING:</b> I want to show our audience a little piece of tape from earlier in the week where you actually went to the House Freedom Caucus side, and I guess you were teaching them the art of the deal. Take a look.</p>                \n                \r\n\n            \n                <p> <b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> PAUL:</b> I brought you all a gift tonight. \"The Art of the Deal.\" I do think that it is important as we go into this that we realize we have enormous power. Actually, you guys have enormous power if you stick together. I put up a quote from \"The Art of the Deal\" that I thought was appropriate. The worst thing that you can possibly do in a deal is to seem desperate to make it. That makes the other guy smell blood, and then you are dead.</p>                \n                \r\n\n            \n                <p> <b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> BOLLING:</b> And so is the lesson to be learned here, that don't accept the first deal, but bring another one?</p>                \n                \r\n\n            \n                <p> <b>PAUL</b>: Well, these were Donald Trump's words. \"Don't be desperate to make a deal.\" But at the same time, what I would add to that is, that we are open to making a deal, and we still are open. Conservatives across the country wants to repeal ObamaCare. Unfortunately, as the House leadership brought this forward, they brought repeal and replace with ObamaCare Lite. Nobody ran on that, and no conservative across the land wants it. We could start over with repeal as the basis and actually some of the ideas, look, I love the fact that Speaker Ryan brought up the association's plans last week.</p>                \n                \r\n\n            \n                <p> <b>BOLLING:</b> Senator, tell me what happened, and I see this, I watched you guys out there saying, let's repeal now, because there is like bicameral support for repealing ObamaCare. But what do you do with the people, whatever the nine million or 10 million people that are on ObamaCare if you repeal that? What are you going to do with them?</p>                \n                \r\n\n            \n                <p> <b>PAUL:</b> Well, here's the history of what has happened in the past. Dozens of times, the House of Representatives under Republican leadership has already voted for a clean repeal. They've already done it dozens of times. In the Senate, we have done it at least once. So, what do we do with the people the government is currently providing health insurance for them? What I want is for every one of them to be protected by group insurance. So, what I would do is open up every individual to be able to buy a group policy which helps them have leverage. Here is an example. AARP has over 30 million people. What if they had one person negotiating prices? They could put prices down. And actually, the House voted on this last week. Nobody is talking about it.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: But Senator, I agree, I think there are some very, very smart things in the replacement, which we were talking about a replacement. But in the interim where you need, this whole legislative calendar of getting it agreed upon in the House, going to Senate, going to the committee, back to the House. What to those people who are hung in the balance due until the replacement is found?</p>                \n                \r\n\n            \n                <p> <b>PAUL</b>: Right. But here is part of the interim. Right now, we're still debating the repeal. We don't have that. So next week, the interim could be that the Senate brings to the floor part of the replacement that the House passed this week. The buying groups, if the Senate would vote on co- ops and buying groups next week, maybe Democrats would say, why would we want to prevent consumers from joining together to get a better price?</p>                \n                \r\n\n            \n                <p> Why would Democrats vote against the AARP being able to negotiate better drug prices and better insurance prices? I think it is such a marvelous idea, we should bring it forward next week, and if Democrats won't help, something that would really bring down costs, then it is shame on them, but we should go ahead and have that vote next week.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: All right. I got to go. And just answer this question though. Donald Trump has said, as soon as this is finished, right now, the health care debate, the issue whether becomes, you know, it goes further or not or dies, he wanted to pivot to tax reform, should Trump pivot to tax reform now or wait and try to do something continue with health care? Are the American people still have a desire to hear about health care. Who knows how long?</p>                \n                \r\n\n            \n                <p> <b>PAUL</b>: I think legislators can walk and chew gum hopefully at the same time, so why don't we do both? Why don't we set up a special committee --</p>                \n                \r\n\n            \n                <p> <b>BOLLING:</b> Senator, absolutely. So many people ask, why don't they do both? Why does it have to be one at a time?</p>                \n                \r\n\n            \n                <p> <b>PAUL</b>: Well, and here's my suggestion to the White House. Get the Freedom Caucus in there. Get the House leadership in there. Get Senate leaders in there, and let's have a continuing conversation. It doesn't have to be at the breakneck pace that it has been the last three days, but let's keep talking about it until we work it out. If we are going to talk about taxes simultaneously and legislatively to that before we have the answer, so be it. But you can work both tracks, and whichever one comes to a resolution first, bring it to the floor for a vote.</p>                \n                \r\n\n            \n                <p> <b>BOLLING:</b> You know what, Senator, that is a really common sense solution. I really appreciate. Thank you very much.</p>                \n                \r\n\n            \n                <p> <br> <i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "GOP pulls vote on their health care bill", "description": "Sen. Rand Paul reacts on 'The O'Reilly Factor' ", "date": "2017-03-27T11:59:00Z"}