{"vcmId": "e1690d40-04af-402b-b2f8-bbfe783b1e4b", "url": "http://www.foxnews.com/transcript/2016/04/11/ted-cruz-on-attack.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 8, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>JESSE WATTERS, THE O'REILLY FACTOR CORRESPONDENT</b>: Hi, I'm Jesse Watters in for Bill O'Reilly. Thanks for watching this special edition of The Factor, \"Election 2016.\"</p>                \n                \r\n\n            \n                <p>And our top story tonight, Ted Cruz on the attack. The Texas Senator went after Donald Trump on The Factor last night saying he is not much different from an establishment politicians like Hillary Clinton.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. TED CRUZ (R-TX), PRESIDENTIAL CANDIDATE:</b> It's actually not a question of being more conservative or not. If you are fed up with the corruption of Washington.</p>                \n                \r\n\n            \n                <p><b>BILL O'REILLY, FOX NEWS HOST: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Donald Trump and Hillary Clinton are flip sides of the same coin. Hillary Clinton has made millions of dollars selling power and access in Washington and Donald Trump has made billions of dollars buying power and access in Washington, buying people like Hillary Clinton.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He did it as a businessman.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> But he is part of the corruption. He is part of the corruption.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: He has funded open border Democrats for 40 years. And the people of New York are hurting.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: With us now in New York Andrea Tantaros, co-host of \"OUTNUMBERED\" and Democratic strategist Jessica Tarlov. Seems to me Cruz's strategy in New York is, I don't go to Clinton weddings and they're the insiders. They're the influence peddlers, they buy and sell politicians and I'm this big outsider. Do you think that's going to work for Ted Cruz in New York?</p>                \n                \r\n\n            \n                <p><b>ANDREA TANTAROS, FOX NEWS CO-HOST, \"OUTNUMBERED\": </b>I don't think it's going to work. And New Yorkers are upset at Ted Cruz for his New York values comment.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Right.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: But also as much as he tries to paint himself as an outsider and I do agree, Ted Cruz for being in insider isn't really part of the establishment. He's not well liked. But he runs into trouble, Jesse, because he said before that he doesn't take money from lobbyists when he does. I mean, Cruz takes money like most politicians as well as their PACs from organizations like Goldman Sachs, the big banks, Credit Suisse. So, I think it's a bit of a problem. Also, Donald Trump took that vulnerability off the table for himself a long time ago by saying, I admit it, I'm part of the problem.</p>                \n                \r\n\n            \n                <p><b>WATTERS: </b>That's right.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: I'm a lobbyists, I use my influence. I use my money. Because that's what I have to do. I have to buy influence with Democrats and Republicans. But I will fix it when I get to Washington.</p>                \n                \r\n\n            \n                <p><b>WATTERS: </b>Right.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> So, he took that attack off the table kind of hard to get him on that.</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> He said, you know, no one plays the game better than I do.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> Exactly.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Now I'm going to work for you, the people.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: He does have a point, Jessica, about Hillary Clinton, who has been at the center of pay-for-play her entire career selling the Lincoln bedroom. Clinton Foundation, I mean, that's what the Clintons do. That's how they roll, is that wrong?</p>                \n                \r\n\n            \n                <p><b>JESSICA TARLOV, DEMOCRATIC STRATEGIST:</b> Yes, I do think that you are wrong.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Really?</p>                \n                \r\n\n            \n                <p><b>TARLOV</b>: I mean, the Lincoln bedroom thing for sure. But no, I think you are wrong and so far as and I know that we really have to get into the weeds here and pierce has written extensively about the, you know, Clinton world and Clinton cash and something that has said. You know, there is no evidence of a quid pro quo here. And I'm not at all going to say that there isn't a murkiness, there certainly is and I think this is one of the things that drives her problem with the honest and trustworthiness ratings and also for Donald Trump as well and I think that it doesn't benefit any Hillary supporter to say, you know, she is squeaky clean. She is not. But there is an evidence.</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> Well, I mean, there is evidence, the \"New York Times\" reported that, you know --</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> -- Bill Clinton gets a half a million dollars from the Russians and then the State Department gives them all the uranium that they need.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>TARLOV: </b>-- Explicitly. We cannot prove that this is why that happened. Peter Schweizer, we cannot prove this is why that happened.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: That's where the quid pro quo is, is I scratch your back you scratch -- that's how it works.</p>                \n                \r\n\n            \n                <p><b>TARLOV</b>: No. There is no smoking gun on this. There just isn't.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: But Jessica, Jessica --</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Go ahead, Andrea.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: Where there is smoke there is fire. And when it comes to the Clintons, I mean, you are coughing from all the smoke.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>I mean, No one can breathe anymore. I mean, you look at the quid pro quo and there is no such thing as the Clinton coincidence.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Right.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: I mean, Jesse, you brought up, I should say the deal, the uranium plant that was sold to the Russians and then coincidently Bill Clinton gets a big speaking fee in Moscow for, you know, half a million dollars. And the list goes on and on. It's not just that deals, its deals in Oslo, its deals in Sweden, it's the Haiti business deals with the Clinton Foundation. All of this points to really shady sketchy activity. And when Clintons do corruption they go big.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Right.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: They go really big.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Jessica -- Jessica, if it's -- if she is not being shady, then why isn't she releasing the transcripts, the speeches to Wall Street? If she is not being shady, why did she continue to solicit donations to the foundation while she was secretary of state when she said she wouldn't?</p>                \n                \r\n\n            \n                <p><b>TARLOV</b>: There wasn't soliciting of the foundation.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: She was taking money from overseas countries while Secretary of State when she told Obama she wasn't.</p>                \n                \r\n\n            \n                <p><b>TARLOV:</b> The foundation was taking money.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Yes. It's the same thing.</p>                \n                \r\n\n            \n                <p><b>TARLOV</b>: It's not the same thing.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: It's not the Clinton Foundation?</p>                \n                \r\n\n            \n                <p><b>TARLOV:</b> No, well I think that was the Bill Clinton Foundation. It was the Clinton Foundation the way that it was after she was secretary of state.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Same name.</p>                \n                \r\n\n            \n                <p><b>TARLOV:</b> Everything your wife does you do, too?</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: I have to. Or else I get in trouble.</p>                \n                \r\n\n            \n                <p><b>TARLOV</b>: That's true.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: But what about the server? I mean, we know that the server, her server that's in question was set up by the Clinton Foundation. I mean, there are so many connections between Bill and Hillary Clinton and the foundation and how she pedaled her influence as secretary of state. And that's the biggest difference. And you can't pin that on a Donald Trump or a Ted Cruz. I mean, she really has a problem, Jessica, when it comes to her position and using it.</p>                \n                \r\n\n            \n                <p><b>TARLOV</b>: There is a problem there, absolutely. And as I said earlier, I think that this is effecting obviously her support. But going back to the Donald Trump issue, you said yes, he got it out of the way and he said hey there, I bribe people. This is how it works in the business world. I hope you like it, I hope you vote for me.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: And he didn't say I bribe people, he said I grease politicians. Every real estate developers greases politicians. How do you think you are going to get a golf course through?</p>                \n                \r\n\n            \n                <p><b>TARLOV</b>: Right.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: That's how the world works, you know it. Hey, listen, he has distanced himself from pay to play. He says I don't do it anymore. I'm self-funding, Hillary Clinton hasn't returned any Donald Trump donations, has she?</p>                \n                \r\n\n            \n                <p><b>TARLOV:</b> This is a joke, right?</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Is Hillary returned any Donald Trump donations, yes or no?</p>                \n                \r\n\n            \n                <p><b>TARLOV</b>: I will call her right now.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Yes. Yes. Find out for me because I don't think she has.</p>                \n                \r\n\n            \n                <p><b>TARLOV:</b> I don't think that that's the point here. Donald Trump is the number one opportunist in this race whether it's, you know, Trump steaks, Trump University, having convicted felons.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Hillary has been running for president for 30 years.</p>                \n                \r\n\n            \n                <p><b>TARLOV</b>: Isn't she great at it?</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: We don't know yet.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> The Clintons have been in office for so long, they have made so much money by being professional politicians. I mean, they have made all their money in the public sector on the backs of taxpayers and big donors, and I do think it points to a huge problem.</p>                \n                \r\n\n            \n                <p><b>TARLOV</b>: Are we agreeing that Donald Trump is a saint here because I'm a little bit confused to what's going on?</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: And the Clintons stole the White House China. All right? Let's not forget that.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: And the W's off the keyboard.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: That's right. Andrea and Jessica, thank you guys very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Ted Cruz on the attack", "description": "'The O'Reilly Factor' examines the GOP candidate's campaign rhetoric", "date": "2016-04-11T12:15:42Z"}