{"vcmId": "e22fb0a3-0558-4e55-bfda-6289d8557ae9", "url": "http://www.foxnews.com/transcript/2017/02/16/bill-oreilly-mass-hysteria-over-general-michael-flynn.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As we reported last night, the national security advisor [Gen. Michael Flynn] has resigned because the Trump administration says it lost confidence in him.</p>                \n                \r\n\n            \n                <p>The story is a bit complicated but it boils down to this:</p>                \n                \r\n\n            \n                <p>Flynn had phone contact with the Russian ambassador in late December while Barack Obama was still president.</p>                \n                \r\n\n            \n                <p>According to leaks from the intelligence agencies, Flynn discussed Mr. Obama's sanctions against Russia.</p>                \n                \r\n\n            \n                <p>Then General Flynn denied that to Vice President Mike Pence.</p>                \n                \r\n\n            \n                <p>The FBI also interviewed General Flynn and, if he lied to them, that would be a crime.</p>                \n                \r\n\n            \n                <p>However, that's a big if.</p>                \n                \r\n\n            \n                <p>It is not a crime for Mr. Flynn to informally talk with the Russian Ambassador before Donald Trump took office, but it is highly inappropriate if policy was discussed.</p>                \n                \r\n\n            \n                <p>So at this point, Flynn is out and it looks like retired Vice Admiral Robert Harward will take his place.</p>                \n                \r\n\n            \n                <p>Admiral Harward is 60-years-old, has extensive military experience and served in Afghanistan.</p>                \n                \r\n\n            \n                <p>Looks like a solid choice, but you never know.</p>                \n                \r\n\n            \n                <p>By the way, the FBI is still investigating the whole Russian situation and that's all we know at this point.</p>                \n                \r\n\n            \n                <p>But lack of facts doesn't stop the anti-Trump press from whipping up hysteria.</p>                \n                \r\n\n            \n                <p>There are two things in play.</p>                \n                \r\n\n            \n                <p>First, the Trump-haters are fervently hoping that they can link the Trump campaign to the Russian hackers who disrupted the Clinton campaign.</p>                \n                \r\n\n            \n                <p>That's the ultimate goal for the haters.</p>                \n                \r\n\n            \n                <p>If they cannot achieve that, they would like to have General Flynn tell the world that Donald Trump ordered him to call the Russian ambassador.</p>                \n                \r\n\n            \n                <p>So that's the media game plan.</p>                \n                \r\n\n            \n                <p>Now yesterday the bombast on our cable competition was actually humorous.</p>                \n                \r\n\n            \n                <p>New York Times columnist Thomas Friedman compared the Russian hacking to war.</p>                \n                \r\n\n            \n                <p><b>THOMAS FRIEDMAN, NEW YORK TIMES COLUMNIST:</b> &#8220;We have never taken seriously from the very beginning, Russia hacked our election. &#160;That was a 9/11 scale event. &#160;They attacked the core of our democracy. &#160;That was a Pearl Harbor scale event.&#8221;</p>                \n                \r\n\n            \n                <p>Here's how crazy that statement is. &#160;Say President Trump declared war on Russia as we did after Pearl Harbor, would Thomas Friedman support that?</p>                \n                \r\n\n            \n                <p>Of course not.</p>                \n                \r\n\n            \n                <p>So this is just madness.</p>                \n                \r\n\n            \n                <p>However, the anti-Trump media loves this kinda stuff.</p>                \n                \r\n\n            \n                <p>Let me give you another very simple example, and it has to do with speculation.</p>                \n                \r\n\n            \n                <p><b>WOLF BLITZER, CNN ANCHOR</b>: &#8220;Do you think Flynn acted alone when he made that phone call to the Russian ambassador in Washington?&#8221;</p>                \n                \r\n\n            \n                <p><b>REP. SETH MOULTON (D-MA): </b>&#8220;I don't think that anything in Washington happens alone.&#8221;</p>                \n                \r\n\n            \n                <p>Now that man, Congressman Seth Moulton, is a Trump hater.</p>                \n                \r\n\n            \n                <p>Also, he has no blanking idea whether General Flynn acted alone. &#160;He couldn't possibly know that.</p>                \n                \r\n\n            \n                <p>Wolf Blitzer, who is generally responsible, asked a speculative question based on nothing.</p>                \n                \r\n\n            \n                <p>There could not have been any credible answer that shed light on the Flynn situation.</p>                \n                \r\n\n            \n                <p>So why bother with this nutty speculation?</p>                \n                \r\n\n            \n                <p>The answer is there are millions of Trump haters who will sit there hour after hour after hour and watch this kind of bilge.</p>                \n                \r\n\n            \n                <p>And that's why it's done.</p>                \n                \r\n\n            \n                <p>Summing up, there is no credible evidence at this point that the Trump campaign cooperated with the Russians in the hacking of the Clinton campaign.</p>                \n                \r\n\n            \n                <p>There is no credible evidence that General Flynn was directed to do anything.</p>                \n                \r\n\n            \n                <p>Yet the anti-Trump media is spending hours talking trash.</p>                \n                \r\n\n            \n                <p>One footnote, hard news reporters should be looking into all the Russian intrusions including the Flynn situation.</p>                \n                \r\n\n            \n                <p>And if those reporters uncover evidence of wrongdoing, it should be presented.</p>                \n                \r\n\n            \n                <p>But speculation by the media is garbage.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Mass hysteria over General Michael Flynn", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/15", "date": "2017-02-16T13:08:27Z"}