{"vcmId": "e2ba5f6e-a9ab-4d93-b25d-2958132e8937", "url": "http://www.foxnews.com/transcript/2015/06/02/bill-oreilly-it-is-war-in-some-american-cities.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>While the grievance industry concentrates on police officer shooting black citizens, the real war is criminals shooting Americans many of whom are innocent bystanders. In Baltimore, May was the most violent month in more than 40 years -- 43 homicides and nonfatal shooting incidents up 60 percent this year.</p>                \n                \r\n\n            \n                <p>Also the Associated Press reporting arrests in Baltimore down 56 percent in May since the riots. That means some Baltimore cops are standing down. In Chicago 47 American killed in May alone. So far this year, homicide is up 13 percent. 169 people already violently killed in the Windy City -- a vast majority of the murders committed by blacks on other blacks. Carnage in Chicago has been going on for years with no end in sight.</p>                \n                \r\n\n            \n                <p>Here in New York City, the uber-liberal mayor, Bill De Blasio ordered his officers to end the stop frisk program designed to get guns off the streets. The result, murders up 15 percent, non fatal shooting up close to 8 percent.</p>                \n                \r\n\n            \n                <p>In addition, the New York City infrastructure is collapsing. Cops are angry with de Blasio for not supporting them therefore low-level offenses such as double parking, aggressive begging, other so-called quality of life crimes, not being enforced. Streets in the city are clogged beyond belief 24/7 which means more air pollution and more frustration for anyone trying to get anywhere. You can't.</p>                \n                \r\n\n            \n                <p>There is no question things are going south in New York City under Mayor de Blasio. Should be noted that in Baltimore, Chicago and New York, Democrats run the show and their permissive attitude toward public policy are the primary reason violence is up, social order down. Unless the nation somehow begins to understand that strict policing is necessary to protect lives, this violent trend will continue.</p>                \n                \r\n\n            \n                <p>That being said, there's a report in \"The Washington Post\" today that says police shootings are also on the rise. So far this year, 385 people have been killed by police -- half white, half minority. More than 80 percent of those shot were carrying weapons of some kind.</p>                \n                \r\n\n            \n                <p>So you can see that the violent climate emerging in the U.S.A. is generating violence on the street and through police action.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: It is the war in some American cities", "description": "Bill O'Reilly's Talking Points 6/1", "date": "2015-06-02T12:16:47Z"}