{"vcmId": "e4630876-01fc-4a6a-b949-51d44df49f7a", "url": "http://www.foxnews.com/transcript/2015/09/09/donald-trump-lays-out-foreign-and-domestic-strategies.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" September 8, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Hi, I'm Bill O'Reilly. Thanks for watching us tonight. No \"Talking Points Memo\" because we have a very busy program. Glenn Beck will be protesting the Iran nuke deal. He will be here. Charles Krauthammer on new information that Hillary Clinton did indeed have classified information on her private server.</p>                \n                \r\n\n            \n                <p>But first the lead story tonight: Donald Trump.</p>                \n                \r\n\n            \n                <p>As you may know he continues to lead the GOP presidential field by a significant margin in all the national polls causing consternation among some Republicans. Mr. Trump will be protesting against the Iran nuke deal tomorrow in Washington and he joins us now from his headquarters here in New York City.</p>                \n                \r\n\n            \n                <p>We'll get to the nuke deal in a moment. But, first, I want to know what you think about this migrant crisis in Europe. 800,000 it looked like will have to be settled in Germany alone. What do you think started that?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, it's a serious problem. We haven't seen anything like it since the Second World War and it's getting worse and worse. And I was actually impressed in one way but surprised that Merkel in Germany allowed this to happen because they are really flowing through all over Europe.</p>                \n                \r\n\n            \n                <p>And if you notice, Russia is not taking and China is not taking and the Gulf States, whether you look at Saudi Arabia or Qatar or any of them - - they are taking none. But some of them are. And some of them are actually being very generous.</p>                \n                \r\n\n            \n                <p>Just really I wonder, you know, where all these people are coming from exactly. And what are they representing because do you have people from ISIS in that group? You know, there is a lot of security risk with it. But, something has to be done. It's an unbelievable humanitarian problem.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok. Israel is not taking any. Britain is taking a few -- maybe 5,000. You know thousands will come to the United States of migrants. Now, do you object to migrants getting out of the Middle East and North Africa? Do you object to them coming to the U.S.A.?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I hate the concept of it but on a humanitarian basis with what's happening, you have to. You know, this was started by President Obama when he didn't go in and do the job when he should have. When he drew the line in the sand which turned out to be a very artificial line.</p>                \n                \r\n\n            \n                <p>But, you know, it's living in hell in Syria, there is no question about it. They are living in hell. And something has to be done.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So you would have intervened.</p>                \n                \r\n\n            \n                <p>Had you been president, you would have intervened in Syria? You would have removed Assad as the President of that country?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, you know, Obama said he was going to do that and the problem you have is that Russia is on his side, Iran is on his side and lots of other things can happen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, what would you have done? After the gas --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: And you know, the amazing thing --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: After the gas --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: After the gas -- something should have happened because when they used gas --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What? What would you have done? In hindsight?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Probably, probably in retrospect, they should have gone in and they had should have done something with Assad. But, you know, Assad is not our biggest problem because Assad and ISIS are actually fighting.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: So now what we are doing is we are fighting ISIS and ISIS wants to fight Assad. And some people could why don't you just let them fight out and you take off the remnants. We're stopping -- Assad has to say these people are the nicest people on earth, they are fighting my enemy. But Assad has the benefit of having Russia and Iran protecting him and I have a feeling that probably --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But now you're going to have millions literally -- now that all of these migrants are going to Europe and being accepted, millions more will come. And I think that catastrophe is going to play out over the next six months.</p>                \n                \r\n\n            \n                <p>All right. Let's go back to the United States.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, Europe is becoming a much different place. Bill, I have to say Europe is becoming a much different place.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Sure.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I was in Paris and Paris doesn't look like Paris anymore. You look at what's going on with some of the major cities and some of the major countries in Europe and even before this it's a much different place. And I'm not hearing that's what they want.</p>                \n                \r\n\n            \n                <p>But on a humanitarian basis, something does have to be done.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Back in the United States, Kim Davis released. She wouldn't give out gay marriage licenses. What is your advice to Miss Davis? Should she have issued the license?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, you know, she was released and that was good and it was too bad that she had to be put in jail. And I'm a very, very strong believer in Christianity and religion, but I will say that this was not the right job for her because we had a ruling from the Supreme Court and we are a country of laws. And you have to do what the Supreme Court ultimately -- whether you liked the decision or not and it was a 5-4 decision.</p>                \n                \r\n\n            \n                <p>Whether you like the decision or not, you have to go along with the Supreme Court.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. So you're going to say she's a licensor -- take what comes.</p>                \n                \r\n\n            \n                <p>Black Lives Matter, what do you think Black Lives Matter is after?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, I think it's very simple. All lives matter -- whether it's black or white and how are we getting away with just murder.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: no, no. But let's go to that group. What does that group want?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I think they're trouble. I think they're looking for trouble. I looked at a couple of the people that were interviewed from the group. I saw with them with hate coming down the street last week talking about cops and police and what should be done to them. And that was not good.</p>                \n                \r\n\n            \n                <p>And I think it's a disgrace that they're getting away with it. I think it's disgraceful the way they're being catered to by the Democrats. And it's going to end up kicking them you know where. I don't think it's going to end up good.</p>                \n                \r\n\n            \n                <p>The fact is all lives matter -- that includes black and it includes white and it includes everybody else. And we have people -- Democrats that are afraid to even say that. They're apologizing because they say white lives matter and all lives matter.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: These are people that are unfit to run for office in my opinion.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It's not just Democrats. Let's roll the tape. I want you to react to this. Go.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>COLIN POWELL, FORMER U.S. SECRETARY OF STATE</b>: Black Lives Matter -- that's a way of capturing the essence of this problem we have where blacks have been killed by police officers in a way that doesn't seem appropriate. Not the killing is appropriate in any circumstance. And so I don't mind the slogan and I don't mind the movement because it draws attention to the problem.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So General Powell, a Republican, he's supporting Black Lives Matter. And you say.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: He's wrong. He's totally wrong. It's all lives matter and that should be the theme of this country frankly. One of our themes -- all lives matter. So he's obviously catering to somebody. I don't know who he's catering to.</p>                \n                \r\n\n            \n                <p>I looked at the head, I was watching the head of Black Lives Matter being interviewed the other night. And I said to myself, give me a break. All lives matter.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. If all lives matter then, why do you support Planned Parenthood and not cutting off the funding since they're the top abortion provider and now we know they are engaged in selling the parts of dead babies? And you don't want to cut off their funding. So if all lives matter --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, I think you have to -- I'm not supporting Planned Parenthood. Somebody said I was supporting -- I `m not supporting --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Would you cut off funding to Planned Parenthood?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I'm against Planned Parenthood -- yes, I would. I don't know where you got this information. I never said that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That was the report.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I'm against Planned Parenthood -- totally against -- well, because you read a wrong report, Bill. You have bad researchers, what can I tell you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No, no, no, no, no. It was an erroneous report but that was the report. We will take care of the people who did that.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: All right. It's wrong.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Go ahead, just state it. State it.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: No, I mean a lot of people say it's an abortion clinic. I'm opposed to that. And I wouldn't do any funding as long as they are performing abortions. And they are performing abortions.</p>                \n                \r\n\n            \n                <p>So I would be opposed to funding -- I would be totally opposed to funding.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. Tomorrow you are going to go down to D.C. you're going to be in this anti-nuke Iranian rally. But as you know 41 Democratic senators say they will support the treaty therefore it's blocked for a vote in the senate. It becomes not law because it's not that way but the treaty will then go into effect or the deal. Some say it's not a treaty. The deal will be made.</p>                \n                \r\n\n            \n                <p>So why are you going down to Washington if it's a fait accompli?</p>                \n                \r\n\n            \n                <p>Well, it's a protest. It's one of the most incompetent contracts. Forget about deals from any standpoint, whether you look at real estate, whether you look at war, it's one of the most incompetently drawn contracts I have ever seen. We could have had much better deal. We could have had a much stronger deal. We should have doubled up the sanctions, negotiated for strength.</p>                \n                \r\n\n            \n                <p>We don't get anything. We are getting nothing from this deal. And then you look at certain countries opposed to it. Now all of the sudden out of the blue, they come as an example Saudi Arabia they came back. Well, what are they getting? You know what we are giving them in terms of guarantees and weapons and money probably. It's absolutely disgraceful.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It's a bad deal, there's no question about it.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: It's an embarrassment to our country. And there's no way -- even, look, it's not the most important thing but it's very important. Our prisoners should have been released before we even started talking to these people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's right.</p>                \n                \r\n\n            \n                <p>Ok. But all of our allies, so-called European allies who didn't step up in Syria didn't want to do anything there. Now they are getting what they deserve because they are too afraid to do anything. They were in favor of the Iran nuke deal. You are talking Germany, you are talking Britain, you are talking France. Yes, yes, yes, yes.</p>                \n                \r\n\n            \n                <p>See, your strategy seems to me is we go it alone because you wouldn't be able to rally anybody against Iran in this situation or am I wrong?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Well, look. You could have -- if we had the right leader, those countries, Russia is going to make a fortune. They're already making deals to send massive missiles all over Iran and other countries are making a lot.</p>                \n                \r\n\n            \n                <p>You know, we are the only country we get nothing out of this deal, we get absolutely nothing. They are going to spend $150 billion that we are giving them like a payment to make a deal that's bad. They are going to spend $150 billion on terror all over the Middle East, probably all over the world.</p>                \n                \r\n\n            \n                <p>This deal is incomprehensible. It should have never been made. And now the problem is you will never put that group together in terms of sanction because they are all out taking advantage of Iran and it's a big problem.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's there. That's right.</p>                \n                \r\n\n            \n                <p>So you are going to protest tomorrow and just let everybody know how you feel, right?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>If I win, I will tell you something, a lot of different things will be happening in this country. You won't see deals like that. Even that deal I will make it much, much better. I will renegotiate that deal, and I will make it, and that's what I do. That's what I do in life. I will make that deal much better for this country.</p>                \n                \r\n\n            \n                <p>That deal is a disgrace. It should have never been allowed and how Obama got away with it is beyond anybody's comprehension.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Donald -- as always we appreciate you coming on. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump lays out foreign and domestic strategies", "description": "GOP frontrunner on the migrant crisis, gay marriage debate, Iran nuke deal, and Black Lives Matter", "date": "2015-09-09T12:32:08Z"}