{"vcmId": "e51d2783-986b-4e39-8841-13f014a18651", "url": "http://www.foxnews.com/transcript/2015/09/24/carly-fiorina-poll-numbers-rising-quickly.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" September 23, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Personal Story\" segment tonight. Carly Fiorina's poll numbers rising quickly. She performed well in both republican debates. Now enjoying big crowds wherever she goes. As you may know, Ms. Fiorina was the CEO of Hewlett Packard from 1999 to 2005. After being removed from that job she left with a $21-million severance package. During her tenure at HP Miss Fiorina cut 30,000 jobs but also hired other workers so net employees grew at the company. Nevertheless, some Democrats are now portraying her as a bad person. Much like what they did with Mitt Romney.</p>                \n                \r\n\n            \n                <p>Joining us now from Rock Hills, South Carolina is Carly Fiorina. So, that's going to be the mantra against you. That you are a greed head, $21 million severance while people who work for Hewlett Packard never make that much in their whole life. How will you counter it?</p>                \n                \r\n\n            \n                <p><b>CARLY FIORINA (R), PRESIDENTIAL CANDIDATE</b>: Well, first, thank you, Bill, for having me tonight. I was recruited by the board to save a company. Hewitt Packard was falling further and further behind. And particularly in a competitive industry like technology if you are lagging you are losing, we did that. We saved 80,000 jobs. Went on to grow to 150,000 jobs. Tripled our rate of innovation to 15 patents a day. Quadrupled our cash flow, quadrupled our growth rate went from the Fortune 28 to a Fortune 11 company.</p>                \n                \r\n\n            \n                <p>And, at the same time, the NASDAQ technology index dropped 80 percent in the middle of the first technology recession in 25 years. And many of our strongest competitors literally disappeared beneath the waves taking every single job with them. Yes, I had to make some tough calls and frankly I think the American people understand that there are some tough calls that are going to have to be made in Washington, D.C. to cut this vast federal government bureaucracy down to size.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. So you are a good, in your opinion, good manager, but the fact does remain that you took 21 million in severance when you left the company and the Democrats are going to come after you for that, you know they are?</p>                \n                \r\n\n            \n                <p><b>FIORINA</b>: Yes. Hey, and of course what I would say is that every single dollar that I earned as a chief executive at Hewlett Packard was voted on by shareholders. That is the owners of the company. We were extremely transparent.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. You didn't do anything illegal.</p>                \n                \r\n\n            \n                <p><b>FIORINA</b>: By the way. Hillary Clinton and Bill Clinton are worth, well, no, actually Hillary and Bill Clinton are worth four times what Frank and Carly Fiorina are. They are worth $100 million. They have never created a job. They have never saved a job. And her policies have destroyed lots of jobs.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. That's interesting because in 2008, I'm going to read you a quote from the \"Chicago Sun-Times,\" you said I know Hillary, I'm a great admirer. She is obviously intellectually determined and heroic individual. She ran a great campaign. I have great empathy for her. So now you are in a position where you are going to have, to you know, hammer her but, you know, back in 2008, you were saying nice things about her.</p>                \n                \r\n\n            \n                <p><b>FIORINA</b>: Well, you say Bill, I'm not a liberal. So, Liberals don't like people that they disagree with. I actually find much about Hillary Clinton and -- you say, hardworking intelligent woman. She has dedicated her life to a particular cause. I also profoundly disagree with her. And I will continue, not to attack her personally as many politicians and some other candidates for president continue to do, I don't believe in personal insults. What I believe in is a fact based attack on her record --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. What about her do you admire --</p>                \n                \r\n\n            \n                <p><b>FIORINA: </b>-- and this is a fact based truth she doesn't have a track record of accomplishments. She is a hard working woman.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Wait. Wait. Wait. Wait.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> She is a very intelligent woman.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So you admire her intelligence?</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> Yes, I do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you admire her ethics?</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> And I admire her work ethic. Yes, I admired her work ethic. She clearly has lied.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How about her personal records?</p>                \n                \r\n\n            \n                <p><b>FIORINA: </b>Well, she has lied about Benghazi. She has lied about her emails and she's lied about her server and because of those lies --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Are you 100 percent sure? Are you 100 percent sure that --</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> Absolutely. Hundred percent sure, yes, absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But if you are going to say I'm a great admirer and then you say she lied. I don't know if that, you can reconcile.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> Well, of course 2008 -- yes, but in 2008, we didn't know about Benghazi.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's true.</p>                \n                \r\n\n            \n                <p><b>FIORINA: </b>We didn't know about her emails and we didn't know about her server now we do. Now, we do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Very good retort by the way. Very good. All right, now, latest FOX News poll has it this way. Trump 26 percent up one percent since the last debate. Carson 18, up six percent. Fiorina nine percent up four. Rubio nine up five. So you are a player. I mean you are very very competitive here. Scott Walker the governor of Wisconsin gets out, all right? And he says to you and all the other republican candidates you guys have got to stop Trump. When you heard Governor Walker say to you and the other candidates you have to stop Trump. What did you think?</p>                \n                \r\n\n            \n                <p><b>FIORINA: </b>Well, Scott Walker obviously is entitled to say whatever he likes. He is a leader. He is a fine governor. And I'm sure he will continue to be a leader in our party. I think each of us as candidates are going to do what we feel is best for our candidacy. Look, I'm running to win this nomination. And I believe as I talk to more and more Americans, despite the fact that still far fewer people know me than know Mr. Trump, more and more people support me. And I think that's because they know we need a no nonsense leader who has a track record of actually producing results. Solving problems and challenging the status quo.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But that's exactly what Trump says.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> I think they know we need --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's exactly what he says. But you are kind of skirting my question. I'm not going to use the word dodging you are skirting it. So Walker says, look, all the republican candidates that remain, you have got to get together and stop this man. Now, do you believe that?</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> Well, look --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Do you believe that Donald Trump has to be stopped?</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> I intend to beat Donald Trump.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Good answer. You know, the Fiorina factor if you don't become president. That's a good answer. So you intend to beat him and that, in effect would stop him. Correct?</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> That's correct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is it personal? Do you feel offended by Mr. Trump because of the things he said about you?</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> I intend to beat him because I think I am the most qualified candidate to win this election.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So that means it's not personal.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> And I think both.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It's not a smidgen? Remember when the president said to me there wasn't a smidgen of evidence about the IRS? Remember that?</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> I do remember that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> It was kind of incredible statement on the President's part.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It was an interesting statement. Now, is there a smidgen of personal animus towards Mr. Trump?</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> You know, actually not Bill, I have to tell you, people say all kinds of things about me. Donald Trump says, exactly the same things the Democrats say about me. I'm used to people saying things about me. And I also know what the facts of my record are. And so, people can say all kinds of things, I'm not going to engage in personal insults. I'm going to engage in a fact-based assessment of my own capabilities and I'm going to continue to give people very straight answers, to real substantive questions and problems. The American people want answers. And I believe I have those answers.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So that means, you are not going to tweet after this interview that I'm a pinhead?</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>FIORINA: </b>I don't ever tweet after interviews and by the way I would never call you a pinhead.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, you are in the minority then, Miss Fiorina. Hey, look, we appreciate it. You are always welcome on the program and we wish you the best on the campaign.</p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Carly Fiorina's poll numbers rising quickly", "description": "GOP Presidential hopeful joins 'The O'Reilly Factor' to discuss some Democrats trying to besmirch her record as CEO of Hewlett-Packard", "date": "2015-09-24T12:23:54Z"}