{"vcmId": "e5fb33c4-63fe-45b8-86f8-ce50b33b4a03", "url": "http://www.foxnews.com/transcript/2015/11/12/bill-oreilly-post-debate-blues.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Because we have no agenda here, I don't watch the debates with a rooting interest. I'm simply interested in seeing if presidential candidates are really looking out for you. I believe you guys should be able to make up your own minds about who did well and who did not do well in the debates.</p>                \n                \r\n\n            \n                <p>But as I said last night after all the verbiage is over there isn't all that much difference among the Republican contenders except for Rand Paul and John Kasich. Senator Paul doesn't really seem to see the urgency of the chaos overseas. And Governor Kasich is running on a humanitarian conservative platform in an age of deep anger against liberal tenets. Therefore, I believe those two candidates will not succeed, at least not this year.</p>                \n                \r\n\n            \n                <p>That leaves six viable contenders for the Republican nomination. If you believe the pundits, Marco Rubio and Ted Cruz gained momentum last night. Donald Trump and Ben Carson held their own. Carly Fiorina and Jeb Bush scored some points but not enough to overtake or challenge the leaders.</p>                \n                \r\n\n            \n                <p>Though one after debate comment that struck me as completely ludicrous was this:</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>COSTELLO: </b>So Dana, what was the mood like in that room because it appeared to me the moderators didn't ask very challenging questions?</p>                \n                \r\n\n            \n                <p><b>DANA BASH, CNN SENIOR CONGRESSIONAL CORRESPONDENT: </b>Well, I think obviously that depends on who you're talking about. To me one of the most fascinating divides that was on display on that stage last night was on the issue of immigration.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Miss Costello has a history of provocative statements and she is, of course, entitled to her opinion. But come on. Come on.</p>                \n                \r\n\n            \n                <p>The FBN moderators were on point, controlled the situation and covered a lot of ground. They should be proud of themselves and that kind of well I didn't think they really asked valid questions.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The post debate blues", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/11", "date": "2015-11-12T13:10:46Z"}