{"vcmId": "e6fc4ffc-d5a1-47d7-bd9f-ea3dd28778ae", "url": "http://www.foxnews.com/transcript/2016/09/16/bill-oreilly-press-and-presidential-election.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It is no secret that most in the media despise Donald Trump and coverage of the candidate reflects that.</p>                \n                \r\n\n            \n                <p>Talking Points is sure supporters of Hillary Clinton would acknowledge that, even if she herself gets pounded on occasion.</p>                \n                \r\n\n            \n                <p>That clear bias in hard news reporting is now reflected in a new Gallup Poll.</p>                \n                \r\n\n            \n                <p>Before I give you the shocking numbers, listen to this sound bite from one of CNN's best hard news reporters:</p>                \n                \r\n\n            \n                <p>Monday:</p>                \n                \r\n\n            \n                <p><b>CHRISTIANE AMANPOUR, CNN REPORTER</b>: &#8220;But surely this can't be a case of a human being having an off day. &#160;Nope. &#160;Like so many things Hillary, the media are having a field day, off to the races with another debilitating case of indignant outrage. &#160;This must be another typical Clinton conspiracy to fool them with total transparency breakdown. &#160;Talk about a transparency breakdown-what about Donald Trump's tax returns? &#160;Where are they? &#160;Can't a girl have a sick day or two?&#8221;<br> Ms. Amanpour has had a distinguished career as a fact-finding journalist.</p>                \n                \r\n\n            \n                <p>So why is she giving her pro-Hillary Clinton opinion? &#160;&#160;She's not an analyst.</p>                \n                \r\n\n            \n                <p>How can viewers now accept her information, especially about the campaign, without being skeptical?</p>                \n                \r\n\n            \n                <p>How?</p>                \n                \r\n\n            \n                <p>Americans know what's going on.</p>                \n                \r\n\n            \n                <p>According to a new Gallup Poll, just 32% of us trust the news to be reported fairly and accurately.</p>                \n                \r\n\n            \n                <p>That is the lowest media trust number in Gallup's history on the subject.</p>                \n                \r\n\n            \n                <p>The question then becomes why is it so difficult to simply report in straight way without a tilt?</p>                \n                \r\n\n            \n                <p>The answer: emotion.</p>                \n                \r\n\n            \n                <p>Editors of many press operations now believe they are on a mission to save the USA from a guy like<br> Trump and the deplorables who support him.</p>                \n                \r\n\n            \n                <p>Same thing on the Clinton side.</p>                \n                \r\n\n            \n                <p>A few, and I mean few, news concerns believe she is not honest and are out to get her.</p>                \n                \r\n\n            \n                <p>That kind of advocacy hurts the folks.</p>                \n                \r\n\n            \n                <p>Let me give you a vivid example.</p>                \n                \r\n\n            \n                <p>The Washington Post is about as anti-Trump as a news operation can get.</p>                \n                \r\n\n            \n                <p>Their top editorial guy Fred Hiatt bashes Trump almost every day and allows his mostly uber-left columnists to run wild.</p>                \n                \r\n\n            \n                <p>So this week the Post's hard news division has raised some valid questions about how Mr. Trump runs his charitable foundation.</p>                \n                \r\n\n            \n                <p>Our Truth Serum reporter will deal with that in a moment.</p>                \n                \r\n\n            \n                <p>But the Post story is getting far less traction than it might because the paper is so committed to hurting Trump.</p>                \n                \r\n\n            \n                <p>Therefore, some folks just ignore what the Post reports.</p>                \n                \r\n\n            \n                <p>Now some of you will ask, what about Fox News?</p>                \n                \r\n\n            \n                <p>From my vantage point in commentary, there are just as many FNC analysts who disparage Trump as support him. &#160;So we are balanced.</p>                \n                \r\n\n            \n                <p>As for hard news, we play it straight at least from what I've seen and I've seen a lot.</p>                \n                \r\n\n            \n                <p>Summing up, this coming presidential vote is extremely important for the country and Americans deserve honest reportage.</p>                \n                \r\n\n            \n                <p>Sadly, we are not getting it.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The press and the presidential election", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 9/15", "date": "2016-09-16T12:30:50Z"}