{"vcmId": "e751f181-86e3-4b57-8b46-a00d55702ba9", "url": "http://www.foxnews.com/transcript/2016/02/06/donald-trump-on-latest-polls.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 5, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Did you write that yourself?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: No, I didn't use the word. I never said the word, Bill. I don't know who told you -- I would never use the word. I didn't say the word. I said you can tell them to go themselves.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But the lips kind of moved in the --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, they might have. No, I didn't say the word. I wouldn't do that. Even I -- hey Bill, even I wouldn't do that, ok. No, I never said the word.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But you just walk right up to the line, you know. You always push it. You are always going there and all that.</p>                \n                \r\n\n            \n                <p>Ok. Be that as it may.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, you know, but we make our point.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You do.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: We make our point.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>There is no doubt you make your point.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Sometimes you have to make a point. And you know, the other way doesn't work out so well.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm sure you were glued to the set this afternoon. President Obama announced the economy was improving. Jobs are 4.9 percent unemployment. Should we give the President credit for that?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Look, you can't give credit. The economy is having the worst -- it's so bad. Hey, Bill, every time I go out, I have packed auditoriums, packed rooms because people don't have jobs. They don't have the jobs they want.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But it's 4.9 percent unemployment.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> It's a phony number. The number is 25 percent and probably higher than that. People are looking for jobs. They can't find them. They keep looking. They give up. And they're statistically employed.</p>                \n                \r\n\n            \n                <p>Bill, the economy is doing terribly. Look at even now the stock market. Finally, that was the one part of the economy and finally that's crashing. These are phony numbers put up by politicians to make them look good. When you hear 5 percent and 4.9 percent -- it's not the right number.</p>                \n                \r\n\n            \n                <p>Plus, as you have probably heard the jobs are bad jobs. They're really low level jobs and bad jobs. I have seen 15 different reports on that. But the fact is, if you look around for a job for months and months, you can't get it. You just sort of go home and forget about it. You are considered employed.</p>                \n                \r\n\n            \n                <p>There are millions of people out there, Bill, that can't get jobs. That's why I'm filling up these stadiums. Bill, if you had a real fight --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And you and Bernie Sanders have the same -- you and Bernie Sanders have the same thing. We got Bolling and Rivera coming up. I'm going to ask them about that. Both the left and the right are saying the economy is rigged. Ok.</p>                \n                \r\n\n            \n                <p>So you are not going to give President Obama any credit for the 4.9.</p>                \n                \r\n\n            \n                <p>Now, I believe that one of the biggest problems America has is the national debt. Yet, it's rarely talked about on the stump. Most people don't understand it, don't care about it. Can you tell us tonight why $19 trillion debt is important to the folks?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, it's really $21 trillion because the new budget deal lifts it up by at least $2 trillion. So, the national debt in a very short period of time is going to be $21 trillion. We are mortgaging our future. We are mortgaging our children's future.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What does that mean? How is that going to come back to hurt the kids -- how?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Because we are going to have to pay this money back at some point and at some point it's going to be impossible. You know, I have always heard and read a lot on it and understand it and went to Wharton and all of that stuff.</p>                \n                \r\n\n            \n                <p>I have always heard that $24 trillion we become Greece. And to a certain extent we are a large scale -- we are getting to be a large scale version of Greece. We never do cutting. We never do anything.</p>                \n                \r\n\n            \n                <p>You know, I saw a statistic the other day. We're the biggest purchaser of drugs in the world. Drugs to make people better for Medicare, et cetera, et cetera. We buy drugs. We spend the same, practically, as if you are going to go buy drugs from a counter, we spend the same. We could have saved $300 billion a year if we did the right job with the purchasing just of drugs.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Negotiated a better deal because we buy in bulk. But here's the thing.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: And you know why. Bill, do you know why this is? Because the drug companies have all the politicians taking care of them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, the lobbyists.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> They are all supporting all these politicians.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And nobody cares about it. Right.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: But they are not supporting me because I'm self-funding, ok?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: How are you going to bring down the debt though? Look, with all of the social security payments, with all of the Medicare payments, with all of the social welfare programs that we have, how is any human being going to bring down the debt? I mean, what are you going to do?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Ok, Bill, are you ready?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I'm ready.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: We have a country -- we have a country with no growth. We have no growth. Last quarter, did you see that practically zero growth which is almost unheard of? When China does 7 percent, they are practically in a depression. We do nothing because our jobs are leaving. Our companies are leaving.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So you're going to grow it but how will that bring down the debt?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: No, no. I will tell you how it is going to bring it back because we're going to create a dynamic economy again. We're going to bring the jobs back from China, from Mexico, from Japan.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But you still owe them money.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: From Vietnam.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: We still owe them money. So you bring it back, how are you going to get the debt down?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Because the country is going to start growing and we will be up to 4 and even 5 percent. And when we do that, we pay it back so easily.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> It's easy to pay it back.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> How? Because essentially if you look at the country like a profit- making corporation or a losing corporation -- right now we are a losing corporation -- we are going to make it a profit-making corporation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. But then you are going to have to raise taxes to get more money in to pay down that debt.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> The problem we have is our taxes are so high that nobody can -- everybody is choking.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't know how -- even if you gin the economy up, how does that pay down $21 trillion? You have to take money from the corporations and people to do it.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Bill, the politicians have caused this problem. Just so you understand.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I understand that.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> They have caused this problem over the years. Listen, the politicians have caused this problem. We're going to make our country dynamic again. Now, companies, big companies like Pfizer are leaving. They're going to make it worse. They're leaving. It's called corporate adversion -- many companies are leaving because the taxes are so high. We have to lower taxes not raise taxes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. But if you cut the taxes again the revenue to pay down the debt then leaves. Ok. But that's for another day.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No. No the country will be more dynamic. It will be a dynamic. We are going to create a dynamic economy where real jobs are going to be pouring into the country and we'll have a country that is sustainable. It will work -- Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Still the debt is still on the books. Now, you say you're going to be in the next --</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>You are going to slowly pay down the debt.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. You are going to be in the next debate. You've confirmed that? Fox News debate in Detroit? You showing up.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you want to confirm tonight that I was right telling you, you should have gone to the debate in Iowa? Do you want to confirm that too?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>No, you weren't right. I don't know what impact that had.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Oh, I wasn't right? Why are you going to this one then?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Flip a coin. Flip a coin.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't have a coin.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Let me just tell you. I raised $6 million that night for the veterans.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We could have done that on any day. You're going to the one in Detroit, you didn't go to the one in Iowa. Can't you give me a little credit that I was right? Can't you give me a little credit?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I will give you a little credit but not too much.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'll take that. You should have gone.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I raised $6 million for the veterans.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You could have done that any other day. And you gave Rubio and Cruz a lot more air time. Yes.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I gave them more air time, that's true. They had more air time. I agree with that. But you know what? The veterans like Trump so I'm ok with that I think it maybe sort of evens. The veterans love me.</p>                \n                \r\n\n            \n                <p>Remember this, $6 million I raised during that debate in one hour, actually, not two hours. And all came in, inn one hour. Pretty good.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Maybe we should have a telethon and pay down the debt.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>That's another way of doing it. That's probably not a bad idea.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Good luck on Tuesday. We always appreciate you coming on the program. I know you are busy and you take the fire and we appreciate it.</p>                \n                \r\n\n            \n                <p>Next on the rundown --</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump on the latest polls", "description": "GOP presidential hopeful joins 'The O'Reilly Factor' to discuss his campaign ahead of the New Hampshire primary", "date": "2016-02-06T22:45:44Z"}