{"vcmId": "e754009c-911a-4591-99a1-ef557c196b1b", "url": "http://www.foxnews.com/transcript/2016/09/08/crisis-in-city-chicago.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" September 7, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Factor \"Follow-Up\" segment tonight, there is now a crisis in the city of Chicago. So far this year murders in the windy city up 46 percent over the last year. Shootings up 46 percent as well. And some people are being gunned down, not just gang members. According to reporting by Heather McDonald in the \"New York Post\" today, at least 15 children under the age of 12 have been shot so far this year. Including a three-year-old boy now paralyzed for life.</p>                \n                \r\n\n            \n                <p>Obviously the governor of Illinois Bruce Rauner and the mayor of Chicago Rahm Emanuel have failed, failed to effectively deal with the list of violence. But why have they failed?</p>                \n                \r\n\n            \n                <p>Joining us now from Chicago, Enoch Muhammad, co-founder of Hip Hop Detox a group that works with at risk youth in Chicago. So, why can't the authorities control the violence, Mr. Muhammad?</p>                \n                \r\n\n            \n                <p><b>ENOCH MUHAMMAD, CO-FOUNDER, HIP HOP DETOX:</b> Well, first of all, thank you for the invitation and in the spirit of how we define Hip Hop, we define Hip Hop as being truth without boundaries and so the first words that I want to put out there is accountability. You cannot successfully deal with violence and you don't understand that violence is systemic and systematic in all aspects of life. So, you can't have people who are 24 to 25 neighborhoods and the speed light cameras and all the things that are done to take money out of people's pockets are happening predominantly in those 24, 25 neighborhoods. It's not to say that the other neighborhoods aren't getting hit but not like those 24 to 25 neighborhoods.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. But let's put the social problems aside and deal with public safety.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Surely you want the poor people of Chicago to be protected. Surely you want that. All right. We all want that.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD</b>: Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The Governor and the Mayor cannot protect them. Why?</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD:</b> Well, you have to have accountability that starts with looking at those who are doing the work, having the funding, the investment.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You have got to get more micro into it. There is a problem on the streets.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD</b>: You are talking about block by block and porch to porch type work where you are dealing with people on the ground. And what I'm saying is is that, the on the groundwork is being done. However, when you have $461 million in tiff funding that gets put into tourism and it gets put into areas that are already affluent and you begin -- you continue to starve those neighborhoods that need that type of funding because this is taxpayer dollars.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't know if funding is going to help --</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD:</b> That's part of the problem.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't know if funding is going to help to reduce violence when the violence is generated by street gangs who sell narcotics. So, I mean - -</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD</b>: Well, that's a misnomer though --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- bribe them not to kill each other.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD</b>: But first of all, let's establish -- the gangs in Chicago are not the way it were in the 90's when you had 1970 murders.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No. But you are up to almost 500 murders and it's September with almost 2500 shootings, that's Afghanistan levels. Okay?</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD:</b> Oh, no you are absolutely correct about the numbers as far as that is concerned.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD</b>: What I'm saying is is that, when you look at the problem, Chicago has a systematic problem where in the neighborhoods, for example, you are dealing with clicks all over the city of Chicago who are not organized as they were in the 80s and the 90's when you talk about quote, unquote, \"gangs.\" So, when you deal with, well, the problem is gangs. The problem is shooting. Yes, have you conflicts within the neighborhoods.</p>                \n                \r\n\n            \n                <p>You have a lot of different social, psychological, a lot of trauma, a lot of pain that's in those particular neighborhoods. However, when you don't deal with the fact that not only do you have rogue cops that are supplying drugs and guns. When you don't deal with the fact that these drugs come on trucks and trains and boats and planes and these young guys on the street don't own a canoe.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. But you be going macro and this is a public safety issue that needs to be dealt with immediately. And it immediately means the National Guard. It means the National Guard, that's what it means. If the National Guard will put into the neighborhoods, all of these shootings would stop. Because the National Guard would be on the street.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD</b>: When you say National Guard --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD:</b> I agree the National Guard should be used but not to be put on the street to deal with the people on the street. You should use National Guard strategically in the Chicago area in terms of the border to prevent drugs from coming in.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Can't do it. Can't do it. It's impossible.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD:</b> Why can't you do that?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Never been done in the history of mankind. People are going to get it no matter. However, what can be done to prevent a three-year-old from being paralyzed by a gang member's bullet, all right, is to put preference on the street that will inhibit violence because right away it will be reacted to. And you know that Mr. Muhammad. If you want to go macro on it, you have to deal with this kind of stuff un-infinitum.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD:</b> This is a micro-solution.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Real quick, micro.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD</b>: When I say block-by-block and porch by porch. That means that those who invest their time. People are getting compensated to do it or not, you have got those in the neighborhood. Not the traditional leaders and those who are in front of cameras all the time. You have those who are in the schools, they're in the neighborhood.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And they can work with the authorities.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD</b>: They are doing that kind of work all the time.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They can work with the authorities.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD: </b>The problem is --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And that's the only way --</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD:</b> They can't work with authorities.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And that's the only way it will stop, Mr. Muhammad. It's the only way that thousands of poor black Chicagoans are going to be safe. That is the only way.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD:</b> But you have to work with the people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You can do both.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD:</b> You can't put armed military in and have guns where you have trauma. You have generations of trauma.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You have to do both.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD</b>: So, you can't just do both. Well, you can't do both and not have mental health. I have got a question.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I have to go.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD</b>: I have a question.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I have got to go.</p>                \n                \r\n\n            \n                <p><b>MUHAMMAD: </b>Okay.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Crisis in the city of Chicago", "description": "Why has there been a failure to confront the lethal violence? 'The O'Reilly factor' investigates", "date": "2016-09-08T12:18:17Z"}