{"vcmId": "e756fca8-6dc8-4b46-9d2d-a85885df14f1", "url": "http://www.foxnews.com/transcript/2014/10/09/ebola-patient-dallas-dies.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><em>This is a RUSH transcript from \"The O'Reilly Factor,\" October 8, 2014. This copy may not be in its final form and may be updated.</em></p>                \n                \r\n\n            \n                <p><em>Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</em></p>                \n                \r\n\n            \n                <p>O'REILLY: \"Factor Follow up\" segment tonight. Thomas Eric Duncan has died from ebola in Dallas, Texas. You remember he came to the U.S.A. from Liberia last month traveling through belgium. Once here he developed ebola symptoms which caused some panic because he had a number of interactions with Americans. We were supposed to have an expert from the National Institutes of Health on this evening but he cancelled. Also officials from the Centers for Disease Control and Prevention have not been cooperative with THE FACTOR. Of course they should be seeking air time on the most watched cable news program in the world.</p>                \n                \r\n\n            \n                <p>With us now is the Dr. Ian Lipkin, director of the Center for Infection and Immunity at Columbia University. Now, we have a new situation developing right now in Dallas where a deputy sheriff that did enter the room of the deceased man in clean up and investigation is now under observation in Dallas for possible ebola. I want to bring everybody up to speed. They don't know for sure. His name is Sergeant Michael Monning, M-O-N-N-I-N-G.</p>                \n                \r\n\n            \n                <p>Now, I don't think we being told the whole truth about this, Doctor. And I'll point to the NBC freelance cameraman currently being treated in Nebraska who was in Liberia and has ebola and they flew him back here for treatment. They're telling us now that Mr. Mukpo, you're seeing here, contracted the disease by washing a car where a guy with ebola died in the car.</p>                \n                \r\n\n            \n                <p>Number one, a freelance cameraman doesn't wash cars. There's no way that happens. And number two, how you can get Ebola from washing a car. You figure you'll get a hose and you're hosing it down, right?</p>                \n                \r\n\n            \n                <p>DR. IAN LIPKIN, CENTER FOR INFECTION AND IMMUNITY, COLUMBIA UNIVERSITY: Well, I don't know how he washed down this car. For all I know he wiped down this car. So there is a lot of information that's missing. But it's true that you can catch ebola by touching things that people have touched who have ebola.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right. So if Mr. Mukpo was dumb enough and I say that with all due respect because he knew what he was covering to reach into a car where a guy with ebola died and there's some fluid he put his in, he's going to get the disease. But I don't think that is what happened.</p>                \n                \r\n\n            \n                <p>Shouldn't we know? He has been now in the country for a week. Shouldn't we know how Mr. Mukpo contracted this disease? The people of America should know that. should they not?</p>                \n                \r\n\n            \n                <p>LIPKIN: I agree that they should.</p>                \n                \r\n\n            \n                <p>O'REILLY: And we don't know because the Centers for Disease Control are too busy PR-ing this and not telling us the truth.</p>                \n                \r\n\n            \n                <p>Now, let's go to Madrid, Spain. There's a nurse who has treated a missionary priest who came back from Liberia and died in Madrid. The hospital says she only entered the room twice in protective gear head to toe. She has ebola. She went on vacation with her husband and was in contact with hundreds of people. How can you get ebola when you are head to toe with all the stuff?</p>                \n                \r\n\n            \n                <p>LIPKIN: First of all, we don't know that she was head to toe.</p>                \n                \r\n\n            \n                <p>O'REILLY: That's what the hospital says.</p>                \n                \r\n\n            \n                <p>LIPKIN: We're told that she may have been head to toe, and we don't know if she was wearing the appropriate head to toe protective gear.</p>                \n                \r\n\n            \n                <p>O'REILLY: Shouldn't we know?</p>                \n                \r\n\n            \n                <p>LIPKIN: Yes I agree we should know. I'm sure that people are trying to sort this out. So you raise the issue about us not being transparent in terms of what we are being told by the CDC or the National Institutes of Health and others. I'm not certain that that's true. I don't know that they actually know more than they are telling us.</p>                \n                \r\n\n            \n                <p>O'REILLY: Then say it. Then say it. But there is no reason Mr. Mukpo's whole story shouldn't be public right now and it isn't. Now I've also called for --</p>                \n                \r\n\n            \n                <p>LIPKIN: But don't we get the story from Mukpo?</p>                \n                \r\n\n            \n                <p>O'REILLY: Why not? He is cognizant. His parents are talking. We don't have the story. There is -- look, I have been doing this now for almost 40 years. There is something wrong here, Doc. I know your expertise is in medicine. My expertise is in information. There is something wrong. We're not being told what's going on here by these federal authorities.</p>                \n                \r\n\n            \n                <p>LIPKIN: There are certain facts that we know for certain. We know who has ebola and who doesn't have ebola. We know to some extent who they came into contact with or what they came into contact with that might have been responsible for their becoming infected with this virus. The details of what they were wearing or what they weren't wearing, we don't have.</p>                \n                \r\n\n            \n                <p>O'REILLY: But we should have that. The hospital has to know how this nurse in Madrid conducted herself in this situation.</p>                \n                \r\n\n            \n                <p>LIPKIN: But we have no control over what's going on in Madrid.</p>                \n                \r\n\n            \n                <p>(CROSSTALK)</p>                \n                \r\n\n            \n                <p>O'REILLY: That's true. But we do in Nebraska.</p>                \n                \r\n\n            \n                <p>LIPKIN: we should be able to figure out what's going on in Nebraska. And we should be able to figure out what's going on in Dallas.</p>                \n                \r\n\n            \n                <p>O'REILLY: Ok. One more question, Centers for Disease Control has a big press conference today where they say they oppose, all right, stopping flights from the African nations that are infected with ebola to the U.S.A. because that would impede our helping the nations. That's totally false. All I want to do is deny entry to anybody in West Africa at this time, suspend entry. But charter flights over there, fine. If we are going to go for humanitarian, military flights, fine. But why should we be admitting people from West Africa into the United States? Why?</p>                \n                \r\n\n            \n                <p>LIPKIN: It's very complicated. And I realize that that falls under the category of spin in your no spin zone. But the fact is the best way for us to protect the American people is to keep that disease over there and to get it under control. If it gets further out into Africa, we will not be able to control because our borders are porous.</p>                \n                \r\n\n            \n                <p>O'REILLY: But that doesn't have anything to do with people coming here from West Africa. I agree with everything you said. They don't need to come here now.</p>                \n                \r\n\n            \n                <p>LIPKIN: Yes, I understand what you are saying. But we have people who come here indirectly as well.</p>                \n                \r\n\n            \n                <p>O'REILLY: Anybody with a passport from that area doesn't get in.</p>                \n                \r\n\n            \n                <p>LIPKIN: People who come back from Liberia or from Guinea who don't have --</p>                \n                \r\n\n            \n                <p>O'REILLY: Special place.</p>                \n                \r\n\n            \n                <p>LIPKIN: -- who have special passports.</p>                \n                \r\n\n            \n                <p>O'REILLY: If they go there on humanitarian, they come back on a special controlled situation.</p>                \n                \r\n\n            \n                <p>Hey, Doc, we appreciate you coming in. Thank you very much.</p>                \n                \r\n\n            \n                <p>LIPKIN: My pleasure.</p>                \n                \r\n\n            \n                <p><em>Content and Programming Copyright 2012 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2012 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</em></p>                \n                \r\n\n            \n\n            \n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Ebola patient in Dallas dies", "description": "This is a RUSH transcript from \"The O'Reilly Factor,\" October 8, 2014.", "date": "2014-10-08T04:00:00Z"}