{"vcmId": "e7a28758-856e-4286-b09c-f3c914d22bac", "url": "http://www.foxnews.com/transcript/2014/12/11/bill-oreilly-truth-about-senate-torture-report.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Many fair-minded Americans are confused because a report by Senate Democrats accuses the Central Intelligence Agency of torture, bad management and lying. But at this point every single CIA leader since the 9/11 attack has refused to endorse the report. And three of them wrote a scathing op-ed today in the \"Wall Street Journal\", calling the Senate report bogus and dangerous. Every American should read that op-ed.</p>                \n                \r\n\n            \n                <p>As I said last night, the days following 9/11 were filled with chaos. America expected another al Qaeda attack and there were plots in development. Because the CIA had failed to detect the al Qaeda attack on 9/11 that killed nearly 3,000 Americans, the agency was under intense pressure. And so when terrorists were captured, intense pressure was put on them and in a few cases harsh interrogation methods were used.</p>                \n                \r\n\n            \n                <p>President Bush and Vice President Cheney ordered those coerce techniques and both men stand by them today, saying that thousands of lives were saved by information gathered.</p>                \n                \r\n\n            \n                <p>The Democrats on the Senate Intel Committee dispute that saying nothing was learned that couldn't have been gleaned by nonviolent interrogations.</p>                \n                \r\n\n            \n                <p>Based on available evidence, \"Talking Points\" is siding with the CIA people. Look, we're fighting a war. I have a book on World War II, \"Killing Patton\" so I know what I'm talking about. Bad things happen in war. After the German SS massacred Americans during the Battle of the Bulge, U.S. troops shot and killed Germans who had their hands up trying to surrender. That was wrong. But it happened and the U.S. high command largely overlooked it, understanding the tremendous emotions involved.</p>                \n                \r\n\n            \n                <p>It is the same thing with coerced interrogation. But opinion lines are drawn on ideology. Listen to this exchange between NBC News anchor Brian Williams and former CIA chief Michael Hayden.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BRIAN WILLIAMS, NBC NEWS ANCHOR: </b>What if you, God forbid, members of your family, had to undergo some of the treatments we are reading about in this report. Can you personalize it in that way?</p>                \n                \r\n\n            \n                <p><b>HAYDEN:</b> I actually think, Brian, that my concern or my outrage, if that were ever done to any of my family members, would be somewhat muted if my family members had just killed 3,000 of my citizens.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And then there's President Obama who doesn't really know what to do here as this sound bite makes clear.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> I don't think that you can know what it feels like to know that America has gone through the worst attack on the continental United States in its history. And you're uncertain as to what's coming next. So there were a lot of people who did a lot of things right and worked very hard to keep us safe. But I think that any fair-minded person looking at this would say that some terrible mistakes were made in allowing these kinds of practices to take place.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But Mr. Obama's own CIA chief, John Brennan, says he does not believe the Senate report. Quote, \"Our review indicates that interrogations of detainees on whom coerced interrogation was used did produce intelligence that helped thwart attack plans, capture terrorists and save lives,\" unquote. Thus the President and his own CIA chief differ on a very important situation.</p>                \n                \r\n\n            \n                <p>What it comes down to is you -- the everyday American. The truth is mistakes were made, but they were made in the fog of war to protect Americans. We're not a torture nation and the left wing which drives stories like this is incredibly irresponsible.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOAN WALSH, MSNBC POLITICAL ANALYST: </b>Look, we tortured and we still have al Qaeda; we tortured and we have ISIS. We tortured and didn't stop the resurgence of this form of fanatic and violent Islam. So torture didn't work either.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That is one of the dumbest statements I have ever heard. Everyone knows that aggressive tactics towards al Qaeda have decimated that group, led to the demise of Osama bin Laden, and prevented another 9/11 attack. Every sane person knows that. Final question -- who would you rather have protecting you -- Bush and Cheney, or Miss Walsh and her cohorts?</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The truth about the Senate torture report", "description": "Talking Points 12/10", "date": "2014-12-11T13:12:04Z"}