{"vcmId": "f15ede6c-3ada-40f3-8563-bc2b18b1575c", "url": "http://www.foxnews.com/transcript/2015/03/03/media-wars-and-2016-elections.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 2, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight. It looks like Hillary Clinton will announce her presidential run in April, at least that's what the Wall Street Journal is saying. But with the rise of the internet and no editorial standards in many precincts, this upcoming presidential race promises to be an unbelievable smear experience. Mrs. Clinton is a strong woman, and whoever the republican candidate is better be strong as well because the invective is going to be flying on both sides.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington, Lauren Ashburn, contributor to \"The Hill.\" And Howard Kurtz, host of Media Buzz on Sunday's 11 a.m. on FNC. You disagree with that assessment, Howard?</p>                \n                \r\n\n            \n                <p><b>HOWARD KURTZ, FNC HOST, \"MEDIA BUZZ\":</b> I think you're being restrained, Bill, it's going to be a cesspool, because you have more media, more ideological, quicker on the trigger and lower standards. Here's a classic case, \"Daily Beast\" just had to retract to completely bogus story about Scott Walker saying he was trying to cut funding for sexual assault reporting at universities of Wisconsin. It was completely false.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right.</p>                \n                \r\n\n            \n                <p><b>KURTZ:</b> He was picked up from Jezebel, a Gatsby women website, it was all over twitter and all over social media. These things just get out there and then they get walked back after somebody decides to check it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Hillary Clinton has got a big advantage, Lauren, because the main stream media, the pipeline as Howard just laid it out is accurate. It starts in these obscure places, then it goes into the bigger political websites and then it goes into the printed newspapers, cable TV, whatever. That's to the pipeline, okay? And there are, very, very few checks and balances anymore. It's just like, okay this is a good story and we're going to throw it out there, and the accusation of always, you know, the retraction is always this big and the accusation is huge and people don't see the retraction. But Hillary Clinton has got an advantage because the pipeline favors her in the third tier. The most of the main stream national media is going to root for her as they did with Barack Obama or am I wrong?</p>                \n                \r\n\n            \n                <p><b>LAUREN ASHBURN, \"THE HILL\" CONTRIBUTOR: </b>No, you're absolutely right. And what we're going to see is the main stream media encouraging a demolition derby of the republican primary candidates and we're going to see things like we saw with Jeb Bush and \"The Washington Post\" reporting on his wife's jewelry spending. Yes. Hillary Clinton we do know has been around for 25 years and there's not a lot that we don't know about her. You know, we know about little rock, we know about Bill Clinton's affair, we know -- I mean we know --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We know a lot about it, but talk radio in particular is going to hammer her. You know, everybody knows that, some of it is legitimate, certainly her 10-year secretary of state has been, you know, I mean, not a slam dunk success. Let me throw something at you here.</p>                \n                \r\n\n            \n                <p><b>KURTZ:</b> Go ahead.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, this is a rumor and I usually don't put rumors out there. But I'm going to do it tonight because I want to show you everybody how vicious this stuff is. Herman King. I saw what happened to Herman King last time around. Alright? There was accusations against him by certain people. I have been told on a very reliable level, but I cannot report it because I don't use blind sources as fact, I want everybody to know that what I'm saying is not fact, that these women were paid, they were paid to say things about Herman King and they were paid by democrats and when you get into a situation where there are websites that can print anything they want and there are people who fund the websites, gazilionaires, you got money to be spread around. And I believe it, I believe it, I believe it, I believe it. Go ahead, Howie.</p>                \n                \r\n\n            \n                <p><b>KURTZ:</b> Well, in the case of Herman King, there were also lawsuit against places he works. Some of each were settled but rather than we litigate out, go to your larger point, which is with all these new apple groups digging up dirt, sometimes spreading it to the main stream media, sometimes throwing it up on the web where it goes viral, this is a real problem. I'm going to push back a little bit on the Hillary Clinton for example, yes, she is going to get more favorable treatment than a lot of republicans who have never been vetted because there haven't been national figures. But in recent 10 days, the Wall Street Journal, Washington Post have dug into that a great job digging into the outrageous foreign government donations to the Clinton Foundation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's different, though, Howard, that's a news story, that's not a personal attack. That's a new story and I have no problem with news stories on anyone. It's the personal attack. Let's get Lauren the last word.</p>                \n                \r\n\n            \n                <p><b>ASHBURN:</b> The personal attack.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I like the demolition Derby line, I think that's exactly what this thing is going to be. Go.</p>                \n                \r\n\n            \n                <p><b>ASHBURN:</b> You know, the personal attacks are the big problem. I have had them, I'm sure a lot of other people have had them and there is no way of correcting them, Bill, because it's a lose, lose situation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>ASHBURN:</b> Right. You either respond to these idiots and then you get into a food fight, right? Or you don't respond and then it looks like you're guilty of something you didn't do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I wouldn't know anything about any of that. Lauren, Howard, thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Media wars and the 2016 elections", "description": "Howard Kurtz and Lauren Ashburn weigh in on reporting presidential politics", "date": "2015-03-03T13:25:20Z"}