{"vcmId": "f1e050da-b33b-4e51-9179-a8305e2aa570", "url": "http://www.foxnews.com/transcript/2016/11/07/bill-oreilly-another-letter-by-fbi-director-james-comey.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Writing once again, he said the bureau has now reviewed all of the e- mails that were on Huma Abedin's computer, she is Hillary Clinton's top assistant as you know. The bureau found nothing that would change the stated outcome of the case that Secretary Clinton should not be charged with national security violations.</p>                \n                \r\n\n            \n                <p>Of course, it is very good news for Mrs. Clinton who is under a shadow of corruption. However, you either believe Hillary Clinton is corrupt, or you don't. And anything short of an indictment is not going to change opinions. Those who pull a lever for Secretary Clinton on Tuesday surely know she plays by her own rules, not those you and I are forced to absorb. It is quite obvious that the Justice Department under President Obama has little interest in holding Hillary Clinton to account but every thinking person knows that.</p>                \n                \r\n\n            \n                <p>And even though the democratic machine caught a break today, there is still WikiLeaks which continues to torment the Clinton campaign. Apparently Doug Band who helped run The Clinton Foundation was very concerned that Chelsea Clinton was using Foundation's assets for, \"her wedding and life for a decade.\"And stated that in an e-mail to John Podesta, which also said, \"I hope you will speak to her and end this.\" We really don't know who she is, Hillary or Chelsea, but either way, it is clear that The Clinton Foundation money was being used for personal advantage for all three Clintons. Now, whether that is important to you, the voter, remains to be seen. But it is important to Talking Points.</p>                \n                \r\n\n            \n                <p>Every time The Clinton Foundation comes up, the Clinton people say this:</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEOTAPE)</b></p>                \n                \r\n\n            \n                <p><b>SEN. TIM KAINE (D-VA), VICE PRESIDENTIAL NOMINEE</b>: \"As you know, the Foundation does great work around the world and the distribution of AIDS drugs here in the United States and the distribution of drugs to battle opiate addiction.\"</p>                \n                \r\n\n            \n                <p><b>(END VIDEOTAPE)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And that is the mantra that the Foundation does a lot of good and it does, but that's not the point. Charity foundations are supposed to be for charity, not individual gains. So once again -- once again Hillary Clinton has a dubious situation on her resume.</p>                \n                \r\n\n            \n                <p>And here is another one, on Friday, the rapper Jay Z appeared at a Clinton rally in Cleveland. It was grim.</p>                \n                \r\n\n            \n                <p><b>(MUSIC PLAYING)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, that is the difference between traditional America and progressive America. Jay Z, a former drug pusher, celebrating cashes in on under poverty and apparently Hillary Clinton is fine with it. She's using the rapper to stimulate votes in the minority community. Now, Trump quickly hopped on it.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEOTAPE)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL NOMINEE</b>: He used every word in the book. I won't even use the initials because I'll get in trouble, they'll get me in trouble. He used language, last night, that was so bad and Hillary said I did not like Trump's lewd language, my lewd language. I'll tell you what; I've never said what he said in my life.</p>                \n                \r\n\n            \n                <p><b>(END VIDEOTAPE)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So with 48 hours left before the media starts calling states, the campaign is as intense as ever. Tuesday cannot come fast enough and that is \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Another letter by FBI Director James Comey", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/6", "date": "2016-11-07T20:22:46Z"}