{"vcmId": "f2eca1c7-bc90-4a27-8cbb-b1930ae1cbad", "url": "http://www.foxnews.com/transcript/2016/03/18/illegal-alien-charged-with-killing-woman-in-omaha.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 17, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: In the impact segment tonight, another grizzly death cause by an illegal alien. On January 21st, 19-year-old from Honduras slammed his car into a young woman's vehicle. He was drunk. 21-year-old Sarah rude who had just graduated from college died just hours later at the Nebraska Medical Center. Mejia was charged with motor vehicle homicide but was given a very low bail by Judge Jeff Marcuzzo, alarmed the Omaha police called ICE demanding the agency pick up Mejia. So, you would not make bail. ICE did not. Mejia got out and vanished. Tuesday in Washington, the head of ICE Sarah Saldana was grilled about the incident.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BEN SASSE (R), NEBRASKA SENATOR:</b> Your statement says -- your agency statement not you personally that Mejia -- is schedule to go before immigration judge on March 23rd, 2017 but he was released by the police once he posted bail. They contacted your agency, asked him to detain him. ICE didn't act. How do you explain that to the family?</p>                \n                \r\n\n            \n                <p><b>SARAH SALDANA, ICE DIRECTOR:</b> We acted -- we tried to act, sir, but I believe there was a matter of hours between the time that we were contacted and the actual release. It is very hard for us to get to every inquiry that is made by law enforcement.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Joining us now from Washington Senator Ben Sasse who just saw a Republican from Nebraska. So, that's not true. What Miss Saldana is saying that it was just a few hours and not enough time. That's not true, is it?</p>                \n                \r\n\n            \n                <p><b>SASSE</b>: You are correct, Bill. They have had three different stories and none of them make any sense. Their first story what they told the Omaha Police Department is apparently that the President's executive actions in November of 2016 is illegal actions in my view are why there was a policy to not try to detain this guy. Subsequently they gave the story that you heard there that they supposedly didn't have enough time. The wreck happened on January 31. She was declared dead later on January 31, the guy posts bail and flees on February 5th. And then they subsequently said well, they just didn't have enough resources and it wasn't clear what they need to do and they'll do an after action report. Their answer is they keep shifting and none of them are good enough.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. And now I have a spokesperson giving me a statement here that admits they screwed up. Now they are admitting they screwed up and now they are going to order their field leaders to look at this case so it never happens again. But the problem here is, number one, you have got a problem in Nebraska with this judge giving this guy $5,000 bail. It was 50 but he makes it when he comes up with 5,000 cash. I mean, this is ridiculous. It's absurd. The judge has to know this guy is a flight risk. He is from Honduras. He has low level beefs in Nebraska. His blood alcohol was through the roof. Why we do that? Did you talk to the judge? Anybody explaining this guy?</p>                \n                \r\n\n            \n                <p><b>SASSE</b>: My team and the committee staff we're reaching out to learn a lot more facts on that. But you are exactly right. The bail was ultimately set by this judge at $5,000. That's less than the funeral charges were for the gal who died. You are right, the blood alcohol limit was three times the legal limit -- blood alcohol level was three times the legal limit. And this guy was known to police in Omaha because he had been suspected of multiple negligent driving in reckless driving efforts in the past. And so, that's why they asked ICE to detain him and ICE refused to act.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You know, there is a trend in this country, I don't know whether it is effecting people in Nebraska as it is in people in New York where I live, that these are all nonviolent offenses. So, drunk driving, even if you kill a 21-year-old girl, you know, it's nonviolent and this guy needs to get a little help with his drinking. It doesn't matter if he is an illegal alien. This is the attitude that's creeping into our judicial system. Not only on the federal level but on the local level in Nebraska.</p>                \n                \r\n\n            \n                <p><b>SASSE:</b> You are right, Bill. Our founders had a vision of a government where there are very few laws but when you have a law, you actually have an executive branch that tries to dutifully enforce it. Because lawlessness is corrosive to a civil society. And we believe in a Republic of laws and a Republic of virtue among the citizenry. And if you do this kind of thing, you undermine the public confidence in government. Okay.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And our condolences to the family of this beautiful, young girl 21 years old. And I mean, it's going to continue to happen if people don't start doing their jobs. Sarah Root right there. Okay, now, I have got to ask you one question about Donald Trump. You are one of the first senators to come out and say, look, you are not going to support him no matter what. You have changed your tune? Have you modified? Have you spoken to Mr. Trump? Any of that?</p>                \n                \r\n\n            \n                <p><b>SASSE:</b> I have tried -- I'm not here to talk about the presidential race, but I have tried to engage Mr. Trump and ask him some serious policy questions. And let's be honest, he is a witty guy. I get that he would be a good guy to have a beer with. But he didn't want to answer any policy questions that I asked him. He responded by saying, I don't look like a U.S. senator I look like a gym rat. Well, as the child of a football and wrestling coach I will take a gym rat. You know, I will fully own that but it would be useful for Mr. Trump to answer some serious questions. He hasn't had any interest in doing that with me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, you sent him some questions written out? That's what you did?</p>                \n                \r\n\n            \n                <p><b>SASSE</b>: No. You know, Mr. Trump's main form of communication is one he can control. So he is the sort of legend of twitter in our times. So I tried to go to him where I could find him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You twitter him. All right.</p>                \n                \r\n\n            \n                <p><b>SASSE</b>: We have gotten to serious -- questions, thanks, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, one more question.</p>                \n                \r\n\n            \n                <p><b>SASSE:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> If he gets the nomination, are you going to not vote for him?</p>                \n                \r\n\n            \n                <p><b>SASSE:</b> You know, Bill, I'm really not trying -- I'm trying to do oversight today and not talk presidential. But here is what I hear from people in my state. Hillary Clinton is terrible.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Wait, wait, wait Senator, you are on The Factor, this is a No Spin Zone. If he gets the nomination, are you going to vote for him?</p>                \n                \r\n\n            \n                <p><b>SASSE:</b> Bill, we have got a fundamentally dishonest New York liberal going to get the democratic nomination. We should beat her. And the way to beat her is not by nominating a fundamentally dishonest New York liberal as a Republican.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, I hope, Senator, we love you. You know that. But I hope you recognize the irony. Trump wouldn't answer your questions. You didn't answer mine. Just, you know, the charming guy I am, but we appreciate your good work on the ICE front. Keep on those people. We can't have this. All right?</p>                \n                \r\n\n            \n                <p><b>SASSE:</b> Thanks, Bill have a good night.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Illegal alien charged with killing woman in Omaha", "description": "Could ICE have prevented the incident? Nebraska Senator Ben Sasse weighs in on 'The O'Reilly Factor'", "date": "2016-03-18T12:42:53Z"}