{"vcmId": "f4138b7b-153a-45be-aac0-85032c9f5884", "url": "http://www.foxnews.com/transcript/2016/08/09/trump-delivers-plan-to-jump-start-nation-economy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 8, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>ERIC BOLLING, FOX NEWS HOST</b>: Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching us tonight. Let's get right to our top story. Today's big economic address by Donald Trump. Republican nominee spoke at the Detroit Economic Club where he not only delivered a refreshed plan to jump start the nation's economy with a focus on reducing taxes. He imagined to hammer Hillary Clinton's focus on economic proposals.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL NOMINEE</b>: All Hillary Clinton has to offer is more of the same, more taxes, more regulations, more bureaucrats, more restrictions on American energy and on American production. More of that. If you were a foreign power looking to weaken America, you couldn't do better than Hillary Clinton's economic agenda. My plan will reduce the current number of brackets from seven to three and dramatically streamline the process. For many American workers, their tax rate will be zero.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Joining us now with reaction from South Hampton, New York, Trump's senior economic advisor David Malpass. David, thank you for joining us, importantly. So, a lot of us have been waiting for specifics. I have got to tell you I'm a conservative and I heard a lot of specifics today. Let me just start -- with what I think is the most refreshing of the four. He had four areas. The tax reform. You guys talk about a 15 percent corporate that's tax down from 25 percent. Deduct child care expenses from taxes. Ten percent repatriation and the debt tax goes well. I think this are going to resonate with conservatives. It certainly is with me.</p>                \n                \r\n\n            \n                <p><b>DAVID MALPASS, TRUMP CAMPAIGN SENIOR ECONOMIC ADVISER</b>: Hi, Eric. And it should. Because they do cause growth. You know, I was really happy with the results of the speech. The room was warm. People were receptive. There was a lot of clapping. And that's because I think there were a lot of specific policies that people could really relate to. The big question is how do you create more prosperity? And you do that by unleashing the economy and so Trump laid out ways to do that and I think it was really well received.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Let me dig in to these if you don't mind, David. I have an economics background. So, you go from a 35 percent to a 15 percent corporate tax. You're going to lose a lot of tax revenue if things were to stay the same. Everyone talks about growth bailing them out. But what kind of number are we talking? We're talking, I'm guessing, close to a trillion dollars in lost revenue if everything stayed the same, right?</p>                \n                \r\n\n            \n                <p><b>MALPASS</b>: Well, I don't know that that's -- what the scoring would be, but the economy is going to change a lot. One of the things that happens now is corporations avoid taxes by either moving offshore or they don't earn as much. They don't report the profit. And so if you have a lower rate, you're going to -- you're going to create more investment within the U.S. economy. That's the goal. You want to bring people in to the labor force. And it's not just on corporations, but the -- there is also going to be a reduction in unincorporated business tax rates. You know, Hillary Clinton has hers going up. And it's very mysterious how you could ever run an economy if you are taxing businesses more.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> I have a lot to get to so I'm sorry I'm going to pepper you with some of these stuffs. The deduct child care expenses from taxes. Does that apply to all levels? Or everyone who is has a child doesn't matter if you are rich or poor?</p>                \n                \r\n\n            \n                <p><b>MALPASS:</b> Right. That's whether you itemize or don't. And so, you might call it before the line. Or it's a -- there is also a cap at $13,000. So it's going to play very well with middle income people.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Uh-hm. Okay. The 10 percent repatriation tax. Meaning when companies are in profits overseas, and they want to bring it back, they were subject to that 35 percent tax bracket here. But you are going to bring it down to 10. How did you come up with 10?</p>                \n                \r\n\n            \n                <p><b>MALPASS</b>: That's exactly right. Well, you know, we have had some of those in the past and they work quite well. So, 10 percent, I think, is a number that will allow companies to bring it in and induce them to bring it in. And it also brings in revenue to the U.S. government. So, it's a win-win kind of a situation.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: All right. Death tax goes away, estate tax goes away. Personally I love this. I don't think enough Americans realize how much money the government takes from us for the second time.</p>                \n                \r\n\n            \n                <p><b>MALPASS:</b> That's right. And also, it causes lots of people to have to hire a lawyer to do estate planning even if they don't in the end up using it. And so, that should go away and that makes the economy more efficient.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> All right. Let's talk about trade a little bit. Donald spends - - Mr. Trump spends a lot of time on trade, quite a bit of time on trade. And he talked, the one that he really went after was trade enforcement with China. You talked about maybe a trillion dollars in, I don't know, net revenues or net money coming back to the United States. Is it really that big?</p>                \n                \r\n\n            \n                <p><b>MALPASS</b>: Well, we don't know how big it will be until the economy grows faster. The idea is to put, to create more manufacturing jobs to have a real economy that creates entry-level jobs for a lot of workers. We have been losing a lot of those jobs to China because it's cheating on its trade agreements. China does a lot of stealing of intellectual property.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: See, that's a good one, David. That's a great one. We know that it's rampant. Trying to stealing our intellectual property costs us hundreds of billions of dollars. I would agree with that. I'm just trying to figure out, he says he wants to apply tariffs against China cheating. How so? How do you apply a tariff? First of all, as a free trader, I hate tariffs.</p>                \n                \r\n\n            \n                <p><b>MALPASS</b>: Right. And so here's the key. You have to find a way to negotiate with somebody that doesn't want to negotiate with you. China has been entering into agreements and then not following through. Arguably, they might say, look, it's very hard for us to do that. But, that's tough. You've got to have a way that you can -- that the U.S. can negotiate and get a better deal than what we're getting right now from China. That's going to create a lot of jobs, and I think it still is in the context of free trade and more commerce. We want to have more fair trade going between the two countries.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Do you -- did you put a number -- in other words, what's your growth rate have to be to break even on this in the tax revenues perspective?</p>                \n                \r\n\n            \n                <p><b>MALPASS</b>: You know, I'm kind of skeptical of all of those economic models. And people, you know, you will going to hear a lot of people throwing --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> You need that. You need to come up with a growth number whether it's three percent, four percent, or five percent to say hey, this plan is really good for America. But we also have a lot of expenses.</p>                \n                \r\n\n            \n                <p><b>MALPASS</b>: So I think this plan will cause four percent growth, and I think we need that because, otherwise, what's happening is the middle of the economy is getting left out. A lot of people are dropping out of the labor force. Millions and millions of people dropping out. And they have to be brought back. So, the four percent, I think, is achievable. We know when Reagan did.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>For how long? I mean, listen, I agree with you four percent, Reagan had four percent coming out of the recession/depression --</p>                \n                \r\n\n            \n                <p><b>MALPASS</b>: He had eight percent.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: But it didn't last that long.</p>                \n                \r\n\n            \n                <p><b>MALPASS</b>: Yes. That's right. But the average, the goal here is to lift the average growth rate over the last seven years it's only been two percent. I think we can get 3.5, four percent average growth going forward.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Honestly, it's not unreasonable.</p>                \n                \r\n\n            \n                <p><b>MALPASS: </b>No, no, I agree with you. It's really not unreasonable and given history, we have had such underperforming growth for the better part of 10 years now it's not that farfetched to see a four percent average growth.</p>                \n                \r\n\n            \n                <p>David, I have to leave it right there. Thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Trump delivers plan to jump-start nation's economy", "description": "'The O'Reilly Factor' analyzes GOP candidate's proposals for jobs, taxes and trade", "date": "2016-08-09T12:13:08Z"}