{"vcmId": "f65884e1-0755-4a07-8947-689b59f1bedb", "url": "http://www.foxnews.com/transcript/2017/01/04/bill-oreilly-donald-trump-inauguration.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>There are wide reports that many entertainers are frightened to perform and the inaugural festivities on January 20th. Hard to pin down, but the roster of performers today is scant. Some of The Rockettes from Radio City Music Hall in New York City will be there. The Mormon tabernacle choir out of Utah is scheduled to perform.</p>                \n                \r\n\n            \n                <p>And Jackie Evancho of \"America's Got Talent\" is also set to sing. We hear the Beach Boys in the country group Alabama maybe appearing but that is not been confirmed. Also, not confirmed are some entertainers reportedly believe if they show up at the inauguration, it will hurt their careers. The tenor Andrea Bocelli has been mentioned. Along with Garth Brooks, I should say. But again, we cannot confirm the fear element.</p>                \n                \r\n\n            \n                <p>However it is obvious there is a problem, and there should not be one. The inauguration of a president, celebrates a peaceful transition of power engineered by the American voters. That is what the ceremony is, not a political gesture. So, all Americans should respect the process. Even if you don't like the incoming president. It should never be intimidation about attending or performing at inauguration. That is un-American.</p>                \n                \r\n\n            \n                <p>The election of George W. Bush in 2000 was perhaps the most controversial vote of the nation's history. Decided by the Supreme Court. Yet, a variety of entertainers showed up at the inauguration, including Ricky Martin, Wayne Newton, Jessica Simpson, Andrew Lloyd Webber, and The Rockettes. Even Beyonce showed up, performing with Destiny's Child as her inaugural concert for America's youth.</p>                \n                \r\n\n            \n                <p>So, even though there was bitterness over the Bush-Gore race, the nation came together at the inauguration. But now, that cohesive spirit seems to have changed. The harsh truth is that there is reverse McCarthyism going on in the entertainment industry. Remember that in the 1950s, Wisconsin Senator Joseph McCarthy started accusing people in Hollywood of being communist, that led to a black list where people were not hired because McCarthy smeared them. It seems anti-Trump zealots may be doing the same thing.</p>                \n                \r\n\n            \n                <p>If you are a Trump supporter, you are a bad person. And a number of entertainers believe their careers will be harmed should they associate with the new Trump administration. Again, that is terrible and awful state of affairs. \"Talking Points\" believes enough is enough with the anti-Trump movement. The man won the election, give him a chance. Respect the process! And stop the nonsense. And that is \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Donald Trump's inauguration", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/3", "date": "2017-01-04T13:02:30Z"}