{"vcmId": "fa59e396-2ce1-4be6-9bb5-2040ce676130", "url": "http://www.foxnews.com/transcript/2016/04/22/pressure-growing-on-fbi-to-release-clinton-findings.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 21, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Factor \"Follow-Up\" segment tonight, pressure growing on the FBI to release some of its finding is in the investigation of Hillary Clinton's use of government emails that may have violated national security laws. Question for us this evening, what is really happening right now?</p>                \n                \r\n\n            \n                <p>With us Judge Andrew Napolitano closely following the case. Can you advance the story?</p>                \n                \r\n\n            \n                <p><b>JUDGE ANDREW NAPOLITANO, FOX NEWS SENIOR JUDICIAL ANALYST</b>: Yes. The FBI is at the very end of its investigation. It's in about the second to last phase. It has invited Mrs. Clinton's five closest advisors, former and president, many of them are now with her in her campaign in for interviews, they have hired their same lawyer and they have agreed to go in.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. They haven't gone in yet.</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO: </b>I don't know if they have gone in. But I do know that the invitation was issued about two to two and a half weeks ago. And the FBI gives you a very short window. Like three to five days.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We assume they are all going to be interviewed and then Hillary Clinton herself has to be interviewed. Right?</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO:</b> And she can say yes or no.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But she has already said -- I thought she said she is going to do it. She has already said that --</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO</b>: She has said that many, many times.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO</b>: The foolish things to do legally but she may need to do it politically. At that point their investigation is concluded. Now, if they don't make a recommendation to the Justice Department, they are working in tandem with the Justice Department. Because they don't do anything under - - without being under the supervision of Justice Department prosecutor.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Sure. That's the way the chain goes. Will they have lawyers? Hillary Clinton and her crew when they go in? Will they have lawyers sitting with them?</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO:</b> Absolutely. They can stop it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. They can stop it. They can say, don't answer that.</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO: </b>Correct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All of that. Now, you would assume they have to talk to Hillary Clinton, right? They have to.</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO:</b> Well, she is the subject and the center of the investigation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, she would have to talk to her.</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO: </b>Well, they would like to talk to her.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. Again, we are assuming that her word is good. She will go in. Now, will they announce that they're going do interview her on a certain day? Will everybody know that? Am I going to be able to report that?</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO:</b> No. Unless they leak it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We won't even know. So, they may have already interviewed the five that work for her. We wouldn't know.</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO</b>: That's correct. Unless one of them, somebody leaked it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But Hillary Clinton's campaign will certainly tell everybody that she is going in, I would imagine.</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO</b>: I would think so because she wants to score points with the fact that she has nothing to hide from the FBI.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. Right. Right. Okay. Now, you have been on record in stay saying that she broke the law. You, the judge, have convicted her on television. Are you ashamed?</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO:</b> No. Not at all. The evidence of her guilt is overwhelming.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: To who?</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO</b>: Overwhelming to anybody who observed what she did and knows what the overwhelming --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Then it has to be overwhelming to the bureau then, right?</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO:</b> Absolutely. The bureau would know more about it than what I do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, if what you are say something is right. The evidence against Hillary Clinton is overwhelming. To you, a judge, it has to be overwhelming to the FBI. So, therefore, they have to recommend that Loretta Lynch prosecute.</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO:</b> And then the issue becomes political.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, we don't want to get into that now. We're only concerned about what the FBI says. All right?</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO</b>: The FBI has enough evidence to indict and to convict just on the public record.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And you are 100 percent certain of that?</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO</b>: Absolutely. Without a doubt whatsoever. Whether they will indict is another issue.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We will deal with that once the FBI steps up and tells the folks what they're going to do. But, see, the process here is confusing because there is politics involved. Everybody knows that.</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know, and they could delay it until, what? Next December, could they?</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO: </b>Theoretically they could.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They could.</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO:</b> I don't think they want to. I think that Jim Comey, the director of the FBI --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Do you like him by the way Comey?</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO</b>: Yes, I do. He is a very, very straight shooter. He's very a- political. If he makes a serious recommendation for indictment.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They have to do it.</p>                \n                \r\n\n            \n                <p><b>NAPOLITANO</b>: And the political forces in the Justice Department say no, I wouldn't be surprised if he resigns.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Appreciate it, Judge.</p>                \n                \r\n\n            \n                <p>Now let's go to D.C. where David Tafuri who worked for the State Department also has some thoughts on the FBI's investigation.</p>                \n                \r\n\n            \n                <p>Now, do you think the judge, he says he is 100 percent certain has enough evidence to indict. Do you agree with that?</p>                \n                \r\n\n            \n                <p><b>DAVID TAFURI, FORMER OBAMA CAMPAIGN FOREIGN POLICY ADVISOR:</b> Look, people look at this one of two ways. They are either convinced Hillary is going to be indicted and go to jail or they are convinced this is a complete nonsense that is going to go away. That is a stark contrast to the way the FBI is approaching this which is they are moving very calmly, slowly, methodically to look at all of the evidence. They are looking at only two issues. One is, did Hillary Clinton break the law? And two is, there enough evidence to prove that two-to-a jury?</p>                \n                \r\n\n            \n                <p>Judge Napolitano did not address that fact. And that's very significant. The one question is, did she violate the law by releasing classified information? Ignore all the other stuff about her private server. That may have been bad. That may have been careless. But it wasn't in violation of the law. Now, you have to look at prosecutions of other high level officials and compare them. Look at the prosecution of General Petraeus. It is similar in a lot of ways to what Hillary Clinton did. But it's very different in one way.</p>                \n                \r\n\n            \n                <p>General Petraeus admitted on tape to Paula Broadwell that he knew he was passing along classified information. Hillary Clinton in contrast says, she did not know she was emailing with classified information. Look at the prosecution of Sandy Berger, also different. A very significant aggravating factor. He took classified documents.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He put papers down his pants.</p>                \n                \r\n\n            \n                <p><b>TAFURI:</b> Yes, down his pants.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, that's not even close. But look, do you believe there is a grand jury in place right now?</p>                \n                \r\n\n            \n                <p><b>TAFURI:</b> I don't know.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. You don't know. That's a fair answer. All right. So, if the grand jury is in place if -- and you would assume that the FBI is going to have to get around to doing that. I don't know when they would have already done it. The intent isn't that important to the grand jury. All right? That's for the trial. All right. It's what actually happened. So, the people, the folks on the grand jury, they are going to be presented with this is what happened. Here's the law. And this is what she did. Not what was going on inside her mind. They are not psychologists. So, I think that the intent of this that comes in the main trial, if there ever is one. Now, it's what she did and whether that rises. Last word.</p>                \n                \r\n\n            \n                <p><b>TAFURI</b>: Well, no, intent matters even for if you are going to indict. You have to be able to show that there was intent. She intend to do release classified information. And that's not clear here yet. And we don't know what is the FBI knew but the --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But it may be clear to the FBI based on testimonies that's already been given. That's why I don't want to get into it because we don't know.</p>                \n                \r\n\n            \n                <p><b>TAFURI:</b> Well, the most important thing that's going to happen is the interview of the Hillary Clinton. Everything rides on that. If she can defend her actions and she is not caught.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I don't know. The guy they gave immunity to. If he contradicts what she says, it goes. That was very good.</p>                \n                \r\n\n            \n                <p>Gentlemen, we really appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Pressure growing on FBI to release Clinton findings", "description": "'The O'Reilly Factor' examines the latest in the email server investigation", "date": "2016-04-22T12:37:37Z"}