{"vcmId": "fa6b9dfb-e091-4a16-9bfe-d6c93c4aad7d", "url": "http://www.foxnews.com/transcript/2015/05/08/bill-oreilly-how-emotion-can-damage-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The debate continues to rage over whether an anti-Muslim group was justified in insulting every Muslim on the planet. As you may know two jihadis were killed by a brave police officer in Garland, Texas on Sunday after they tried to storm a conference held by the American Freedom Defense Initiative. The dead men deserved what they got.</p>                \n                \r\n\n            \n                <p>But the incident was ignited by a contest featuring cartoons of the Prophet Mohammed. Any depiction of that Islamic icon is a sin in the Muslim world. Many Americans believe the provocation was legitimate under freedom of speech, but that is not the issue. No one I know favors curtailing speech in this case.</p>                \n                \r\n\n            \n                <p>The real issue is whether the exposition was the right thing to do.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>REV. FRANKLIN GRAHAM, SAMARITANS' PURSE:</b> First of all, you know, as a Christian I don't like it when people mock my lord and savior Jesus Christ. And what this event in Garland was doing was mocking the Muslims. I'm discouraged that people would do this. We live in a society now where there is no civility, there is no respect. We don't honor people who have differences, we only attack each other.</p>                \n                \r\n\n            \n                <p>And so I agree that the folks in Garland, Texas were wrong.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Reverend Graham reflects the Christian point of view that you don't demean other people unnecessarily. Jesus would not have sponsored that event. Now, I have to say my respect for Franklin Graham is growing. I wish the Catholic Church in America had a leader like him.</p>                \n                \r\n\n            \n                <p>But \"Talking Points\" sees the issue from another perspective. The goal of every decent person in the world should be to defeat the jihad. And in order to do that, you have to rally the world to the side of good, our side. Emotional displays like insulting the Prophet Mohammed make it more difficult to rally law-abiding Muslims for example including nations like Jordan and Egypt who are actually fighting the fanatical Islamists. In any war, you have to win hearts and minds and the situation in Garland goes against that.</p>                \n                \r\n\n            \n                <p>Again, the freedom of speech issue is bogus. No one is saying that the exposition was illegal. The point is winning, defeating the jihad. We have a BillOReilly.com poll question that asks: do you support the group American Freedom Defense Initiative mocking the Islamic religion? Yes or no. We hope you vote. And if you do, please consider walking away from emotion.</p>                \n                \r\n\n            \n                <p>This whole emotional deal can be applied to the Republican Party, as well. President Obama achieved power because some Americans decided not to vote, believing the Republican candidates McCain and Romney were not conservative enough. So now we have a nation that has been battered over the past six years.</p>                \n                \r\n\n            \n                <p>It might have happened if the Republicans won. That's certainly possible. But voting or not voting out of emotion never a good idea. The best problem solver should always win. And no candidate is perfect.</p>                \n                \r\n\n            \n                <p>There comes a time when all of us have to make a decision whether we'll do what is best for the country or wallow in shallow emotion -- important decision.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: How emotion can damage America", "description": "Bill O'Reilly's Talking Points 5/7", "date": "2015-05-08T12:20:00Z"}