{"vcmId": "fa79d9e9-1977-46ed-bcb0-1668da33370a", "url": "http://www.foxnews.com/transcript/2015/01/20/beyonce-and-first-family.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 19, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story Segment\" tonight, a new book by our pal Mike Huckabee called \"God, Guns, Grits and Gravy\". The former governor of Arkansas and former Fox News host joins us now. If you put gravy on guns, you jam it though. Gravy and grits and guns, you have to separate the two.</p>                \n                \r\n\n            \n                <p><b>MIKE HUCKABEE, FORMER GOVERNOR OR ARKANSAS: </b>It's not intended to be something you would eat. It's not even a book of Southern recipes and Southern cuisine.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I see.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> It's really the land of God, Guns, Grits and Gravy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I see.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE: </b>People who live out there in the flyover country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I got nervous. Because I didn't want to have anybody to have, you know, gun jam with a grits in it. Okay. One of the controversial things that the liberal press seized upon in your book was exactly what I said, I guess it was six or eight months ago. That the singer Beyonce, a fabulously talented woman. You would agree.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> Incredibly talented.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. Worth about $150 million, doesn't need money. Doesn't need money. Makes a video that is very explicit sexually with her husband Jay-z. For adults I don't care. For everybody to understand that. I don't care. But for children, it's between young girls between the ages of 10 and 14 who are vulnerable and don't know how to really process this. And with the out of wedlock birth rate we have, and teenage pregnancy is actually going down in this country but we have a problem with the traditional family and all of that. So I said, you know, maybe this isn't a good thing. They came after me. You wrote almost the same thing. They came after you. Why did they -- why do they see themselves as the defenders of all things Beyonce?</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> I don't know if it's specifically about Beyonce. Although, they clearly have circle the wagons around her. Absolutely right. But I think it's also this sense that, well, she is an empowered woman. But Bill, I think most of us would say it's not empowering when you become an object, a sex object.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But they can make the argument that it's her husband and herself and that's what they do. But the vehemence and the personal attacks that comes out of this toward me and towards you, that surprised me. I mean, what do you have invested in this Beyonce? Why?</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> I think they like her, they admire her talent, but heck I admire her talent and that's what I've said. She has the best set of pipes out and then he's out there saying though that maybe Mariah Carey. She's got dance move that are incredible. She has got all the talent. Here's the point. She doesn't have to go there to be successful.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. She doesn't have to do it and she can chose to do it.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> She could be a trend setter and an example. Rather than somebody that parents ought to say, honey --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Which is clearly doesn't want to be that.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> No.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The first family are friends with her. I don't know if you end the friendship over a video. I didn't go that far.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> No. You certainly don't, but here's the thing. The President said in an interview with Clamore Magazine that he can't listen to Beyonce with his daughters when they are listening to it and he says that they are listening to it because it would embarrass him. Well, the point is, Bill, if something is embarrassing to listen to with your daughter, maybe your daughter shouldn't be listening to it if it's embarrassing to you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's a complicated age if which we live to. Kids with this internet stuff, they know everything. I believe that the press doesn't want judgments made about any behavior except behavior from people they don't like then they, of course. But because a guy like you and me would say, look, this kind of behavior put in front of impressionable children is wrong, they don't want that.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> Well, that's the essence of the message. Is that there is a cultural disconnect between people who live in these bubbles of influence in fashion, finance, music, entertainment, government and politics, New York, Washington, Hollywood. Take those three bubbles and compare it to what I call the bubbleville versus the bubbaville out there in the middle of America, the people you speak to every night --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Big gulf.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE: </b>There's a big gulf.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They have power these people in New York and Hollywood.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> Incredible power. They set the cultural table for all of America, but you know what, Bill, they don't understand the people in bubbaville. We understand the people in bubbleville, you know, why? Because every television show and movie is about the people in the bubbles of New York, Washington and Hollywood. But the people in the bubbles, they don't understand. Why do people go to church? Why do people own guns?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They just look down upon us.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE: </b>And try to order into a Manhattan Restaurant, you can't do it. You can't do it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. \"God, Guns, Grits and Gravy\" separated, not all together.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE: </b>Not together.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right? The governor's book, check it out. Thanks for coming in, Mike.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE: </b>Good to be here. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Beyoncé and the First Family", "description": "Former Arkansas governor Mike Huckabee on his comments about the first family and his new book", "date": "2015-01-20T13:23:03Z"}