{"vcmId": "fad95a38-f3da-4a98-b987-307fed3ea961", "url": "http://www.foxnews.com/transcript/2015/02/02/truth-about-jobs-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 30, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Unresolved Problems\" segment tonight. What is the real story about jobs in America? President Obama says the economy is back. Jobs are being created. But data published by the Bureau of Labor Statistics says that all, all the net gain jobs since 2007, eight years ago have gone to immigrants. All of them. Also, that employment for Americans born here has not returned to precession levels.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington with the facts. Dr. Steven Camarota of the Center for Immigration Studies. What is the headline of the government's own stats?</p>                \n                \r\n\n            \n                <p><b>STEVEN CAMAROTA, PH.D., DIRECTOR OF RESEARCH AT THE CENTER FOR IMMIGRATION STUDIES: </b>Well, they are about two million more immigrants working now than there was in 2000. There is about 1.5 million fewer native born people working. So what job growth there has been has all gone to the foreign born.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Why have a 1.5 million Americans left the marketplace?</p>                \n                \r\n\n            \n                <p><b>CAMAROTA: </b>Well, some of them are unemployed. That is some of them are looking but haven't found. And then there is this huge massive growth, several hundred thousand just in the last few months of people who have just given up. They don't look for jobs and they don't have one. That's called being not in the labor force. And that really hasn't been improving. So, we have seen a decline in the number of people who are actively looking who say hey I looked in the last four weeks. That's the unemployment number. But the number completely out of labor force, that really hasn't been improving. And what we see is that what job growth there has been has mostly or entirely in the long term gone to immigrants both legal and illegal.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Let's break that down now. The government doesn't do illegal aliens take this many jobs, illegal people with green cards take this many. They just lump them both together, right?</p>                \n                \r\n\n            \n                <p><b>CAMAROTA:</b> That's right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right.</p>                \n                \r\n\n            \n                <p><b>CAMAROTA:</b> But we do have some idea who the illegals are in this data.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. I will get to that. So you say that two million more immigrants are working now in America than they were in the year 2000. About two million immigrants to the labor force. Laura Ingraham contends that they have taken jobs away from the American born worker. Is that true?</p>                \n                \r\n\n            \n                <p><b>CAMAROTA:</b> There is certainly some evidence for that. What we have is a kind of contentious debate on that question. What we can say is the immigrants are gaining jobs throughout the labor market. At the high end, engineers, software people in the middle sort of an office manager or healthcare support and at the bottom, you know, janitors, maids, busboys. So, the immigrants are making gains across the labor market.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is it the illegal aliens at the bottom? And then the aliens who get the green card because of their expertise at the top. Is that how it breaks down?</p>                \n                \r\n\n            \n                <p><b>CAMAROTA:</b> Well, remember, most people get green cards because they have a family member here. And that's a very middle skilled group. Probably one in five. One in four hasn't graduated high school. Maybe one in three has a college degree. Of those kinds of people. So, the legal immigrant population is very diverse in its education levels as well. The people get it for skills is a small fraction of new legal immigrants. Though it's not trivial. But the point here is the legal immigrants who have this, you know, distribution across all the education groups. They are getting jobs and it looks like the illegals are mainly at the bottom are getting jobs too. And unfortunately the fraction of native born Americans holding a job shows actually almost a 14-year uninterrupted decline.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And my last question is that the wages for all Americans in the marketplace have gone down substantially during the Obama administration. Is that have anything to do with the immigrant labor force?</p>                \n                \r\n\n            \n                <p><b>CAMAROTA:</b> I think it's very fair to say that we are adding so many workers beyond the absorption capacity of the U.S. labor market that yes, it is exerting a downward pressure on the wages for a good chunk of the workforce. And the question is why is Congress actually considering increasing immigration? Both skilled and unskilled? Remember, the bill they passed last year in the Senate would have doubled legal immigration in addition to legalizing illegal immigrants.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, Doctor. Very interesting. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The truth about jobs in America", "description": "New data shows all net gain jobs since 2007 have gone to immigrants", "date": "2015-02-02T13:30:06Z"}