{"vcmId": "fb8720b3-a349-4f63-b68d-bdf3b5965565", "url": "http://www.foxnews.com/transcript/2015/09/29/will-hillary-clinton-email-scandal-derail-her-campaign.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" September 28, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Factor Follow Up Segment\" tonight, with all the Pope coverage and Republican politics all over the place, the Hillary Clinton e- mail story is tough to define at this point.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BILL CLINTON, FORMER PRESIDENT OF THE UNITED STATES</b>: You know, at the beginning of the year she was the most admired person in public life and she earned it. Why? Because she was being covered by people who reported on what she was doing.</p>                \n                \r\n\n            \n                <p>What happened? The Presidential campaign happened. And the nature of the coverage shifted from issue-based to political.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The former president saying his wife is getting hammered unfairly because of politics.</p>                \n                \r\n\n            \n                <p>With us now Amie Parnes, senior White House correspondent \"The Hill\" newspaper.</p>                \n                \r\n\n            \n                <p>Now, I don't really understand what the heck is going on. And I'm getting paid to understand it.</p>                \n                \r\n\n            \n                <p><b>AMIE PARNES, \"THE HILL\"</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I have got to be honest with everybody. Every day it's she forgot this, she didn't do that -- you know. Is there anything that has happened in the last week that the folks should know about that's damning?</p>                \n                \r\n\n            \n                <p><b>PARNES</b>: I think the fact is that the story is alive and well. It's not going away. And that's scary, too. The Clinton camp, you know, they want the story to go away. They want to pivot to other issues, to policy issues but they can't because on Friday, for instance, we discovered that two months of e-mails are suddenly missing. And you know it's confusing it to me as it is to you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Is it really you?</p>                \n                \r\n\n            \n                <p><b>PARNES</b>: It is.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Because you wrote a book on her. So I understand that the FBI found e-mails between Secretary of Clinton and General Petraeus who at the time was running the operations in Afghanistan and Iraq. Is that right?</p>                \n                \r\n\n            \n                <p><b>PARNES:</b> Yes. And she actually -- I reveal in our book, actually I co-authored it with someone. We revealed that she had invited General Petraeus over for wine. She was trying to court him at the time and I think that was part it. You know, we don't know exactly what were --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So that would be a private e-mail that she destroyed or didn't hand over. If she was inviting him over for wine --</p>                \n                \r\n\n            \n                <p><b>PARNES</b>: Well, I think it's work. It's considered work.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So do I. But this is the problem with this story. I agree with you 100 percent -- e-mail Hillary together again never going to break up.</p>                \n                \r\n\n            \n                <p><b>PARNES</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Republicans are going to keep it going. But, fair-minded people want to know, did she do anything wrong? Did she lie directly to the American people?</p>                \n                \r\n\n            \n                <p><b>PARNES</b>: And that's the problem because --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Do you believe she did?</p>                \n                \r\n\n            \n                <p><b>PARNES</b>: You know -- people even strategists, Democratic strategists, donors I talk to all the time say this is a problem for us. I talk to people last week. I did a story where I interviewed bundlers. They are concerned about this. They think we don't know when the other shoe is going to drop.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. So they're thinking the FBI may find e-mails that are embarrassing to Hillary Clinton that she tried to delete. That's the bottom line, right?</p>                \n                \r\n\n            \n                <p><b>PARNES</b>: And classified e-mails.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok. But that's not as big. You know, classified is big. But not as big as you screwed up on Benghazi, bang, I'm erasing it.</p>                \n                \r\n\n            \n                <p><b>PARNES</b>: Well, that, too.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. Now, the FBI, as I predicted accurately, can reconstitute pretty much everything she erased. Is that what you are hearing?</p>                \n                \r\n\n            \n                <p><b>PARNES</b>: Yes. They found everything. And so I think that's why we have this drip, drip, drip as she called it this weekend and as everyone is calling it because more and more e-mails keep surfacing and it's going to keep the story alive.</p>                \n                \r\n\n            \n                <p>The thing that's also going to keep it alive is that she is testifying on Capitol Hill on October 22nd.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>PARNES</b>: So the story isn't --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You know what she's going to say. Look, the Clintons believe and they believe this and they took a lie detector test that they passed. This is all political witch-hunt. She didn't do anything wrong. She was overwhelmed. Da-da-da-da-da, how can I remember. Don't you agree?</p>                \n                \r\n\n            \n                <p><b>PARNES:</b> But you know what's bad for them is that this trust narrative. It's not about the e-mails. It's about the past and how all this baggage keeps coming up again and again and again and people don't believe. I talked to donors who don't believe.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So you are getting the feeling from big Democratic donors they want Biden to come in?</p>                \n                \r\n\n            \n                <p><b>PARNES</b>: They want some opening. They just don't know what is going to happen with the Clinton camp.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But there is only one option -- Biden.</p>                \n                \r\n\n            \n                <p><b>PARNES</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Bernie Sanders is never going to get elected president of the United States.</p>                \n                \r\n\n            \n                <p><b>PARNES</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They have to know that.</p>                \n                \r\n\n            \n                <p><b>PARNES</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Bernie is having a lot of laughs out there on the trail and people are paying attention to him for the first time in his life.</p>                \n                \r\n\n            \n                <p><b>PARNES:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But the only other option is Joe Biden.</p>                \n                \r\n\n            \n                <p><b>PARNES: </b>Right. And the vice president takes votes away from her. That's scary to some people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So they want her -- him to come in. Do they want -- these donors, these fat cats? They want him?</p>                \n                \r\n\n            \n                <p>They want to be listened to. I feel like a lot of people I talk to are being ignored by the Clinton campaign.</p>                \n                \r\n\n            \n                <p><b>PARNES:</b> They want to be listened to and I feel like a lot of people that I talk feel like they're being ignored by the Clinton campaign.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Amy, thanks for coming.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Will the Hillary Clinton email scandal derail her campaign?", "description": "'The O'Reilly Factor' examines the latest in the controversy surrounding the former Secretary of State and presidential hopeful", "date": "2015-09-29T12:24:11Z"}