{"vcmId": "fbafd0b7-8cca-4097-8128-8b2daaee38c4", "url": "http://www.foxnews.com/transcript/2015/12/09/bill-oreilly-donald-trump-shaking-up-politics-once-again.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Last night in South Carolina, Mr. Trump called for a total ban of Muslims entering the U.S.A. He believes most Americans would support that prohibition and says we have to do it to protect ourselves against the jihad.</p>                \n                \r\n\n            \n                <p>Almost immediately hysteria broke out.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CARLY FIORINA (R), PRESIDENTIAL CANDIDATE:</b> I think Donald Trump's over reaction is as dangerous as President Obama's under reaction.</p>                \n                \r\n\n            \n                <p><b>SEN. LINDSEY GRAHAM (R-SC), PRESIDENTIAL CANDIDATE:</b> He is a race baiting, xenophobic, religious bigot. And you know how you make America great again? Tell Donald Trump to go to hell.</p>                \n                \r\n\n            \n                <p><b>WHOOPIE GOLDBERG, TV HOST</b>: Where has the GOP been? I mean this started with him saying Mexicans were rapists and murderers. Where the hell has everybody been?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, let's examine this without emotion or agenda. Ok -- both can cloud thinking.</p>                \n                \r\n\n            \n                <p>The federal courts would never, never allow the government to deny anyone entry solely on the basis of religion so the whole discussion is really moot. Good night, everyone.</p>                \n                \r\n\n            \n                <p>As with revoking the citizenship of so-called anchor babies, a ban on Muslims traveling to the U.S.A. will never happen. However, however -- the feds do have an obligation to deny visas to anyone who might cause harm to the country. Thus, people living in countries where jihad and terrorism are rife can and should be scrutinized with the burden of proof being put upon those who want to come here.</p>                \n                \r\n\n            \n                <p>Homeland security should deny visas to any questionable person -- period. But a complete ban of Muslims would actually hurt the war on terror.</p>                \n                \r\n\n            \n                <p>Here's the crux of the matter, which I will discuss with Mr. Trump here tomorrow on The Factor. The U.S. and other western nations need moderate Muslim countries to fight the jihadists. The West can't defeat the jihad without the help of Jordan, Egypt, to some extent Pakistan, Saudi Arabia and the rest of the Gulf States. We need them to cooperate with us militarily and with intel.</p>                \n                \r\n\n            \n                <p>By saying all Muslims can't come to the U.S.A. that means that King of Jordan can't come. So, it is simply bad anti-terror policy to overreact and prohibit Muslims even if you could, which you can't.</p>                \n                \r\n\n            \n                <p>It is long past time for Americans to see the jihad for what it is -- a movement that seeks to destroy western civilization. Someone tell President Obama.</p>                \n                \r\n\n            \n                <p>But the majority of Muslims do not support jihad and some will actually fight against it. Those people should be applauded, not demonized.</p>                \n                \r\n\n            \n                <p>But and here is where Donald Trump is correct. The Obama administration is losing the fight against ISIS as \"Talking Points\" clearly said last night. Political correctness and weakness, rank weakness, now dominate Washington. Many of our politicians are afraid to confront evil. I'm talking to you, Democratic Party.</p>                \n                \r\n\n            \n                <p>We, the people, must rise up and demand to be protected. Demand that the war be waged against the jihad in a smart and aggressive way.</p>                \n                \r\n\n            \n                <p>With the Presidential election next year, it is now on us to elect a new leader who has the guts and the intelligence to fight Islamic terrorism and defeat it. Believe me, this is 1938 all over again.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Donald Trump shaking up politics once again", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 12/8", "date": "2015-12-09T13:08:43Z"}