{"vcmId": "fcf8cf05-c9da-4105-b00b-be8b9ff4d0a5", "url": "http://www.foxnews.com/transcript/2016/06/17/bill-oreilly-why-presidential-campaign-is-so-difficult-to-cover.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The latest polling has Donald Trump's unfavorable number at about 70%.</p>                \n                \r\n\n            \n                <p>Hillary Clinton clocks in at just under 60 percent unfavorable.</p>                \n                \r\n\n            \n                <p>That's why I believe we may have a low voter turnout in November.</p>                \n                \r\n\n            \n                <p>In the meantime, I have to cover this race &#160;in the fairest way possible.</p>                \n                \r\n\n            \n                <p>That means: no cheap shots, no gotcha stuff, no personal attacks on either candidate.</p>                \n                \r\n\n            \n                <p>But it also means skepticism about what Trump and Clinton say and do, and challenges to their positions.</p>                \n                \r\n\n            \n                <p>But with so many Americans not liking the candidates, the concept of fair-play is hard to pull off.</p>                \n                \r\n\n            \n                <p>The left wants to demonize Trump, and if you don't do that, you are in the tank for him ... and a very bad person.</p>                \n                \r\n\n            \n                <p>The right wants to hammer Secretary Clinton on everything, and if you don't do that, you are selling out ... and a very bad person.</p>                \n                \r\n\n            \n                <p>Also: if you don't openly root for a candidate, you become suspect in the eyes of their followers.<br> This year ... it is very personal.</p>                \n                \r\n\n            \n                <p>Today on Good Morning America, George Stephanopolous asked me about some Republicans who will not support Trump.</p>                \n                \r\n\n            \n                <p>That's a standard question from the national media.</p>                \n                \r\n\n            \n                <p>I said it was style,, not substance, that is fueling GOP dissent.</p>                \n                \r\n\n            \n                <p>It is the way Donald Trump bluntly states his case that has alienated many.</p>                \n                \r\n\n            \n                <p>But if you want to tell the truth, and I do, the no-prisoners approach is why Trump is the nominee. &#160;He has rallied voters who are fed up with politics as usual.</p>                \n                \r\n\n            \n                <p>Now, is that analysis fair?</p>                \n                \r\n\n            \n                <p>Of course it is.</p>                \n                \r\n\n            \n                <p>But many will condemn me because I did not condemn Trump.</p>                \n                \r\n\n            \n                <p>Same thing with Hillary Clinton and President Obama.</p>                \n                \r\n\n            \n                <p>If you don't despise everything they do, then you are misguided.</p>                \n                \r\n\n            \n                <p>And if you do criticize them, then you are a conservative zealot.</p>                \n                \r\n\n            \n                <p>Right now politics in the USA ... is dysfunctional.</p>                \n                \r\n\n            \n                <p>Here's a big headline today ... shortly after the Orlando terror attack ... Mr. Obama said this:</p>                \n                \r\n\n            \n                <p><b>PRESIDENT BARACK OBAMA</b>: Since I last updated the American people on our campaign two months ago, we&#8217;ve seen that this continues to be a difficult fight -- but we are making significant progress.<br> ((EDIT)) &#160;This campaign at this stage is firing on all cylinders.</p>                \n                \r\n\n            \n                <p>But a funny thing happened on the way to the terror war battlefield.</p>                \n                \r\n\n            \n                <p>Today, just two days after Mr. Obama's optimistic statement, the director of the CIA said this:</p>                \n                \r\n\n            \n                <p><b>JOHN BRENNAN, CIA DIRECTOR:</b> Unfortunately, despite all our progress against ISIL on the battlefield and in the financial realm, our efforts have not reduced the group's terrorism capability and global reach. The resources needed for terrorism are very modest, and the group would have to suffer even heavier losses on territory, manpower and money for its terrorist capacity to decline significantly.</p>                \n                \r\n\n            \n                <p>Mr. Brennan is absolutely correct in his assessment ... Mr. Obama is far too short-sighted on ISIS.</p>                \n                \r\n\n            \n                <p>Again ... that is the truth, but the truth will not be accepted by Obama devotees.</p>                \n                \r\n\n            \n                <p>Same thing with Hillary.</p>                \n                \r\n\n            \n                <p>Same thing with Trump.</p>                \n                \r\n\n            \n                <p>Prove all of them wrong, and they are at times, and you will be attacked as a false messenger.<br> Summing up ... no longer does the truth set us free.</p>                \n                \r\n\n            \n                <p>In the current political climate ... truth gets you hammered.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Why the Presidential Campaign is so Difficult to Cover", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 6/16", "date": "2016-06-17T12:23:21Z"}