{"vcmId": "fe694d0a-fe3e-4e7a-aca1-60f01cb05ce6", "url": "http://www.foxnews.com/transcript/2017/01/26/movement-growing-to-de-legitimize-trump-presidency.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 25, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Impact Segment\" tonight, giving President Trump a fair hearing. As you know, some on the left are not doing that, claiming his presidency is illegitimate.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington, Jonathan Turley teaches Constitutional Law at George Washington University. So, you have been critical of the delegitimizers. Why?</p>                \n                \r\n\n            \n                <p><b>JONATHAN TURLEY, PROFESSOR, GEORGE WASHINGTON UNIVERSITY:</b> Well, I think that there is an effort, a concerted effort to create political mythology to suggest that President Trump is some type of pretender in office. And I think that is a dangerous thing. You know, my house was filled with friends and family that came to protest the inauguration and I didn't join them, nor did my kids.</p>                \n                \r\n\n            \n                <p>Because I've taught them that, you know, the Fourth of July is an important holiday but it was basically a declaration to a foreign leader. The inauguration day is far more important. That is where we keep a promise to each other. That even when we are divisive, even when we are hateful in elections, we come together on that day, every four years, and reaffirm what is really a leap of faith under our system. And to see all of those members of Congress boycotting this inauguration, I thought was shameful.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What do you think is driving -- I've named it now, the Trump derangement syndrome, what is driving that?</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>TURLEY:</b> Well, I think part of it is that there are a lot of folks in this town that want to redirect a lot of this anger. You know, the democrats helped Barack bring about the selection is much as Donald Trump did. You know, they didn't look at polls that said that people wanted an antiestablishment figure. They didn't look at polls showing that Hillary Clinton had record negatives. They pushed through her like she was the anointed candidate for the Democratic Party. They steamrolled Sanders. The results should not surprise many people.</p>                \n                \r\n\n            \n                <p>But there are a lot of folks that want to suggest, look, it wasn't us. It wasn't our message, it wasn't our choices. Much of that same leadership is still in place. And instead, they want to suggest that somehow he stole the election or that Putin gave him the office, which is of course ridiculous.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. But those are all devices to generate a real hatred of Donald Trump. So, he evokes his powerful support for his people who love him, okay, but also, this hatred for people who loathe him. And I am wondering, what drives the loathing? Is at any one thing? Is that his personality? Is it a stance on an issue? What do you think it is?</p>                \n                \r\n\n            \n                <p><b>TURLEY: </b>No. I think that is what is so dangerous about this. Is that there is this disconnect from reality, as people create this mythology of just total hate. You know, I had one relative at my house who was talking about Trump supporters very negative comments. I said, you know, there are very nice Trump supporters. You know, about 47 percent of people who voted for him. So, you do realize that there are lots of nice Trump supporters. And she wouldn't accept that. And I think that is part of this mythology.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Why wouldn't she accept that? You are a logical man. She wouldn't accept that 47 percent of the voting public isn't evil? She wouldn't accept that? That's irrational.</p>                \n                \r\n\n            \n                <p><b>TURLEY</b>: I think that there is this rhetoric that is pushing everyone to extremes on both sides. And it is dangerous for a government like ours. We have to get along at some point. We have problems to solve. And sometimes, when you have a big change, like the Trump administration, it can bring positive things. You can re-look at issues. And if Trump is willing to work with Congress, we can come up with some innovative solutions.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, if he is successful, that is going to make the haters hate them even more. You know that. I don't think you will ever going to win over a certain segment of the population. What could Trump do himself, from your vantage point, to try to assuage some of this anger toward him? Is there anything that he could do?</p>                \n                \r\n\n            \n                <p><b>TURLEY</b>: Well, in some ways, he benefits. I always tell my wife, the success of our marriage is due to the fact that I lowered her expectation so much that I surpass them every day. Trump may have that advantage. The expectations are so low. If he does anything but a nuclear strike in the first three weeks, the latter predictions are going to be wrong. I think that he could to show that it is possible to come up with new ideas. I thought it was interesting when he talked about inner cities and said, you know, I know that these are Democratic strongholds. But it hasn't really worked out that way.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No, it hasn't. If he sends the troops into Chicago, by the troops, I mean federal agents and federal attorneys, that might go a long way in showing people that he does care about it.</p>                \n                \r\n\n            \n                <p><b>TURLEY:</b> Well, also, I think that he needs to look at more innovative solutions.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>TURLEY</b>: A new ways of looking at those problems.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, he is certainly taking a lot of action. I don't how innovative it is. But it is certainly definite. Professor, we appreciate your point of view. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Movement growing to de-legitimize the Trump presidency", "description": "'The O'Reilly Factor' examines one Democrat calling for cooperation with President Trump", "date": "2017-01-26T13:13:33Z"}