{"vcmId": "fed33740-d761-4ca2-b395-b88d84b36214", "url": "http://www.foxnews.com/transcript/2016/03/15/ohio-impact-on-gop-race.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 14, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Thanks for staying with us. I'm Bill O'Reilly in the Hume Zone segment tonight, there are a bunch of new polls out. We are not going it give them to you because the polling has been very shaky lately. Tomorrow there are votes in Florida, Ohio, Illinois, Missouri, and North Carolina. Donald Trump wins Florida and Ohio, he has got it, it's over. But what happens if he loses Ohio to John Kasich?</p>                \n                \r\n\n            \n                <p>With us now here in New York City warming up for tomorrow's election coverage Brit Hume. Yes, so that's what everybody -- it looks Florida is going to go to Trump. You agree with that right?</p>                \n                \r\n\n            \n                <p><b>BRIT HUME, FOX NEWS SENIOR POLITICAL ANALYST</b>: That's -- there is not a single poll that shows.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>There is not anything -- although you got to give it to Rubio. He has running going door to door -- I think he's visited every home.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> You know, we had that result in Michigan last week on the Democratic side.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And that's what he is hoping for.</p>                \n                \r\n\n            \n                <p><b>HUME</b>: You're thinking somebody who is 20 points down could win.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. But I know Florida pretty well. I just can't see Trump losing there. But in Ohio, the FOX News poll has Kasich ahead. And another couple polls do as well. So, let's assume that Trump doesn't win Ohio. And then Illinois doesn't do that well either. Which is possible. Then what happens?</p>                \n                \r\n\n            \n                <p><b>HUME: </b>Well, you have got to think about the other states and how well he might do in those.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: North Carolina he will do well.</p>                \n                \r\n\n            \n                <p><b>HUME</b>: Yes, I think so. But North Carolina is professional.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>HUME</b>: So the delegates will be scattered all over the place. And he may win the most but it won't be that big of deal. The big ones is Florida. Of course, that's 99 delegates. Ohio only has 66. So, if he wins one -- if he wins one -- Florida, not the other, he is still 33 delegates to the good against the field.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>HUME: </b>And, of course, you know, you have got to figure the others will get something in North Carolina. But, Illinois and --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Missouri.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> Missouri come out, that's 121 delegates there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's not winner-take-all.</p>                \n                \r\n\n            \n                <p><b>HUME: </b>Well, no, it was complicated.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's complicated.</p>                \n                \r\n\n            \n                <p><b>HUME</b>: But it's basically winner-take-all.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Oh, it is.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> If he does really well in those two states -- delegates. So, what happens, Bill, as we go forward here and Trump continues to gain delegates on his competitors, what happens is that they then have to -- in order for him not to win, they have to get an ever larger share of the remaining delegates.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right.</p>                \n                \r\n\n            \n                <p><b>HUME</b>: So the odds lengthen against them. That does not mean, however, that by the time he gets to the convention, you know, he will have the 1237 necessary.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. So, you figure Rubio is gone then if he loses Florida, he's down, he's down. OK? Kasich, if he loses Ohio is gone.</p>                \n                \r\n\n            \n                <p><b>HUME</b>: I would agree.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. But if he wins he stays.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> Well, he survives.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But he not going to drop out.</p>                \n                \r\n\n            \n                <p><b>HUME</b>: No, I would think he would continue to go on.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>HUME</b>: But remember, he will claim momentum. But remember, he is winning his home state where he is very popular.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I know. I know.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> I mean, let me say something, if he is a serious candidate, he should win his state. And he should win it easily.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But even if he wins his state, he is still going to be way behind in delegates with no chance of getting enough delegates to win the nomination.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> Outright.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So you have got to keep your eye on how many Cruz picks up although he is not favored to win any of the states.</p>                \n                \r\n\n            \n                <p><b>HUME</b>: Right. That's true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But he could do all right. So, at this point though, the Republican Party, they are trying to hope for Rubio, magically winning Florida. That's, I guess, the hope.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> What they're hoping for now, I think is, the one way or another, Donald Trump can be prevented from carrying -- having enough delegates to win it outright.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> And then it goes to the convention and has to be settled there and then they have to figure out then what to do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> If he comes in with real big delegate lead --</p>                \n                \r\n\n            \n                <p><b>HUME</b>: Well, this is the problem.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> Let's assume just for the sake of discussion, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> That he falls short but he has still got the lion's share of the delegates.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> So, that means the convention hall will have a large plurality of Trump supporters. And the rest of the Republican Party gets together and gives it to somebody else, probably one of the candidates now running, possibly Cruz. How are the Trump delegates going to react to that?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Not well.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> How are the people who have been voting for him all along going to react to that in the fall?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Not well.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> There is no, you look at this. In any way you can --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right.</p>                \n                \r\n\n            \n                <p><b>HUME</b>: You cannot think of a way this turns out well for the Republicans unless of course Trump wins and wins everybody over between now and then and learns all the issues and does all the things we haven't seen him do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. Yes. He's got to win 65 million of votes to get the presidency.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> And he have to do the fancy dancing, to change in that, to satisfy a lot of Republicans to oppose it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Brit Hume everyone</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Ohio's impact on the GOP race", "description": "Brit Hume discusses presidential politics on 'The O'Reilly Factor'", "date": "2016-03-15T19:47:19Z"}