{"vcmId": "fff6eacb-b301-4df8-88c7-7c7802d2e29b", "url": "http://www.foxnews.com/transcript/2016/05/09/bill-oreilly-presidential-campaign-already-crazy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Yesterday was Cinco de Mayo. Donald Trump tweeted out a picture of himself eating tacos. Above the picture he said he loves Hispanics. Almost immediately the president of the militant organization La Raza tweeted out, quote, \"Eating a taco or wearing a sombrero doesn't cut it with your community. In 2016, Trump is clueless, offensive and self-promoting.\"</p>                \n                \r\n\n            \n                <p>So, eating a taco on Cinco de Mayo is now offensive? It's like saying eating corned beef and cabbage on St. Patrick's Day and saying you love the Irish is offensive. That is how insane America culture has become.</p>                \n                \r\n\n            \n                <p>On a more serious note, Hillary Clinton had to be shocked when some Hispanics demonstrators in Southern California protested against her.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE</b>: Other organizations joined together for the protest. They say Clinton has not supported at $15 national minimum wage and has been part of anti-immigration policies including and not limited to deporting undocumented children.</p>                \n                \r\n\n            \n                <p>They tell us that in other countries, Clinton would be considered, quote, \"right wing.\"</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Again, absolutely insane. Hillary Clinton certainly has no bias against Hispano-Americans. Come on.</p>                \n                \r\n\n            \n                <p>And then there is the political fallout from the Trump victory. Former presidents Bush the elder, Bush the younger, presidential candidate Mitt Romney, current Speaker of the House, Paul Ryan, all will not endorse Donald Trump at least at this point. In response, Trump said this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I learned yesterday a couple people, they don't want to endorse me. I say it doesn't matter. It makes no difference. I didn't have huge support in the primary and I blew everyone away.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, on the other side, Bernie Sanders, who has absolutely no shot to defeat Hillary Clinton, will not pull out of the race as Ted Cruz and John Kasich did.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Do we have your word in this interview that you're not going to drop out before the Democratic convention?</p>                \n                \r\n\n            \n                <p><b>SEN. BERNIE SANDERS (D-VT), PRESIDENTIAL CANDIDATE:</b> Absolutely. We have made that commitment. I'm going to be in it until the last vote is cast.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, Senator Sanders certainly has that right, but what's the point? He has made his essential point over and over and over and over. Wall Street's rigged, billionaires control everything. Nevertheless, Bernie soldiers on. The Clinton campaign cannot be pleased. Finally, President Obama injected himself into the campaign this afternoon taking shots at Donald Trump. Bowling and Rivera will analyze that later on.</p>                \n                \r\n\n            \n                <p>So it is, indeed, political madness in the USA, and believe me, it's going to get a lot worse. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Presidential campaign already crazy", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 5/6", "date": "2016-05-09T12:14:01Z"}