{"vcmId": "13d5b362-4641-42cb-8bd8-c62847457d9d", "url": "http://www.foxnews.com/transcript/2016/06/21/donald-trump-on-latest-presidential-polling.html", "title": "Donald Trump on the latest presidential polling", "description": "Presumptive Republican nominee weighs in on the state of his campaign on 'The O'Reilly Factor'", "date": "2016-06-21T12:09:01Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" June 20, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nO'REILLY: And in the \"Impact\" segment tonight, polling all over the place between Donald Trump and Hillary Clinton. New Monmouth poll out today as Secretary Clinton up by seven points. But this goes day to day up and down.\nJoining us now from inside headquarters, here in in New York City is Donald Trump. So, where do you think you are in the race? I don't think if you guys are doing internal polling yet. But do you think you are ahead, behind, tied? Where are you?\nDONALD TRUMP (R), PRESUMPTIVE PRESIDENTIAL NOMINEE: I think it's very close. I think that probably one poll came out. I'm pretty much even. I just tonight know. It's very early to have polling. I think we haven't even gotten started yet. You know, I'm just literally just starting. And I view the convention as probably a real starting point. But I think it's pretty even from what I'm seeing.\nO'REILLY: Okay. Now, you are taking some incoming from the insinuation that Barack Obama may be sympathetic to Muslim terrorists. We talked about this a little recently on this program. I don't think you believe that he is a quisling. That is he someone who wants Islamic terrorism to prosper. You don't believe that do you?\nTRUMP: I don't believe it. I do say though when I see a deal like was made with Iran, this horrible, horrible deal where we are giving them back $150 billion. To the best of my knowledge and I will tell you what, I've studied that thing pretty closely. We're getting almost nothing out of it. They will going to end up with nuclear weapons and lots of other things, whatever they want. And then I see the way he treats Israel.\nI say wow, what's the -- there seems to be a double standard. I'm not happy about it. A lot of other people aren't happy about it. I can tell you the people in Israel are not happy about it. So, I look at things and I see what's going on. I'm a common sense person. And I don't like it. I don't like it. I don't like it one bit.\nO'REILLY: Well, the Iranian deal is geopolitics. And he believes that he is going to keep Iran from getting the nuclear device but we will see down the road.\nTRUMP: It's not going to happen.\nO'REILLY: But your insinuation after Orlando is a little bit more personal than that. I remember the background because you are a birther guy, you didn't believe or you questioned his birth certificate where he was born. And now you are saying in so many words and I don't want to put words in your mouth so you can clarify that look, there is something more here than just President Obama seeing the world in a non-confrontational way. There might be a personal agent here. Is that on your mind?\nTRUMP: Well, it bothers me when is he afraid or doesn't want to mention the words radical Islamic terrorism when, obviously --\nO'REILLY: But he says it doesn't do any good to do that. It doesn't influence his policy.\nTRUMP: I disagree with him. And then they, you know, they redact a lot of the different statements made by this thug, this horrible guy that killed all those people. And, you know, it's a disgraceful thing. So, I disagree. You know, if you have a problem you have to be able to speak openly about the problem. This is a real problem. This is worldwide.\nO'REILLY: Sure. Sure. And that's the difference between you and not only President Obama but Hillary Clinton who's, you know, you brought her a little bit more. But you are kind of dodging my question and you don't usually do that. You believe there is a personal component inside the President's personality that sympathizes with the Muslim world and doesn't want to take the Muslim world with terrorism? Is that what it's about?\nTRUMP: I don't believe anything. I see things and whether it's the Iran deal, whether it's not wanting to mention the words radical Islam or radical Islamic terrorism or other things, Bill. You look at what's going on. I mean, it's not a question of what I think. But you look at facts. This isn't -- this isn't thinking. This is facts.\nO'REILLY: I know but you got a motive.\nTRUMP: And I really believe this. Bill, I really believe it. No, I have no motive.\nO'REILLY: Not your motive, I'm talking about his motive.\nTRUMP: If he were a great, let me tell you something. If he were a great president, a great, great president, and you know that's not going to happen. I would be so thrilled if our real employment was at five percent or four percent or three percent. I would be so thrilled. But it's not. Our country is in a horrible position in so many ways whether it's manufacturing, which is just -- our companies are fleeing our country with jobs. You look at what's going on with this country. It's really sad.\nO'REILLY: All right. All right. Then you have what happened.\nTRUMP: Wait, Bill. I look at what he does and I look at what he says. And I look at what he doesn't say. Why isn't he willing -- how do you solve a problem if you are unwilling to discuss it or unwilling to name it. And now she is all of the sudden, wait a minute, Bill.\nO'REILLY: All right. He says -- he'll drop the drones on them. He'll do what he has to do. But okay. Motive is always hard.\nTRUMP: You are always complaining. Hey, Bill, Bill, Bill, one second, you are always complaining, he is not strong enough. He is not going --\nO'REILLY: Yes. That's my opinion.\nTRUMP: A problem which is always getting worse.\nO'REILLY: That's my opinion.\nTRUMP: Drones are one thing but drones are not going to solve the problem.\nO'REILLY: And I agree with that. I have been very tough on him as you have in this arena.\nTRUMP: Yes. Well, a lot of other people agree with us.\nO'REILLY: And I may have a report coming up Thursday that might shed a little light on this but we're still working it. Now, you and gun control, right? All right. Let's run down the list. They have got to tighten up the terror watch vis-a-vis buying gun list, right? That's got to happen, right?\nTRUMP: Yes, sure. Absolutely.\nO'REILLY: Okay. All right.\nTRUMP: Who would not agree with that?\nO'REILLY: And I think the NRA would agree with it, too. But we have to have a very precise thing about, if you are on a terror watch list, this is what you can and can't do. What about the big guns? All right? You know, do people need big rifles that fire a lot of rounds? Do they need them?\nTRUMP: Well, the big guns, first of all, are the same guns that the enemy has and that people that can break into your home or do what this maniac did over the weekend. And the big guns are the same guns. I mean, you are going to have to have that.\nO'REILLY: Okay.\nTRUMP: People use it for many other reasons. You know they use them -- they also use them for recreation, Bill. I have friends my sons are in the NRA, so am I. People use them for recreation. They use them for a lot of other reasons.\nO'REILLY: Would you put any limits on, you know, you can't have a mortar. You can't have hand grenades. You can't have a bazooka.\nTRUMP: All right.\nO'REILLY: Would you put any limits on what you can and cannot buy.\nTRUMP: On the guns I wouldn't because again, it's a question of protection and, also, once you start, where do you end? Where do you end?\nO'REILLY: Slippery slope?\nTRUMP: No, I wouldn't. I get along. I get along very well with the NRA on most of these subjects. I think probably the one is that when you are on a terror watch list. Perhaps in a certain sense my stance is tougher than anybody. But when you are on terror watch list you are on. You don't get to get a gun. And basically, they are right. And they're right. No, no, they're right. There are mistakes. And by the way, there are many, many mistakes on those watch lists. And what I would do, frankly is work hard to eradicate the mistakes --\nO'REILLY: Yes.\nTRUMP: To make sure that this people get off the list --\nO'REILLY: Right.\n(CROSSTALK)\nCongress is going to have to pass a law that has exact wording. All right. Now, what about you buy a big rifle? All right. You buy for whatever reason. Should you have to register that? So the FBI knows a serial number, knows you have it, knows you have it in your house? Should you have to do that?\nTRUMP: Well, right now, if you look at the real rules, regulations, and laws right now, you have pretty good laws in terms of registration. I was actually surprise to do see that. I saw it two or three weeks ago where they show me laws. I mean, if we obey the laws that are already in existence. If we follow those laws already in existence, you have pretty good rights.\nO'REILLY: Okay. You know, there are a lot of gun advocates and including the NRA in this, they don't want the government to know what their holding because they think the government down the line is going to seize their guns. So, rhetorically is it okay with you if the FBI knows?\nTRUMP: I think that frankly, I've stayed and I really feel very strongly I was very honored to get the endorsement of the NRA, the earliest endorsement they have ever given. I'm pretty sure the earliest endorsement they have ever given to a presidential candidate. I have stayed with what they have been saying. And I will tell you what, Bill, these people Wayne and Chris, I think they get a bad rap. They are great Americans. They love our country. This is what they do. They really want what's good I think more than anything else for our country. And I have stayed very much with what they do.\nO'REILLY: Okay.\nTRUMP: Having to do with the watch list. I would like to meet with them. I think we are going to meet. Actually I think something is set up or will be set up.\nO'REILLY: There is not big opposition for that.\nTRUMP: The watch list to me is very important.\nO'REILLY: Okay.\nTRUMP: The watch list to me is very important.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": [], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" June 20, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nO'REILLY: And in the \"Impact\" segment tonight, polling all over the place between Donald Trump and Hillary Clinton. New Monmouth poll out today as Secretary Clinton up by seven points. But this goes day to day up and down.\nJoining us now from inside headquarters, here in in New York City is Donald Trump. So, where do you think you are in the race? I don't think if you guys are doing internal polling yet. But do you think you are ahead, behind, tied? Where are you?\nDONALD TRUMP (R), PRESUMPTIVE PRESIDENTIAL NOMINEE: I think it's very close. I think that probably one poll came out. I'm pretty much even. I just tonight know. It's very early to have polling. I think we haven't even gotten started yet. You know, I'm just literally just starting. And I view the convention as probably a real starting point. But I think it's pretty even from what I'm seeing.\nO'REILLY: Okay. Now, you are taking some incoming from the insinuation that Barack Obama may be sympathetic to Muslim terrorists. We talked about this a little recently on this program. I don't think you believe that he is a quisling. That is he someone who wants Islamic terrorism to prosper. You don't believe that do you?\nTRUMP: I don't believe it. I do say though when I see a deal like was made with Iran, this horrible, horrible deal where we are giving them back $150 billion. To the best of my knowledge and I will tell you what, I've studied that thing pretty closely. We're getting almost nothing out of it. They will going to end up with nuclear weapons and lots of other things, whatever they want. And then I see the way he treats Israel.\nI say wow, what's the -- there seems to be a double standard. I'm not happy about it. A lot of other people aren't happy about it. I can tell you the people in Israel are not happy about it. So, I look at things and I see what's going on. I'm a common sense person. And I don't like it. I don't like it. I don't like it one bit.\nO'REILLY: Well, the Iranian deal is geopolitics. And he believes that he is going to keep Iran from getting the nuclear device but we will see down the road.\nTRUMP: It's not going to happen.\nO'REILLY: But your insinuation after Orlando is a little bit more personal than that. I remember the background because you are a birther guy, you didn't believe or you questioned his birth certificate where he was born. And now you are saying in so many words and I don't want to put words in your mouth so you can clarify that look, there is something more here than just President Obama seeing the world in a non-confrontational way. There might be a personal agent here. Is that on your mind?\nTRUMP: Well, it bothers me when is he afraid or doesn't want to mention the words radical Islamic terrorism when, obviously --\nO'REILLY: But he says it doesn't do any good to do that. It doesn't influence his policy.\nTRUMP: I disagree with him. And then they, you know, they redact a lot of the different statements made by this thug, this horrible guy that killed all those people. And, you know, it's a disgraceful thing. So, I disagree. You know, if you have a problem you have to be able to speak openly about the problem. This is a real problem. This is worldwide.\nO'REILLY: Sure. Sure. And that's the difference between you and not only President Obama but Hillary Clinton who's, you know, you brought her a little bit more. But you are kind of dodging my question and you don't usually do that. You believe there is a personal component inside the President's personality that sympathizes with the Muslim world and doesn't want to take the Muslim world with terrorism? Is that what it's about?\nTRUMP: I don't believe anything. I see things and whether it's the Iran deal, whether it's not wanting to mention the words radical Islam or radical Islamic terrorism or other things, Bill. You look at what's going on. I mean, it's not a question of what I think. But you look at facts. This isn't -- this isn't thinking. This is facts.\nO'REILLY: I know but you got a motive.\nTRUMP: And I really believe this. Bill, I really believe it. No, I have no motive.\nO'REILLY: Not your motive, I'm talking about his motive.\nTRUMP: If he were a great, let me tell you something. If he were a great president, a great, great president, and you know that's not going to happen. I would be so thrilled if our real employment was at five percent or four percent or three percent. I would be so thrilled. But it's not. Our country is in a horrible position in so many ways whether it's manufacturing, which is just -- our companies are fleeing our country with jobs. You look at what's going on with this country. It's really sad.\nO'REILLY: All right. All right. Then you have what happened.\nTRUMP: Wait, Bill. I look at what he does and I look at what he says. And I look at what he doesn't say. Why isn't he willing -- how do you solve a problem if you are unwilling to discuss it or unwilling to name it. And now she is all of the sudden, wait a minute, Bill.\nO'REILLY: All right. He says -- he'll drop the drones on them. He'll do what he has to do. But okay. Motive is always hard.\nTRUMP: You are always complaining. Hey, Bill, Bill, Bill, one second, you are always complaining, he is not strong enough. He is not going --\nO'REILLY: Yes. That's my opinion.\nTRUMP: A problem which is always getting worse.\nO'REILLY: That's my opinion.\nTRUMP: Drones are one thing but drones are not going to solve the problem.\nO'REILLY: And I agree with that. I have been very tough on him as you have in this arena.\nTRUMP: Yes. Well, a lot of other people agree with us.\nO'REILLY: And I may have a report coming up Thursday that might shed a little light on this but we're still working it. Now, you and gun control, right? All right. Let's run down the list. They have got to tighten up the terror watch vis-a-vis buying gun list, right? That's got to happen, right?\nTRUMP: Yes, sure. Absolutely.\nO'REILLY: Okay. All right.\nTRUMP: Who would not agree with that?\nO'REILLY: And I think the NRA would agree with it, too. But we have to have a very precise thing about, if you are on a terror watch list, this is what you can and can't do. What about the big guns? All right? You know, do people need big rifles that fire a lot of rounds? Do they need them?\nTRUMP: Well, the big guns, first of all, are the same guns that the enemy has and that people that can break into your home or do what this maniac did over the weekend. And the big guns are the same guns. I mean, you are going to have to have that.\nO'REILLY: Okay.\nTRUMP: People use it for many other reasons. You know they use them -- they also use them for recreation, Bill. I have friends my sons are in the NRA, so am I. People use them for recreation. They use them for a lot of other reasons.\nO'REILLY: Would you put any limits on, you know, you can't have a mortar. You can't have hand grenades. You can't have a bazooka.\nTRUMP: All right.\nO'REILLY: Would you put any limits on what you can and cannot buy.\nTRUMP: On the guns I wouldn't because again, it's a question of protection and, also, once you start, where do you end? Where do you end?\nO'REILLY: Slippery slope?\nTRUMP: No, I wouldn't. I get along. I get along very well with the NRA on most of these subjects. I think probably the one is that when you are on a terror watch list. Perhaps in a certain sense my stance is tougher than anybody. But when you are on terror watch list you are on. You don't get to get a gun. And basically, they are right. And they're right. No, no, they're right. There are mistakes. And by the way, there are many, many mistakes on those watch lists. And what I would do, frankly is work hard to eradicate the mistakes --\nO'REILLY: Yes.\nTRUMP: To make sure that this people get off the list --\nO'REILLY: Right.\n(CROSSTALK)\nCongress is going to have to pass a law that has exact wording. All right. Now, what about you buy a big rifle? All right. You buy for whatever reason. Should you have to register that? So the FBI knows a serial number, knows you have it, knows you have it in your house? Should you have to do that?\nTRUMP: Well, right now, if you look at the real rules, regulations, and laws right now, you have pretty good laws in terms of registration. I was actually surprise to do see that. I saw it two or three weeks ago where they show me laws. I mean, if we obey the laws that are already in existence. If we follow those laws already in existence, you have pretty good rights.\nO'REILLY: Okay. You know, there are a lot of gun advocates and including the NRA in this, they don't want the government to know what their holding because they think the government down the line is going to seize their guns. So, rhetorically is it okay with you if the FBI knows?\nTRUMP: I think that frankly, I've stayed and I really feel very strongly I was very honored to get the endorsement of the NRA, the earliest endorsement they have ever given. I'm pretty sure the earliest endorsement they have ever given to a presidential candidate. I have stayed with what they have been saying. And I will tell you what, Bill, these people Wayne and Chris, I think they get a bad rap. They are great Americans. They love our country. This is what they do. They really want what's good I think more than anything else for our country. And I have stayed very much with what they do.\nO'REILLY: Okay.\nTRUMP: Having to do with the watch list. I would like to meet with them. I think we are going to meet. Actually I think something is set up or will be set up.\nO'REILLY: There is not big opposition for that.\nTRUMP: The watch list to me is very important.\nO'REILLY: Okay.\nTRUMP: The watch list to me is very important.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n"}