{"vcmId": "1d8d00f8-469b-477a-a680-e587879355c8", "url": "http://www.foxnews.com/transcript/2016/02/17/donald-trump-vs-ted-cruz.html", "title": "Donald Trump vs. Ted Cruz", "description": "Both campaigns releasing vicious attacks against each other; 'The O'Reilly Factor' examines the latest", "date": "2016-02-17T13:24:05Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" February 16, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nERIC BOLLING, FOX NEWS HOST: Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching us tonight.\nLet's get straight to our top story: Donald Trump versus Ted Cruz. Both sides are unleashing vicious broad sides against each other with their attacks escalating over the past few days.\n(BEGIN VIDEO CLIP)\nDONALD TRUMP (R), PRESIDENTIAL CANDIDATE: I have never seen anybody that lied as much as Ted Cruz. He is a lying guy -- a really lying guy. Some people misrepresent, this guy is just a plain out liar.\nSEN. TED CRUZ (R-TX), PRESIDENTIAL CANDIDATE: Truth matters. You cannot simply scream \"liar\" when somebody points out the actual position of Donald Trump. So I will continue to focus on substance and truth and let other candidates focus on the insults and attack.\n(END VIDEO CLIP)\nBOLLING: And the Cruz campaign isn't stopping there. Releasing a fresh attack ad, taking aim at Donald Trump.\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED FEMALE: Between sips of wine and bites of salad, a Planned Parenthood doctor discusses getting money for tissue from aborted fetuses.\nUNIDENTIFIED FEMALE: Harvesting the organs of aborted fetuses for money.\nUNIDENTIFIED FEMALE: Planned Parenthood treats the unborn like another form of currency. And yet, some politicians still defend them.\nTRUMP: Planned Parenthood serves a good function. We have to look at the positives.\nUNIDENTIFIED FEMALE: Donald Trump is just plain wrong.\n(END VIDEO CLIP)\nBOLLING: And Trump fired back today.\n(BEGIN VIDEO CLIP)\nTRUMP: This guy, Cruz, comes out. Well I don't think he is going to win. This guy is so strident and so nasty he is going to lose every single state.\n(END VIDEO CLIP)\nBOLLING: Well this battle between Trump and Cruz isn't costing Trump support, at least not yet. A new survey by Public Policy Polling, a Democratic group shows Trump maintaining a strong lead in South Carolina with 35 percent of likely Republican voters backing him. Ted Cruz and Marco Rubio are tied for second at 18 percent, followed by John Kasich at 10 percent then Jeb Bush and Ben Carson tied at 7 percent.\nJoining us now with reaction from Columbia, South Carolina Alice Stewart, senior adviser for the Cruz campaign; and from Dallas Trump national spokesperson Katrina Pierson.\nNow, Katrina and Alice, no two better people sitting right here to debate all recent events between your two candidates. I'm going to start with you Katrina. Donald has said Ted Cruz has repeatedly lied about him and is ready to sue. Is that the case? Will Trump sue Cruz for libel?\nKATRINA PIERSON, TRUMP NATIONAL SPOKESPERSON: Well, he actually might, considering how a lot of these attacks against Mr. Trump are not true. And specifically with this new ad on Planned Parenthood, Donald Trump simply says that cervical cancer screening for poor women is a good thing, even though he opposes abortion and opposes funding for abortion for Planned.\nThe Cruz campaign wants to take it a little bit further. It's obvious that Senator Cruz needs South Carolina to move forward and he is not going to stop at anything, including misrepresenting his positions on pretty much everything at this point -- Eric.\nBOLLING: Ok. Alice, is Ted Cruz concerned about being sued in the middle of a fight for the GOP nomination?\nALICE STEWART, CRUZ CAMPAIGN SENIOR ADVISER: Well, if Donald Trump wants to sue, bring it on. The fact of the matter is Ted Cruz has done nothing but point out Donald Trump's exact words, exactly as he said them.\nAnd he has said that he supports the nation's largest abortion provider. He has said he is pro-choice. He has said that Planned Parenthood does some great things. And so -- I want to ask Katrina, the nation's largest abortion provider, how can he compete in a state like South Carolina when he supports abortion?\nBOLLING: Katrina.\nPIERSON: Well, first, I would like to ask Alice if she actually believes Mr. Trump supports abortion because the ads that the campaign are running are from 17 years ago. Mr. Trump hasn't been pro-abortion for a very long time. He has been pro-life. He has told stories on the campaign trail about that transition.\nSenator Cruz props up people like Ronald Reagan who, as governor of California, signed the most liberal piece of abortion legislation in that state, in the country's history, Alice.\nMr. Trump is pro-life and the Cruz campaign knows it.\nBOLLING: Alice.\nSTEWART: Well, it was just last week when we were on the debate stage when Donald Trump said that he supports taxpayer funding for the nation's largest abortion provider. We are talking last week not 17 years ago. He has said repeatedly that he is --\n(CROSSTALK)\nPIERSON: Mr. Trump said he supports the good things, the good things like cervical. Do you think poor women shouldn't have cervical cancer screenings?\nSTEWART: Planned Parenthood is the nation's largest abortion provider. He supports the nation's largest abortion provider and South Carolina is a pro-life state. The Republican Party is a pro-life party. And you cannot go around saying that you are pro-life when you support funding for Planned Parenthood. In addition to that he has said repeatedly that he thinks they do good things.\nHe has also said he supported Democrat candidates over the years.\nKIERSON: He also supported Ted Cruz. He's donated to Ted Cruz.\nBOLLING: Hold on guys. We can go back and forth on this. I mean Alice, honestly, there are a lot of candidates who change positions on certain things, for example on immigration. Some would say Ted Cruz has changed his position on immigration over the years as well. Should you be holding Donald Trump to the standard of what he said as Katrina points out -- I'm not sure about that 17 years ago number. If, in fact, it was 17 years ago that he said it, should he be held to that standard now?\nSTEWART: He should be held to the standard of what he said on the debate stage just last week, Eric. That's what people are basing their decision on.\nAnd when it comes to immigration, no one has fought harder against Marco Rubio and the Gang of Eight and their amnesty program than Ted Cruz in Washington, D.C. Here's the fact. I'm in South Carolina. We have been out on the campaign trail for days here in South Carolina talking to South Carolinians about issues that they are concerned with.\nNot some Donald Trump just calling his opponents liars and nasty. Ted Cruz this morning gave a phenomenal national security speech here in Charleston where he talked about the importance of funding and building up our military. Barack Obama has spent the past seven years with our national security on the back burner. Ted Cruz will put it on the front burner.\nThis afternoon, we were out on the campaign trail with Texas governor, former governor Rick Perry and Medal of Honor recipient Dakota Myer. Talking about our vets --\nBOLLING: Katrina, now --\nPIERSON: Donald Trump is pro-life and has been for a very long time. We too are on the ground in South Carolina listening to the voters who think that a lot of these things that the Cruz campaign are too doing have very sleazy from Iowa all the way to South Carolina with these horrible push polls.\nI will say this with regard to immigration. Donald Trump is the most solid on immigration as we have seen and the only reason we are having this discussion is because of Donald Trump. On Senator Cruz's own YouTube page, he is praising bringing Syrian refugees to this country because it's the right thing to do for America. He flip-flopped on that after Mr. Trump came out against it. He supported increasing HB1 visas and green cards.\nBOLLING: Right. We can't go through the complete platforms of both candidates. What I would like to talk about a little bit and we don't have a ton of time. I'm going to start with you Katrina, in the aftermath of the last debate where Donald Trump had mentioned some things about George W. Bush yet afterwards the poll numbers haven't seem to have budged. Is he concerned -- are you hearing on the ground that that's going to affect anything going forward going into Saturday's primary?\nPIERSON: No. Not at all, Eric. The people on the ground in South Carolina and all over the country are tired of the transnational corporations backed people like Senator Ted Cruz who promotes Obama trade. They are tired of it. They want their jobs back. They want to make things in this country again. They want to secure the borders. They want to stop immigration. They want to deport criminal aliens.\nThe people on the ground get it. They are very used to politics and politic politicians alike and that's why we see the poll numbers staying the same.\nBOLLING: And what do you say Alice. Is Ted Cruz concerned that the poll numbers in the aftermath of the -- what a lot of people thought this was the one thing that's going to give Donald Trump his numbers to come down after all the other things. This was going to be the one because George W. Bush seems to be beloved, but it hasn't seemed to budge. Is Ted Cruz concerned that maybe he shouldn't have picked this fight?\nSTEWART: Well, here's the thing. Ted Cruz has done nothing more than point out Donald Trump's own record and his own words. And for -- it's sad that Katrina has to defend someone who basically says anyone that calls out his record is lying. That's a pretty weak defense. And just by saying someone is a liar does not address the issue. So, you know, it's unfortunate.\nBOLLING: Here is where the rubber meets the road. You look at the last poll, the poll we just sited Ted Cruz was solidly in second prior to that poll. Now he is tied for second. His numbers have slid a bit. Is this a concern in the Cruz camp?\nSTEWART: We are encouraged by the crowds we've seen here on the ground in South Carolina. We are making tens of thousands of phone calls every day and knocking on doors and having tremendous surrogates out here on the trail with us. And keep in mind, the polls have Donald Trump in first in Iowa and we had a resounding victory in Iowa.\nWe are looking forward to Saturday.\nBOLLING: We're going to have to leave it right there, ladies. Thank you very much. Hot debate.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": ["DONALD TRUMP (R), PRESIDENTIAL CANDIDATE: I have never seen anybody that lied as much as Ted Cruz. He is a lying guy -- a really lying guy. Some people misrepresent, this guy is just a plain out liar.SEN. TED CRUZ (R-TX), PRESIDENTIAL CANDIDATE: Truth matters. You cannot simply scream \"liar\" when somebody points out the actual position of Donald Trump. So I will continue to focus on substance and truth and let other candidates focus on the insults and attack.", "UNIDENTIFIED FEMALE: Between sips of wine and bites of salad, a Planned Parenthood doctor discusses getting money for tissue from aborted fetuses.UNIDENTIFIED FEMALE: Harvesting the organs of aborted fetuses for money.UNIDENTIFIED FEMALE: Planned Parenthood treats the unborn like another form of currency. And yet, some politicians still defend them.TRUMP: Planned Parenthood serves a good function. We have to look at the positives.UNIDENTIFIED FEMALE: Donald Trump is just plain wrong.", "TRUMP: This guy, Cruz, comes out. Well I don't think he is going to win. This guy is so strident and so nasty he is going to lose every single state."], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" February 16, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nERIC BOLLING, FOX NEWS HOST: Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching us tonight.\nLet's get straight to our top story: Donald Trump versus Ted Cruz. Both sides are unleashing vicious broad sides against each other with their attacks escalating over the past few days.\nBOLLING: And the Cruz campaign isn't stopping there. Releasing a fresh attack ad, taking aim at Donald Trump.\nBOLLING: And Trump fired back today.\nBOLLING: Well this battle between Trump and Cruz isn't costing Trump support, at least not yet. A new survey by Public Policy Polling, a Democratic group shows Trump maintaining a strong lead in South Carolina with 35 percent of likely Republican voters backing him. Ted Cruz and Marco Rubio are tied for second at 18 percent, followed by John Kasich at 10 percent then Jeb Bush and Ben Carson tied at 7 percent.\nJoining us now with reaction from Columbia, South Carolina Alice Stewart, senior adviser for the Cruz campaign; and from Dallas Trump national spokesperson Katrina Pierson.\nNow, Katrina and Alice, no two better people sitting right here to debate all recent events between your two candidates. I'm going to start with you Katrina. Donald has said Ted Cruz has repeatedly lied about him and is ready to sue. Is that the case? Will Trump sue Cruz for libel?\nKATRINA PIERSON, TRUMP NATIONAL SPOKESPERSON: Well, he actually might, considering how a lot of these attacks against Mr. Trump are not true. And specifically with this new ad on Planned Parenthood, Donald Trump simply says that cervical cancer screening for poor women is a good thing, even though he opposes abortion and opposes funding for abortion for Planned.\nThe Cruz campaign wants to take it a little bit further. It's obvious that Senator Cruz needs South Carolina to move forward and he is not going to stop at anything, including misrepresenting his positions on pretty much everything at this point -- Eric.\nBOLLING: Ok. Alice, is Ted Cruz concerned about being sued in the middle of a fight for the GOP nomination?\nALICE STEWART, CRUZ CAMPAIGN SENIOR ADVISER: Well, if Donald Trump wants to sue, bring it on. The fact of the matter is Ted Cruz has done nothing but point out Donald Trump's exact words, exactly as he said them.\nAnd he has said that he supports the nation's largest abortion provider. He has said he is pro-choice. He has said that Planned Parenthood does some great things. And so -- I want to ask Katrina, the nation's largest abortion provider, how can he compete in a state like South Carolina when he supports abortion?\nBOLLING: Katrina.\nPIERSON: Well, first, I would like to ask Alice if she actually believes Mr. Trump supports abortion because the ads that the campaign are running are from 17 years ago. Mr. Trump hasn't been pro-abortion for a very long time. He has been pro-life. He has told stories on the campaign trail about that transition.\nSenator Cruz props up people like Ronald Reagan who, as governor of California, signed the most liberal piece of abortion legislation in that state, in the country's history, Alice.\nMr. Trump is pro-life and the Cruz campaign knows it.\nBOLLING: Alice.\nSTEWART: Well, it was just last week when we were on the debate stage when Donald Trump said that he supports taxpayer funding for the nation's largest abortion provider. We are talking last week not 17 years ago. He has said repeatedly that he is --\n(CROSSTALK)\nPIERSON: Mr. Trump said he supports the good things, the good things like cervical. Do you think poor women shouldn't have cervical cancer screenings?\nSTEWART: Planned Parenthood is the nation's largest abortion provider. He supports the nation's largest abortion provider and South Carolina is a pro-life state. The Republican Party is a pro-life party. And you cannot go around saying that you are pro-life when you support funding for Planned Parenthood. In addition to that he has said repeatedly that he thinks they do good things.\nHe has also said he supported Democrat candidates over the years.\nKIERSON: He also supported Ted Cruz. He's donated to Ted Cruz.\nBOLLING: Hold on guys. We can go back and forth on this. I mean Alice, honestly, there are a lot of candidates who change positions on certain things, for example on immigration. Some would say Ted Cruz has changed his position on immigration over the years as well. Should you be holding Donald Trump to the standard of what he said as Katrina points out -- I'm not sure about that 17 years ago number. If, in fact, it was 17 years ago that he said it, should he be held to that standard now?\nSTEWART: He should be held to the standard of what he said on the debate stage just last week, Eric. That's what people are basing their decision on.\nAnd when it comes to immigration, no one has fought harder against Marco Rubio and the Gang of Eight and their amnesty program than Ted Cruz in Washington, D.C. Here's the fact. I'm in South Carolina. We have been out on the campaign trail for days here in South Carolina talking to South Carolinians about issues that they are concerned with.\nNot some Donald Trump just calling his opponents liars and nasty. Ted Cruz this morning gave a phenomenal national security speech here in Charleston where he talked about the importance of funding and building up our military. Barack Obama has spent the past seven years with our national security on the back burner. Ted Cruz will put it on the front burner.\nThis afternoon, we were out on the campaign trail with Texas governor, former governor Rick Perry and Medal of Honor recipient Dakota Myer. Talking about our vets --\nBOLLING: Katrina, now --\nPIERSON: Donald Trump is pro-life and has been for a very long time. We too are on the ground in South Carolina listening to the voters who think that a lot of these things that the Cruz campaign are too doing have very sleazy from Iowa all the way to South Carolina with these horrible push polls.\nI will say this with regard to immigration. Donald Trump is the most solid on immigration as we have seen and the only reason we are having this discussion is because of Donald Trump. On Senator Cruz's own YouTube page, he is praising bringing Syrian refugees to this country because it's the right thing to do for America. He flip-flopped on that after Mr. Trump came out against it. He supported increasing HB1 visas and green cards.\nBOLLING: Right. We can't go through the complete platforms of both candidates. What I would like to talk about a little bit and we don't have a ton of time. I'm going to start with you Katrina, in the aftermath of the last debate where Donald Trump had mentioned some things about George W. Bush yet afterwards the poll numbers haven't seem to have budged. Is he concerned -- are you hearing on the ground that that's going to affect anything going forward going into Saturday's primary?\nPIERSON: No. Not at all, Eric. The people on the ground in South Carolina and all over the country are tired of the transnational corporations backed people like Senator Ted Cruz who promotes Obama trade. They are tired of it. They want their jobs back. They want to make things in this country again. They want to secure the borders. They want to stop immigration. They want to deport criminal aliens.\nThe people on the ground get it. They are very used to politics and politic politicians alike and that's why we see the poll numbers staying the same.\nBOLLING: And what do you say Alice. Is Ted Cruz concerned that the poll numbers in the aftermath of the -- what a lot of people thought this was the one thing that's going to give Donald Trump his numbers to come down after all the other things. This was going to be the one because George W. Bush seems to be beloved, but it hasn't seemed to budge. Is Ted Cruz concerned that maybe he shouldn't have picked this fight?\nSTEWART: Well, here's the thing. Ted Cruz has done nothing more than point out Donald Trump's own record and his own words. And for -- it's sad that Katrina has to defend someone who basically says anyone that calls out his record is lying. That's a pretty weak defense. And just by saying someone is a liar does not address the issue. So, you know, it's unfortunate.\nBOLLING: Here is where the rubber meets the road. You look at the last poll, the poll we just sited Ted Cruz was solidly in second prior to that poll. Now he is tied for second. His numbers have slid a bit. Is this a concern in the Cruz camp?\nSTEWART: We are encouraged by the crowds we've seen here on the ground in South Carolina. We are making tens of thousands of phone calls every day and knocking on doors and having tremendous surrogates out here on the trail with us. And keep in mind, the polls have Donald Trump in first in Iowa and we had a resounding victory in Iowa.\nWe are looking forward to Saturday.\nBOLLING: We're going to have to leave it right there, ladies. Thank you very much. Hot debate.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n"}