{"vcmId": "30446225-a085-4435-9de6-004a550163fb", "url": "http://www.foxnews.com/transcript/2016/12/19/donald-trump-and-russian-interference-in-us-election.html", "title": "Donald Trump and Russian interference in US election", "description": "Sean Spicer joins 'The O'Reilly Factor' to discuss the Trump transition, Russia and hacking", "date": "2016-12-19T12:54:58Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" December 16, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nBut just a little while ago, I spoke with Trump-Pence Presidential Transition Team Senior Communications Advisor Sean Spicer.\n(BEGIN VIDEO CLIP)\nBOLLING: So, Sean, President Obama yesterday was talking to NPR and he has said that he was considering retaliatory moves against Russia given the hacking and what we know. Tell me, he actually said I think there's no daughter when any foreign government tries to impact the integrity of our elections, we need to take action and we will. And the next line was, at a time and a place of our choosing, some maybe explicit and publicize some of it may not be.\nNow, Sean, does President-Elect Donald Trump want President Obama with 35 days left in his term to get involved with Russia in any way, shape or form?\nSEAN SPICER, CHIEF STRATEGIST AND COMMUNICATIONS DIRECTOR, RNC: I think President-elect Trump recognizes that there's one president at a time. President Obama has 30 some odd days left in his term and on January 20th this country will have a new president. Real change will come. While President Obama is president, he has the right to do what he thinks is in the country's best interests and when President-elect Trump becomes President Trump on January 20th, I think whether it's our foreign policy or domestic policy, you're going to see real change come to Washington at this country.\nBOLLING: Right. But does he want President Obama to step aside and let him take care of it in 35 days or is he willing to deal with whatever Obama decides to do right now?\nSPICER: Well, I think that the problem that we have right now Eric is this, that we hear a lot of sources that say the following happened or didn't happen on November 17th, the director of National Intelligence James Clapper spoke to the House Intelligence Committee and at that time he said that they had no con exclusive proof that the WikiLeaks and the other revelations were conclusively tied to Russia. Now, if President Obama does have that information and the intelligence conclusively points to it, that he needs to make decisions in a base in the country's best interests.\nBut I think that one of the things that the media keeps conflating is an attempt to say if Russia or other entities are probing, you know, different sites which is what you get all the time, this so-called fishing exercise, where they send e-mails and try to find ways to break through different accounts into data, that's one thing. But there is zero proof that they had any impact on the election in terms of the outcome.\nAnd I think that's what's happening now is an attempt by folks on the Left and some folks in the media frankly to de-legitimatize the huge win that Donald Trump had and I think that it's sad because if you think about where we were 38 days ago prior to the election, it was the administration and others in the media saying that we need to have absolutely integrity in our election and anyone who questions it should be, you know, shouldn't be taken seriously because we have so many voting systems, there's no way that you could compromise integrity of our election. So --\nBOLLING: But I find it curious that President Obama today said that yes, he knew that we had Intel, that they were hacking yet he choose now, now, yesterday to say in his words, we will take action.\nSPICER: Well, and I think that if we do -- but one of the things that's really gotten lost in this -- and again, I want to make it very clear to everyone watching, any foreign entity or any entity that seeks to undermine or interfere in a U.S. election should be stopped, fall stop, no question about it. But if you look at what happened, it was Hillary Clinton who had a secret server that wasn't in accordance with government regulations. It was the DNC that didn't came up with their technology security measures that's been reported.\nIt was John Podesta and Hillary Clinton, I mean, and Jennifer Palmieri, Neera Tanden (ph), and David Brock, they wrote the things that got out and it was the mainstream media that covered it. This is not Donald Trump's fault. This is not the Republican's fault. They have brought this scandal to their doorstep and now they are trying to do everything they can to deflect from what they brought to themselves.\nBOLLING: Okay. Sean, you've been floated as a possible -- the next press secretary. Have you been asked?\nSPICER: No, I haven't.\nBOLLING: How will President-elect Donald Trump and President Donald Trump's relationship with the media evolve? What do you expect going forward with that relationship?\nSPICER: Well, I think that it's a two-way street. For so long the media has held politicians captive because most politicians frankly need the outlet. They need the media to communicate a message. Donald Trump has shown that he more effectively than frankly anybody else, celebrities, politicians, you know, you name it, can effectively get out a message to the American people and have a two-way dialogue with them in a way that no one ever has in our history. And I think that it scares the media, frankly. Now, he understands that the media is a very healthy part of our democracy, they need to be part of the process, but that he doesn't need them in the same way that everybody else has, I think frankly worries them a bit.\nBOLLING: Yes. And so, will he therefore restructure access that the media has to the presidency.\nSPICER: No, no, no. Look, look, he is unbelievably transparent. There's a camera from goodness sake in Trump Tower that shows everybody going up and down. We've allowed the press to have access. They're in a pool that follows him now. He understands that they're a healthy part of the democracy, but I think that he also has the ability to speak directly to the American people like no one else has.\nBOLLING: So there's a thing called the Trump way that we talked about it and you've done things differently and frankly you've won doing things differently.\nSPICER: Right.\nBOLLING: How do you think the relationship with the media should change and what should Donald Trump, President Donald Trump be tweeting?\nSPICER: Well, of course he should be and it's been effective. I think people don't like it sometimes because he does have this direct line to the American people and he frankly in a lot of cases is able to bypass the mainstream media. But to you first question, I think that one of the things that he realized is that he has this dialogue with the American people and he wants to expand it whether it's the Facebook live or Twitter. He has a way to have a back and forth dialogue with the American people that is something very, very unique to him and it's something that he's going to continue to do.\nBut he will continue to -- and then frankly the other thing is that I think the mainstream media has had a strangle hold on a lot of stuff and I think that we've seen conservative media play a much bigger role and they should be brought into this process a lot more as well.\nBOLLING: All right. Thank you very much, Sean Spicer. We appreciate your time.\nAnd by the way, Donald Trump having 30 million Twitter Facebook and Instagram followers. Boy, that is some access that he has -- to the American public. Leave it right there. Sean, thank you.\nSPICER: Thanks, Eric.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": [], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" December 16, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nBut just a little while ago, I spoke with Trump-Pence Presidential Transition Team Senior Communications Advisor Sean Spicer.\n"}