{"vcmId": "504dee23-0141-4a5d-b1d1-e39ed6eeb9ec", "url": "http://www.foxnews.com/transcript/2017/02/23/bill-oreilly-intense-debate-over-illegal-immigration-continues.html", "title": "Bill O'Reilly: The intense debate over illegal immigration continues", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/22", "date": "2017-02-23T12:47:06Z", "full_transcript": "A new survey from Harvard conducted by the Harris poll printed in The Hill newspaper, kind of shocking. One caveat, this is an internet poll, which we usually do not reference for hard news reporting here.\nSo, please maintain some skepticism. The poll asks, do you believe cities that arrest illegal immigrants for crimes should be required to turn them over to immigration authorities? An astounding 80 percent say, yes. Twenty percent say, no. But on the question of a border wall, it is different. Do you support or oppose a wall? Fifty three percent oppose, 47 percent support. Next question, do you support the executive order that suspends the U.S. refugee program for 120 days? Fifty three percent support, 47 percent opposed.\nThen, finally, the United States is supposed to accept 100,000 Syrian refugees this year. Should that number be higher, lower or the same? Fifty one percent lower, 34 percent, the same. Fifteen percent, higher. If the polling is accurate, the Harvard survey is a stunning rebuke to the liberal sanctuary city movement. \"Talking Points\" does believe most Americans oppose sanctuary cities but 80 percent simply don't know. Now, the reason most Americans do not want local jurisdictions creating federal anarchy can be spotlighted in Denver County, Colorado.\nFederal authorities say that 27-year-old Norlan Estrada-Reyes with a number of run-ins with the law, was released by the Denver County sheriff's office despite I.C.E. asking that he be held. Reyes is a Honduran citizen in this country illegally. So, what happened after his release? Reyes allegedly struck 28-year-old Karina Pulec with his car, dragging her 50 feet and killing her. Then, he fled. He is now charged with multiple felonies.\nAlso, in Denver County, 19-year-old Ever Valles, an illegal alien from Mexico and a known gang member was again released by the Denver County sheriff's office despite I.C.E. asking that he be held. So, what happened? February 7th, Valles and another man shot 32-year-old Tim Cruz to death at a light rail station. Both men have now been charged with murder.\n(BEGIN VIDEO CLIP)\nWe wanted to ask the Denver Sheriff Patrick Firman why his department failed to notify I.C.E. when Valles was booked for murder when it had already notified the Feds about the stolen car arrest. But Firman declined an interview. In a statement, the Sheriff's Department says, Denver has never and will never condone dangerous or violent individuals being on our streets. Immigrants are not. However, detaining anyone without a criminal warrant is a violation of the Fourth Amendment.\n(BEGIN VIDEO CLIP)\nO'REILLY: The Sheriff Patrick Firman is full of it, it's both, there is no violation of the law holding someone for the federal government. None. It's done all the time. The sheriff upholds the sanctuary city mantra, as does the mayor of the city of Denver Michael Hancock. In my opinion, both men have blood on their hands.\nAnd then that is \"The Memo\".", "video_clips": [], "remaining_transcript": "A new survey from Harvard conducted by the Harris poll printed in The Hill newspaper, kind of shocking. One caveat, this is an internet poll, which we usually do not reference for hard news reporting here.\nSo, please maintain some skepticism. The poll asks, do you believe cities that arrest illegal immigrants for crimes should be required to turn them over to immigration authorities? An astounding 80 percent say, yes. Twenty percent say, no. But on the question of a border wall, it is different. Do you support or oppose a wall? Fifty three percent oppose, 47 percent support. Next question, do you support the executive order that suspends the U.S. refugee program for 120 days? Fifty three percent support, 47 percent opposed.\nThen, finally, the United States is supposed to accept 100,000 Syrian refugees this year. Should that number be higher, lower or the same? Fifty one percent lower, 34 percent, the same. Fifteen percent, higher. If the polling is accurate, the Harvard survey is a stunning rebuke to the liberal sanctuary city movement. \"Talking Points\" does believe most Americans oppose sanctuary cities but 80 percent simply don't know. Now, the reason most Americans do not want local jurisdictions creating federal anarchy can be spotlighted in Denver County, Colorado.\nFederal authorities say that 27-year-old Norlan Estrada-Reyes with a number of run-ins with the law, was released by the Denver County sheriff's office despite I.C.E. asking that he be held. Reyes is a Honduran citizen in this country illegally. So, what happened after his release? Reyes allegedly struck 28-year-old Karina Pulec with his car, dragging her 50 feet and killing her. Then, he fled. He is now charged with multiple felonies.\nAlso, in Denver County, 19-year-old Ever Valles, an illegal alien from Mexico and a known gang member was again released by the Denver County sheriff's office despite I.C.E. asking that he be held. So, what happened? February 7th, Valles and another man shot 32-year-old Tim Cruz to death at a light rail station. Both men have now been charged with murder.\n"}