{"vcmId": "56642b3a-c6cd-427d-b5bd-89b8360b19f5", "url": "http://www.foxnews.com/transcript/2017/01/24/bill-oreilly-donald-trump-on-job.html", "title": "Bill O'Reilly: Donald Trump on the job", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/23", "date": "2017-01-24T13:03:10Z", "full_transcript": "Busy news day, President Trump signed three executive orders. Number one, USA will leave the Trans Pacific Partnership, that trade agreement is now toast.\nNumber two, there is a federal hiring freeze in place with the exception of the military.\nAnd number three, the U.S. government will no longer pay any agency for performing abortions overseas. In addition, to the press briefing today at the White House, Brit Hume will analyze that coming up. It was quite clear to me that President Trump is going to be an activist. That means he is going to change a lot of things fast. Congress people think they are going to get a lot of gym time, they are mistaken.\nMr. Trump is also going to challenge the American press, which he loathes. Over the weekend, there was a silly controversy over whose inauguration crowd was bigger, Trump's or Obama's. A macho thing. With all due respect, who cares? If you are interested in that kind of thing, television ratings really tell the tale. Donald Trump's inauguration clocked in with the fifth highest TV viewership. Ronald Reagan's first.\nBut today, Press Secretary Sean Spicer said that if you added all the people watching on the internet devices, the Trump inauguration reach more folks than any other. Most likely true. But again, not really important to the country. What is far more compelling is the press war, the price war between the President and national media outlets. Talking Points sees it clearly, many in the media had a vested interest in seeing President Obama succeed.\nAnd those same exact people have a vested interest in seeing Donald Trump fail. He knows it. You know it. And I know it. The only reason to compare crowds at the inauguration, the only reason was to embarrassed Donald Trump. Everyone knows Washington, D.C. and its suburbs are Democratic strongholds. Come on. Now, there are two roads for the Trump administration to take care. They can rise above the national media and bring the message directly to the folks. Or you can slug it out.\n(BEGIN VIDEO CLIP)\nREINCE PRIEBUS, WHITE HOUSE CHIEF OF STAFF: I am saying, there is an obsession by the media to delegitimize this president. And we are not going to sit around and let it happen. We are going to fight back, tooth and nail, every day, and twice on Sunday.\n(END VIDEO CLIP)\nO'REILLY: So, we're going to expect a lot of time devoted to this press battle. Now back in the year 2000, Presidential Candidate George W. Bush faced the same kind of media bias.\n(BEGIN VIDEO CLIP)\nPRES. GEORGE W. BUSH (R), 43RD PRESIDENT OF THE UNITED STATES: You know something, Bill, I have learned a pretty good lesson. That is never to complain about the press coverage. I don't like some of the coverage but I will tell you, the worst one was for me in politics was when I saw people say ugly things about my dad. I was a loyal son, he is the guy that gave me unconditional love and I was ready to launch after anybody that said --\nO'REILLY: And you did on a couple of occasions.\nBUSH: I did. I know. But it's a lot different being the first son to become a president.\n(END VIDEO CLIP)\nO'REILLY: And George W. Bush did not engage the press. He mostly ignored the slings and arrows. \"Talking Points\" believes that hurt Mr. Bush a bit, as his image suffered in the relentless criticism he endured. The Iraq war should have been defined better by the Bush administration, especially after the weapons of mass destruction were not found. But George W. Bush made a decision not to take on the press and they hammered him.\nSo, there is no way Donald Trump is going to allow that to happen. Whether the ongoing confrontation is good for the country, for you guys, remains to be seen. What Americans have to understand is that there is an organized effort to get Donald Trump out of office. This is a largely unreported story. The woman's march over the weekend, a perfect example. That wasn't a spontaneous event. It was organized by far left groups, which received millions of dollars from the liberal activist George Soros.\nIn fact, Soros has ties to 50 of the groups that attended the woman's march this weekend. Fifty. And according to the media research center, sources pumped $90 million into those groups. Some of the top of march organizers were members of the Obama administration, Hillary Clinton's campaign, Bernie Sanders campaign. Again, this was not some spontaneous uprising.\nIt's a well-thought-out political spectacle. Designed to denigrate the new president. And if you watch the exposition, you heard some really crazy stuff.\n(BEGIN VIDEO CLIP)\nJUDD: Blacks are still in shackles and graves just for being black. Slavery has been reinterpreted as the prison system in-front of people who see melanin as animal skin. I am not as nasty as a swastika painted on a pride flag. And I didn't know devils could be resurrected, but I feel Hitler in these streets. A mustache traded for a toupee. Nazis renamed to the cabinet.\n(END VIDEO CLIP)\nO'REILLY: Now that kind of extremism is simply nuts. Yet, the Trump administration responded.\n(BEGIN VIDEO CLIP)\nKELLYANNE CONWAY, SENIOR ADVISER TO PRESIDENT TRUMP: You have celebrities from the podium using profanity laced insults. You have a very prominent singer, who was with hundreds of millions of dollars, not going over to a women's shelter to write a check, but instead, saying that she's thought of, quote, \"burning down the White House.\"\nUNIDENTIFIED MALE: Are you talking about Madonna?\nCONWAY: This is destructive.\n(END VIDEO CLIP)\nO'REILLY: I think she said blow up the White House not burn it down. That would take too long. Ms. Conway is correct. It is destructive. Not good for the country. \"Talking Points\" has no problem with people demonstrating against a politician or political party. That is time-honored but insane charges of fascism, racism and the like demean our system. It is clear that the far left will not give President Trump a chance and we'll do everything it can to get him out of office before his term is over.\nHe's going to lead the trouble. And the crazy left has a powerful ally, the media. You won't hear them reporting about how George Soros is manipulating protests behind the scenes. You will not hear that. Finally, a presidential inauguration is supposed to be a time of celebration for the country, not nonstop acrimony. Donald Trump is a confrontational guy. He is not going to sit around and take a lot of garbage.\nBut by responding to obvious provocations, the Trump administration veers away from the people's business. We have said it before. The Trump administration will rise or fall on his policy accomplishments. If the economy ignites insecurity gets tighter, Mr. Trump will be a successful president. If that does not happen, the dissent will become overwhelming. And that is \"The Memo\".", "video_clips": ["REINCE PRIEBUS, WHITE HOUSE CHIEF OF STAFF: I am saying, there is an obsession by the media to delegitimize this president. And we are not going to sit around and let it happen. We are going to fight back, tooth and nail, every day, and twice on Sunday.", "PRES. GEORGE W. BUSH (R), 43RD PRESIDENT OF THE UNITED STATES: You know something, Bill, I have learned a pretty good lesson. That is never to complain about the press coverage. I don't like some of the coverage but I will tell you, the worst one was for me in politics was when I saw people say ugly things about my dad. I was a loyal son, he is the guy that gave me unconditional love and I was ready to launch after anybody that said --O'REILLY: And you did on a couple of occasions.BUSH: I did. I know. But it's a lot different being the first son to become a president.", "JUDD: Blacks are still in shackles and graves just for being black. Slavery has been reinterpreted as the prison system in-front of people who see melanin as animal skin. I am not as nasty as a swastika painted on a pride flag. And I didn't know devils could be resurrected, but I feel Hitler in these streets. A mustache traded for a toupee. Nazis renamed to the cabinet.", "KELLYANNE CONWAY, SENIOR ADVISER TO PRESIDENT TRUMP: You have celebrities from the podium using profanity laced insults. You have a very prominent singer, who was with hundreds of millions of dollars, not going over to a women's shelter to write a check, but instead, saying that she's thought of, quote, \"burning down the White House.\"UNIDENTIFIED MALE: Are you talking about Madonna?CONWAY: This is destructive."], "remaining_transcript": "Busy news day, President Trump signed three executive orders. Number one, USA will leave the Trans Pacific Partnership, that trade agreement is now toast.\nNumber two, there is a federal hiring freeze in place with the exception of the military.\nAnd number three, the U.S. government will no longer pay any agency for performing abortions overseas. In addition, to the press briefing today at the White House, Brit Hume will analyze that coming up. It was quite clear to me that President Trump is going to be an activist. That means he is going to change a lot of things fast. Congress people think they are going to get a lot of gym time, they are mistaken.\nMr. Trump is also going to challenge the American press, which he loathes. Over the weekend, there was a silly controversy over whose inauguration crowd was bigger, Trump's or Obama's. A macho thing. With all due respect, who cares? If you are interested in that kind of thing, television ratings really tell the tale. Donald Trump's inauguration clocked in with the fifth highest TV viewership. Ronald Reagan's first.\nBut today, Press Secretary Sean Spicer said that if you added all the people watching on the internet devices, the Trump inauguration reach more folks than any other. Most likely true. But again, not really important to the country. What is far more compelling is the press war, the price war between the President and national media outlets. Talking Points sees it clearly, many in the media had a vested interest in seeing President Obama succeed.\nAnd those same exact people have a vested interest in seeing Donald Trump fail. He knows it. You know it. And I know it. The only reason to compare crowds at the inauguration, the only reason was to embarrassed Donald Trump. Everyone knows Washington, D.C. and its suburbs are Democratic strongholds. Come on. Now, there are two roads for the Trump administration to take care. They can rise above the national media and bring the message directly to the folks. Or you can slug it out.\nO'REILLY: So, we're going to expect a lot of time devoted to this press battle. Now back in the year 2000, Presidential Candidate George W. Bush faced the same kind of media bias.\nO'REILLY: And George W. Bush did not engage the press. He mostly ignored the slings and arrows. \"Talking Points\" believes that hurt Mr. Bush a bit, as his image suffered in the relentless criticism he endured. The Iraq war should have been defined better by the Bush administration, especially after the weapons of mass destruction were not found. But George W. Bush made a decision not to take on the press and they hammered him.\nSo, there is no way Donald Trump is going to allow that to happen. Whether the ongoing confrontation is good for the country, for you guys, remains to be seen. What Americans have to understand is that there is an organized effort to get Donald Trump out of office. This is a largely unreported story. The woman's march over the weekend, a perfect example. That wasn't a spontaneous event. It was organized by far left groups, which received millions of dollars from the liberal activist George Soros.\nIn fact, Soros has ties to 50 of the groups that attended the woman's march this weekend. Fifty. And according to the media research center, sources pumped $90 million into those groups. Some of the top of march organizers were members of the Obama administration, Hillary Clinton's campaign, Bernie Sanders campaign. Again, this was not some spontaneous uprising.\nIt's a well-thought-out political spectacle. Designed to denigrate the new president. And if you watch the exposition, you heard some really crazy stuff.\nO'REILLY: Now that kind of extremism is simply nuts. Yet, the Trump administration responded.\nO'REILLY: I think she said blow up the White House not burn it down. That would take too long. Ms. Conway is correct. It is destructive. Not good for the country. \"Talking Points\" has no problem with people demonstrating against a politician or political party. That is time-honored but insane charges of fascism, racism and the like demean our system. It is clear that the far left will not give President Trump a chance and we'll do everything it can to get him out of office before his term is over.\nHe's going to lead the trouble. And the crazy left has a powerful ally, the media. You won't hear them reporting about how George Soros is manipulating protests behind the scenes. You will not hear that. Finally, a presidential inauguration is supposed to be a time of celebration for the country, not nonstop acrimony. Donald Trump is a confrontational guy. He is not going to sit around and take a lot of garbage.\nBut by responding to obvious provocations, the Trump administration veers away from the people's business. We have said it before. The Trump administration will rise or fall on his policy accomplishments. If the economy ignites insecurity gets tighter, Mr. Trump will be a successful president. If that does not happen, the dissent will become overwhelming. And that is \"The Memo\".\n"}