{"vcmId": "7f5337b0-91dd-4efd-a101-34f88220a527", "url": "http://www.foxnews.com/transcript/2015/11/17/bill-oreilly-is-president-barack-obama-delusional.html", "title": "Bill O'Reilly: Is President Barack Obama delusional?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/16", "date": "2015-11-17T13:23:11Z", "full_transcript": "History will record that the two biggest deficits of the Obama administration were the failure to create a robust economy and the President's retreat from the terrorist battlefield. For years \"Talking Points\" has been telling you the Obama administration has no strategy, none, to defeat the ISIS threat. Random bombing, not going to do it; and every honest military analyst knows it.\nBut President Obama somehow does not seem to understand that the civilized world is losing the fight against ISIS. Just nine hours before the Paris attack, this was broadcast.\n(BEGIN VIDEO CLIP)\nSTEPHANOPOULOS: ISIS is gaining strength, aren't they?\nOBAMA: Well, I don't think so they are gaining strength. What is true is that from the start our goal has been first to contain and we have contained them.\n(END VIDEO CLIP)\nO'REILLY: Obviously that's not true. The United States and its allies have not contained ISIS. They are a threat worldwide. They continue to kill people with impunity. Nevertheless, the President is unrepentant and unwilling to admit that his strategy has failed even though some in his own party take exception.\n(BEGIN VIDEO CLIP)\nSEN. DIANNE FEINSTEIN (D), CALIFORNIA: I have never been more concerned. I read the intelligence faithfully. ISIL is not contained. ISIL is expanding. They just put out a video saying it is their intent to attack this country. And I think we have to be prepared.\n(END VIDEO CLIP)\nO'REILLY: We have to be prepared, Senator. So why not back that statement up with action and vote for Kate's Law which punishes alien criminals who defy deportation. It makes the country safer. There are more than a few terrorists in that crew.\nNow back to the President. Even though France says the ISIS attack was an act of war, Mr. Obama not going to change his strategy.\n(BEGIN VIDEO CLIP)\nOBAMA: When we send troops in, those troops get injured. They get killed. They are away from their families. Our country spends hundreds of billions of dollars. It's best that we don't, you know, shoot first and aim later. It's important for us to get the strategy right and the strategy that we are pursuing is the right one.\n(END VIDEO CLIP)\nO'REILLY: How can that possibly be? When ISIS continues to disrupt order all over the world? Simple question. President can't answer it -- doesn't even address it.\nOn the side, the Republican Party is taking note.\n(BEGIN VIDEO CLIP)\nCRUZ: I recognize that Barack Obama does not wish to defend this country. That he may have been tired of war, but our enemies are not tired of killing us and they are getting stronger. Every region on earth has gotten worse under the Obama-Clinton foreign policy.\nSEN. LINDSEY GRAHAM (R-SC), PRESIDENTIAL CANDIDATE: I hope Hillary Clinton, I hope the President will listen to what I'm saying. We don't have until the next election to deal with ISIL. There is a 9/11 coming and it's coming from Syria if we don't disrupt their operations inside of Syria.\n(END VIDEO CLIP)\nO'REILLY: So Republicans now have an opportunity to make a campaign issue out of ISIS. It's clear most Democrats will not stop backing Mr. Obama on the issue.\n(BEGIN VIDEO CLIP)\nJOHN DICKERSON, CBS HOST: Marco Rubio also running for president said that this attack showed and the attack in Paris showed that we're at war with radical Islam. Do you agree with that characterization radical Islam?\nCLINTON: I don't think we're at war with Islam. I don't think we are at war with all Muslims. I think we are at war with jihadists who have --\nDICKERSON: Just to interrupt -- he didn't say all Muslims. He just said radical Islam. Is that a phrase you don't --\nCLINTON: -- I think that you can talk about Islamists who clearly are also jihadists but I think it's -- it's not particularly helpful.\n(END VIDEO CLIP)\nO'REILLY: Gobbledygook. It's just gobbledygook. Number one Hillary Clinton tried to dodge the question by equating all Muslim with radical jihadists. She understood the question she tried to dodge it. A five- year-old would have understood the question.\nNumber two, Mrs. Clinton has no strategy to defeat ISIS -- none.\nEven worse is her competitor Bernie Sanders?\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: In a previous debate you said the greatest threat to national security was climate change. Do you still believe that?\nSEN. BERNIE SANDERS (I-VT), DEMOCRATIC PRESIDENTIAL CANDIDATE: Absolutely. In fact climate change is directly related to the growth of terrorism.\n(END VIDEO CLIP)\nO'REILLY: Senator Sanders just made a fool out of himself so there you go. It's long past time that we the people demand ISIS be defeated not contained. 2006 the organization was formed; 2013 it was named and began to accumulate power.\nInitially President Obama called ISIS the junior varsity. But as the threat grew in ferocity and thousands of miles of territory was seized by ISIS many expected the President to take aggressive action. He did not. Ordering tepid bombing and outsourcing the ground fight to Iran is not aggressive action, Mr. President.\nNow critical mass has been reached as Paris has been devastated.\nOBAMA: Folks want to pop off and have opinions about what they think they would do -- present a specific plan. If they think that somehow their advisors are better than the chairman of my joint chiefs of staff, and the folks who are actually on the ground, I want to meet them.\n(END VIDEO CLIP)\nO'REILLY: Here I am, Mr. President. Here I am. Here is the strategy you should employ immediately. The President of France clearly stated the ISIS attack was an act of war. France is a member of the 28-nation NATO appliance. Article 5 of that alliance says that an attack on one country is an attack on all.\nSo all 28 nations should now begin to organize a campaign to crush the ISIS killers. That should include ground troops, bombings, no-fly zones, border security for Turkey, Jordan, Iraq and a central command and control center based in Europe.\nOnce NATO declares war on ISIS things will radically change. The anti-ISIS Arab nations will step up their participation and the jihadist group will begin to be isolated. No one is calling for an occupation of Syria and Iraq -- that would be foolish but surely, surely 28 nations can launch tactical strikes both on the ground and in the air that will crush these people.\nPresident Obama should take the lead along with France and Great Britain to make all that happen. The first step: a declaration of war on ISIS by NATO.\nFinally, it was quite clear in the President's press conference today that he is very concerned about the refugees fleeing Syria and he should be concerned because it's his fault. When the Syrian dictator Assad used poison gas President Obama threatened the man. You may remember he did not carry out his threat which he could have easily done by destroying the Syrian air force on the ground which was delivering some of the gas.\nThe President's retreat from Syria has caused the massive refugee problem. And remember one of the ISIS killers in Paris apparently posed as a refugee to enter France. Nonetheless, Mr. Obama is quite confident that no terrorists will be among the 10,000 refugees he wants to resettle in America.\nThat of course, is another delusion. And at least 15 states right now have already said they will not accept any refugees at all. Expect that number to grow as more and more Americans finally realize, finally that the President of the United States has lost control of the war on terror.\nAnd that's “The Memo”.", "video_clips": ["STEPHANOPOULOS: ISIS is gaining strength, aren't they?OBAMA: Well, I don't think so they are gaining strength. What is true is that from the start our goal has been first to contain and we have contained them.", "SEN. DIANNE FEINSTEIN (D), CALIFORNIA: I have never been more concerned. I read the intelligence faithfully. ISIL is not contained. ISIL is expanding. They just put out a video saying it is their intent to attack this country. And I think we have to be prepared.", "OBAMA: When we send troops in, those troops get injured. They get killed. They are away from their families. Our country spends hundreds of billions of dollars. It's best that we don't, you know, shoot first and aim later. It's important for us to get the strategy right and the strategy that we are pursuing is the right one.", "CRUZ: I recognize that Barack Obama does not wish to defend this country. That he may have been tired of war, but our enemies are not tired of killing us and they are getting stronger. Every region on earth has gotten worse under the Obama-Clinton foreign policy.SEN. LINDSEY GRAHAM (R-SC), PRESIDENTIAL CANDIDATE: I hope Hillary Clinton, I hope the President will listen to what I'm saying. We don't have until the next election to deal with ISIL. There is a 9/11 coming and it's coming from Syria if we don't disrupt their operations inside of Syria.", "JOHN DICKERSON, CBS HOST: Marco Rubio also running for president said that this attack showed and the attack in Paris showed that we're at war with radical Islam. Do you agree with that characterization radical Islam?CLINTON: I don't think we're at war with Islam. I don't think we are at war with all Muslims. I think we are at war with jihadists who have --DICKERSON: Just to interrupt -- he didn't say all Muslims. He just said radical Islam. Is that a phrase you don't --CLINTON: -- I think that you can talk about Islamists who clearly are also jihadists but I think it's -- it's not particularly helpful.", "UNIDENTIFIED MALE: In a previous debate you said the greatest threat to national security was climate change. Do you still believe that?SEN. BERNIE SANDERS (I-VT), DEMOCRATIC PRESIDENTIAL CANDIDATE: Absolutely. In fact climate change is directly related to the growth of terrorism.", ""], "remaining_transcript": "History will record that the two biggest deficits of the Obama administration were the failure to create a robust economy and the President's retreat from the terrorist battlefield. For years \"Talking Points\" has been telling you the Obama administration has no strategy, none, to defeat the ISIS threat. Random bombing, not going to do it; and every honest military analyst knows it.\nBut President Obama somehow does not seem to understand that the civilized world is losing the fight against ISIS. Just nine hours before the Paris attack, this was broadcast.\nO'REILLY: Obviously that's not true. The United States and its allies have not contained ISIS. They are a threat worldwide. They continue to kill people with impunity. Nevertheless, the President is unrepentant and unwilling to admit that his strategy has failed even though some in his own party take exception.\nO'REILLY: We have to be prepared, Senator. So why not back that statement up with action and vote for Kate's Law which punishes alien criminals who defy deportation. It makes the country safer. There are more than a few terrorists in that crew.\nNow back to the President. Even though France says the ISIS attack was an act of war, Mr. Obama not going to change his strategy.\nO'REILLY: How can that possibly be? When ISIS continues to disrupt order all over the world? Simple question. President can't answer it -- doesn't even address it.\nOn the side, the Republican Party is taking note.\nO'REILLY: So Republicans now have an opportunity to make a campaign issue out of ISIS. It's clear most Democrats will not stop backing Mr. Obama on the issue.\nO'REILLY: Gobbledygook. It's just gobbledygook. Number one Hillary Clinton tried to dodge the question by equating all Muslim with radical jihadists. She understood the question she tried to dodge it. A five- year-old would have understood the question.\nNumber two, Mrs. Clinton has no strategy to defeat ISIS -- none.\nEven worse is her competitor Bernie Sanders?\nO'REILLY: Senator Sanders just made a fool out of himself so there you go. It's long past time that we the people demand ISIS be defeated not contained. 2006 the organization was formed; 2013 it was named and began to accumulate power.\nInitially President Obama called ISIS the junior varsity. But as the threat grew in ferocity and thousands of miles of territory was seized by ISIS many expected the President to take aggressive action. He did not. Ordering tepid bombing and outsourcing the ground fight to Iran is not aggressive action, Mr. President.\nNow critical mass has been reached as Paris has been devastated.\nOBAMA: Folks want to pop off and have opinions about what they think they would do -- present a specific plan. If they think that somehow their advisors are better than the chairman of my joint chiefs of staff, and the folks who are actually on the ground, I want to meet them.\nO'REILLY: Here I am, Mr. President. Here I am. Here is the strategy you should employ immediately. The President of France clearly stated the ISIS attack was an act of war. France is a member of the 28-nation NATO appliance. Article 5 of that alliance says that an attack on one country is an attack on all.\nSo all 28 nations should now begin to organize a campaign to crush the ISIS killers. That should include ground troops, bombings, no-fly zones, border security for Turkey, Jordan, Iraq and a central command and control center based in Europe.\nOnce NATO declares war on ISIS things will radically change. The anti-ISIS Arab nations will step up their participation and the jihadist group will begin to be isolated. No one is calling for an occupation of Syria and Iraq -- that would be foolish but surely, surely 28 nations can launch tactical strikes both on the ground and in the air that will crush these people.\nPresident Obama should take the lead along with France and Great Britain to make all that happen. The first step: a declaration of war on ISIS by NATO.\nFinally, it was quite clear in the President's press conference today that he is very concerned about the refugees fleeing Syria and he should be concerned because it's his fault. When the Syrian dictator Assad used poison gas President Obama threatened the man. You may remember he did not carry out his threat which he could have easily done by destroying the Syrian air force on the ground which was delivering some of the gas.\nThe President's retreat from Syria has caused the massive refugee problem. And remember one of the ISIS killers in Paris apparently posed as a refugee to enter France. Nonetheless, Mr. Obama is quite confident that no terrorists will be among the 10,000 refugees he wants to resettle in America.\nThat of course, is another delusion. And at least 15 states right now have already said they will not accept any refugees at all. Expect that number to grow as more and more Americans finally realize, finally that the President of the United States has lost control of the war on terror.\nAnd that's “The Memo”.\n"}