{"vcmId": "8fa31372-af68-4e14-ae77-c38e703413e4", "url": "http://www.foxnews.com/transcript/2017/01/10/bill-oreilly-kate-law-reintroduced.html", "title": "Bill O'Reilly: Kate's Law reintroduced", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/9", "date": "2017-01-10T13:01:45Z", "full_transcript": "First, the big picture. I believe Donald Trump separated himself from his Republican competitors last year by being very tough on illegal immigration. Mr. Trump made it very clear to the American people that he believes folks entering the USA illegally should be held accountable for that action. He also championed \"Kate's Law,\" which would impose a mandatory minimum five year federal prison term on foreigners convicted of crimes in the USA who reenter after being deported.\n\"Kate's Law\" specifically says that convicted felons are the targets, not chambermaids or farmworkers. As you may know, The Factor came up with this law after 32-year-old Kate Steinle was shot to death, allegedly by an illegal alien felon Juan Francisco Lopez-Sanchez. That man had been deported five times but illegally entered here six times. How could that possibly happen? How could a guy avoid a long prison term defying deportation all those times? It is insane! And America is at fault for allowing it to happen. The toll on the Steinle family is immense.\n(BEGIN VIDEO CLIP)\nJIM STEINLE, FATHER OF KATE STEINLE: The day she was killed, we were walking arm and arm on Pier 14 in San Francisco, enjoying a wonderful day together. Suddenly, a shot rang out. Kate fell. She looked at me and said, \"Help me, Dad.\" Those were the last words I will ever hear from my daughter.\nO'REILLY: The murder trial begins in California February 17th. Also, last Friday, federal judge said to the Steinle family, they are free to sue the U.S. government. The federal government, for general negligence. But the judge did dismiss the claims against San Francisco county. And that is too bad. Now that is why \"Kate's Law\" is needed. No American family should suffer at the hands of convicted foreign felons who defy deportation.\n\"Talking Points\" believes one of the main reasons Donald Trump won the presidency is that he felt outrage over Kate Steinle, while many other politicians, including the entire Democratic Party and President Obama, did not. Even if you are not politically involved, failing to harshly punish foreigners who defy deportation after committing heinous crimes in this country is inexcusable. The government is there to protect we the people, not to look the other way when things like immigration breakdown.\nAnd remember, San Francisco let Sanchez go, let him out of jail, after ICE requested the county hold him. How bad is that? This time around, we can expect \"Kate's Law\" to pass, as the Democrats will have a very hard time blocking it. And that will be a tremendous victory for every American citizen. And that is \"The Memo\".", "video_clips": [], "remaining_transcript": "First, the big picture. I believe Donald Trump separated himself from his Republican competitors last year by being very tough on illegal immigration. Mr. Trump made it very clear to the American people that he believes folks entering the USA illegally should be held accountable for that action. He also championed \"Kate's Law,\" which would impose a mandatory minimum five year federal prison term on foreigners convicted of crimes in the USA who reenter after being deported.\n\"Kate's Law\" specifically says that convicted felons are the targets, not chambermaids or farmworkers. As you may know, The Factor came up with this law after 32-year-old Kate Steinle was shot to death, allegedly by an illegal alien felon Juan Francisco Lopez-Sanchez. That man had been deported five times but illegally entered here six times. How could that possibly happen? How could a guy avoid a long prison term defying deportation all those times? It is insane! And America is at fault for allowing it to happen. The toll on the Steinle family is immense.\n"}