{"vcmId": "a94d4205-1417-49df-ab66-0eb3df861950", "url": "http://www.foxnews.com/transcript/2015/04/27/growing-accusations-corruption-against-hillary-clinton.html", "title": "Growing accusations of corruption against Hillary Clinton", "description": "Overwhelming amount of circumstantial evidence that the former Secretary of State traded favors for donations", "date": "2015-04-27T12:23:55Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" April 24, 2015. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nLet's get right to our top story: growing accusation of corruption against Hillary Clinton. As Talking Points explained last night, there is an overwhelming amount of circumstantial evidence that the former secretary of state may have traded political favors for donations to her family foundation and large speaking fees for her husband.\n(BEGIN VIDEO CLIP)\nO'REILLY: Talking Points believes there is enough evidence of major money flowing to the Clinton Foundation and to the Clintons themselves through lecture fees that an official investigation has to be launched. But I want to make it very clear that the Clintons are to be given the presumption of innocence.\nAs one who has been dishonestly smeared, I loathe political hit jobs. But there are major questions here. And they must, must be answered. No government official should benefit financially while serving the people.\n(END VIDEO CLIP)\nBOLLING: And a Fox News documentary hosted by Bret Baier tonight suggests even good deeds such as help for earthquake ravaged Haiti came with strings attached.\n(BEGIN VIDEO CLIP)\nBRET BAIER, FOX NEWS CHIEF POLITICAL ANCHOR: As Haiti dug itself out of the rubble, many projects were initiated, often with U.S. money and a connection to the Clintons. The central question, the question which Schweizer investigated was about how so many of these deals seemed to come back at some point to the Clintons.\nPETER SCHWEIZER, AUTHOR, \"CLINTON CASH\": What quickly became apparent to many people was that if you wanted a contract, if you wanted to do business in Haiti, you had to have relationships with the Clinton -- that was absolutely key.\n(END VIDEO CLIP)\nBOLLING: The Clinton machine has been predictably out in force trying to defend Hillary.\n(BEGIN VIDEO CLIP)\nBILL ALLISON, CLINTON FOUNDATION: There is no smoking gun. There is no evidence that she changed the policy based on the donations to the foundation.\nSTEPHANIE SCHRIOCK, EMILY'S LIST: I think what we're dealing with is a really big bureaucratic organization. I think this book, again, has been full of a lot of already discredited pieces. And I think that's more and more going to come out. What I think we have to remember here is that this is not what the voters in this country are looking for in this campaign.\nJAMES CARVILLE, DEMOCRATIC STRATEGIST: If somebody wants to make something that the foundation is readjusted a tax return, who knows. And I think the thing is like $2 billion. I wouldn't be surprised if there is an accounting glitch somewhere. How would I know?\n(END VIDEO CLIP)\nBOLLING: But even the liberal \"New York Times\" says it's time for Hillary to come clean writing today, quote, \"The increasing scrutiny of the foundation has raised several points that need to be addressed by Mrs. Clinton and the former president. The only plausible answer is full and complete disclosure of all sources of money going to the foundation.\"\nSo, is it time for the Clintons to come clean? Joining me now from Washington is Richard Goodstein a Democratic strategist and former adviser to Hillary Clinton; and Simon Rosenberg a former advisor to President Bill Clinton and the founder of NDN.\nRichard -- first to you -- you were an advisor of Hillary Clinton. You know, first of all, the two of you guys, I feel bad. I don't know how you are going to do this. You have to defend this -- these scandals keep getting bigger and bigger. I'm under the impression that this is a sweater with so many snags in it one of these snags is just going to unravel the whole thing.\nRichard -- why is this not as big as I think it is and a lot of people do?\nRICHARD GOODSTEIN, FORMER HILLARY CLINTON ADVISER: Well let's see. Here to start. First, I won't talk about discrediting the author. I know people have talked about his ties to Bush and Palin --\nBOLLING: Stay on Hillary. Stay on Hillary.\nGOODSTEIN: Ok. I'm just saying let's put that aside.\nThe fact of the matter is as you heard in the segment you just ran, there has not been a single fact, tons of speculation, great, but not a single fact that traces any of her behavior to anything that anybody on the outside did or indeed anything involving this whole Russian uranium deal at all.\nIndeed, the assistant secretary of state who was assigned to handle this said that he never heard from Hillary once. This was a multi-agency project that she just wasn't involved. Yes --\nBOLLING: Richard, Digicel, a cellular company made somewhere around $50 million doing Haiti work. Then it's O'Brien who ran Digicel, started Digicel, set up speeches for Bill Clinton and dropped millions of dollars into Clinton Foundation.\nGOODSTEIN: Right.\nBOLLING: Hold on, one more. DCS Mining, new to the mining game, got mining contracts in Haiti and Hillary Clinton's brother was put on the board of that mining company. Mind you, they are new to that business. You may say there is no shred of evidence but I look at it as saying it's a big pile, a big mound of evidence.\nGOODSTEIN: Listen, there are good reasons that big global companies were donating to the Clinton Foundation because they, like others, want to tackle malaria, AIDS, climate change, disaster relief. There is a reason that they like having Bill Clinton speak to them because he spoke to those issues, too.\nBOLLING: The timing.\nGOODSTEIN: If you're critical --\nBOLLING: The timing of all this --\nGOODSTEIN: No, no, no, if you're critical --\nBOLLING: -- stuff, Richard. The timing -- they are dropping money into the Clinton Foundation as these deals were struck or just after the deals were struck. I have a whole list of them.\nLet me get to Simon for a second. Simon, London group, they're investigated for human rights violations in the Congo under Senator Obama and Senator Clinton's legislation. Senator Clinton became Secretary of State Clinton she looked the other way on her own legislation with this group, this London group.\nGuess what happens when she announces she wants to run for president in 2008. Do you know what happened? They dropped $100 million into the Clinton Foundation.\nSIMON ROSENBERG, FORMER CLINTON ADVISOR: Well, look, I think that Richard covered some of the topics but I think the Clintons are going to have to do as the \"New York Times\" suggested far more in the coming weeks to assuage people that nothing improper happened during her time as secretary of state. I don't think that the initial defense has been overwhelmingly convincing.\nThere is a lot of stuff kicking around out there. I think if they think they're going to make this go away by taking one of these at a time, I don't think that's going to happen. They're going to have to do far more than they have to make sure -- the \"New York Times\" has offered one idea, there is lots of other ideas out there to make sure that they say to the American people definitively that nothing improper happened.\nIf that doesn't happen it's going to clearly affect her candidacy.\nBOLLING: Simon, you can say all they want. But you know, the only way you really put a nail in this coffin so to speak is by getting those e- mails to find out what happened.\nNow we're going to talk a little bit in the next block about when we try -- how we try to get e-mails and sometimes it doesn't work out.\nRichard, take a listen to Marie Harf at the State Department. Remember Josh Earnest all over TV over the last couple of days has said don't talk to us, White House, about what went on during the Clinton era that the Hillary secretary of state era. Talk to the State Department -- they were the ones who she ran, she oversaw the State Department.\nLook what happens when you ask the State Department about Hillary Clinton.\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: These specific donations that the \"New York Times\" reported about yesterday were not required to be disclosed by the memorandum?\nMARIE HARF, STATE DEPARTMENT SPOKESPERSON: That's certainly my understanding.\nUNIDENTIFIED MALE: Can you explain why that is?\nHARF: I'm happy to check on some more information on that. I'm happy to check.\nUNIDENTIFIED MALE: You don't know why --\nHARF: I'm happy to check. If I knew why, I would tell you. I'm happy to check.\n(END VIDEO CLIP)\nBOLLING: A little snippy there. Right, Richard?\nGOODSTEIN: You know, I'm friends with Simon and I agree with him on almost everything but here is where I disagree a little bit. John Podesta was quoted as saying to donors, the Clintons are used to taking this incoming -- this will not stop. If all she did, all she spent her time doing was talking about all the stuff coming in that utterly unsubstantiated, ok? That's all she would be doing.\nThe voters out there -- let me tell you the evidence that what she is doing is right. Republicans spent two weekends ago in New Hampshire bashing Hillary. Hillary has been out there talking about problems that are facing every day voters. Guess what? In the Fox News poll itself from the month ago to now, her standing is better against Rubio, Paul, Christie. And the Fox News poll actually has her up half as much as the Real Clear Politics.\nBOLLING: But it's sliding. She's definitely losing --\nGOODSTEIN: She's doing fine.\nBOLLING: -- she's losing ground.\nGOODSTEIN: No, she is not.\nBOLLING: Simon, it's one thing when it's a former president or it's a secretary of state and you're trying to, I don't know, buy favor or get some political influence. But it's another thing completely when that person wants to be the most powerful human being on the planet. There is a lot of influence to peddle if she becomes president.\nROSENBERG: Yes. I mean, look, she is the most likely person in the country to become the President. She is far ahead in the polls. She has no primary opposition right now. There hasn't really been a figure on the national stage like this since Eisenhower running for president. I think it's -- and because she has no opposition all the media is now focused on her.\nThis has come very quickly. It's clear that they were not totally prepared, frankly, for what's going on. And they have got to get out in front of this. And I think what I said earlier was they have got to make it clear to the American people, not to you and those of us watching tonight, but the American people that nothing improper happened. If she can do that, she can become the President. If she fails at that it's going to affect her candidacy.\nBOLLING: We need to leave it there. We're going to talk a lot more about this the rest of the show. Simon and Richard -- thank you very much.\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": ["O'REILLY: Talking Points believes there is enough evidence of major money flowing to the Clinton Foundation and to the Clintons themselves through lecture fees that an official investigation has to be launched. But I want to make it very clear that the Clintons are to be given the presumption of innocence.As one who has been dishonestly smeared, I loathe political hit jobs. But there are major questions here. And they must, must be answered. No government official should benefit financially while serving the people.", "BRET BAIER, FOX NEWS CHIEF POLITICAL ANCHOR: As Haiti dug itself out of the rubble, many projects were initiated, often with U.S. money and a connection to the Clintons. The central question, the question which Schweizer investigated was about how so many of these deals seemed to come back at some point to the Clintons.PETER SCHWEIZER, AUTHOR, \"CLINTON CASH\": What quickly became apparent to many people was that if you wanted a contract, if you wanted to do business in Haiti, you had to have relationships with the Clinton -- that was absolutely key.", "BILL ALLISON, CLINTON FOUNDATION: There is no smoking gun. There is no evidence that she changed the policy based on the donations to the foundation.STEPHANIE SCHRIOCK, EMILY'S LIST: I think what we're dealing with is a really big bureaucratic organization. I think this book, again, has been full of a lot of already discredited pieces. And I think that's more and more going to come out. What I think we have to remember here is that this is not what the voters in this country are looking for in this campaign.JAMES CARVILLE, DEMOCRATIC STRATEGIST: If somebody wants to make something that the foundation is readjusted a tax return, who knows. And I think the thing is like $2 billion. I wouldn't be surprised if there is an accounting glitch somewhere. How would I know?", "UNIDENTIFIED MALE: These specific donations that the \"New York Times\" reported about yesterday were not required to be disclosed by the memorandum?MARIE HARF, STATE DEPARTMENT SPOKESPERSON: That's certainly my understanding.UNIDENTIFIED MALE: Can you explain why that is?HARF: I'm happy to check on some more information on that. I'm happy to check.UNIDENTIFIED MALE: You don't know why --HARF: I'm happy to check. If I knew why, I would tell you. I'm happy to check."], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" April 24, 2015. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nLet's get right to our top story: growing accusation of corruption against Hillary Clinton. As Talking Points explained last night, there is an overwhelming amount of circumstantial evidence that the former secretary of state may have traded political favors for donations to her family foundation and large speaking fees for her husband.\nBOLLING: And a Fox News documentary hosted by Bret Baier tonight suggests even good deeds such as help for earthquake ravaged Haiti came with strings attached.\nBOLLING: The Clinton machine has been predictably out in force trying to defend Hillary.\nBOLLING: But even the liberal \"New York Times\" says it's time for Hillary to come clean writing today, quote, \"The increasing scrutiny of the foundation has raised several points that need to be addressed by Mrs. Clinton and the former president. The only plausible answer is full and complete disclosure of all sources of money going to the foundation.\"\nSo, is it time for the Clintons to come clean? Joining me now from Washington is Richard Goodstein a Democratic strategist and former adviser to Hillary Clinton; and Simon Rosenberg a former advisor to President Bill Clinton and the founder of NDN.\nRichard -- first to you -- you were an advisor of Hillary Clinton. You know, first of all, the two of you guys, I feel bad. I don't know how you are going to do this. You have to defend this -- these scandals keep getting bigger and bigger. I'm under the impression that this is a sweater with so many snags in it one of these snags is just going to unravel the whole thing.\nRichard -- why is this not as big as I think it is and a lot of people do?\nRICHARD GOODSTEIN, FORMER HILLARY CLINTON ADVISER: Well let's see. Here to start. First, I won't talk about discrediting the author. I know people have talked about his ties to Bush and Palin --\nBOLLING: Stay on Hillary. Stay on Hillary.\nGOODSTEIN: Ok. I'm just saying let's put that aside.\nThe fact of the matter is as you heard in the segment you just ran, there has not been a single fact, tons of speculation, great, but not a single fact that traces any of her behavior to anything that anybody on the outside did or indeed anything involving this whole Russian uranium deal at all.\nIndeed, the assistant secretary of state who was assigned to handle this said that he never heard from Hillary once. This was a multi-agency project that she just wasn't involved. Yes --\nBOLLING: Richard, Digicel, a cellular company made somewhere around $50 million doing Haiti work. Then it's O'Brien who ran Digicel, started Digicel, set up speeches for Bill Clinton and dropped millions of dollars into Clinton Foundation.\nGOODSTEIN: Right.\nBOLLING: Hold on, one more. DCS Mining, new to the mining game, got mining contracts in Haiti and Hillary Clinton's brother was put on the board of that mining company. Mind you, they are new to that business. You may say there is no shred of evidence but I look at it as saying it's a big pile, a big mound of evidence.\nGOODSTEIN: Listen, there are good reasons that big global companies were donating to the Clinton Foundation because they, like others, want to tackle malaria, AIDS, climate change, disaster relief. There is a reason that they like having Bill Clinton speak to them because he spoke to those issues, too.\nBOLLING: The timing.\nGOODSTEIN: If you're critical --\nBOLLING: The timing of all this --\nGOODSTEIN: No, no, no, if you're critical --\nBOLLING: -- stuff, Richard. The timing -- they are dropping money into the Clinton Foundation as these deals were struck or just after the deals were struck. I have a whole list of them.\nLet me get to Simon for a second. Simon, London group, they're investigated for human rights violations in the Congo under Senator Obama and Senator Clinton's legislation. Senator Clinton became Secretary of State Clinton she looked the other way on her own legislation with this group, this London group.\nGuess what happens when she announces she wants to run for president in 2008. Do you know what happened? They dropped $100 million into the Clinton Foundation.\nSIMON ROSENBERG, FORMER CLINTON ADVISOR: Well, look, I think that Richard covered some of the topics but I think the Clintons are going to have to do as the \"New York Times\" suggested far more in the coming weeks to assuage people that nothing improper happened during her time as secretary of state. I don't think that the initial defense has been overwhelmingly convincing.\nThere is a lot of stuff kicking around out there. I think if they think they're going to make this go away by taking one of these at a time, I don't think that's going to happen. They're going to have to do far more than they have to make sure -- the \"New York Times\" has offered one idea, there is lots of other ideas out there to make sure that they say to the American people definitively that nothing improper happened.\nIf that doesn't happen it's going to clearly affect her candidacy.\nBOLLING: Simon, you can say all they want. But you know, the only way you really put a nail in this coffin so to speak is by getting those e- mails to find out what happened.\nNow we're going to talk a little bit in the next block about when we try -- how we try to get e-mails and sometimes it doesn't work out.\nRichard, take a listen to Marie Harf at the State Department. Remember Josh Earnest all over TV over the last couple of days has said don't talk to us, White House, about what went on during the Clinton era that the Hillary secretary of state era. Talk to the State Department -- they were the ones who she ran, she oversaw the State Department.\nLook what happens when you ask the State Department about Hillary Clinton.\nBOLLING: A little snippy there. Right, Richard?\nGOODSTEIN: You know, I'm friends with Simon and I agree with him on almost everything but here is where I disagree a little bit. John Podesta was quoted as saying to donors, the Clintons are used to taking this incoming -- this will not stop. If all she did, all she spent her time doing was talking about all the stuff coming in that utterly unsubstantiated, ok? That's all she would be doing.\nThe voters out there -- let me tell you the evidence that what she is doing is right. Republicans spent two weekends ago in New Hampshire bashing Hillary. Hillary has been out there talking about problems that are facing every day voters. Guess what? In the Fox News poll itself from the month ago to now, her standing is better against Rubio, Paul, Christie. And the Fox News poll actually has her up half as much as the Real Clear Politics.\nBOLLING: But it's sliding. She's definitely losing --\nGOODSTEIN: She's doing fine.\nBOLLING: -- she's losing ground.\nGOODSTEIN: No, she is not.\nBOLLING: Simon, it's one thing when it's a former president or it's a secretary of state and you're trying to, I don't know, buy favor or get some political influence. But it's another thing completely when that person wants to be the most powerful human being on the planet. There is a lot of influence to peddle if she becomes president.\nROSENBERG: Yes. I mean, look, she is the most likely person in the country to become the President. She is far ahead in the polls. She has no primary opposition right now. There hasn't really been a figure on the national stage like this since Eisenhower running for president. I think it's -- and because she has no opposition all the media is now focused on her.\nThis has come very quickly. It's clear that they were not totally prepared, frankly, for what's going on. And they have got to get out in front of this. And I think what I said earlier was they have got to make it clear to the American people, not to you and those of us watching tonight, but the American people that nothing improper happened. If she can do that, she can become the President. If she fails at that it's going to affect her candidacy.\nBOLLING: We need to leave it there. We're going to talk a lot more about this the rest of the show. Simon and Richard -- thank you very much.\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n"}