{"vcmId": "b35e00af-468b-42b4-9e56-bf554822d44a", "url": "http://www.foxnews.com/transcript/2016/02/26/is-donald-trump-inevitable-republican-nominee.html", "title": "Is Donald Trump the inevitable Republican nominee?", "description": "'The O'Reilly Factor' examines the presidential candidate's tightening grip on the GOP nomination", "date": "2016-02-26T13:15:52Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" February 25, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nERIC BOLLING, FOX NEWS ANCHOR: Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching the special edition of The O'Reilly Factor \"Election 2016.\"\nLet's get the right to our top story. Is Donald Trump now the inevitable Republican nominee? Super Tuesday is just five days away and Trump's two biggest rivals, Senator Ted Cruz and Senator Marco Rubio are firing everything they have got to try to stop him.\n(BEGIN VIDEO CLIP)\nSEN. TED CRUZ (R-TX), PRESIDENTIAL CANDIDATE: We can't be fooled by P.T. Barnum.\n(CHEERS AND APPLAUSE)\nThe time for the clowns and the acrobats and the dancing bears has passed.\n(CHEERS AND APPLAUSE)\nSEN. MARCO RUBIO (R-FL), PRESIDENTIAL CANDIDATE: Trump has actually alluded to the fact that he thinks parts of ObamaCare are pretty good.\n(CROWD BOOING)\nI can tell you everybody running for president tells you, I want to get rid of ObamaCare. I want to get -- I'm the only one that's ever done anything about it meaningful.\n(END VIDEO CLIP)\nBOLLING: Meanwhile, Bill O'Reilly put it this way last night about Trump's tightening grip on the G.O.P. nomination.\n(BEGIN VIDEO CLIP)\nBILL O'REILLY, FOX NEWS HOST, \"THE O'REILLY FACTOR\": In the end Donald Trump doesn't care about politics. He doesn't care about parties. He does not care about elites. He does not care what he says in attacking opponent. He only cares about one thing. Winning.\n(END VIDEO CLIP)\nBOLLING: Joining us now with reaction from Nashville, the Tea Party News network Scottie Nell Hughes and with me in studio Kellyanne Conway, the head of a pro-Ted Cruz Super PAC.\nAll right. Let me start with you Kelly, and you are here right here in the studio. So, people have said, what have you guys -- what have you been waiting for now you are finally going after Donald Trump? Do you like the way it's working out?\nKELLYANNE CONWAY, REPUBLICAN POLLSTER AND STRATEGIST: Well, Senator Cruz is taking on Donald Trump himself as is the campaign. At our Super PAC, we are still bolstering Senator Cruz's image through filling in the blanks of his career before he got to the Senate.\nBOLLING: What are you waiting for?\nCONWAY: No, and --\n(CROSSTALK)\nBOLLING: Got to go, time is running out. There's five days before Super Tuesday.\nCONWAY: Right. Well --\nBOLLING: Six hundred delegates are going to go on Super Tuesday and you still filling out his career?\nCONWAY: No, no, no, no, no. Let me start over here, Eric. We have been running as many about Senator Rubio, something about Mr. Trump and many about Senator Cruz. But the question of is, is he inevitable? Of course he is not. Five percent of all delegates have already been cast. Only 133 have been awarded, there will be over 2500 that are eventually rewarded. Let's not be disrespectful to all of the voters except for these first four states that have cast ballots and deprive them of their voice in choosing their nominee. Mr. Trump is prohibitive frontrunner at this moment. That he is in no way inevitable. I think if Senator Cruz gets Mr. Trump to himself, then you're going to have the two anti-establishment outsiders.\nBOLLING: So, you're calling for Rubio to drop out?\nCONWAY: Well, sure, he said, he can't win anything in Florida and Trump is beating him by 16 points today.\nBOLLING: So Scottie, Donald Trump is looking at Senator Cruz and Senator Rubio taking shots at each other, beating each other senseless and saying, you know, I'm all right with this because I keep winning states. Is Donald Trump the inevitable?\nSCOTTIE NELL HUGHES, TEA PARTY NEWS NETWORK: He is the inevitable. I mean, I agree. Let's not look past the upcoming states. I'm in a state that is voting on Tuesday. But guess what, in my state, in almost every single state, Mr. Trump is winning, he's ahead of the polls by double digits in almost every single state. And now, according to the latest Dallas ABC poll, he is tied with Senator Cruz at 32 percent.\nListen, Texas is one of the odd states that you have to be above 50 percent of the vote counts and then you get 100 percent of the delegates. Senator Cruz is a far away point from that and he only said that he needed to win South Carolina. He did not win a single county in there. That what was he was hoping to beat, his Bill Clinton moment that would sweep him into the south. That would get the momentum going for the rest of the country. It hasn't started and it doesn't look like it has any chance or of even starting at this point.\nBOLLING: Kellyanne, I do the math. I look at these things. I do the delegate math and it comes down to and Scottie Nell points this out, does Senator Cruz not only take Texas but take a lot, it's a proportional state, if he doesn't take a vast majority of Texas. I can't see a path to the nomination.\nCONWAY: Why? There are other states voting that day. Arkansas, Georgia - -\nBOLLING: And Trump has a lead --\nCONWAY: And he's not leading in any of them.\nBOLLING: He has a big lead in almost -- in 12 of the 14 states and territories that are going to vote.\nCONWAY: Right. No doubt. Well, I'm going to respect the right of the citizens in the state to cast their ballots and show their preferences on Tuesday. There is another poll just to correct the record -- there is another poll out today that shows Senator Cruz leading Mr. Trump by -- there's a Monmouth poll that says Mr. Trump only likes to quote the Monmouth poll. The Monmouth poll shows Cruz leading Trump in Texas by 15 points. Senator Cruz has the best chance of winning his home state when you compare him to Rubio and Kasich. Rubio is losing by 16 points to Mr. Trump.\nKasich is behind in Ohio. So, that's why I think the two anti- establishment, anti-Washington outsider candidate and Trump and Cruz will do very well on Super Tuesday. That's a 155 delegates. From the last couple days of Senator Cruz must win Texas or he's done to now he has said the vast majority. He's also competing in other states. We'll get his public schedule. He'll be in five or six of the states between now and Tuesday. He is competing in many Super Tuesday states. As opposed to Senator Rubio who should just drop out and let Cruz and Trump really battle it out. Why? He was asked what state can you win and he says, oh, Florida on March 15th. So, we're going to skip. All of Super Tuesday. The first four contests in February, March 5th contest, March 8th contest, until Rubio can find a state he can win. That's not a winner.\nBOLLING: So, go ahead Scottie Nell, the Cruz campaign would love to see the Rubio campaign drop out but it didn't seem like Rubio is dropping.\nHUGHES: Absolutely. No, they're not. And actually we can talk to people. You know, Marco Rubio is having some really good momentum in some of these states, including my own. But it's still not enough. While you, Kellyanne are sitting here looking at these states that are coming up on Tuesday and just like praying that something will change and uphold --\nCONWAY: I'm not praying.\nHUGHES: Well, you have to be doing something. Because after you saw the Cruz campaign, he is not going to attend an event in Alabama on Saturday morning. He is going to Texas. You are hearing things of, most all of his work is going into Texas. His home state which by the way he should be blowing out every single poll but he is not. It reminds me a little bit of Al Gore in Tennessee when he lost this states. But instead you've got Mr. Trump being asked about, who do you want as your vice presidential candidate to run with you? That right there shows where the American people have moved on. I'm waiting for the Cruz campaign to kind of get the hint and instead of maybe -- instead of continuing to divide our conservative movement, they will start speaking positively about uniting us and going against Hillary and Bernie.\nCONWAY: Well, uniting us and so all these personal insults against Senator Cruz is supposed to then lead to uniting us. But let me just say --\nHUGHES: You just had a communication director that have to resign.\nCONWAY: Bill Clinton lost first four contests in 1992.\n(CROSSTALK)\nHUGHES: -- throw that mud at Mr. Trump.\nBOLLING: Scottie, hold on. Go ahead, Bill Clinton, what?\nCONWAY: Bill Clinton lost the first four contest in 1992. His first win was on Super Tuesday in Georgia. He went on to be the democratic nominee and a two term president. So, the entire point is, we don't disrespect people and vote in states that haven't voted yet. We are not going to choose a nominee base on four states. One of which --\nBOLLING: Kellyanne, I'm doing the math. I'm doing the math.\nCONWAY: Should we just hang it up now?\nBOLLING: Well, let me do this way.\nCONWAY: These sounds like the Jeb Bush people --\n(CROSSTALK)\nBOLLING: No, no, no, no. Listen I've seen this on FOX.\nCONWAY: We're inevitable. Hillary is inevitable.\nBOLLING: I have said this on FOX for a long time. The only way you compete against Donald Trump at this stage of the game, there are two things in politics that is momentum and time. Trump has the momentum. You guys are running out of time. Everyone, if you want to compete has to get behind one non-Trump candidate. Who is it going to be? Doesn't seem like you want --\nHUGHES: Ted Cruz.\nCONWAY: Marco Rubio says, he can't win anywhere. But you rather be Ted Cruz than Donald Trump, Scottie as a head of a Tea Party Network.\nHUGHES: Well, no, actually I agree that it could be all three of them. All three. You know, the truth is though --\n(CROSSTALK)\nIt doesn't matter whether Cruz or Rubio. We're winning. That's the point. You guys have\n(CROSSTALK)\nCONWAY: Mr. Trump who I know well, why isn't he at 50 percent, 55 percent. If people really want --\nHUGHES: You know, what? If you said he wasn't -- you said he wasn't going to get 25 percent. You know what Kelly, do yourself, your present self a favor, start helping to unite the party instead of and that will help the party --\nCONWAY: United against Hillary and you know it.\nBOLLING: All right. I need to leave it right there, ladies. Thank you so much.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": ["SEN. TED CRUZ (R-TX), PRESIDENTIAL CANDIDATE: We can't be fooled by P.T. Barnum.(CHEERS AND APPLAUSE)The time for the clowns and the acrobats and the dancing bears has passed.(CHEERS AND APPLAUSE)SEN. MARCO RUBIO (R-FL), PRESIDENTIAL CANDIDATE: Trump has actually alluded to the fact that he thinks parts of ObamaCare are pretty good.(CROWD BOOING)I can tell you everybody running for president tells you, I want to get rid of ObamaCare. I want to get -- I'm the only one that's ever done anything about it meaningful.", "BILL O'REILLY, FOX NEWS HOST, \"THE O'REILLY FACTOR\": In the end Donald Trump doesn't care about politics. He doesn't care about parties. He does not care about elites. He does not care what he says in attacking opponent. He only cares about one thing. Winning."], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" February 25, 2016. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nERIC BOLLING, FOX NEWS ANCHOR: Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching the special edition of The O'Reilly Factor \"Election 2016.\"\nLet's get the right to our top story. Is Donald Trump now the inevitable Republican nominee? Super Tuesday is just five days away and Trump's two biggest rivals, Senator Ted Cruz and Senator Marco Rubio are firing everything they have got to try to stop him.\nBOLLING: Meanwhile, Bill O'Reilly put it this way last night about Trump's tightening grip on the G.O.P. nomination.\nBOLLING: Joining us now with reaction from Nashville, the Tea Party News network Scottie Nell Hughes and with me in studio Kellyanne Conway, the head of a pro-Ted Cruz Super PAC.\nAll right. Let me start with you Kelly, and you are here right here in the studio. So, people have said, what have you guys -- what have you been waiting for now you are finally going after Donald Trump? Do you like the way it's working out?\nKELLYANNE CONWAY, REPUBLICAN POLLSTER AND STRATEGIST: Well, Senator Cruz is taking on Donald Trump himself as is the campaign. At our Super PAC, we are still bolstering Senator Cruz's image through filling in the blanks of his career before he got to the Senate.\nBOLLING: What are you waiting for?\nCONWAY: No, and --\n(CROSSTALK)\nBOLLING: Got to go, time is running out. There's five days before Super Tuesday.\nCONWAY: Right. Well --\nBOLLING: Six hundred delegates are going to go on Super Tuesday and you still filling out his career?\nCONWAY: No, no, no, no, no. Let me start over here, Eric. We have been running as many about Senator Rubio, something about Mr. Trump and many about Senator Cruz. But the question of is, is he inevitable? Of course he is not. Five percent of all delegates have already been cast. Only 133 have been awarded, there will be over 2500 that are eventually rewarded. Let's not be disrespectful to all of the voters except for these first four states that have cast ballots and deprive them of their voice in choosing their nominee. Mr. Trump is prohibitive frontrunner at this moment. That he is in no way inevitable. I think if Senator Cruz gets Mr. Trump to himself, then you're going to have the two anti-establishment outsiders.\nBOLLING: So, you're calling for Rubio to drop out?\nCONWAY: Well, sure, he said, he can't win anything in Florida and Trump is beating him by 16 points today.\nBOLLING: So Scottie, Donald Trump is looking at Senator Cruz and Senator Rubio taking shots at each other, beating each other senseless and saying, you know, I'm all right with this because I keep winning states. Is Donald Trump the inevitable?\nSCOTTIE NELL HUGHES, TEA PARTY NEWS NETWORK: He is the inevitable. I mean, I agree. Let's not look past the upcoming states. I'm in a state that is voting on Tuesday. But guess what, in my state, in almost every single state, Mr. Trump is winning, he's ahead of the polls by double digits in almost every single state. And now, according to the latest Dallas ABC poll, he is tied with Senator Cruz at 32 percent.\nListen, Texas is one of the odd states that you have to be above 50 percent of the vote counts and then you get 100 percent of the delegates. Senator Cruz is a far away point from that and he only said that he needed to win South Carolina. He did not win a single county in there. That what was he was hoping to beat, his Bill Clinton moment that would sweep him into the south. That would get the momentum going for the rest of the country. It hasn't started and it doesn't look like it has any chance or of even starting at this point.\nBOLLING: Kellyanne, I do the math. I look at these things. I do the delegate math and it comes down to and Scottie Nell points this out, does Senator Cruz not only take Texas but take a lot, it's a proportional state, if he doesn't take a vast majority of Texas. I can't see a path to the nomination.\nCONWAY: Why? There are other states voting that day. Arkansas, Georgia - -\nBOLLING: And Trump has a lead --\nCONWAY: And he's not leading in any of them.\nBOLLING: He has a big lead in almost -- in 12 of the 14 states and territories that are going to vote.\nCONWAY: Right. No doubt. Well, I'm going to respect the right of the citizens in the state to cast their ballots and show their preferences on Tuesday. There is another poll just to correct the record -- there is another poll out today that shows Senator Cruz leading Mr. Trump by -- there's a Monmouth poll that says Mr. Trump only likes to quote the Monmouth poll. The Monmouth poll shows Cruz leading Trump in Texas by 15 points. Senator Cruz has the best chance of winning his home state when you compare him to Rubio and Kasich. Rubio is losing by 16 points to Mr. Trump.\nKasich is behind in Ohio. So, that's why I think the two anti- establishment, anti-Washington outsider candidate and Trump and Cruz will do very well on Super Tuesday. That's a 155 delegates. From the last couple days of Senator Cruz must win Texas or he's done to now he has said the vast majority. He's also competing in other states. We'll get his public schedule. He'll be in five or six of the states between now and Tuesday. He is competing in many Super Tuesday states. As opposed to Senator Rubio who should just drop out and let Cruz and Trump really battle it out. Why? He was asked what state can you win and he says, oh, Florida on March 15th. So, we're going to skip. All of Super Tuesday. The first four contests in February, March 5th contest, March 8th contest, until Rubio can find a state he can win. That's not a winner.\nBOLLING: So, go ahead Scottie Nell, the Cruz campaign would love to see the Rubio campaign drop out but it didn't seem like Rubio is dropping.\nHUGHES: Absolutely. No, they're not. And actually we can talk to people. You know, Marco Rubio is having some really good momentum in some of these states, including my own. But it's still not enough. While you, Kellyanne are sitting here looking at these states that are coming up on Tuesday and just like praying that something will change and uphold --\nCONWAY: I'm not praying.\nHUGHES: Well, you have to be doing something. Because after you saw the Cruz campaign, he is not going to attend an event in Alabama on Saturday morning. He is going to Texas. You are hearing things of, most all of his work is going into Texas. His home state which by the way he should be blowing out every single poll but he is not. It reminds me a little bit of Al Gore in Tennessee when he lost this states. But instead you've got Mr. Trump being asked about, who do you want as your vice presidential candidate to run with you? That right there shows where the American people have moved on. I'm waiting for the Cruz campaign to kind of get the hint and instead of maybe -- instead of continuing to divide our conservative movement, they will start speaking positively about uniting us and going against Hillary and Bernie.\nCONWAY: Well, uniting us and so all these personal insults against Senator Cruz is supposed to then lead to uniting us. But let me just say --\nHUGHES: You just had a communication director that have to resign.\nCONWAY: Bill Clinton lost first four contests in 1992.\n(CROSSTALK)\nHUGHES: -- throw that mud at Mr. Trump.\nBOLLING: Scottie, hold on. Go ahead, Bill Clinton, what?\nCONWAY: Bill Clinton lost the first four contest in 1992. His first win was on Super Tuesday in Georgia. He went on to be the democratic nominee and a two term president. So, the entire point is, we don't disrespect people and vote in states that haven't voted yet. We are not going to choose a nominee base on four states. One of which --\nBOLLING: Kellyanne, I'm doing the math. I'm doing the math.\nCONWAY: Should we just hang it up now?\nBOLLING: Well, let me do this way.\nCONWAY: These sounds like the Jeb Bush people --\n(CROSSTALK)\nBOLLING: No, no, no, no. Listen I've seen this on FOX.\nCONWAY: We're inevitable. Hillary is inevitable.\nBOLLING: I have said this on FOX for a long time. The only way you compete against Donald Trump at this stage of the game, there are two things in politics that is momentum and time. Trump has the momentum. You guys are running out of time. Everyone, if you want to compete has to get behind one non-Trump candidate. Who is it going to be? Doesn't seem like you want --\nHUGHES: Ted Cruz.\nCONWAY: Marco Rubio says, he can't win anywhere. But you rather be Ted Cruz than Donald Trump, Scottie as a head of a Tea Party Network.\nHUGHES: Well, no, actually I agree that it could be all three of them. All three. You know, the truth is though --\n(CROSSTALK)\nIt doesn't matter whether Cruz or Rubio. We're winning. That's the point. You guys have\n(CROSSTALK)\nCONWAY: Mr. Trump who I know well, why isn't he at 50 percent, 55 percent. If people really want --\nHUGHES: You know, what? If you said he wasn't -- you said he wasn't going to get 25 percent. You know what Kelly, do yourself, your present self a favor, start helping to unite the party instead of and that will help the party --\nCONWAY: United against Hillary and you know it.\nBOLLING: All right. I need to leave it right there, ladies. Thank you so much.\nContent and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n"}