{"vcmId": "c8ebb6b9-207c-4599-bb4a-5523b9bf6f93", "url": "http://www.foxnews.com/transcript/2016/05/11/bill-oreilly-how-partisans-are-covering-trump-clinton-race.html", "title": "Bill O'Reilly: How partisans are covering the Trump-Clinton race ", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 5/10", "date": "2016-05-11T12:17:29Z", "full_transcript": "Donald Trump will be with us shortly. But no matter what I say to him, or he says to me, anti-Trump people will condemn the interview unless I call him a racist, sexist or any other -ist the far left embraces.\nBut it's not only crazy liberals who are distorting the Presidential race. Writing in \"The Hill\" newspaper a guy named Matt Mackowiak, who formerly worked for President Bush the Younger says that I, your humble correspondent, worship at the altar of Trump. Who knew?\n(BEGIN VIDEO CLIP)\nO'REILLY: Do you get mad at guys like me when I ask you the negative questions?\nTRUMP: Well no, I think you have become very negative. I do think --\nO'REILLY: Me?\nTRUMP: Yes. I think --\nO'REILLY: Why? Why would I do that?\nTRUMP: I don't know. Who knows? You will have to ask your psychiatrist. But I think you have become very negative.\nO'REILLY: Toward you?\nTRUMP: Yes.\nO'REILLY: Mr. Trump's disenchantment back in March was echoed by just about every other candidate at one time or another because we ask the toughest questions we can think of here on The Factor. It's clear \"The Hill\" newspaper needs to reevaluate its columnists that is if it values honesty at all.\nNow, the reason for this garbage is hatred. For example, if you are not willing to convict Hillary Clinton of crimes over the email situation, then you are not worthy, even though only the FBI knows what the evidence will show. Also, if you make true statements about the candidates, you will be attacked because partisans don't want to hear the truth.\nHere's what Mr. Bernie wants to do. Destroy Wall Street and the big banks. Provide each American with free healthcare, kind of. List of Sanders' freebies is endless. The unintended consequences are simple -- a bankrupt nation. The nearly 20 trillion-dollar debt would double under a Sanders administration.\nNow, after I said that, condemnation rolled in. But yesterday as reported in \"The Washington Post\", two new studies show that Bernie Sanders would run up $18 trillion, with a \"t\", dollars in debt over a decade with all his endless entitlements.\nSo once again I told the truth and got hammered for it but read my lips, I don't care. There is blatant dishonesty in the partisan ranks. Unfortunately, they have access to the media and they can spew their garbage without challenge.\nShame on you, \"Hill\" newspaper and shame on you rank partisans.\nAnd that's “The Memo”.", "video_clips": [], "remaining_transcript": "Donald Trump will be with us shortly. But no matter what I say to him, or he says to me, anti-Trump people will condemn the interview unless I call him a racist, sexist or any other -ist the far left embraces.\nBut it's not only crazy liberals who are distorting the Presidential race. Writing in \"The Hill\" newspaper a guy named Matt Mackowiak, who formerly worked for President Bush the Younger says that I, your humble correspondent, worship at the altar of Trump. Who knew?\n"}