{"vcmId": "e7db8e83-9e0f-40d2-8b65-0d1031d53448", "url": "http://www.foxnews.com/transcript/2014/10/15/another-embarrassing-moment-for-susan-rice.html", "title": "Another embarrassing moment for Susan Rice", "description": "Charles Krauthammer weighs in on the national security advisor misleading the public on ISIS", "date": "2014-10-15T12:37:09Z", "full_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" October 14, 2014. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nIn \"Back of the Book\" segment tonight, another embarrassing moment for Susan Rice, one of President Obama's top National Security people.\nIf you remember, it was Ms. Rice who told the world the Benghazi assassination of American ambassador, Christopher Stevens in Libya was caused by a videotape. And that was false.\nNow, she's saying that the Turkish government has committed to help fight ISIS.\n(BEGIN VIDEO CLIP)\nSUSAN RICE, NATIONAL SECURITY ADVISOR: The Turks have -- this just in the last several days -- made a commitment that they will, in the first instance, allow the United States and our partners to use Turkish bases and territory.\nThat's a new commitment and one that we very much welcome.\n(END VIDEO CLIP)\nO'REILLY: One problem, it's not true. The Turks say no deal has been made.\n(BEGIN VIDEO CLIP)\nCHARLES KRAUTHAMMER, FOX NEWS CONTRIBUTOR: This is really unbelievable that she could say that and then Turkey denies it. I don't know how they're going to explain it.\nObama is simply not serious about this war. Why would you join a war where the leader of the coalition is not serious --\n(END VIDEO CLIP)\nO'REILLY: All right, joining us now from Washington, Charles Krauthammer. So, it really is unbelievable -- that's the word you used -- that Ambassador Rice would once again go out on national television and say something that's not true.\nIt can't be that they have a little meeting and say, \"What lie are we going to tell today.\" They can't be doing that. So, what do you think it is.\nKRAUTHAMMER: Look, I have a little advice for Ambassador Rice. She could be the best advisor Obama has ever had. She could be an --\n(BEGIN VIDEO CLIP)\n-- international strategist of Kissingerian proportions. But she shouldn't go on television. It just doesn't work.\nIt is totally inexplicable that the National Security Advisor whose job it is to be the --\n(END VIDEO CLIP)\n-- conduit of all information coming from the various foreign policy agencies, the one that coordinate and consolidate all of that should go out on television, announce to the world this very crucial agreement. And then, within hours, have the Turks say it's not true.\nIt's not just that it's not true, it's also that, now, we have a dispute with the Turks over what she said rather than negotiating the details of some cooperation between us.\nThat it should have happened at this level is truly inexplicable. I think you're right, it couldn't be a deliberate lie because there's no advantage in it.\nO'REILLY: Right.\nKRAUTHAMMER: It's not going to help negotiations. It's not going to bully the Turks into saying yes. It obviously is a mistake but it is a monumental one.\nAnd that it should happen in the middle of a war at this high level is truly remarkable.\nO'REILLY: You know what I think it is. It all goes back to what we've discussed in the past. There is a lack of leadership.\nThere is not anyone in charge. I don't believe President Obama is in charge of the ISIS conflict.\nI believe he farms it out to other people. He obviously doesn't have the stomach for it, all right.\n(BEGIN VIDEO CLIP)\nSo, there's like five, six people running around, \"Ooh, look at this. Look what we've got. Look what happened today. We blew up a truck,\" tut tut tut -- you know, there's no central force. There's no organizational capacity to get any message out almost about anything.\nYou can just go down the list of major issues. Look at Ebola. Look at this guy coming out and one day he sees one thing, the next day he sees the other thing. We still don't know what Mukpo -- how he got it in Omaha.\nIt's just there isn't any leadership. That's what it is.\nKRAUTHAMMER: Well, regarding Iraq, this is not new. The most crucial decision Obama made on Iraq, the full withdrawal at the end of 2011 on the eve of his reelection. That, he was relatively uninvolved.\nBush, for all of his faults, was very deeply involved, particularly at the time of the surge, in making the decision, in going ahead with it. When it came to withdraw from Iraq, Obama, as you said, he farmed it out.\nO'REILLY: Right.\nKRAUTHAMMER: This was a decision that had to be done at a presidential level. It had to have been a head of state in Iraq or negotiating with a head of state here. That's not how it was done. And, in the end, it fell apart.\nO'REILLY: Right. You know, look, I'm president and I say to the Iraqi president who has given us a hard time, Maliki, about keeping troops there.\nI'll say, \"You know what, President Maliki -- Prime Minister Maliki, with all due respect, we're going to keep 10,000 troops there. And if you prosecute one of them, all right, we will have a -- we will have a problem that you will not survive.\"\nI would threaten the man directly and tell him, \"You don't touch one of our guys. We're keeping 10,000 there and you don't touch them.\" That's it. That's how you lead.\nKRAUTHAMMER: Bill, that's OK but it was unnecessary. Every major faction in Iraq wanted the U.S. to stay.\nO'REILLY: Except Maliki.\nKRAUTHAMMER: No. Maliki did. He absolutely did. We insisted that he had to go to parliament. And he said, \"Leave the procedures to us. I'm not going to go to parliament.\"\nO'REILLY: The Iranians didn't want us there and Maliki was listening to them.\nKRAUTHAMMER: No, that's not -- Maliki knew that, in the end, he would depend on the U.S. He knew what was coming. When Obama came back, the number that the military had advised 10,000.\nObama proposed 3,000. That was a joke. That is less than anything required even to protect themselves.\nO'REILLY: That's right. And put them in harm's way.\nKRAUTHAMMER: If the Americans were not going to be serious, he was not going to risk their --\nO'REILLY: There's no doubt that the President could have gotten it done if he wanted to. Now, all Americans, I think, understand the lack of leadership coming out of the White House.\nAnd that's why the President's poll numbers are below 40 percent in job approval. However, in the African-American community, according to Gallup, they are 81 percent.\nEighty-one percent of American blacks support and approve the president's job performance. My question is a simple one because, as you know, I'm a simple man -- Is that totally based on race.\nKRAUTHAMMER: It's probably a couple of things. One is, obviously, they perceive the President -- they perceive the presidency differently from the way you do.\nBut, second, I know you know it sounds pejorative to say only race. It is ethnic solidarity. Roman Catholics supported John Kennedy. Mormons were heavily supporting Mitt Romney.\nIf we had a gay president, if we had a Jewish president, if we had a Hispanic candidate running for office, you would find a high level of association. And among African-Americans, it's all the more understandable.\nHere's a community who, for hundreds of years, were oppressed. In your lifetime and mine, they were legally discriminated against by the state. And then they were essentially emancipated a second time in the '60s.\nBut in our lifetime, we have African-Americans whose parents were segregated and really treated badly. They now point to their children and say, \"Look at what we have achieved. Look at the man at the White House,\" as a form of aspiration and a form of pride.\nThat is what any minority would do. And I'm not at all surprised by the high level of support. I'm surprised that you're surprised.\nO'REILLY: I'm not surprised. I just want to know the reason and I think you articulated it very well.\nKRAUTHAMMER: And I try to make it as simple as I could, Bill.\nO'REILLY: Because I am a simple man.\nKRAUTHAMMER: Precisely.\nO'REILLY: Krauthammer, everybody.\nContent and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "video_clips": ["SUSAN RICE, NATIONAL SECURITY ADVISOR: The Turks have -- this just in the last several days -- made a commitment that they will, in the first instance, allow the United States and our partners to use Turkish bases and territory.That's a new commitment and one that we very much welcome.", "CHARLES KRAUTHAMMER, FOX NEWS CONTRIBUTOR: This is really unbelievable that she could say that and then Turkey denies it. I don't know how they're going to explain it.Obama is simply not serious about this war. Why would you join a war where the leader of the coalition is not serious --", "-- international strategist of Kissingerian proportions. But she shouldn't go on television. It just doesn't work.It is totally inexplicable that the National Security Advisor whose job it is to be the --"], "remaining_transcript": "This is a RUSH transcript from \"The O'Reilly Factor,\" October 14, 2014. This copy may not be in its final form and may be updated. Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!\nIn \"Back of the Book\" segment tonight, another embarrassing moment for Susan Rice, one of President Obama's top National Security people.\nIf you remember, it was Ms. Rice who told the world the Benghazi assassination of American ambassador, Christopher Stevens in Libya was caused by a videotape. And that was false.\nNow, she's saying that the Turkish government has committed to help fight ISIS.\nO'REILLY: One problem, it's not true. The Turks say no deal has been made.\nO'REILLY: All right, joining us now from Washington, Charles Krauthammer. So, it really is unbelievable -- that's the word you used -- that Ambassador Rice would once again go out on national television and say something that's not true.\nIt can't be that they have a little meeting and say, \"What lie are we going to tell today.\" They can't be doing that. So, what do you think it is.\nKRAUTHAMMER: Look, I have a little advice for Ambassador Rice. She could be the best advisor Obama has ever had. She could be an --\n-- conduit of all information coming from the various foreign policy agencies, the one that coordinate and consolidate all of that should go out on television, announce to the world this very crucial agreement. And then, within hours, have the Turks say it's not true.\nIt's not just that it's not true, it's also that, now, we have a dispute with the Turks over what she said rather than negotiating the details of some cooperation between us.\nThat it should have happened at this level is truly inexplicable. I think you're right, it couldn't be a deliberate lie because there's no advantage in it.\nO'REILLY: Right.\nKRAUTHAMMER: It's not going to help negotiations. It's not going to bully the Turks into saying yes. It obviously is a mistake but it is a monumental one.\nAnd that it should happen in the middle of a war at this high level is truly remarkable.\nO'REILLY: You know what I think it is. It all goes back to what we've discussed in the past. There is a lack of leadership.\nThere is not anyone in charge. I don't believe President Obama is in charge of the ISIS conflict.\nI believe he farms it out to other people. He obviously doesn't have the stomach for it, all right.\n"}