{"vcmId": "0091075a-5b84-4bb3-8916-ed269027c249", "url": "http://www.foxnews.com/transcript/2016/12/20/ny-and-ca-oppose-president-elect-on-immigration.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 19, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thanks for staying with us. I'm Bill O'Reilly in the \"Unresolved Problem\" segment tonight. As we know, Donald Trump is pledging to deport criminal illegal aliens.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENT-ELECT:</b> What we are going to do is get the people that have criminal records, gang members, drug dealers. We have a lot of these people. Probably two million. Couldn't be three million. We are getting them out of our country or we are going to incarcerate. But we are getting them out of our country.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, in order to track down criminal aliens, the Feds will need the cooperation of local and state authorities but in California and here in New York, that could be a problem.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BILL DE BLASIO (D), NEW YORK CITY MAYOR</b>: If the federal government wants our police officers to tear immigrant families apart. We will refuse to do it.</p>                \n                \r\n\n            \n                <p><b>ANTHONY RENDON (D), SPEAKER OF THE CALIFORNIA STATE ASSEMBLY</b>: We are saying that if you are an immigrant, you are welcome here in California.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> As they always do the left wing fanatics and both of those gentlemen fall in that category conflate alien criminals, people who shot Kate Steinle for example, with housekeepers and gardeners. There is no difference to them. They did that when the despicable Harry Reid sabotage Kate's Law, that's what he did.</p>                \n                \r\n\n            \n                <p>Joining us now from San Diego, Ruben Navarrette, syndicated columnist. How do you see this looming showdown between California, New York and Trump, Ruben?</p>                \n                \r\n\n            \n                <p><b>RUBEN NAVARRETTE, SYNDICATED COLUMNIST</b>: Bill, good to be with you again. You know, history tells us the California and New York will lose the federal supremacy clause. I mean, if any time the federal government comes up against a local state a renegade state that doesn't want to follow the law. They are going to lose. And I find it interesting that a lot of liberals in New York and California are now cast in the role of being sort of the new George Wallace from Alabama. You know, 40 years ago, 50 years ago was a different story --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>NAVARRETTE:</b> -- with renegade states in the south. And now you have them doing the same thing in New York and --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Very good. Very good point. You know, the desegregation orders came from Washington. And Governor Wallace of Alabama refused to obey them.</p>                \n                \r\n\n            \n                <p><b>NAVARRETTE: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And therefore the Kennedy's have to send the National Guard down which they did and imposed the desegregation orders in the schools.</p>                \n                \r\n\n            \n                <p><b>NAVARRETTE: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But this is a little bit more personal than that. Okay? It will be interesting to see if President Trump tries to make an example of San Francisco and New York City. And tries to go in hard and say this is what you are going to do and if you don't do it, say goodbye to your federal money.</p>                \n                \r\n\n            \n                <p><b>NAVARRETTE</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Interesting to see. I don't know whether he will or not.</p>                \n                \r\n\n            \n                <p><b>NAVARRETTE</b>: Well, I think, Bill, you got to be careful. When you are looking at New York and Chicago and San Francisco, they have tried to pull the wool over people's eyes and pretend to be much more liberal in this regard than they really are. If you read those statutes there are huge loopholes that have been created there by lawyers to allow the federal government to arrest and apprehend people in those places. So, you know, Rahm Emanuel in Chicago --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know the county of San Francisco being sued by the Steinle family.</p>                \n                \r\n\n            \n                <p><b>NAVARRETTE:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Because they flat out refused to hold the man who allegedly killed Kate Steinle, all right? Even though ICE directly requested that that man be held.</p>                \n                \r\n\n            \n                <p><b>NAVARRETTE</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Because he had six deportations and seven felonies. And the sheriff of San Francisco County said blank you federal government. We're letting them out. Where upon he kills Steinle. Ms. Steinle.</p>                \n                \r\n\n            \n                <p><b>NAVARRETTE:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So the law is on the side of the federal government. But if you're going to have anarchy, if you are going to have a San Francisco county say that says, we're not going to obey the law, something has to be done to them.</p>                \n                \r\n\n            \n                <p><b>NAVARRETTE</b>: Right. So here's my thing. How is it that for instance Bill de Blasio has been mayor of New York almost three years. And in those three years, Barack Obama has managed to deport 400,000 people a year, a lot of them from the New York. And in California, the same thing. And in Chicago the same thing.</p>                \n                \r\n\n            \n                <p>So, if these ironclad, you know, have been in fact and they've been applied aggressively in those places, that would have never happened. What I'm telling you is that Democrats are lying to America. They're trying to pretend to be progressive and liberal are going to fight Trump but in reality they have always built in these loopholes to allow people to be apprehended.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. But it's a little bit different because the immigration courts have nothing to do with the local government here. When it gets dicey is when there is a criminal and this is what Trump says. He is going after the criminal aliens. Not the gardeners.</p>                \n                \r\n\n            \n                <p><b>NAVARRETTE: </b>Yes. Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right?</p>                \n                \r\n\n            \n                <p><b>NAVARRETTE</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The criminals being held. All right? ICE should be informed if it's an illegal alien. Right away, bang.</p>                \n                \r\n\n            \n                <p><b>NAVARRETTE</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It goes on a computer. And then ICE determines when or if it's going to pick them up, okay?</p>                \n                \r\n\n            \n                <p><b>NAVARRETTE:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They don't do that in the sanctuary cities. That's the crux of the matter. And most of the deportations under President Obama happened at the border, Ruben. That's 75 percent of them were just people coming over and then they threw them right back and then they counted them as deportations. So that's a ruse. But the real thing is that they won't cooperate in New York and Chicago and L.A. and San Francisco. And Trump is going to have to do something. Last word.</p>                \n                \r\n\n            \n                <p><b>NAVARRETTE:</b> What I'm saying is that under the Democratic administration of Barack Obama, those cities have cooperated. Those people were removed. And they were removed because as we talked about before, union members want them gone. They don't want to compete with those people. The Democrats have been able to have their cake and eat it too. Pretended to be more liberal than they really are.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. And that may be true. I'm not sure but we will look into it. Ruben, thanks very much. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "NY and CA oppose President-elect on immigration", "description": "'The O'Reilly Factor' examines the Trump administration and the deportation debate", "date": "2016-12-20T13:28:00Z"}