{"vcmId": "01bf2fb9-6cb1-4269-9f0c-b5d40a5d511e", "url": "http://www.foxnews.com/transcript/2016/02/23/ted-cruz-on-his-illegal-immigration-stance.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 22, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Continuing now with our coverage of 2016 Presidential campaign. It was in breaking news today as Ted Cruz fired his Communications Director, Rick Tyler. That happened because Mr. Tyler inaccurately reported some comments Marco Rubio made about the bible in South Carolina.</p>                \n                \r\n\n            \n                <p>Joining us now from Elko, Nevada, Senator Ted Cruz. That ought to be a tough one for you to fire the guy but, you know, this is the third controversy you guys have had. So, how do you see it?</p>                \n                \r\n\n            \n                <p><b>SEN. TED CRUZ, (R-TX) PRESIDENTIAL CANDIDATE: </b>Well, Bill, it is good to join you. Thank you for having me. Listen, it was unfortunate that I had to ask for Rick's resignation. But we have set a standard from the very beginning of this campaign that he we are going to operate from the highest level of integrity. And, Rick tweeted out a press story that falsely attributed to Marco some comments about the bible. It turned out the story was false.</p>                \n                \r\n\n            \n                <p>But, regardless, we are not going to call anyone's faith in to question. That is a standard I set from the very beginning. And, that is why I asked for Rick's resignation. We are, instead, from the beginning, running a campaign where we are taking the high road and not engaging in the insults and attacks of the other races, rather keeping the focus on issues and substance.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: OK. But, certainly, you have to defend yourself and of course some of your opponents today weighed in with your current campaign is dishonest, blah, blah, blah, that kind of stuff. Donald Trump was in the lead on that, as you probably know. Do you have any comment on Trump saying that, you know, your campaign is dishonest. You are a bad guy? And, you know -- you know what the drills.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Well, you know, Bill, it is a very strange dynamic where two of the candidates in this race Donald Trump and Marco Rubio, whenever anyone points to their actual record, they will not defend their record. They do not even want to discuss the record. They just scream, \"liar, liar, liar.\"</p>                \n                \r\n\n            \n                <p>And, both of them have been engaging in very nasty, very personal attacks relentlessly and daily. And, it is all false. You know, I will give you an example. The debate we had last Saturday. I made the point from the debate stage that Donald Trump for 60 years of his life described himself as very pro-choice and even now he supported Planned Parenthood.</p>                \n                \r\n\n            \n                <p>And, Trump began bellowing, \"Liar, liar, that is not true.\" He said, \"When did I support Planned Parenthood?\" And, I said, \"Well , when I led the fight to defund Planned Parenthood, you opposed it.\" And, said Planned Parenthood does wonderful things, likewise wise with Marco. Look, let us talk about the fact, because my focus is on facts and substance.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. I do not want to use the whole interview thing for this, but because of the breaking news I had to do it. Here is a policy question I need you to define for me tonight.</p>                \n                \r\n\n            \n                <p><b>CRUZ: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Twelve million illegal aliens here in America. Mr. Trump says he would deport them forcefully. The federal authorities will round them up and send them back home. Goes bass home. It will cause a lot of money, but he says it is worth it, because we just cannot allow the law to be broken this way. Would you round up 12 million illegal aliens here and if so, how?</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Listen. We should enforce the law. How do we enforce the law. Yes, we should deport them. We should build the wall. We should triple the border patrol and Federal Law requires that anyone here illegally that is apprehended should be deported. It is the greatest difference, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Trump would look for them to get them out. Would you do that if you everywhere President?</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Look. Bill, of course you would. That is what ICE exists for. We have law enforcement that looks for people, who are violating the law that apprehends them and deports them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Just let me get this straight.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> But, Bill --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Wait, wait. Just let me get this straight, because this is important, very important. So, I use the same example. So, Tommy O'Malley from County Cork in Ireland is over here and he overstays his visa and he has got a couple of kids and he settled into Long Island. And, you, President Cruz are going to send the Feds to his house, take him out and put him on a plane back to Ireland?</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> You better believe that right now we actually cannot do that, because we do not have a biometric exit-entry system. So, we do not know what in your example Tommy gets home.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right, you cannot find them, but you require that. But, then the court would probably block you. Look, I am sorry to cut you off, but I want to get to the meat of this. The federal courts would probably block you from doing that, taking Mr. O'Malley and put him on a plane --</p>                \n                \r\n\n            \n                <p><b>CRUZ: </b>Why would they do that?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Because due process.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Why would they do that?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Due process.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: No. No. Listen, I have spent my entire process as a constitutional lawyer. So, federal law requires a biometric entry-exit system on visas. The Obama Administration refuses to enforce federal law. As President, I will put that in place, so we will know the day someone overstays their visa, we will be able to send law enforcement to apprehend them and send them home.</p>                \n                \r\n\n            \n                <p>And, the biggest difference, Bill, between Donald Trump and Marco Rubio and myself is that both Donald Trump and Marco Rubio would allow those 12 million people to become U.S. citizens. Donald says once he deports them, he would let them back in as citizens. I will not -- and for anyone who is concerned about -- do not want to see wages driven down --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>CRUZ: </b>They are going to be under existing law. They are not eligible to come back in legally if they have been deported to breaking the law. And, I think Donald Trump and Marco Rubio are wrong to drive down wages and take away Americans'' jobs by giving 12 million people here legally U.S. citizenship. That is not consistent with rule of law.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Well, this is my job to get your position on the record, we get it tonight.</p>                \n                \r\n\n            \n                <p><b>CRUZ :</b> Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Senator, we will continue the conversation. We appreciate you are taking the time.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Ted Cruz on his illegal immigration stance", "description": "Republican presidential hopeful shares his policies for foreign and domestic policies on 'The O'Reilly Factor'", "date": "2016-02-23T13:12:36Z"}