{"vcmId": "03d27cc7-a141-4192-8db3-69a3dc7d829e", "url": "http://www.foxnews.com/transcript/2015/02/16/bill-oreilly-three-muslims-murdered-in-north-carolina-was-it-hate-crime.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>On Tuesday in Chapel Hill, three Muslim students were murdered, shot dead. They are 23-year-old Deah Shaddy Barakat. His 21-year-old wife Yusor, and her 19-year-old sister Razan Muhammad Abu-Salha.</p>                \n                \r\n\n            \n                <p>Police have arrested 46-year-old Craig Stephen Hicks. He is he charged with three counts of first degree murder. Investigators say Hicks shot the victims over a parking dispute.</p>                \n                \r\n\n            \n                <p>The FBI now looking into possible hate crime violations but that investigation has just begun. Hicks is a malcontent, a troublemaker by all accounts. He's an atheist who has attacked all religions on the net and also advocated for gay marriage.</p>                \n                \r\n\n            \n                <p>Almost immediately after the shooting, the verbal accusations began.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>ABU-SALHA: </b>With the media bombarding every American every day with news about what they call Islamic terrorism, none of which is Islamic at all, they are really preparing people for such tragedies and triggering them and provoking them.</p>                \n                \r\n\n            \n                <p><b>CHRIS HAYES, MSNBC HOST: </b>Whatever the motivations for this horrendous slaughter, it takes place in the context where subtle, persistent anti- Muslim bias is a part of American life. This feels like a wakeup call.</p>                \n                \r\n\n            \n                <p><b>SHAFI KHAN, FRIEND OF UNC SHOOTING VICTIMS:</b> I want to take this minute and I want to ask people like FOX News and Bobby Jindal to stop this dehumanization of Muslims. It's really, really starting to take a toll.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's just vile. But it's standard issue these days.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" grieves for the three murdered young people. They are innocents, destroyed by a disturbed individual. Just as all the human beings being destroyed by the jihadists around the world are innocents, murdered for absolutely no reason at all.</p>                \n                \r\n\n            \n                <p>It is simply revolting that any person would throw around accusations against people who had nothing to do with the murder.</p>                \n                \r\n\n            \n                <p>Governor Jindal of Louisiana is a fine man, a patriot who helps millions of people.</p>                \n                \r\n\n            \n                <p>It is long past time for all decent Americans to condemn those who use murder to advance a political agenda or seek vengeance against those with whom they disagree.</p>                \n                \r\n\n            \n                <p>The FBI will find out if these murders can be classified as hate crimes just as the agency did in Ferguson, Missouri.</p>                \n                \r\n\n            \n                <p>But for the haters among us in America, facts don't really matter, do they? That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Three Muslims murdered in North Carolina. Was it a hate crime?", "description": "Talking Points 2/13", "date": "2015-02-16T13:13:44Z"}