{"vcmId": "04405efa-043d-41df-bcf9-19da66f300be", "url": "http://www.foxnews.com/transcript/2014/10/22/bill-oreilly-racist-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The far left once again banging the drum that America is a terrible country -- racist in every way; the cable arm of NBC News peddling that.</p>                \n                \r\n\n            \n                <p>Here is what happened yesterday in a discussion about Ebola, ISIS and illegal immigration.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Well the brown people coming from the south, the Arab people coming from the east. The black people coming from Africa, nobody is saying that in so many words. Nobody is saying it at all, but it's in the background of this whole discussion and anybody who would deny that doesn't know how this country operates.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, I deny it and I know how the country operates. We are not a racist nation. He is full of you-know-what. Laws and high level decisions are not based on skin color anymore. But in order to drive African-Americans to the polls, the race card is now being played with just two weeks before the election -- thus, that disgraceful exhibition.</p>                \n                \r\n\n            \n                <p>On the Ebola front, the administration is now backtracking on the travel ban as we told you it would. Today it announced restrictions on anyone traveling from the West African nations affected by Ebola. They will only be allowed to enter the USA at five airports -- JFK, Newark, Dulles, Atlanta and O'Hare in Chicago.</p>                \n                \r\n\n            \n                <p>As \"Talking Points\" predicted, if there is one more Ebola case, there will be an overall travel ban imposed. In just a few moments we will talk with the Liberian ambassador about the situation.</p>                \n                \r\n\n            \n                <p>But back to the race card. Fair-minded Americans should be deeply offended, deeply offended that their country is being smeared with the bigotry brush. Certainly there are individual cases of racism, they occur within every ethnic group. No government can stop individual stupidity.</p>                \n                \r\n\n            \n                <p>But in America there is opportunity for all. Unfortunately that opportunity has been beaten down recently by bad economic policies. Democratic Party believes Washington should run the economy. But that has failed. The Republican Party wants a free market economy with low taxation and aggressive job expansion. The problem is the free market economy was abused during the Bush administration and the economy collapsed because of it.</p>                \n                \r\n\n            \n                <p>That's what led to the election of the very liberal Barack Obama who promised greater prosperity for all. That promise remains unfulfilled as wages for working Americans have gone down during Mr. Obama's tenure and unemployment among black Americans remains higher than any other group.</p>                \n                \r\n\n            \n                <p>So, the far left is desperate. And the only way Democrats can keep power in the Senate is for African-Americans to once again block vote. And they must turn out in great numbers on November 4th. That is why liberal zealots are trying to demonize their country by playing the race card.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Racist America", "description": "Talking Points 10/21", "date": "2014-10-22T12:08:06Z"}