{"vcmId": "05ae6fba-9b02-46e3-a714-7087bb083bf3", "url": "http://www.foxnews.com/transcript/2015/03/18/president-obama-liberal-legacy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 17, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Thanks for staying with us, I'm Bill O'Reilly in the \"Personal Story\" segment tonight, brand new book called \"Frank: A Life in Politics From The Great Society To Same Sex Marriage.\" It is of course written by former Congressman Barney Frank from Massachusetts. And here he is.</p>                \n                \r\n\n            \n                <p>All right. I want to talk about liberal policies we have six years of them under President Obama. Let's put aside ObamaCare. Because it's still undefined whether that's going to really help the majority of people and put aside the economy because some people are benefiting now that wages are still down. What is the biggest accomplishment of President Obama domestically in your opinion?</p>                \n                \r\n\n            \n                <p><b>BARNEY FRANK (D), FORMER MASSACHUSETTS CONGRESSMAN:</b> Well, I don't agree to put aside the economy. I think that has been a very important accomplishment for which he deserves credit. And it's been controversial. I think from the time he took office until now, there has been an enormous turn around, not nearly fast enough and it hasn't been widely --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Wages are still down. The wages are still down. That's the key indicator.</p>                \n                \r\n\n            \n                <p><b>FRANK: </b>No, it is not the only indicator. Unemployment is also an indicator. I agree wages are still down that's probably because of resistance to some of the policies liberals would like to see.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. Let me give you -- I'm interested in what else?</p>                \n                \r\n\n            \n                <p><b>FRANK: </b>You know, I was just watching you interrupt your preview guests all the time. No one ever gets a chance to talk on your show.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Because it's a five minute segment I get a lot to get to.</p>                \n                \r\n\n            \n                <p><b>FRANK:</b> Then you get four of them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We will give you the economy. All right? Anything else that he has done?</p>                \n                \r\n\n            \n                <p><b>FRANK:</b> Oh, yes. I think financial reform. I think we have in fact made it much less likely that we will see undoing by irresponsibility on the part of all parties and get the same kind of crisis. I think repealing \"Don't Ask, Don't Tell\" was very helpful. And he has been very very forceful in helping us diminish prejudice based on sexual orientation and gender identity both in the area of marriage where he took the leading role finally and in doing away with.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, he brought the economy back in your opinion. Financial regulations are stricter so the banks can't make bad loans. And \"Don't Ask, Don't Tell,\" gay marriage he has got behind. Anything else?</p>                \n                \r\n\n            \n                <p><b>FRANK:</b> Yes. We got a very important bill through in 2010, called the Lily Ledbetter Act which made it much easier for women to sue when they've been unfairly --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Race relations better or worse under him?</p>                \n                \r\n\n            \n                <p><b>FRANK: </b>Oh, I think they are better. I think --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Really?</p>                \n                \r\n\n            \n                <p><b>FRANK: </b>-- under both presidents. Yes. I think under all presidents, democratic and republican, we have made steady progress since the end of World War II but we still have some serious problems.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know because black Americans don't feel race relations are better. Overwhelmingly they think they are worse under President Obama. Overseas, what's the big accomplishment?</p>                \n                \r\n\n            \n                <p><b>FRANK:</b> What you disagree with, I think cutting back on the excessive involvement of the United States in other countries, where we should not spend our money and get involved and not do much. I understand, I saw the last segment, people were critical, people actually pulled out of Iraq. Well, we accomplished what I thought was a mistake in the first place with Iraq.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The Middle East is in absolute chaos right now, wouldn't you say that? In everywhere you look?</p>                \n                \r\n\n            \n                <p><b>FRANK: </b>Yes, it is. And it's not America's fault and it's not America's --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Do you think he is leading, President Obama is a world leader? Do you think Putin is fearful of him? Do you think that our problems overseas are being --</p>                \n                \r\n\n            \n                <p><b>FRANK: </b>-- can I answer any of the seven questions you just asked me? I hope so.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It's an overall arch that President Obama's leadership has caused a lot of problems.</p>                \n                \r\n\n            \n                <p><b>FRANK: </b>Oh, nonsense. No, here is the problem.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Not nonsense.</p>                \n                \r\n\n            \n                <p><b>FRANK:</b> He's a problem. May I finish? Bill, I know you are ready to interrupt again --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You are so sensitive.</p>                \n                \r\n\n            \n                <p><b>FRANK:</b> You are not hurting my feelings, you are hurting the discussion. Here's the deal. You take this false position that everything that goes bad in the world is America's fault that America should have stopped it. I don't think it's America's fault that you cannot in Iraq have people that get along with each other. We gave the Afghans a chance. It's not America's fault. And I am not for indefinite posting of tens and tens of thousands of American troops to try and run the country where they can't get along with each other.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No. I wouldn't reoccupy any country either.</p>                \n                \r\n\n            \n                <p><b>FRANK: </b>You did. You wanted with Iraq. You wanted 10, 000 more troops there indefinitely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You keep them in there because they were there in the first place.</p>                \n                \r\n\n            \n                <p><b>FRANK</b>: You keep them there forever. How long would you keep them there, Bill?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>One country, South Korea.</p>                \n                \r\n\n            \n                <p><b>FRANK:</b> How many years?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>People are still free, are they not?</p>                \n                \r\n\n            \n                <p><b>FRANK: </b>Would do you that in Iraq?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I would keep a residual force in Iraq.</p>                \n                \r\n\n            \n                <p><b>FRANK:</b> Sixty years.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't know a time.</p>                \n                \r\n\n            \n                <p><b>FRANK: </b>I think that's important question.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Putin obviously running wild, right? Invading a country he shouldn't be. Ukraine.</p>                \n                \r\n\n            \n                <p><b>FRANK:</b> Right. And that's not --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Should Obama do anything more than he is doing?</p>                \n                \r\n\n            \n                <p><b>FRANK:</b> No. You want to go to war against --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't want to go to war with any of the peace guy.</p>                \n                \r\n\n            \n                <p><b>FRANK:</b> I will tell you what Obama -- you want more troops in Iraq and more troops here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> For stability and peace-keeping purposes.</p>                \n                \r\n\n            \n                <p><b>FRANK:</b> But peace keeping services means shooting bad guys. Sometimes you do that, that's what peace keeping means.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Sometimes you have to keep the peace.</p>                \n                \r\n\n            \n                <p><b>FRANK: </b>Yes. Secondly though with regard to Putin. No. Yes, what Obama has done more than any other government in the world by agreeing to sanctions. The only other thing you could do is to have invasion. I think is he a terrible guy but I don't think we should be invading. And America has --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You think Putin fears him?</p>                \n                \r\n\n            \n                <p><b>FRANK:</b> I don't think he fears anybody.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What if he continues a little march into the Baltic States and all that?</p>                \n                \r\n\n            \n                <p><b>FRANK: </b>I think we should put some troops in there but we also --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Peace keeping troops, right?</p>                \n                \r\n\n            \n                <p><b>FRANK:</b> No. But troops that are ready to fight a war. I don't use -- you were right when you said we should be asking the other countries to do it. And part of the problem is that we have, these European nations who backed down because they think America --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Would you do one thing though, you were right, would you just say that again?</p>                \n                \r\n\n            \n                <p><b>FRANK:</b> Yes, I would say you were right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. There you go, Barney Frank, everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "President Obama's liberal legacy ", "description": "Barney Frank weighs in on how well liberal policy is working", "date": "2015-03-18T12:16:10Z"}