{"vcmId": "05aeb831-6d7a-49b4-b530-24e0bcab8b79", "url": "http://www.foxnews.com/transcript/2015/02/26/do-our-human-rights-come-from-god.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 25, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight, human right, where do they come from. In Alabama, Chief Justice Roy Moore arguing that the state should decide gay marriage that the feds or courts have no right to impose gay marriage.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>ROY MOORE, ALABAMA CHIEF JUSTICE:</b> I believe that's a matter of law because our rights contained in the Bill of Rights do not come from the constitution. They come from God.</p>                \n                \r\n\n            \n                <p><b>CHRIS CUOMO, CNN HOST: </b>Our rights do not come from God. That's your faith. That's my faith not our country. Our laws.</p>                \n                \r\n\n            \n                <p><b>MOORE: </b>That's not a matter of faith, sir.</p>                \n                \r\n\n            \n                <p><b>CUOMO:</b> Collective agreement and compromise.</p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES:</b> As Americans we believe that workers' rights are civil rights. That dignity and opportunity -- that dignity and opportunity aren't just gifts to be handed down by a generous government or by a generous employer they are rights given by god.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Joining us now from Tampa, Florida Democrat Jessica Ehrlich and here in the studio Republican Andrea Tantaros. You see her on \"OUTNUMBERED\" at noon.</p>                \n                \r\n\n            \n                <p>So President Obama seems to be siding with the secular press and say that rights are given to us by God which opens up an interesting door. Does it not?</p>                \n                \r\n\n            \n                <p><b>ANDREA TANTAROS, FOX NEWS HOST</b>: It does but I prefer to watch what President Obama does than what he says.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. But the fact that he said that to evoke sympathy policies for his policies toward working people that's why he did it -- all right -- blows Mr. Cuomo at CNN right off the couch.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> Well, right. Ok. So he says that he believes rights come from God. But President Obama also, I think, interprets that to mean that God has given him, President Obama, rights to do certain things like redistribute wealth.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Maybe, but --</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> A very radically different view than our founding fathers, Bill. Cuomo, if you want to talk about Cuomo, Cuomo used the rights that he believes are afforded to him I think to bully and intimidate that judge.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, that judge can't be bullied or intimidated.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> And he shouldn't have gone on that show in my opinion.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Whatever, but the lines, Jessica, are here. That the Declaration of Independence clearly states that our whole justice system and our whole system of interactions with each other is based upon the rights given to us by God, not by man. So Mr. Cuomo and the other secular progressives say -- you know what -- that's nice theory, but it's the judges and the legislature who really give us our rights. Where do you come down on it?</p>                \n                \r\n\n            \n                <p><b>JESSICA EHRLICH, DEMOCRATIC STRATEGIST: </b>Well, there is a difference between our rights, which are the inalienable rights we have set out based upon the fact that our nation was founded on Judeo-Christian values. And our legal system and the justice system and justice is in all the sculptures -- it's supposed to be blind. And you know, we are a nation that was created not only on those values but by people who are suffering religious persecution. And our legal system is specifically set out so that it will not be affected by that.</p>                \n                \r\n\n            \n                <p>We're not the Middle East. We don't have clerics who are handing out, you know, biblical justice. We are based on the British common law system where you have case law and authority and judges and there is a difference between church and state.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. But that's the criminal system. In the social system what President Obama is telling the country is that Americans' rights come from God. One of our rights is to treat people justly. All right, so workers should get certain benefits and should be treated a certain way.</p>                \n                \r\n\n            \n                <p>All right, if that's true, if that's true, then Judge Moore, his argument becomes more powerful. You can't take away our rights in Alabama to vote and want marriage to remain between a man and a woman. You can't take away those rights.</p>                \n                \r\n\n            \n                <p><b>EHRLICH:</b> I think the key thing is, it's not just justly, it's actually equally. People are equal under the law. If you are equal under the law you have equal rights.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> If everybody was equal though everybody will be making the same amount of money. That doesn't hold up. All right, let's get back.</p>                \n                \r\n\n            \n                <p><b>EHRLICH:</b> No, you have the opportunity to make money but you are equal under the law, meaning the law sees whether you are gay, purple, Martian, if you are an American, you are seen as equal.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's right. You can't be discriminated against based on anything -- that means you can't be denied. All right. But the judge is saying -- and I want to get your point of view on this -- that you are denying we Alabamans our rights to determine what our state and local situation should be that's his argument.</p>                \n                \r\n\n            \n                <p><b>TANTAROS: </b>Yes. The judge is right. Rights do come from God. But they don't come down in some metaphysical form. They come down to flawed human beings and they expect us to sort of sort them out. But the founding fathers gave us rights, God-given rights. And those rights were to let us be left alone -- really.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But also the people who favor gay marriage can say the one of the rights given us to from God is all men are created equal.</p>                \n                \r\n\n            \n                <p>All right. So if heterosexual couples can marry, why can't gays because we are all equal?</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's a pretty powerful argument.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> It's definitely a powerful argument.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's what the Supreme Court decision is going to hinge on.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> That's right. I do just want to quickly go back to what Cuomo said though. Because, if you believe what Cuomo said --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> God doesn't have a say.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> It means that anything goes. That's right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. Taken away --</p>                \n                \r\n\n            \n                <p><b>TANTAROS: </b>That there's no hierarchy. That there is no right and wrong, that anything goes in society.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Absolutely right.</p>                \n                \r\n\n            \n                <p><b>EHRLICH:</b> That's not true.</p>                \n                \r\n\n            \n                <p><b>TANTAROS: </b>No, that's exactly what he said.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, no. No I'm going to give you the last word. Jessica - - surely you know, because I'm sure you read my book \"Culture Warrior\" that the secular progressive belief system discounts God totally 100 percent. God should not have any place in the public forum at all. You go to your church. You go to your synagogue, you go to your mosque and you shut up. That is what the secular --</p>                \n                \r\n\n            \n                <p><b>EHRLICH:</b> That's actually the same argument that President Kennedy made which I'm sure you know because when he was running as the first Catholic president is that his core beliefs is how he would act were based on his religious values. That doesn't mean that he would impose them on other people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Nobody is looking at an imposition of anything. The Alabamans are just saying, listen, we want to decide what kind of state we're going to have and that's all.</p>                \n                \r\n\n            \n                <p><b>EHRLICH:</b> And state rights argument has gone back to the basis of the bill of rights that it should exist in general. It's the history of our country right there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Everybody thinks the Supreme Court is going to rule against Judge Moore. You do, I do I'm sure Jessica does.</p>                \n                \r\n\n            \n                <p><b>EHRLICH:</b> I do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But it's a very fascinating debate and we appreciate it, ladies.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Do our human rights come from God?", "description": "Chief Justice in Alabama arguing that states should rule on gay marriage", "date": "2015-02-26T13:23:17Z"}