{"vcmId": "06cb3585-b5a9-467b-b254-154f7a318120", "url": "http://www.foxnews.com/transcript/2015/03/30/should-bowe-bergdahl-be-prosecuted-for-desertion.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 27, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> In the \"Personal Story Segment\" tonight, should Bowe Bergdahl be prosecuted for desertion? The \"New York Times\" says no in a new editorial writing, quote, \"Trying him for desertion and misbehaving before the enemy stands to accomplish little at this point. A conviction would most likely deprive a traumatized veteran of benefits, including medical care, which he will probably need for years. A dishonorable discharge would make it harder to rebuild his life as a civilian.\"</p>                \n                \r\n\n            \n                <p>Meantime, the White House continues to defend the controversial swap of Bergdahl for five Taliban commanders. Bill O'Reilly pressed David Axelrod, one of President Obama's former top advisers about their decision in February.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BILL O'REILLY, FOX NEWS HOST:</b> After he left his unit and there were a number of U.S. soldiers killed looking for him. There was an investigation. And the conclusion was he was a deserter.</p>                \n                \r\n\n            \n                <p><b>DAVID AXELROD, FORMER ADVISER TO PRESIDENT OBAMA:</b> Bill --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The President had to know that.</p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>The practice of the United States is that we don't leave anybody behind. We may hold them accountable when they come back, but we don't leave them behind.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So you think he still thinks it was a good deal? Still was a good deal?</p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>That was the -- that was what provoked that decision.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That was the explanation. Does he still think it's a good deal, do you think?</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> I haven't talked to him about it. I think that he would stand behind what he's done.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Joining us now from Washington, attorney and former federal prosecutor, John Flannery. Mr. Flannery, you agree he should not be prosecuted?</p>                \n                \r\n\n            \n                <p><b>JOHN FLANNERY, FORMER FEDERAL PROSECUTOR:</b> Yes, I do. I mean you have an exercise of discretion when you're a prosecutor. And in this case, this is not your ordinary alleged desertion. This is a fellow that was run out of the Coast Guard because he had mental and psychological problems. They gave him a waiver to bring him in. And that great American philosopher, Clint Eastwood said a man ought to know his limitations. And this man had the drive to serve, but he shouldn't have been allowed to do so. And he claims that when he --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Ok. There's only one problem with that. You're calling it alleged desertion, but he himself wrote his parents saying \"I'm walking off, I'm out of here.\" And by the way he himself, according to \"Rolling Stone\" said \"I hate America\".</p>                \n                \r\n\n            \n                <p><b>FLANNERY:</b> I don't -- he said he hated America. Have you read his writings? His writings are the writings of a man who has psychological problems. Let me say this about the fellow. Even if he walked off, although he says he walked off to go to another outpost to tell them about misconduct at the post he was at. I don't know if that's true or not.</p>                \n                \r\n\n            \n                <p>But assuming he was a deserter, the five years he spent in custody and tried to escape 12 different times -- he was beaten and refusing to talk.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>How is this for a deal? You did your five years for desertion. Misbehaving in front of the enemy, which is a far more serious crime. He should get life -- look, there are some people --</p>                \n                \r\n\n            \n                <p><b>FLANNERY:</b> What is the misbehaving there?</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>There are some people who think he should get the firing squad for that.</p>                \n                \r\n\n            \n                <p><b>FLANNERY:</b> That's ridiculous. What is his misbehaving? The man resisted in every way possible, giving them any information was beaten for it.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> How do you know that?</p>                \n                \r\n\n            \n                <p><b>FLANNERY: </b>Because -- did you read his statement?</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>I read everything about it. I went back to the \"Rolling Stone\" articles four or five years ago reading all about this. I think the guy is a traitor.</p>                \n                \r\n\n            \n                <p><b>FLANNERY: </b>A traitor?</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>FLANNERY:</b> Come on. First of all, he shouldn't have been in the position he was. He didn't have the capacity to serve. We let him in, because we couldn't recruit enough people to serve. Then we're surprised when this fellow can't handle it and walks off.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Hey John. Hey John, how many people died because he decided to walk off the base that day, he left his gun, he left his uniform, folded nicely and walked. How many people died, do you know that?</p>                \n                \r\n\n            \n                <p><b>FLANNERY: </b>I actually don't know. But you know we have --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> I'll tell you. People, five or six in his platoon -- how is this? Let's listen from his platoon leader who sat with Megyn a while back. Listen.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>EVAN BUETOW, FORMER TEAM LEADER OF BERGDAHL'S PLATOON: </b>I want to hear from him why he did what he did. I want to know, and I know that everyone who is involved in the situation wants to know, it's something that we have lived with for so long, and I think for the American people, they need to hear from him what he was thinking. What was going through his head?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> And you know who else wants to know, the families of the six people who allegedly died because they were looking for him.</p>                \n                \r\n\n            \n                <p><b>FLANNERY: </b>Come on. We have this principle, no man left behind. And they went to get him. That is what we do. That is why we made a good or bad exchange of prisoners for him. That's why we brought him here. If we didn't think he was worth that, we shouldn't have sent a search party. We knew that when we went looking for him.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>You can make your case. That's why you traded five Taliban for the one deserter. My point is, now that we know, or there is very good evidence that six men have died looking for the man, I think that puts him into the higher -- misbehaving in front of the enemy sounds light.</p>                \n                \r\n\n            \n                <p><b>FLANNERY:</b> Whoa, whoa, whoa. They knew when they were looking for him how he went off post. And they know it today. And they knew it when they traded the prisoners. And they brought him back because we believed that the soldiers who sacrificed their life and in this case were tortured for five years, have a right to come home. And if you're going to exercise discretion to prosecute, this is not the case to prosecute.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>What is an example? If not this, then when? What do you really need to prosecute a deserter or a traitor?</p>                \n                \r\n\n            \n                <p><b>FLANNERY: </b>When is when you don't have somebody who is a fragile soldier to begin with --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> So he's fragile so we have to (inaudible) back.</p>                \n                \r\n\n            \n                <p><b>FLANNERY:</b> He was fragile.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Let me ask you this. Let me ask you this. What -- if we did say, you know what, you're fragile, you did your five years with the enemy -- alleged enemy. Maybe not even enemy? What if we did that? What message would we send to every single military personnel over there right now who are staring at a gun at their face?</p>                \n                \r\n\n            \n                <p><b>FLANNERY:</b> Well, you know what we should say, is that we shouldn't put any soldier at risk by giving waivers to people who have no business in the service when they were drummed out of the Coast Guard before they were put in the service, because we couldn't recruit enough people to go fight in Afghanistan. That's the message.</p>                \n                \r\n\n            \n                <p>And when somebody goes through this and we make a mistake as a government and put somebody in a place they can't handle, when they come back from being tortured for five years, we don't prosecute them.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>We had General Wesley Clark, who is almost straight down the middle. You know what he would say? He would say, if you do -- you let a guy go like this, you've opened up a can of worms.</p>                \n                \r\n\n            \n                <p><b>FLANNERY:</b> Well, he's wrong.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> You're taking the legs out of the military. I don't want to speak for Wesley Clark, however, I will tell you letting a deserter go or traitor go -- we don't know what he did yet.</p>                \n                \r\n\n            \n                <p><b>FLANNERY: </b>He's not a traitor.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>We don't know that.</p>                \n                \r\n\n            \n                <p><b>FLANNERY: </b>You do. Why are you calling him that? You have no evidence he's a traitor. The man couldn't handle it.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Being prosecuted for misbehaving in front of the enemy. You want me to define that for you? Traitor</p>                \n                \r\n\n            \n                <p><b>FLANNERY: </b>No, a charge means nothing. A charge is not worth the paper it's written on. You know the old saying -- a grand jury can indict a ham sandwich. That's what this is. This is political.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Ok. Well, we'll see. I would love to see the evidence because I'm pretty darn sure they're not bringing that charge against him with no evidence.</p>                \n                \r\n\n            \n                <p><b>FLANNERY:</b> Oh, yes.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> I could be wrong.</p>                \n                \r\n\n            \n                <p><b>FLANNERY:</b> You know what they say about military intelligence, oxymoron -- that's what we have here. We have bad intelligence, we have a bad prosecution. It shouldn't happen, and the \"Times\" is right.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Well, how is this. After we find out all the evidence, we'll have you back and we'll sit down and talk about what they really did find. Mr. Flannery, thank you very much.</p>                \n                \r\n\n            \n                <p><b>FLANNERY: </b>Thanks for having me -- Eric.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Should Bowe Bergdahl be prosecuted for desertion?", "description": "The New York Times says Bowe Bergdahl should not be prosecuted for deserting his unit in Afghanistan", "date": "2015-03-30T12:34:54Z"}