{"vcmId": "07a932df-8a84-4a92-89a9-69dfc090515c", "url": "http://www.foxnews.com/transcript/2015/10/20/bill-oreilly-more-political-madness.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The terror attack on 9/11 was caused by a failure of U.S. intelligence. America simply didn't have effective assets on the ground in Afghanistan under President Clinton and then for a short time under President Bush. Thus, al Qaeda was able to grow in ferocity as the Taliban assisted them and finally launched the atrocious assault that killed 3,000 people and shocked the world.</p>                \n                \r\n\n            \n                <p>Six of the Muslim killers violated U.S. immigration law. But 13 were here legally -- that was caused by lax immigration policy. So Donald Trump said this about the al Qaeda attackers.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I'm extremely, extremely tough on illegal immigration. I'm extremely tough on people coming into this country. I believe that if I were running things, I doubt those families would have -- I doubt that those people would have been in the country.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Trump going on to say that he doesn't blame President Bush for 9/11 but he doesn't believe Mr. Bush kept us completely safe either.</p>                \n                \r\n\n            \n                <p>Jeb Bush, the President's brother, took exception to that.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BUSH:</b> My brother responded to a crisis and he did it as you would hope a president do. He united the country. He organized our country and he kept us safe. And there is no denying that. The great majority of Americans believe that and I don't know why he keeps bringing this up.</p>                \n                \r\n\n            \n                <p>It doesn't show that he is a serious person as it relates to being commander in chief and being the architect of a foreign policy.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Governor Bush is correct in saying his brother's administration acted quickly to prevent any follow-up attacks and did heavy damage to al Qaeda. Those are facts. But the tempest isn't really important, is it, as America faces a bunch of new threats that are not being adequately addressed by the Obama administration. So while the Trump/Jeb Bush back and forth may be good copy it really serves no purpose.</p>                \n                \r\n\n            \n                <p>Something else I noticed over the weekend was this analysis of Hillary Clinton by Mitt Romney.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>ROMNEY: </b>Her mistaken perspective on foreign policy has led to the fact that frankly there is no place in the world that I can think of where American interests have been bettered by virtue of Hillary Clinton having served as secretary of state. That record of the secretary of state, I think, will become the focal point of the debates in 2016 when a Republican nominee goes after that record.</p>                \n                \r\n\n            \n                <p><b>JAKE TAPPER, CNN HOST: </b>You would vote for Donald Trump over Hillary Clinton though?</p>                \n                \r\n\n            \n                <p><b>ROMNEY:</b> I would vote for the nominee of the Republican Party and I don't believe that's going to be Donald Trump.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, that might have been just a standard interview by Governor Romney but I suspect there may be something else in play. It is entirely possible that no Republican contender will lock things up in the early primaries. If that's the case the GOP could turn to Mitt Romney. The governor received more than 59 million votes last time around. He's well known and has establishment support -- something to consider. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: More political madness", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/19", "date": "2015-10-20T15:21:03Z"}