{"vcmId": "08831d8e-6fe2-41f3-895a-2ffdbb2ad13f", "url": "http://www.foxnews.com/transcript/2015/06/19/bill-oreilly-bad-day-for-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>21-year-old Dylann Roof shot nine people dead last night inside a Charleston, South Carolina church. Roof fled, was caught this morning in Shelby, North Carolina about 250 miles from Charleston. He surrendered without a struggle. Roof from Lexington, South Carolina dropped out of high school in the tenth grade and has been arrested at least twice, once on a drug possession charge.</p>                \n                \r\n\n            \n                <p>Apparently he is a long-time racist, wearing anti-black patches on his clothing. Those who know him say he often made inappropriate statements about African-Americans.</p>                \n                \r\n\n            \n                <p>Police report that Roof entered the historic Emanuel African-American Methodist Episcopal Church about 8:15 last night. He watched the prayer meeting that was underway. Shortly after 9:00 he pulled out a handgun, murdered nine church goers before fleeing. Reports are he reloaded the gun a number of times saying he had to kill the innocent black people.</p>                \n                \r\n\n            \n                <p>No question -- that was an act of terror. No different than what ISIS and al Qaeda does, targeting civilians because of who they are. In this case, skin color seems to be the motivator.</p>                \n                \r\n\n            \n                <p>This is not a tragedy. This is an execution designed to terrorize people just like the Boston marathon bombing and the mass murder at Fort Hood, Texas. Reaction came quickly.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES: </b>There is something particularly heart-breaking about a death happening in a place in which we seek solace and we seek peace.</p>                \n                \r\n\n            \n                <p><b>LORETTA LYNCH, U.S. ATTORNEY GENERAL: </b>Acts like this one have no place in our country and no place in a civilized society.</p>                \n                \r\n\n            \n                <p><b>SEN. LINDSEY GRAHAM (R-SC), PRESIDENTIAL CANDIDATE: </b>I can't explain this. I don't know what would make a young man at 21 get so sick and twisted to kill nine people in a church.</p>                \n                \r\n\n            \n                <p><b>HALEY: </b>We woke up today -- and the heart of soul of South Carolina was broken.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, terror acts have become, sadly, common the world over as thousands of human beings are being slaughtered by insane fanatics. In South Carolina the victims include the church's pastor 41-year-Old Clamenta Pinckney who was also a State Senator. 59-year-old Myra Thompson who taught bible study at the church. Another victim Cynthia Hurd was a manager in the public library system. Sharonda Coleman-Singleton, a speech therapist and girls track coach at Goose Creek High School. Ethel Lance, a member of the church for more than 30 years. Susie Jackson, Towanda Sanders, Dupayne Doctor, and Daniel Simmons -- also all long time church members. The nation's prayers and sympathies and directed to the families of the victims.</p>                \n                \r\n\n            \n                <p>Having just finished investigating John Hinckley who nearly assassin President Ronald Reagan, I can tell you that troubled people often act out against innocent strangers. Like Dylann Roof Hinckley gravitated toward racial extremism. At one point he expelled from the American Nazi Party for being too violent. That kind of pathology can never be stopped. It has been with us since man began walking the planet.</p>                \n                \r\n\n            \n                <p>Pundits who can say they can prevent individual acts of terror are misleading you. No one can do that. Unfortunately President Obama strayed into the theoretical today.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>At some point, we as a country, will have to reckon with the fact that this type of mass violence does not happen in other advanced countries. It doesn't happen in other places with this kind of frequency.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Of course mass murder does happen in other advanced countries, even those with all-out bans on firearms. The President used the frequency line to give him cover but again preventing random mass murder is impossible as is stopping the deranged acts of individual terrorists. The best we can do is slow them down.</p>                \n                \r\n\n            \n                <p>Talking Points believes President Obama was misguided in his gun comments today but that is a debate for another time. Tomorrow on The Factor will present you with facts about crimes committed by guns.</p>                \n                \r\n\n            \n                <p>But, not tonight. Because our focus should be on the individual victims and the country, not on policy. Sadly, there are those who will condemn America as being violent place where racial animus is the rule, not the exception. That is a lie. This is a nation of 320 million people who have freedoms beyond those of most other countries. We have 50 individual states that regulate public safety because each state is different with a unique set of circumstances. The U.S.A. is not Finland or Spain or even Canada where central authority basically rules. Here, citizens are free to move from place to place where laws and standards of behavior differ, sometimes dramatically.</p>                \n                \r\n\n            \n                <p>Wyoming is much different than Massachusetts. And that diversity has made the U.S.A. strong but also a target of propaganda.</p>                \n                \r\n\n            \n                <p>The truth is most places in America are safe and secure. Most citizens are decent, fair, and law abiding. Most police officers are honest and dedicated to helping people. Most civil servants, teachers, firefighters, local officials, take lower pay to look out for the folks.</p>                \n                \r\n\n            \n                <p>But now an ignorant terrorist like Dylann roof, a psychotic, damages the image of America by a disgraceful act of violence. Decent people mourn the lives of the nine Americans shot dead by Roof and we also mourn for our country. Evil is present in the United States as it is everywhere.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Bad day for America", "description": "Bill O'Reilly's Talking Points 6/18", "date": "2015-06-19T12:21:54Z"}