{"vcmId": "08ac0b73-84fd-4c7a-b69a-1dc34f1a930d", "url": "http://www.foxnews.com/transcript/2017/02/09/bill-oreilly-adventures-on-far-left.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As you may know, the Democratic Party is split between moderates and far left folks. But it is the ideological zealots that get most of the attention. This week, Betsy DeVos was confirmed as education secretary. But before that vote took place, liberal bomb thrower Al Franken attacked Miss DeVos in the Senate.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. AL FRANKEN (D), MINNESOTA</b>: It was one of the most embarrassing scenes I have witnessed during my time in the United States Senate. In fact, I believe it may have been one of the most embarrassing performances by a nominee in the history of the United States Senate.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, the reason Franken does not like Betsy DeVos is that she is a champion of school choice. She is devoted much of her life trying to bring quality education to poor kids, often trapped in bad inner-city schools. You would think that an uber liberal like Franken would approve of trying to help poor children but he does not. Why? Because by offering school vouchers and encouraging charter schools, which are run apart from the public school system, Miss DeVos is challenging the powerful teachers union.</p>                \n                \r\n\n            \n                <p>And those unions and their associates have donated more than $150,000 to Al Franken's campaigns. How enlightening. So, Franken, like many politicians, panders to those who give him money. It is beyond question that poor American children, offer minorities, are not getting the same quality of education that middle class and wealthy children are getting. So, why not try something new? Why not try school choice? Why not give poor parents subsidies to choose better schools for their kids? Why not? How long are we going to put up with discrimination against the poor? How long, Al?</p>                \n                \r\n\n            \n                <p>And other far left adventure, Senator Elizabeth Warren, as close to a socialist as you can get attacked Senator Jeff Sessions and hearings over whether Mr. Sessions should become the new attorney general. What Warren did was try to read a letter written by Coretta Scott King 31 years ago. Thirty one. That criticized Mr. Sessions. All it has to do with the Senator prosecuting a voter fraud case in Alabama while he was a U.S. attorney there. The situation involved three civil rights activists who Sessions believed were committing voter fraud. The three were ultimately acquitted of the charges and Mrs. King was furious with the case. Again, that was 31 years ago. But last night, seeking to paint Jeff Sessions as a racist, Warren brought up in the Senate.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MCCONNELL: </b>The senator has impugned the motives and conduct of our colleague from Alabama as warned by the chair. Senator Warren, quote said, \"Senator Sessions has used the awesome power of his office to chill the pre-exercise of the vote by Black citizens.\"</p>                \n                \r\n\n            \n                <p><b>WARREN:</b> I am surprised that the words of Coretta Scott King are not suitable for debate in the United States Senate. I asked leave of the Senate to continue my remarks.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Is their objection?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Object.</p>                \n                \r\n\n            \n                <p><b>WARREN:</b> I appeal the ruling.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>Objection is heard. The Senator will take her seat.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Later, Senator Warren read the later on Facebook. Now you can decide whether the far left is really looking out for the country by objecting to school choice and trying to smear a man like Senator Sessions. That call is entirely up to you. But what is crystal clear is a huge divide between the attitudes of the far left and moderates in the Democratic Party. Not to mention Republicans, where there is no common ground at all.</p>                \n                \r\n\n            \n                <p>Talking Points believes that honest debate is necessary but part of that equation is letting you know what is really going on behind the scenes. Thus, tonight's \"Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Adventures on the far left", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/8", "date": "2017-02-09T12:49:24Z"}