{"vcmId": "0a9bae6c-9c16-4290-be82-5a0d590e902b", "url": "http://www.foxnews.com/transcript/2015/04/22/bill-oreilly-hillary-dilemma.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>No matter what kind of controversy engulfs Hillary and Bill Clinton, they have a ready defense -- \"The Clinton haters are at it again.\" And there is some validity to that defense as the Clintons are the most controversial couple in America and perhaps in the history of this country.</p>                \n                \r\n\n            \n                <p>In general, a big mistake the Clintons make is that they don't admit mistakes. For example, Benghazi. All former secretary of state Clinton had to say was that security in Libya was very difficult, that she and her staff didn't pay close enough attention to the threats that were brought to their attention. That's a painful admission, but mistakes do happen.</p>                \n                \r\n\n            \n                <p>Libya's a backwater. Secretary Clinton was gallivanting all over the place so her admission and deep apology most likely would have been accepted by most fair-minded people. Instead, instead Hillary Clinton and President Obama stone walled, angering millions of Americans.</p>                \n                \r\n\n            \n                <p>On the e-mail front, there's no excuse. It was a calculated deception -- everybody knows that. The calculation the Clintons are making is that most voters won't care.</p>                \n                \r\n\n            \n                <p>Now on to the latest brouhaha -- a new book will present circumstantial evidence that Hillary Clinton profited from her position as secretary of state. She did this because her husband made an enormous amount of money on the lecture circuit while she was in office. Also there is evidence that Clinton may have acted favorably to some concerns that donated big money to the Clinton Foundation. While a designated charity, the foundation pays an awful lot of bills for Bill and Hillary as well as for their daughter Chelsea.</p>                \n                \r\n\n            \n                <p>Talking Points doesn't know if there's overwhelming evidence of donations for favors. Already some are saying Mrs. Clinton should be indicted like Senator Robert Menendez of New Jersey. At this point, that's a gross overstatement and one that actually helps the Clinton campaign.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>PODESTA:</b> It's a book that's written by a former Bush operative who's a reporter for that august news organization, Breitbart.com, or has been in the past. He's cherry-picked information that's been disclosed and woven a bunch of conspiracy theories about it. The facts -- there's nothing knew about.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The author of the book Peter Schweizer did help President Bush the Younger write speeches. He is also an editor-at-large at Breitbart News a conservative Web site. But that does not diminish what Mr. Schweitzer is writing.</p>                \n                \r\n\n            \n                <p>Again, the charges will have to be vetted. And big media such as the \"New York Times\", the \"Washington Post\" as well as Fox News are doing just that.</p>                \n                \r\n\n            \n                <p>One bad sign for Hillary Clinton is that a character assassin, David Brock, is now being used by her campaign to attack the credibility of the book. There are few Americans lower than Brock, who is a known hater and smear merchant. If the Clinton campaign is going to use people like Brock, major problems will develop.</p>                \n                \r\n\n            \n                <p>With the Democratic Party fully committed to Hillary Clinton, all of these controversies will get attention, but in the end it comes down to you -- the American voter. We are living in a country that is now largely fed up with politics, and many have turned away from public policy, descending into trivial pursuits mostly in the social media.</p>                \n                \r\n\n            \n                <p>So it is easier to overcome dubious situations than it used to be. Talking Points will be fair to Hillary Clinton, but right now her profile has been damaged and she needs to address all the controversies with serious media people and soon.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The Hillary Dilemma", "description": "Bill O'Reilly's Talking Points 4/21", "date": "2015-04-22T12:13:07Z"}