{"vcmId": "0b5214bf-b78e-4e18-a432-536ae4e2cb11", "url": "http://www.foxnews.com/transcript/2015/11/03/bill-oreilly-sympathy-for-drug-dealers.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>President Obama in Newark, New Jersey today touring a drug rehab center touting his leniency towards people involved with the hard drug trade who he says are nonviolent. Today the first wave of more than 6,000 drug dealers released from federal penitentiaries all around the country after their sentence was shortened at the behest of President Obama.</p>                \n                \r\n\n            \n                <p>The publicly-stated reason is that keeping drug dealers in prison for long periods of time too expensive and the punishment does not fit the crime. The liberal point of view is that selling heroin, cocaine and methamphetamine is a nonviolent action, nonviolent. Despite the fact that in 2013, last stats available, nearly 44,000 people died from drug overdoses in America. Thousands more killed in automobile accidents. Thousands more contracted AIDS and other diseases that are generally a huge strain on the American medical system -- all because people sell narcotics to make money.</p>                \n                \r\n\n            \n                <p>Yet those people, President Obama puts forth, deserve sympathetic treatment. Of course, that is erroneous in the extreme. And many law enforcement agents are harshly critical of President Obama's early release program. That will continue -- thousands more will be released.</p>                \n                \r\n\n            \n                <p>Now, Talking Points knows the real reasons the President and other liberal Americans do not want harsh punishment for drug-involved individuals.</p>                \n                \r\n\n            \n                <p>Reason number one: the left firmly believes that police target African-Americans more than whites in the narcotics trade. Therefore, the thinking goes the criminal justice system is racist.</p>                \n                \r\n\n            \n                <p>Reason number two: many liberals want to legalize all drugs. They believe it's a personal choice and should not be punished by society.</p>                \n                \r\n\n            \n                <p>Also President Obama apparently thinks diverting drug involved individuals into rehab is a better solution than incarceration. The problem is rehab never works unless the individual wants to get off drugs or alcohol. And many offenders, perhaps most do not. Thus the whole exercise will accomplish little in the way of public safety.</p>                \n                \r\n\n            \n                <p>Some convicts will inevitably return to the drug life and they will cause a tremendous amount of damage.</p>                \n                \r\n\n            \n                <p>But here's the worst part of President Obama's foolish policy. It sends a message to young people, to drug dealers, to drug users, that society doesn't believe this is a dangerous and immoral situation.</p>                \n                \r\n\n            \n                <p>When I was growing up in Levittown, New York there was nothing worse than being a dope dealer -- nothing worse. They were outcast in the neighborhood, considered scum. Now they are glorified in some places. In many circles the local dealer is considered cool.</p>                \n                \r\n\n            \n                <p>The acceptance and promotion of addicted substances is a national disgrace. Drug dealing is one of the lowest forms of human activity. It enslaves, kills, and harms people. Yet, President Obama is making it a priority to give folks who sell hard drugs leniency -- awful.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Sympathy for drug dealers", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/2", "date": "2015-11-03T13:07:23Z"}