{"vcmId": "0bd2af81-b625-4ccd-9876-a2429c45c1a7", "url": "http://www.foxnews.com/transcript/2015/02/26/bill-oreilly-hating-president-obama.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>At the height of the Iraq war, the vilification of President Bush the younger was off the chart. The left in America accusing him and Vice President Cheney of lying to get us into the war, of sacrificing American military people so Halliburton could make money, and a variety of other vile allegations.</p>                \n                \r\n\n            \n                <p>Having seen President Clinton go through impeachment, I thought President Bush got it even worse with the smearing. Enter President Obama, who is also loathed by some Americans.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> You want to know about that fight among Republicans running for president is all about? What's it all about? It is about who can hate President Obama the most.</p>                \n                \r\n\n            \n                <p>Let me finish with the contest of hate that seems to be going on among Republican candidates for president. Who can hate Obama the most?</p>                \n                \r\n\n            \n                <p>Let me finish tonight with this contest of hate we are watching among the Republican candidates for president. How much do you -- how much can you hate President Obama?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Did somebody say hate? Now, there is no question that Barack Obama's policies are controversial. He is a big tax and spend guy, has increased the power of the federal government, has ordered a quasi amnesty for illegally aliens, has withdrawn completely from Iraq leading the chaos, has imposed the health care system many people despise. So as far as policy goes, there is much angst directed at the President and that's fine.</p>                \n                \r\n\n            \n                <p>On the personal front though, Mr. Obama gets it too much. This is a letter from Tom who lives in Florida quote, \"It's time to impeach Obama and the Islamistration. This guy is clearly sabotaging our country.\"</p>                \n                \r\n\n            \n                <p>Islamistration -- wow.</p>                \n                \r\n\n            \n                <p>This from Liz, who lives in New Mexico, \"Obama is a Muslim, many Muslims do not care about Christians. The President fights the crisis all over the world with politics and love for his Muslims.\"</p>                \n                \r\n\n            \n                <p>\"Talking Points\" laments the haters on both sides. Smearing anyone should be unacceptable. In the upcoming presidential campaign the Republican candidate surely will point out where they differ with President Obama and by proxy Hillary Clinton.</p>                \n                \r\n\n            \n                <p>One of Mrs. Clinton's challenges is deciding whether to repudiate some of Mr. Obama's policies. Is she going to do that? Interesting dilemma. If she doesn't, Republicans certainly have an opportunity to put Hillary Clinton on the defensive. But any Republican candidate who says personal things about either the President or Mrs. Clinton will be making a tremendous mistake.</p>                \n                \r\n\n            \n                <p>The haters on both the left and the right make a lot of noise, they get a lot of attention but most Americans don't like this kind of stuff. Once in a while a takedown is necessary but, to make a living out of gutter sniping -- ticket to defeat.</p>                \n                \r\n\n            \n                <p>Right now America is in a bad place. We're weak overseas. The economy is still mainly rewarding the wealthy. President Obama has had six years to improve that situation. In my opinion, he has failed to do so. That's an objective analysis based upon facts, not a personal attack.</p>                \n                \r\n\n            \n                <p>Here is a final fact. I have had discussions with both George W. Bush and Barack Obama. They see the world very differently. But they both have absorbed tremendous punishment in order to serve their country. I respect that and hope the upcoming presidential campaign will not be a smear fest. There is simply too much at stake for that to happen.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Hating President Obama", "description": "Talking Points 2/25", "date": "2015-02-26T13:16:04Z"}