{"vcmId": "0ccadfeb-f759-43b8-a80e-668504a6e426", "url": "http://www.foxnews.com/transcript/2016/02/09/who-has-momentum-going-into-new-hampshire-primary.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 8, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Campaign 2016 Segment\" tonight, in just a few hours voters start the primary process in New Hampshire at a place called Dixville Notch -- voting begins at midnight there. Now this year, the Granite State primary takes on major importance especially in Republican circles where there are still a bunch of viable candidates.</p>                \n                \r\n\n            \n                <p>Joining us now from New Hampshire, Jack Heath radio talk show host on WGIR and Adriana Cohen a columnist from \"Boston Herald\". Miss Cohen, I begin with you. What candidates in your opinion have the most momentum right now?</p>                \n                \r\n\n            \n                <p><b>ADRIANA COHEN, BOSTON HERALD:</b> Donald Trump -- there is no doubt about it. In most polls he is still dominating in double digits. Many people I speak to, both in Massachusetts and in New Hampshire are very excited about a possible Donald Trump presidency.</p>                \n                \r\n\n            \n                <p>And you know all about these rallies that he has that draws literally up to 20,000 people. So he has become sort of a phenomenon in and of himself. And so he's the man to watch tomorrow.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> 1All right. So that hasn't abated at all, it hasn't calmed down at all? Do you agree with that, Mr. Heath?</p>                \n                \r\n\n            \n                <p><b>JACK HEATH, RADIO HOST: </b>I do. I think Donald Trump has genuine momentum here. It's a rebellious campaign. We're the \"Live free and die\" state. That's why Sanders is doing well in the progressive.</p>                \n                \r\n\n            \n                <p>But I will also keep an eye still on Marco Rubio. He had real momentum going into the weekend. I don't think that was a fatal moment when Chris Christie whacked him. And surprisingly, Bill, John Kasich and Jeb Bush -- I think they are moving. New Hampshire likes to send surprises to the rest of the nation, you know that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>HEATH:</b> And I would watch out for Kasich and Bush.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They've invested a lot of time and money in that state and it's their last stance. Both of them -- they both have to do well.</p>                \n                \r\n\n            \n                <p><b>HEATH:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Although Mr. Bush can stay in because he has the money it becomes a war of attrition.</p>                \n                \r\n\n            \n                <p>Miss Cohen, let's assume and I believe this is true as well, but don't take it to the bank because my Super Bowl prediction was awful and I will deal with that later. I'm copping to it.</p>                \n                \r\n\n            \n                <p>I think Trump is going to win. I don't know if he is going to win by all that much though. I think that the second and third contenders are going to take a lot of that. Who do you see second and third, Miss Cohen?</p>                \n                \r\n\n            \n                <p>Cohen: I think Kasich has a real shot at coming in second place. In the latest Monmouth poll he came in second place. He has done over 100 town halls here. He has definitely had momentum.</p>                \n                \r\n\n            \n                <p>Marco Rubio is still doing well although that debate he fumbled the ball. There is no doubt about it in that exchange with Chris Christie. And I think we can see a surge with Jeb Bush. Agree with Jack because he has climbed nine points in one of the latest Monmouth polls as well.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. So, right now, those four names: Trump, Kasich, Bush, and Rubio are the ones that you both see as a fighting it out.</p>                \n                \r\n\n            \n                <p><b>COHEN:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Are you dismissing all of the others? Dr. Carson, Carly Fiorina, Chris Christie who put in a lot of currency Mr. Heath -- are you dismissing them?</p>                \n                \r\n\n            \n                <p><b>HEATH:</b> No. Bill, I think there are four first class tickets if you will out of New Hampshire. The race will continue. I do agree with you that I think Trump will win but more like the 10 percent range. Double digits would be good.</p>                \n                \r\n\n            \n                <p>But I think below those four, maybe Cruz, but keep an eye, believe it or not, on Carly Fiorina. She has been on my show in New Hampshire today a lot. She wasn't in the debate. I think she should have been on that ABC debate stage. She is polling ahead of some of these people.</p>                \n                \r\n\n            \n                <p>She might even finish ahead of Chris Christie. Dr. Ben Carson has dropped way down. So I would keep an eye maybe on Carly Fiorina.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That would be a shocker -- that would be a shocker because she hasn't been visible. But you know, New Hampshire, Adriana is a very small state.</p>                \n                \r\n\n            \n                <p>You guys going to go up to Dixville Notch at midnight up there? Cold up there. There's what -- nine voters?</p>                \n                \r\n\n            \n                <p>Have to do a show in the morning.</p>                \n                \r\n\n            \n                <p><b>HEATH: </b>I'd like to be there but I have to do a show in the morning.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's nine voters there, right?</p>                \n                \r\n\n            \n                <p><b>HEATH:</b> Something like that -- maybe 10 or 12.</p>                \n                \r\n\n            \n                <p><b>COHEN:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. And then that's the first vote and then it cascades down.</p>                \n                \r\n\n            \n                <p><b>HEATH:</b> Interesting place.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Hey, I really appreciate you guys --</p>                \n                \r\n\n            \n                <p><b>HEATH:</b> Record turnout Bill -- record turnout tomorrow.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>COHEN:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Record turnout in the Granite State.</p>                \n                \r\n\n            \n                <p><b>HEATH:</b> That's what they're predicting.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Good. That's good for our republic. Thank you both.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Who has momentum going into the New Hampshire primary?", "description": "'The O'Reilly Factor' examines which candidates can win the Granite State's vote", "date": "2016-02-09T13:13:17Z"}