{"vcmId": "0e50e3f6-597f-417c-87f2-f99fac209181", "url": "http://www.foxnews.com/transcript/2016/06/08/bill-oreilly-did-hillary-clinton-catch-break-because-donald-trump-criticized.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Later on, Secretary Clinton will make a victory speech as she now has more than enough delegates for the nomination as you just heard. She still has the FBI investigation to deal with but other than that, she simply has to defeat Donald Trump to become the next president. However, that might not be so simple because the populist campaign Trump is running has energized millions of voters. The Clinton campaign is counting on Mr. Trump continuing to create controversy that will dilute his message.</p>                \n                \r\n\n            \n                <p>Last night on this program Mr. Trump reiterated that he believes the judge presiding over the federal class action suit against Trump University has treated him unfairly. Mr. Trump says it's all about politics because the judge is of Mexican descent and may not applaud Trump's strong stance against illegal immigration. Today, Mr. Trump issued a statement saying he is done talking about the situation. But the story will remain. And it's worth analyzing in a fair way. If you read the \"New York Times\" today, there is an article stating that Mr. Trump has attacked judges in the past who have ruled against him.</p>                \n                \r\n\n            \n                <p>Some of those judges were white. The truth is, if Mr. Trump feels aggrieved, he will criticize you or me or anyone. That's just the way he is. So those who are calling Mr. Trump racist, apparently do not know his history. He is an equal opportunity basher. But it was unwise for the presidential candidate to spotlight the judge's ethnicity. That mistake gave the Trump haters a free pass to vilify.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MELISSA MARK-VIVERITO (D), NEW YORK COUNCIL SPEAKER:</b> This is really about the most serious position in this country and he is defaming and detracting attention away from this essence of this case. This is an individual, Donald Trump, who is a charlatan and who is a racist.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ms. Viverito has despised Donald Trump for years. Everybody in New York City knows that and her charge of racism went unchallenged. That's wrong. Whether it's Trump or Hillary Clinton or President Obama, no add homonym attacks carry any credibility. They should all be condemned. This racism business is totally out of control and journalists have a responsibility to reign it in providing perspective rather than silently allowing the cheap talk. If you watch my interview with Donald Trump last night, the last portion of it was instructive.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I think the judge is an honest man. I don't think he is hosing you. I really don't. I have checked him.</p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESUMPTIVE PRESIDENTIAL NOMINEE</b>: Well, I hope so. Look, I want him to be.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. I think he is an honest guy.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Mexican or not Mexican, I want him to be. Just -- all I want him to do is give me a fair shake. When we have thousands of people say Trump U is great, why does this thing continue to go forward?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Finally I suggested the judge may want, by his only choice to recuse himself from the case, not because he has done anything wrong, he hasn't. But this situation is far more than civil litigation. The law firm representing the plaintiffs is a major supporter of the Democratic Party. Paying Bill and Hillary Clinton hundreds of thousands of dollars to give speeches. It's not a stretch to see the class action suit as a political cudgel. It's certainly true that Judge Curiel might be seen as giving into intimidation if he would handle the case to another federal judge. That is a very bad thing.</p>                \n                \r\n\n            \n                <p>Judges have to be strong in the face of criticism. But with this case, having a direct impact on the presidential vote, it would be better if there were not a whiff of any political agenda. Would it not? And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Did Hillary Clinton catch a break because Donald Trump criticized a federal judge?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 6/7", "date": "2016-06-08T12:13:00Z"}