{"vcmId": "1178d0c9-4356-4b40-9525-18b3a1c66045", "url": "http://www.foxnews.com/transcript/2016/02/11/donald-trump-on-trade-deficit-with-china.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 10, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Continuing now with last night winner of the New Hampshire primary Donald Trump.</p>                \n                \r\n\n            \n                <p>Now Friday, the Feds announced that China is selling $366 billion more merchandise to we Americans than we Americans sell back to the Chinese, $366 billion trade gap.</p>                \n                \r\n\n            \n                <p>Specifically -- specifically, how will you fix that?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: You know this is my big point I have been talking about it for years.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know. But I want to know how you are going to do it.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Listen to me. I will tell you, ok? We are going to have to go -- one of the reasons they are able to do it is they devalue their currency to such an extent. They are the single greatest currency manipulator that's ever been on this planet.</p>                \n                \r\n\n            \n                <p>And if they don't stop devaluing we're going to have to charge them a tax on the goods coming in. They, by the way, Bill, just in case you don't know it they tax our goods going into China. It's a totally unfair deal.</p>                \n                \r\n\n            \n                <p>And what's happened every time they devalue their currency they make it impossible and more and more difficult for our businesses to deal with China on the other side. The gap is getting bigger and bigger. It's really called the deficit. The deficit is getting bigger and bigger.</p>                \n                \r\n\n            \n                <p>Unless we have somebody very smart and very tough that understands it -- and our president does not understand it -- but I understand it better than anybody, we're going to have nothing but trouble.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So you are going to say to them.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: It's going to be $505 billion this year.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: If you continue to devalue your currency -- I'm going to slap a tariff on all Chinese goods coming into the United States. Ok. They then are going to say to you --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Bill, yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: President Trump, we are going to sell all of our bonds that we are holding for America's debt. We're going to flood the market with them and crash your currency.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: That's all right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's what a trade war would do.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Now, they are not -- no, no, no. They wouldn't crash -- they won't crash our currency. They will crash their economy. That's what they are going to do if they start playing that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. It's going to be bloody.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> They will crash their economy. You will have -- let me explain something. We're too dependent on China. We're too dependent. They will have a depression, the likes of which you have never seen if they ever did that. That's what would happen, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I mean you know what people don't understand in our dealings with China, we have the cards. They don't have the cards.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's what I say (inaudible).</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> We have the cards because they need our economy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And that was a good specific answer and I appreciate that.</p>                \n                \r\n\n            \n                <p>So now let's go on to your statement you're going to deport 12 million people. As you have to know, each one of the 12 million people here illegally is entitled to due process. That means that if Donald Trump as president issues a deportation order they are entitled to a court hearing in front of a judge. With 12 million people that takes us up --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: They may or may not be --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They are.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: -- excuse me -- Bill, if they're here illegally they may or may not be. Just like the argument we had about the anchor babies.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm telling you --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> In my opinion you don't need --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>-- all settled law says once you're here you are entitled to our constitutional protections, every single case. All right. Just so you know.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I disagree, ok? I disagree. That doesn't mean I wouldn't do that. That doesn't mean I wouldn't do it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They will block you.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>If they are here illegally, I disagree with you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They'll block it. The federal courts will block it.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> They're here illegally Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Look, Obama just got blocked.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> They are here illegally.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It doesn't matter. They are entitled to constitutional protections. Obama just got blocked on a, his illegal immigration amnesty and b, in telling the coal companies that you can't have a certain amount of emissions. He got blocked on both of them.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: You and I had an argument not so long ago about the anchor babies where somebody comes, has the baby here and they're forever going to be taken care of.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. And that's law.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> And everybody said you need a new constitutional amendment to end that. They turned out to be wrong. I turned out to be right. You just need an act of Congress. You don't need a new constitutional amendment. And we had the same discussion.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You change the law but not retroactively. You can change it but not retroactively.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Ok. So, Bill, what you're saying would mean that if somebody just walked across the border, just walked across and they are here for a couple days and border patrol catches them, they can't bring them back, we have to go through a whole long process because you are not right about that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They can catch them the act of crossing -- if they catch them in the act of crossing, they can repatriate right away. If they're here and established, they get the due process. All right. One more thing.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I disagree.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Ok. That's what makes our program great. We have a lively debate. You know that. All right.</p>                \n                \r\n\n            \n                <p>In Colorado, they legalized pot, ok. $1 billion industry, a billion-dollar a year industry in Colorado. And all of the dealers, all the pushers are going to Colorado, loading up on the free pot because it's legal, not free -- legal and then zooming around the country selling it. Does that concern you?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> That's a real problem.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What would you do?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> That's a real problem.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What would you do?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: There is another problem. In Colorado, the book isn't written on it yet, but there is a lot of difficulty in terms of illness and what's going on with the brain and the mind and what it's doing. So, you know, it's coming out probably over the next year or so. It's going to come out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What would do you to stop it? What would you do?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I would really want to think about that one, Bill. Because in some ways I think it's good and in other ways it's bad. I do want to see what the medical effects are. I have to see what the medical effects are and, by the way -- medical marijuana, medical? I'm in favor of it a hundred percent. But what you are talking about, perhaps not. It's causing a lot of problems out there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But you know the medical marijuana thing is a ruse that I have a headache and I need, you know, two pounds of marijuana.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> But I know people that have serious problems and they did that they really -- it really does help them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. All right. Was that fun? Fun interview? Another one? Fun? You like the show better than anyone, right?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> It's always a pleasure after one hour sleep coming in from New Hampshire to be on your show. Always a great honor.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But you still can. You can still can, even though you don't have any sleep. I don't know how that happens.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>That's good. I don't know, maybe it's --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Once again, congratulations on the victory in New Hampshire.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump on the trade deficit with China", "description": "GOP candidate on his strategy for the economy, Muslim refugees and marijuana on 'The O'Reilly Factor'", "date": "2016-02-11T13:29:56Z"}