{"vcmId": "1278f47a-b62c-40d2-9863-067bb8b12943", "url": "http://www.foxnews.com/transcript/2016/04/28/illegal-alien-criminals-hurting-americans.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 27, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thanks for staying with us. I'm Bill O'Reilly in the \"Unresolved Problem\" segment tonight. Illegal alien criminals. They were the subject of a House Judiciary Subcommittee hearing last week.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>REP. TREY GOWDY (R), SOUTH CAROLINA</b>: Today there are over 350,000 known criminal aliens in the United States who are not detained by ICE. The number of criminal aliens living in the United States not in custody, not separated from society is larger than the city of Pittsburgh, Pennsylvania.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: In addition, what's the deal on Kate's law which still has not passed. That's the proposed legislation off the terrible murder of 32- year-old Kate Steinle allegedly by an illegal alien felon in San Francisco.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington is Congressman Trey Gowdy. So, let's take Kate's law first, Harry Reid killed it in the Senate. What's the House doing?</p>                \n                \r\n\n            \n                <p><b>REP. TREY GOWDY (R), SOUTH CAROLINA: </b>Well, Bill, thank you for having me on. House Judiciary passed of our iteration of Kate's law in the Davis Oliver bill. And I say our iteration, there are many minimums after entry after removal. But there is also a provision that deals with sanctuary cities and there's also a provision that deals with empowering state local law enforcement. If you take the murder of Kate Steinle, that defendant had served north of ten years in federal prison, so it was double the mandatory minimum in Kate's law which is five. But without the sanctuary city fix and without empowering state and local law enforcement simply having another law for this administration not to enforce won't prevent the next Kate Steinle.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. But here's the fallacy of your argument. You are never going to get sanctuary cities under this president ever in a million years. All right? It's an exercise in futility. He would, I think he would have to sign Kate's law as a standalone. That's a start. You send a message and it makes easier for law enforcement to round up the aliens that you talked about last week because they wouldn't have to commit a crime. All they have to do is defy deportation. If they're aggravated felon you sweep them up and arrest them right away and put them in jail for five years. So, when you tie it in and that's what they did in the Senate with sanctuary cities, you know it's not going to pass, Congressman.</p>                \n                \r\n\n            \n                <p><b>GOWDY</b>: Well, at the risk of disagreeing with you on your own show.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You can do that. I mean, come on. Go ahead.</p>                \n                \r\n\n            \n                <p><b>GOWDY:</b> I have been in Congress for five years. And I have watched this administration not enforce a plethora of laws, including laws that have mandatory minimums like our drug laws. Remember, Eric Holder passed a memo explicitly so prosecutors could get around mandatory minimums. This administration has no interest in enforcing immigration laws whether it's Kate's law.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, that's obvious though, Congressman. But it's your job as head of the Judiciary Committee to go around the president. We all know he is not going to enforce the law. We all know he is going to stick up for sanctuary cities. We know that but Kate's law is different. I think you can mobilize both parties and you would want to know \"On The Record\" who is against that. Who is going to vote against that? Stand alone and just start the process.</p>                \n                \r\n\n            \n                <p><b>GOWDY</b>: I am not disagreeing with you that it would be great to have a vote on the record. I'm not disagreeing with you that Kate's law in the House could pass as a standalone bill. My point is this. Having yet another law for this administration to not enforce while you open up the broader discussion about what to do with the 12 million, which is not proven to be a very good discussion for folks on our side, all the while you are not going to get what you and I want, which is a mandatory minimum. Keep in mind, even if you had Kate's law, like you have other mandatory minimums, you don't control the prosecutor's. You don't control the executive branch.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I got it but you are embarrassing the opposition who has allowed the situation to get out of control. And you are giving relief, at least to the Steinle family and the thousands of other victims, families, who have lost people to violent illegal alien felons. You are doing something. We know this administration is corrupt on this issue. Everyone knows it embarrass them. I will give you the last word.</p>                \n                \r\n\n            \n                <p><b>GOWDY:</b> Well, thank you. I, again, the law that House Judiciary passed does have mandatory minimums. So it is similar to Kate's law. I do get your point that including sanctuary cities and local law enforcement adds additional reasons to not support it. I would be thrilled to vote for Matt Salmons' bill, Kate's law. I just think our time is probably better spent finding a chief executive who is actually going to enforce the law.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You can walk and chew gum at the same time, Congressman. But think about it if you would with all due respect. I would love to you break it out, because then I could go with it and we can really pinpoint the bad guys here. And that's what the people need to see. Who the bad guys are in Congress. Hey, congressman, we always appreciate you coming on. Thank you very much.</p>                \n                \r\n\n            \n                <p><b>GOWDY: </b>Yes, sir.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Illegal alien criminals hurting Americans", "description": "'The O'Reilly Factor' examines the immigration and border security debate and an update on 'Kate's Law'", "date": "2016-04-28T12:38:24Z"}