{"vcmId": "12b8a386-cac9-4b4a-9849-4149814ed080", "url": "http://www.foxnews.com/transcript/2015/02/24/cbs-news-releases-video-falklands-war-riots.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 23, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Factor Follow up Segment\" tonight, as you may know some left wing zealots have attacked me, your humble correspondent. They say I trumped up my war experiences in the Falklands conflict and in El Salvador.</p>                \n                \r\n\n            \n                <p>At issue, the huge riot immediately after the Argentine surrendered to the British in 1982. As I reported accurately, the violence was horrific. Today CBS News released the video.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEOTAPE)</b></p>                \n                \r\n\n            \n                <p><b>DAN RATHER, FORMER CBS NEWS ANCHOR:</b> As word of the Argentine defeat leaked out in Buenos Aires, thousands of demonstrators began to gather outside of the Presidential palace. But the demonstrators as many as a five thousand of them began screaming \"Traitor, traitor\". And \"This is the end of the military dictator.\"</p>                \n                \r\n\n            \n                <p>Police moved in with clubs and tear gas, they dispersed the crowd. Some television crew members were knocked to the ground.</p>                \n                \r\n\n            \n                <p>The fighting in the Falklands is over but there is new fighting now on the streets of Buenos Aires. And tonight there are signs that the last casualty of Falklands war could be the Argentine military junta.</p>                \n                \r\n\n            \n                <p>In Buenos Aires, angry protesters gathered outside the gates of the presidential palace in the biggest anti-government demonstration in years. The biggest loser the Argentine government which started the war and failed to win it and which tonight, on the streets of Buenos Aires did battle with its own people.</p>                \n                \r\n\n            \n                <p><b>ERIC ENGBERG, CBS NEWS CORRESPONDENT:</b> There were arrests and beatings. Then with guns that fired tear gas and plastic bullets, the police opened fire.</p>                \n                \r\n\n            \n                <p>It is not known how many were hurt but witnesses reported at least some serious injury.</p>                \n                \r\n\n            \n                <p><b>CHUCK GOMEZ, CBS NEWS CORRESPONDENT:</b> As the mob grew to 10,000, they broke through police lines, pelting officers with coins and garbage (ph). An unknown number of demonstrators were injured. Unknown because of a virtual news black out in Buenos Aires.</p>                \n                \r\n\n            \n                <p><b>(END VIDEOTAPE)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We posted the entire video on BillOReilly.com.</p>                \n                \r\n\n            \n                <p>With us now here in New York City, Joe Concha, columnist for Mediate and joining us on the phone from Florida, Don Browne former NBC News bureau chief in Miami. He was in charge of news coverage in central and South America including the coverage of the Falklands war and the El Salvadorian war.</p>                \n                \r\n\n            \n                <p>Mr. Browne we begin with you, you have read the \"Mother Jones\" article on me. What's your assessment of the situation?</p>                \n                \r\n\n            \n                <p><b>DON BROWNE, NBC NEWS:</b> Well, there were two things. Number one I was surprised at the article because interestingly enough, you came on my radar. I was overseeing the coverage in El Salvador which was a brutal war. You were there to cover the war because it was an opportunity for young journalists to get they're ticket punched. That was a time when satellites had just come on line and that was a war that was the number one news story at the time. So, you came down to get your ticket punched and you did.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And we went up to Morazon which was the most dangerous providence. We did a story up there as you know. And then we segued down to the Falklands war. You were overseeing the coverage there in the Falklands. You know what happened that night when Galtieri, his government surrendered to the British.</p>                \n                \r\n\n            \n                <p>In my reporting I told it exactly the way it was or did I make any mistakes, Mr. Browne?</p>                \n                \r\n\n            \n                <p><b>BROWNE: </b>No. Let me take you the progression of the war. At first it was a joke. Nobody took it seriously. We had the only reporter that actually got on the Falkland Islands, Robin Lloyd actually got there through the Argentine navy. As the war went badly, there were demonstrations every day. There were tanks in the street. It was a country at war.</p>                \n                \r\n\n            \n                <p>At first it was casual and it became more and more serious. And as the military were losing badly, the populace began to turn on the military leadership.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You said there were tanks in the streets. You mean the streets of Buenos Aires where we all were.</p>                \n                \r\n\n            \n                <p><b>BROWNE:</b> There were tanks in the -- yes. It was a real country at war. It wasn't a joke.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's right.</p>                \n                \r\n\n            \n                <p><b>BROWNE:</b> It was a real war and they were taking it very seriously and at first Buenos Aires was a pretty nice place to be if you are covering the war. But as it turns out, it got progressively more intense.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now I got their only three days before that giant riot, so I didn't participate in all the fun that you guys might have had. But your correspondents were with me in the Plaza De Mayo when the riot broke out. What did your correspondents tell you about the danger that they witnessed and indeed experienced?</p>                \n                \r\n\n            \n                <p><b>BROWNE:</b> Well, these were veteran correspondents, we saw the situation escalating. They weren't surprised. But they were surprised at the overall reaction. And but it was -- to them, it was business as usual. That's what they were down there to do. It wasn't -- didn't happen one day. It was the progression that led up to -- you call it a riot. It was a very intense situation where people got hurt. And there was a very serious confrontation. And it was a defining moment when the populace really turned on the military.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It was extremely violent from the street where I was. And we couldn't get casualty numbers because, as know, it was a military dictatorship and they don't give that to you. But I saw people hit the ground hard, I saw them hauled off, put into ambulances and police vehicles and local reportage was that there were fatalities. We have not been able to say how many -- all right? But I believe there were.</p>                \n                \r\n\n            \n                <p>And in the \"New York Times\" article, there is Myzel (ph) -- he did a pretty good job. You know, everybody was trying to get the numbers but the numbers were impossible to get. But there is no doubt that this was extremely violent and volatile situation where reporters were in danger or am I wrong?</p>                \n                \r\n\n            \n                <p><b>BROWNE:</b> No, it was. And any situation like that, when you bring that kind of intensity together in a protest whether it be police or in this case the military are reacting aggressively it's a dangerous cocktail.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But nobody said it was a walk in the park, did they Mr. Browne?</p>                \n                \r\n\n            \n                <p><b>BROWNE:</b> Not at all. This is a very serious situation where a lot of people died.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>A lot of people died -- you bet.</p>                \n                \r\n\n            \n                <p><b>BROWNE:</b> A lot of people on both sides, the British and the Argentine.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>900 deaths on the island and we don't know how many deaths in Buenos Aires.</p>                \n                \r\n\n            \n                <p>But I really appreciate you standing up because there is a lot of pressure to make this a political issue. But you have a sterling reputation, Mr. Browne. You have been there. You have seen it. And I can't thank you enough for coming on today.</p>                \n                \r\n\n            \n                <p><b>BROWNE:</b> My pleasure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. Now, let's turn to you for the political component. You are one of the few guys who saw this from the beginning for really what it was. So, tell the audience what you wrote.</p>                \n                \r\n\n            \n                <p><b>JOE CONCHA, MEDIATE.COM:</b> Ok. In situations like, this Bill, you always have to look to motive. Because \"Mother Jones\" is in each Web site appealing to an audience that it's giving its red meat to basically progressive Democrats, liberals.</p>                \n                \r\n\n            \n                <p>And then I have to look to who wrote the story. And I see David Corn, and David Corn was employed by Fox News as a contributor from 2001 to 2008. Then he wasn't -- his contract wasn't renewed. Basically it's a nice way of saying you are fired.</p>                \n                \r\n\n            \n                <p>So then I see Eric Engberg enter the scene. He goes on CNN yesterday and he says he heard no sirens. He heard no gunshots. He called it a relatively tame riot. Then I see that video that CBS released today. And you say that he was called \"Room Service Eric\" -- right?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right.</p>                \n                \r\n\n            \n                <p><b>CONCHA:</b> I have got to think that turkey was on the menu that night because you would have to eat something that would make you fall asleep very heavily. If you watched that video and you know and you say that there is no sirens, no gunshots. He watched that, that completely contradicts it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He downplayed the whole thing.</p>                \n                \r\n\n            \n                <p>I can't say with any certainty that Mr. Engberg not in the Plaza De Mayo when this all hell broke loose.</p>                \n                \r\n\n            \n                <p><b>CONCHA:</b> Then why would he describe it that way?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But I will tell you this. When I left the hotel -- because I was there all day -- when I left the hotel, he was in the hotel. And when I ran the video back to feed to the Rather program, he was in the hotel.</p>                \n                \r\n\n            \n                <p><b>CONCHA:</b> So we look to motive again then, right?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't know. All I'm telling is I just report the facts. Every single fact that I reported about this Falklands experience in Buenos Aires is true.</p>                \n                \r\n\n            \n                <p>So, to you on Mediaite this is a political hit job -- right.</p>                \n                \r\n\n            \n                <p><b>CONCHA: </b>Yes, and the reason we know that now -- not because I'm saying it is because I don't see any establishment major media picking up this story.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But I just wanting to say to you, you have a lot of courage to do what you did because Mediaite is fairly left wing. And they are not friendly to me at all. I really give you credit.</p>                \n                \r\n\n            \n                <p><b>CONCHA:</b> Well, Mediaite is a box of chocolates; you never know what you are going to get.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I want everybody to read your piece. And I appreciate you coming in.</p>                \n                \r\n\n            \n                <p><b>CONCHA:</b> Thank you Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. Nice to see you.</p>                \n                \r\n\n            \n                <p>One footnote - the Christian Science Monitor newspaper people covered the Falklands conflict in a very responsible way on June 17, 1982. James Nelson Goodsell (ph) wrote this about the riots, quote, \"Widespread public anger spilled over into the streets at midweek as violent demonstrations racked Buenos Aires for a time Tuesday evening. Police were unable to control angry mobs that turned the Plaza de Mayo in front of the Casa Rosada (the Argentine white house) into a, quote, `battle zone'.\" All right?</p>                \n                \r\n\n            \n                <p>So there you go. I want to stop this now. I hope we can stop it. I really do.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "CBS News releases video of the Falklands War riots ", "description": "O'Reilly hits back at the far left accusations of misreporting in Argentina", "date": "2015-02-24T13:18:29Z"}