{"vcmId": "12cc18ee-f8b8-4eda-bf1f-8700f8c06e4e", "url": "http://www.foxnews.com/transcript/2015/02/05/bill-oreilly-muslim-world-strikes-back-kind.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>After ISIS executed a Jordanian pilot by burning him alive, there were scenes of outrage across the Muslim world. Almost immediately the Jordanian government executed a 46-year-old Iraqi woman, suicide bomber, arrested when her vest failed to ignite. That was back in 2005. The Jordanians hanged her yesterday.</p>                \n                \r\n\n            \n                <p>They also hanged a man named Ziad al-Karbouli who was sentenced to death. He is an al Qaeda operative.</p>                \n                \r\n\n            \n                <p>Now, I would not have done that because the executions smack of revenge not retribution. It's always better to operate within the law, not be swayed by a mob reaction. But surely everyone can understand the anger of the Jordanian people have toward the ISIS killers and other terrorists. Japanese people have the same anger, so do most Americans and others around the world.</p>                \n                \r\n\n            \n                <p>But again, there is no strategy in place to stop the ISIS madness. Here is President Obama's comment yesterday.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES:</b> It's just one more indication of the viciousness and barbarity of this organization. And I think we'll redouble the vigilance and determination on the part of a global coalition to make sure that they are degraded and ultimately defeated.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right now the global coalition the President referred to is a myth. It doesn't exist. And ISIS is doing pretty much what it wants to do.</p>                \n                \r\n\n            \n                <p>Last year the CIA estimated that perhaps as many as 32,000 fighters had joined ISIS. Jordan has an active army of 88,000 and almost twice that number in total personnel and reserves. ISSI burned the pilot to death at their headquarters in Raqqa, Syria. There it is, ok? That's pretty near Jordan -- 330 miles away.</p>                \n                \r\n\n            \n                <p>So why isn't the, quote, \"global coalition\" attacking Raqqa? Surely the Jordanian army could attack it, so could the Turks. U.S. could also launch operations against Raqqa but there is no will to do it. And so the world will continue to watch barbaric atrocities unfold on a regular basis.</p>                \n                \r\n\n            \n                <p>ISIS is still holding an American and other innocent people. The American people deserve to know the truth about President Obama's campaign to defeat the jihad. And the truth is there is no campaign. What we have are selected targets that we hit with drones and bombers.</p>                \n                \r\n\n            \n                <p>In Iraq, the bombing has been somewhat effective in stopping the ISIS advance but not in driving them out of that country. Almost every military person knows that only ground forces will get ISIS out of their entrenched positions. Again, we are talking under 40,000 of these savages and you are telling me the world can't wipe them out when they are sitting over there in the Syrian desert and in ramshackle towns in Iraq? You are telling me the world can't defeat these people? That's total bull. America and the rest of the world lack the will to defeat evil, period.</p>                \n                \r\n\n            \n                <p>Finally, Barack Obama must, must totally focus on the growing terror problem and on the threat from Iran. We have reached, I should say, a crisis level.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The Muslim world strikes back -- kind of", "description": "Talking Points 2/4", "date": "2015-02-05T13:07:29Z"}