{"vcmId": "13cfe58b-eec6-4b67-9a39-0dfbd58514af", "url": "http://www.foxnews.com/transcript/2015/01/28/lt-col-shaffer-stands-by-claim-bergdahl-will-be-charged.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 27, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Factor Follow up Segment\" tonight, last night on The Factor Lieutenant Colonel Tony Shaffer told us that the army has decided to charge Sergeant Bowe Bergdahl with desertion and his civilian lawyer has received some advanced heads-up on that. Today the army denied it.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>ADM. JOHN KIRBY, PENTAGON PRESS SECRETARY:</b> No decision has been made with respect to the case of Sergeant Bergdahl, none, and there is no time line to make that decision, and General Milley is not being put under any pressure to make a decision.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He is by me but I guess they don't count that. Now, we invited Admiral Kirby on The Factor and we're hoping that he will appear tomorrow.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington is Col. Shaffer. You're causing all kinds of trouble again.</p>                \n                \r\n\n            \n                <p><b>LT. COL. TONY SHAFFER, LONDON CENTER FOR POLICY RESEARCH:</b> Yes, as usual.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you stand by what you told us about Sergeant Bergdahl. And I want to reiterate that the investigation concluded he did desert his unit in Afghanistan and that his civilian lawyer has been informed of such. Do you stand by that?</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> I stand by all of those facts. Plus, Bill if you look at what Admiral Kirby said in the written statements from the Pentagon, they don't deny the material findings of the report or what I said is in the report. They're being very careful how they parse their words and I think there's reason why.</p>                \n                \r\n\n            \n                <p>And I do stand by the fact that my understanding is that Bergdahl's lawyer has been given a statement of charges, a charge sheet that says this is what to expect that were coming. Now, the other part of this is a decision was made. Has it been formally announced? No, probably not.</p>                \n                \r\n\n            \n                <p>But I note in Admiral Kirby's comments and also army statement to the \"Army Times\" today that they've said twice, there's no time limit on this decision. The other thing Bill, Kirby even said, there's no pressure on General Milly -- of course, the moment you say that, there's pressure.</p>                \n                \r\n\n            \n                <p>So it's very clear that what they did in fact I think is almost more compelling than what they said in their denial.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. But the fact remains that the army is calling you a liar. That's what they're essentially doing.</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I might point out that it's not only you, but after your report, NBC News confirmed that this was the case, what Colonel Shaffer told us.</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> Yes, sir.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He told us first. Then NBC News confirmed from another source that it was true too. So it's not just you out there. But they're calling you a liar. If it comes out that what you're telling us is accurate, they're going to look so bad, it's going to be, you know, impossible for them.</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> Bill, I challenge you to ask Kirby the hard questions regarding the statement of charges and the other interactions regarding this with the White House. And then one of the things I would recommend is bring Sergeant Bergdahl and his lawyer on. During the Haditha (ph) issue when Sgt. Warwich (ph) was actually accused of wrongdoing regarding killing individuals in Iraq, he went on \"60 Minutes\". So bring his lawyer on. I'm all for it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, look they're not going come on. We'll try to get everybody in, but they're going to say the investigation is ongoing and we can't do this, we can't do that.</p>                \n                \r\n\n            \n                <p>But the fact remains that the data was all assembled in October. They had all their investigations -- nobody else in the field now doing any interviews, ok? It's all done.</p>                \n                \r\n\n            \n                <p><b>SHAFFER: </b>The material facts are all with the general. It's not going to change. From now he only makes the decision.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They're not going to change. Milly's got them and has had them for almost three months -- ok. Here it is -- boom, boom, boom, boom, boom. This is what we found out. You say it's political, the White House -- last night you said the White House doesn't want this out. There's a big brawl going on with Ben Rhodes the assistant national security adviser and the army. They're trying to say don't put it out, don't put it out, don't put it out. I guess they're under duress and that's why the army came out tonight.</p>                \n                \r\n\n            \n                <p>It's a mess and somebody's going to look bad.</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> Bill, look at what their own statement says. There's no time limit. They're telegraphing to you they're going to try to drag this out. No doubt.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I think the pressure is going to build and build and build.</p>                \n                \r\n\n            \n                <p>All right, Colonel. From a personal viewpoint, I hope you're right. You're a nice guy, you've always served us well. I don't want our Armed Forces to look bad either.</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> We need accountability. That's all we're calling for.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We're in this for the truth and we hope that Admiral Kirby comes on tomorrow.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Lt. Col. Shaffer stands by claim Bergdahl will be charged", "description": "The Army denies that its investigation will charge Sgt. Bowe Bergdahl with desertion", "date": "2015-01-28T13:34:05Z"}