{"vcmId": "14889363-25c5-45a5-9d13-862bcd3704ea", "url": "http://www.foxnews.com/transcript/2016/01/11/bill-oreilly-president-obama-parallel-universe.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The two most important issues for Americans are the economy and the terror threat posed by Islamic killers. Yet, President Obama apparently believes global warming and increased gun checks are the most vital issues. It's kind of hard to fathom but Mr. Obama's investing a huge amount of energy in climate and guns. Meantime many American workers can't make enough money to prosper and the terror threat is off the charts.</p>                \n                \r\n\n            \n                <p>Last night the President held a town hall meeting about guns. He was told that gun sale background checks and more stringent registration rules are not going to solve the murder problem.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> What would it have solved?</p>                \n                \r\n\n            \n                <p><b>COOPER:</b> None of the recent mass shootings, I should point out, none of the guns were purchased from an unlicensed dealer.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Correct. And that's what I'm speaking to the executive action that you mentioned.</p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES: </b>Nobody's saying we need to be going soft on criminals. What we do have to make sure is that we don't make it so easy for them to have access to deadly weapons.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> As Talking Points stated earlier this week criminals and terrorists are not going to buy guns from dealers who do background checks. Of course, the President knows that but will not acknowledge it.</p>                \n                \r\n\n            \n                <p>On the climate front, ok, fine, let's all try to get the environment cleaner. But this is not a top five issue and the President shouldn't be spending most of his time trying to find ways to stimulate the economy. Instead the feds continue to strangle the free marketplace with high taxes, complicated regulations and mandated Obamacare rules.</p>                \n                \r\n\n            \n                <p>Although many Americans do live in a world of their own, it's dangerous when the leader of the free world does. On Tuesday we can expect the President to deliver an upbeat state of the union address -- he always does -- even though terrorism and the economic situation are not being addressed in effective ways.</p>                \n                \r\n\n            \n                <p>It's hard to believe that Mr. Obama thinks crazy people, criminals and terrorists are going to stop murdering because the FBI's conducting more background checks. While those checks are needed, there's nothing wrong with trying to keep bad people away from guns -- nothing wrong with that. The executive action's not a panacea, cure for sick violence. There is no cure.</p>                \n                \r\n\n            \n                <p>So let's acknowledge that and get to work really protecting Americans from criminals and terrorists. Not giving the bad guys false hope.</p>                \n                \r\n\n            \n                <p>On the economy, come on, Mr. President, your programs aren't working. Everybody knows it. Try something else.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: President Obama's parallel universe", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/8", "date": "2016-01-11T13:15:14Z"}