{"vcmId": "15994e45-927c-4ae9-8681-7dc86b2b298e", "url": "http://www.foxnews.com/transcript/2015/07/23/did-mohammod-youssuf-abdulazeez-turn-to-radical-islam.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" July 22, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Factor Follow Up Segment\" tonight. The FBI holding a press conference today on Mohammed Abdulazeez who murdered five American servicemen last week in Chattanooga, Tennessee. It is now beyond a reasonable doubt in my mind that this killer had ties to radical Islam.</p>                \n                \r\n\n            \n                <p>Joining us now from Chattanooga, Fox News senior national correspondent John Roberts. What's the headline from the FBI press conference today, John?</p>                \n                \r\n\n            \n                <p><b>JOHN ROBERTS, FOX NEWS SENIOR NATIONAL CORRESPONDENT:</b> Well, I think, first of all, Bill, I think we could probably say that you are safe in that assumption that he had some sort of ties to radical Islam. Was he actually tied to radical groups? Was he tied to terror groups? The FBI says they found no evidence of that.</p>                \n                \r\n\n            \n                <p>But we do know that he was reading some materials online. He was listening to sermons of Anwar al-Awlaki, the American born radical Islamic cleric who was calling for attacks on Americans and American military before he was taken out by a drone in 2011.</p>                \n                \r\n\n            \n                <p>He wrote about this idea of martyrdom maybe as a way to cleanse the sins of his life in which he had been doing drugs and alcohol and couldn't hold a job and basically was living a life that was rapidly spiraling down.</p>                \n                \r\n\n            \n                <p>Now, as to the headline here at the FBI press conference, they believe, so far, that this guy was a lone wolf, that he was a homegrown violent extremist, that he didn't have anybody helping him on the day, though they are leaving open the possibility that somewhere along the line Bill he talked to some people, at least, who may have helped him down this road to radicalizing in whatever way he did before his murderous rampage.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. Now, part of that is in Jordan where the Jordanian authorities are interrogating a relative of this guy because he did spend so much time in Jordan. Did the FBI comment on that today?</p>                \n                \r\n\n            \n                <p><b>ROBERTS:</b> The FBI did not comment much on that. They said that they do want to talk to the uncle. But we found out a few things about the uncle. His name is Assad Ibrahim Assad Haj Ali, he's 40 years old. He is a U.S. citizen born in Kuwait. He has an MBA from George Mason University. He was a business owner in northern Virginia. And then in 2010, at the behest of his parents who said we need taking care of, can you please move to Jordan. He moved to Jordan.</p>                \n                \r\n\n            \n                <p>His attorney absolutely insists that he has no ties to any radical groups, certainly no ties to terrorism. And the only reason why Abdulazeez came to visit with him for a number of months -- it may have been four or five, not the seven that was reported earlier -- in 2014 was they thought hey let's go work with your uncle for a while. Maybe that will straighten out this lifestyle that you have been living. Try to get him away from his non-Muslim friends who they believe, Bill, were a bad influence here in the United States.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. But the Jordanian authorities they question a little bit different than we do. So we'll get the -- we'll get the idea there.</p>                \n                \r\n\n            \n                <p>Then there is all the guns that the 24-year-old as able to acquire. Now, the word is that he got some of these guns on armslist.com. We talked about this yesterday. We have been investigating this. Arms List is basically clearing house for people who want to buy guns. It doesn't sell. The Web site doesn't sell guns directly. It sets you up with other people who may have guns for sale.</p>                \n                \r\n\n            \n                <p>The dodge is that you don't have to register. You don't have to do anything. There is no background checks -- nothing. Arms just put you in touch and then you do what you want. It's like a back alley I deal.</p>                \n                \r\n\n            \n                <p>The FBI comment on the guns today?</p>                \n                \r\n\n            \n                <p><b>ROBERTS:</b> The FBI was not commenting much on the guns except to say when Abdulazeez got out of the car he had in his hand an assault rifle which was a Molat, which is Russian-made AK 74. Looks almost like an AK 47 that you see in the hands of jihadis all around the world. He also had a handgun as well and he had a Sega 12 shotgun that was left in the car.</p>                \n                \r\n\n            \n                <p>Now, as to this Arms List and what it is all about. Obviously a lot of people know what Arms List is. You don't have to explain it to them. It actually was created when Craigslist stopped taking ads for weapons. A couple guys who are graduates of the Air Force Academy decided we could probably have a very lucrative here by Craigslist connects people who want to sell furniture and motorcycles, guitars, what have you -- we can connect people who want to sell guns.</p>                \n                \r\n\n            \n                <p>It's been very controversial because of this idea that there is no background checks.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>ROBERTS:</b> FBI investigation or New York City police investigation found a couple of murders and other crimes that were connected to guns that were sold on arms lists and now, Bill --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Look, it just makes it easier for somebody.</p>                \n                \r\n\n            \n                <p><b>ROBERTS:</b> Now the deaths of five service members now connected through Arms List.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. And Now this place is going to come under scrutiny. I think even the NRA would say, listen, you can't have back alley gun dealings at this level and that's what this is. I don't think any Second Amendment people are going to object to figuring out how to regulate this kind of stuff. Anyway, the FBI didn't have much to say about it that will be coming forward.</p>                \n                \r\n\n            \n                <p><b>ROBERTS:</b> No, they didn't.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> John -- thanks a lot.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Did Mohammod Youssuf Abdulazeez turn to radical Islam?", "description": "John Roberts with the latest on the FBI’s investigation to the Chattanooga shooting", "date": "2015-07-23T12:20:35Z"}