{"vcmId": "162ce4fb-459b-4640-a51f-f78b35c35b98", "url": "http://www.foxnews.com/transcript/2014/10/30/ebola-race-and-obama-administration.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 29, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Factor Follow-up\" segment tonight an op-ed in the \"Wall Street Journal\" today says the reason the Obama administration will not impose a travel ban on the Ebola regions in West Africa is race. With us now Jason Riley a member of \"The Journal\" editorial board -- do you agree with that?</p>                \n                \r\n\n            \n                <p><b>JASON RILEY, WSJ EDITORIAL BOARD MEMBER: </b>That there is a racial angle? Sure. I think there is a racial angle. This administration is obsessed with race and racial slice and maintaining street cred with the black community. And I think that has played into this decision regarding the -- the Ebola policy, definitely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Don't you think the African-American community is like every other American community who wants to be protected? They don't want people coming from the affected regions right now. Just let it cool off a little until we get organized? Don't you think most African-Americans would support that policy? I do.</p>                \n                \r\n\n            \n                <p><b>RILEY: </b>Sure, sure, but the administration's concerns are political. They don't want to do anything to offend the black community and a policy that bans black people from West Africa from coming to the U.S. --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All people.</p>                \n                \r\n\n            \n                <p><b>RILEY: </b>Could be spun that way. And they don't want that. Particularly among a group that any need to turnout in higher than usual numbers next week in order to hang on to the senate.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right so you are convinced that that's part of this problem.</p>                \n                \r\n\n            \n                <p><b>RILEY: </b>Yes. That is the biggest part of it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Australia -- Australia has announced they are not going to take nobody, no visas from West Africa and a number of other. Now what about the other component of the ebola debate -- the quarantines? California just announced today -- I don't know whether you know that or not -- that they are going to quarantine, all right, along with New York, New Jersey, Illinois and a couple of other states. That's embarrassing. Is that not embarrassing?</p>                \n                \r\n\n            \n                <p><b>RILEY: </b>What I think is driving this is a confidence void at the federal level that governors are trying to sell. And it's not unlike the immigration debate that you have where governors' hands are tied but they are the ones dealing with the anxiety of their constituents. And here you have some governors who wanted to do what they could to alleviate those anxieties which are justified. Bill, think of what we have been told.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Of course.</p>                \n                \r\n\n            \n                <p><b>RILEY: </b>The false assurances -- we were told it was remote that it would get here -- that turned out not to be true. We were told that the hospitals could take care of it -- that turned out not to be true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But I'm trying to understand the mentality of the President here which is not easy to understand. He's being undermined by the states. The states are saying to him hey, your policy is bone headed so we -- and we are talking California, New York. I mean these are liberal states, big liberal states. We're going to do our own thing now, all right.</p>                \n                \r\n\n            \n                <p>And now you have this woman up in Maine. And the Maine authorities said look lady, you know you did a nice thing. You went over and you helped the Ebola patients over there in Guinea and you came back. But we've got to watch you for three weeks to make sure you don't get a fever like the doctor in New York City did. And so, you know, you can stay in your home but you can't come out. And she said you know, blank you, Maine authorities. I'm coming out. Are the feds going to do anything to her? No.</p>                \n                \r\n\n            \n                <p><b>RILEY:</b> No, no people are looking for assurances from their elected officials. They are not getting it from Washington. And these governors are trying to step in and take care of matters. And I understand. The federal government as you mentioned can't even get a uniform policy at the federal level. And today, the President comes out and says he is going to treat military personnel different from civilians. Does that reassure the public?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No and the explanation was and the President said this, the explanation was look in the military they have to do what they are told. All right? So we're going to tell them they have to be in 21 day quarantine. But civilians, and they have the power to tell civilians hey, look, you have to be in quarantine. And if you are not, we will forcibly put you in there; the constitutional power is there it's just insane.</p>                \n                \r\n\n            \n                <p>And there is one more aspect to this thing that doesn't make any sense at all. President Obama appointed this Thomas Frieden to the CDC. Where is he? What happened to him? Does he have Ebola? Is he quarantined now?</p>                \n                \r\n\n            \n                <p><b>RILEY:</b> Your guess is as good as mine.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What happened to him?</p>                \n                \r\n\n            \n                <p><b>RILEY: </b>But it speaks to a leadership problem. And it's not just with respect to Ebola.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But if they can force Frieden into quarantine which obviously he is because nobody has even seen the man since I got on his case.</p>                \n                \r\n\n            \n                <p><b>RILEY:</b> Ultimately I don't think a patchwork of different state policies is going to work.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, of course not.</p>                \n                \r\n\n            \n                <p><b>RILEY: </b>In terms of protecting the public but I understand the pressure that these state and local officials are under because there is no leadership in Washington. And someone needs to step up and reassure the public that something is being done.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But nobody is going to do that unless the policies change because nothing is being done. How can you reassure something to people that something is being done when nothing is being done?</p>                \n                \r\n\n            \n                <p><b>RILEY:</b> You can't.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I mean you know -- there you go. All right Jason thanks for coming in.</p>                \n                \r\n\n            \n                <p><b>RILEY:</b> Thank you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And you might want to check out Jason Riley's new book \"Please Stop Helping Us: How Liberals Make it Harder for Blacks to Succeed\".</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Ebola, race and the Obama administration ", "description": "Jason Riley on whether race is a factor in the Obama administration not imposing a travel ban to West Africa", "date": "2014-10-30T12:29:27Z"}