{"vcmId": "16d9900b-ff20-49b0-8362-d1e423d2b95a", "url": "http://www.foxnews.com/transcript/2015/09/11/donald-trump-attacking-ben-carson-over-faith.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" September 10, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight the two top Republicans in the polls, Donald Trump, Ben Carson, going after each other on faith, of all things.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE</b>: Dr. Carson, you and Donald Trump have a few things in common right now. You're both leading in the polls. You're both first time candidates. What do you think the main characteristics are that differentiate you two?</p>                \n                \r\n\n            \n                <p><b>CARSON: </b>Well, probably the biggest thing is that I realize where my successes come from. And I don't in any way deny my faith in God.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> You know, I've known Ben Carson, of him for a long time. I never heard faith was a big thing until just recently. All of a sudden he becomes this great religious figure. I don't think he is a great religious figure.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And joining us now from Houston is Dr. Ben Carson. Now, this is kind of dopey who is more pious -- is it not?</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Yes. Absolutely. And it was not my intention to impugn anybody's religious beliefs. And, first of all, Bill, let me just say happy birthday.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Come on. Now I'm going to get mobbed when I go out. Yes I'm 48 years old today. And I have a condition, of course. All right.</p>                \n                \r\n\n            \n                <p>But you brought it up because it was an open-ended question by the interviewer. You didn't have to go to the faith based thing. You could have gone anywhere to differentiate yourself from Trump. So it was you who brought it up. But, do you want to walk it back now?</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Well, basically, I'm talking primarily about myself and the fact that I am a very faith-based person and I don't, in any way, deny that the success that I have had is because of my faith and my walk with the Lord. That probably differentiates me from a lot of people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. But the question was about Trump. You know the implication, Doctor. You are a brilliant man. The implication was look, I'm a humble guy and I know the Lord is responsible for my success where that barbarian Trump is a big braggart. I mean that was the implication.</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: That certainly I think is something that should be apparent to people. But, you know, I really don't want to get into the mud pit. That's not in my nature. And I know that the media frequently loves to stoke up these things.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Of course, that's why I'm doing it tonight. Of course.</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: And they goad people and --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I'm not goading but it's a very good story because you two are now dominating in the polling. I mean you are up 10 points in less than a month so your message is resonating and Trump's message is resonating and when you have the two frontrunners going after each other on an issue as faith, that's a big story.</p>                \n                \r\n\n            \n                <p>Now you can criticize me for bringing it up but I think it's legitimate.</p>                \n                \r\n\n            \n                <p>But let's advance the story tonight.</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Ok.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You're going to have to convince people that you are better suited for the presidency than Donald Trump is or any of the other candidates. That's how you are going to have to win. So why are you better suited than Trump and the rest of them?</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Well, that really is going to be a decision that the people will have to make. But what I'm going to do is put out my reasons for the things that I believe. I'm going to talk about why I believe that the United States of America is in great trouble because we are allowing the agents of division to have sway in our society. And a house divided against itself cannot stand.</p>                \n                \r\n\n            \n                <p>I am going to talk about the fact that we have such outrageous fiscal irresponsibility that we are threatening the future for the next generations. I'm going to talk about how we are putting ourselves in danger because we are not taking a leadership position in the world. Our foreign policy is just to react to what everybody else is doing. That doesn't work.</p>                \n                \r\n\n            \n                <p>I'm going to talk about how we are being negligent by not hardening our grit by not taking a much more active role in cyber security. All of these things, including not being in the space race, is hurting us. So many inventions came out of the space race.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok. All of the candidates -- all of the candidates are going to say, I'm better and I'm going to do better. You have to differentiate yourself from the others and you have so far and you have been very successful. You made a very interesting statement. You say the agents of divisiveness are hurting the country. Point blank question.</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Yes absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Is Donald Trump an agent of divisiveness?</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Well, I would just say I don't want to judge for the people. I just want to say --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You're an American.</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: -- anybody who is (INAUDIBLE)</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. But you're an American in addition to being --</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: They will decide that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Do you as an American believe that Mr. Trump is a divider?</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Again, I am not going to go there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok. It's your privilege. You can go there. I respect it.</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: I believe what we have to do is extend to the people what a divisive person is and let them decide --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok.</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: -- who belongs there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Look, my job is to interview all the candidates and ask the questions that I think people want to know. If you don't want to answer the question that I brought, that's your right to do.</p>                \n                \r\n\n            \n                <p>So big debate coming up -- all right. Again, so many people are on the stage. Do you have one message that you are going to want to get across next Wednesday night?</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Well, the main thing that I want to get across and I'm very hopeful that they will ask me some substantial questions --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They don't have to ask you just say it. Just say it.</p>                \n                \r\n\n            \n                <p><b>CARSON:</b> -- about fiscal policy and about our national defense because I'm very concerned about those. And I want people to understand that I have a very good knowledge of what's going on in the world and I am going to be very happy to talk about it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok. I want to tell everybody that Dr. Carson did THE FACTOR a big favor tonight by getting to the location in Houston as quickly as possible. And in my 19 years of doing, this I have seen very few politicians go out of their way. And did you it tonight and I want just me and you, I want to say thank you very much for doing that.</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Well, that's because I'm not a politician, and because it's your birthday.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And he is a good guy. All right, Doc. Thanks as always.</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: All right.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump attacking Ben Carson over faith", "description": "Presidential hopeful Ben Carson discusses faith and campaign politics on 'The O'Reilly Factor'", "date": "2015-09-11T12:24:20Z"}