{"vcmId": "191fbc9b-0988-4e83-9714-f60c29593f7f", "url": "http://www.foxnews.com/transcript/2015/06/30/bill-oreilly-supreme-court-rules.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The court acceptance of Obama Care and gay marriage was predictable. In fact, there is a legal team accurately for a toll what would happen last week.</p>                \n                \r\n\n            \n                <p>The Supreme Court is made up of nine individuals who see America in very different ways. Some see it a country that needs to be changed. Others believed we're settled nation, where established law should be upheld.</p>                \n                \r\n\n            \n                <p>Generally speaking, we have an activist court, not judges who are able to put ideology aside.</p>                \n                \r\n\n            \n                <p>Chief Justice, John Roberts, provides a big example. He believes that Congress should make the laws, not judges. That was the intent of the Founders. It's in writing.</p>                \n                \r\n\n            \n                <p>So Roberts jumps through legal hoops to justify ObamaCare, no matter what the legal problems, Robert ignores that, differing to congressional approval of the Affordable Healthcare Law.</p>                \n                \r\n\n            \n                <p>To his credit, Roberts is consistent. He voted against gay marriage because again, he doesn't want the court to make law, which the gay nuptial decision certainly done.</p>                \n                \r\n\n            \n                <p>Most of the other justices are consistent as well. They often decide cases to a prism of what they believe to be right for the country, not what are our original system of checks and balances dictates. There is no crazy the system has become in the Supreme Court.</p>                \n                \r\n\n            \n                <p>Liberal justices, Ginsberg and Kagan, each presided over a gay marriage, in Ginsberg case, four of them, yet they did not recuse themselves when the issue came before the court.</p>                \n                \r\n\n            \n                <p>Come on.</p>                \n                \r\n\n            \n                <p>We either have a fair legal system or we don't and right now, we don't.</p>                \n                \r\n\n            \n                <p>The Factors lastly has been consistent for nearly 20 years.</p>                \n                \r\n\n            \n                <p>I believe every American, each one of us, should have an equal shot to pursue happiness and prosperity and that the government must provide oversight to provide that opportunity for all.</p>                \n                \r\n\n            \n                <p>But I do not believe the government has a right to impose upon me or any other American rules that deny my freedom to express myself, practice my faith, or earn my living.</p>                \n                \r\n\n            \n                <p>If a baker believes marriage is a sacrament instituted by his religion, the government should leave the baker alone.</p>                \n                \r\n\n            \n                <p>Even thought the Supreme Court has now ruled gay marriage legal, it has no constitutional right to force any American to participate in it, to do so teras up the social contract forged by the Founders.</p>                \n                \r\n\n            \n                <p>Americans who sincerely believe that judges do have the authority to redefine marriage have a perfect right to celebrate their victory provided they are following their consciences. However, they do not have a right to demonize those who disagree based on the same principle, conscience.</p>                \n                \r\n\n            \n                <p>Yesterday, FOX News Analyst, Father Jonathan Morris, was walking in New York City, close to where the gay pride parade was taking place. Father Morris reports two men spit on him. He was in clerical garment. He'll tell the story on Hannity tonight.</p>                \n                \r\n\n            \n                <p>Oppression runs both ways and all Americans should consider that. For example, Justice Scalia wrote a well-fought out dissent to the gay marriage decision. He was immediately mocked.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>STEPHEN COLBERT, THE LATE SHOW HOST: </b>Justice Scalia was little more nuance in his criticism, writing that he if ever join in opinion that begin the way Justice Kennedy's majority decision did, \"I would hide my head in a bag. I could have sworn he was already hiding his head a flesh-toned cinch sack.\" Please come on my show, sir.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>Scalia also took issue with the majority's view that marriage is about free expression grumbling, \"Expression sure enough is a freedom, but anyone in a long-lasting marriage will attest that that happy state constricts, rather than expands, what one can prudently say,\" which is both a fiery descent and the world's longest lock horns (ph) comic.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> In a few months, Colbert will be competing (inaudible) and Kimmel both talented and successful guys.</p>                \n                \r\n\n            \n                <p>You might want to think about alienating, traditional Americans to the extent he has. It could be very bad for business.</p>                \n                \r\n\n            \n                <p>The deciding vote in the gay marriage decision was Justice Kennedy a good man. He clearly and honestly wrote that his decision was primarily based on emotion, that compassion dictates gay Americans have equal marital status.</p>                \n                \r\n\n            \n                <p>Justice Kennedy forged a legal opinion using the concept of greater good. There's obviously nothing in the constitution that allows the redefinition of marriage, nothing. On a strictly constitutional basis, the decision has to come from Congress to change a law.</p>                \n                \r\n\n            \n                <p>The Supreme Court deviated from that dictum, as it has in the past, for political and personal reasons.</p>                \n                \r\n\n            \n                <p>Now on healthcare, the issue is again greater good. ObamaCare is obviously yet another federal entitlement program designed to help poor Americans, at the expense of non-poor Americans.</p>                \n                \r\n\n            \n                <p>The president sold the law on the basis that it is a benefit for all, but only his party bought that, not one Republican member of Congress voted for.</p>                \n                \r\n\n            \n                <p>And subsequently, health insurance costs have risen for many working Americans, and a significant number of doctors are refusing to take government mandated insurance programs.</p>                \n                \r\n\n            \n                <p>But the four liberal judges don't really care about the overall impact of ObamaCare. They want free healthcare for the poor, that's what they want and they'll find a legal justification for it, no matter what the actual law says.</p>                \n                \r\n\n            \n                <p>Add in Roberts and Kennedy impressed though (ph) another enormous social safety net that benefits that have not (ph) survives a valid legal challenge.</p>                \n                \r\n\n            \n                <p>The sad truth is most Americans have no blanking idea what's really happening to their country.</p>                \n                \r\n\n            \n                <p>These are complicated issues, where both sides have legitimate points, but some important decisions are being made outside the constitutional authority.</p>                \n                \r\n\n            \n                <p>If the trend toward big government and political activism by judges continues, the liberty of the American individual is going to take a huge hit.</p>                \n                \r\n\n            \n                <p>Already, we have a guy running for president, Senator Bernie Sanders, who does not oppose a top income tax rate of 90 percent, 90.</p>                \n                \r\n\n            \n                <p>Conservative and independent-minded Americans should well understand what's occurring.</p>                \n                \r\n\n            \n                <p>Uber-left politicians and judges, aided by a compliant media and vicious smear-merchants on the net, now have political cover and momentum and they are held bent on crushing traditional beliefs and competitive capitalism, replacing them with so-called tolerance and forced asset-sharing.</p>                \n                \r\n\n            \n                <p>The tenets of victimization and grievance may soon dominate public policy, even at the expense of public safety and majority opinion.</p>                \n                \r\n\n            \n                <p>You see in a brave new progressive world, the rights and welfare of each American really don't matter.</p>                \n                \r\n\n            \n                <p>The promise of collective social justice dominates and you will be dismissed as unworthy or even branded a bigot if you get in the way of that promise.</p>                \n                \r\n\n            \n                <p>That's the reality of America as we head into the 2016 presidential campaign. Spread the word and that&#8217;s &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The Supreme Court rules", "description": "Bill O'Reilly's Talking Points 6/29", "date": "2015-06-30T15:09:43Z"}