{"vcmId": "19257ffb-27b9-4606-a9c9-ca0b33a9ee73", "url": "http://www.foxnews.com/transcript/2015/09/25/bill-oreilly-biggest-smear-so-far-in-presidential-campaign.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>In a vicious, utterly false attack on Senator Marco Rubio, the head of the Democratic National Committee, Congresswoman Debbie Wasserman Schultz has reached a new low in political attack discourse.</p>                \n                \r\n\n            \n                <p>Earlier this week the senator, Rubio, held a fundraiser at the Dallas home of real estate guy Harlan Crow. Mr. Crow has one of the biggest private collections of historical memorabilia in the world. The collection includes items from the Third Reich including stuff from Hitler.</p>                \n                \r\n\n            \n                <p>Wasserman Schultz used that historical collection to smear Rubio, quote, \"Rubio is holding this event on the eve of the holiest day of the Jewish calendar Yom Kippur. Holding an event in a house featuring the artwork and signed autobiography of a man who dedicated his life to extinguishing the Jewish people is the height of insensitivity and indifference. There is really no excuse for such a gross act of disrespect. Mr. Rubio, who by the way represents a sizeable Jewish population in our home state of Florida, should cancel this tasteless fundraiser. It is astounding that the presence of these items that represent horror for millions of Jews the world over would not stop Mr. Rubio or anyone on his team in their tracks when planning this event.\"</p>                \n                \r\n\n            \n                <p>What is truly astounding is the woman's ignorance. I have been to Harlan Crow's home and I have seen his collection of history. It's amazing. Any museum would be proud to display what he has. Both good and evil are represented in an educational way. There are documents and letters from crucial moments in American history as well as world history. They include items from villains such as Hitler, Stalin, Tojo and Saddam Hussein.</p>                \n                \r\n\n            \n                <p>If you follow Wasserman Schultz's reasoning no politician could hold an even in say the Imperial War Museum in London, for example. Her take is truly insane.</p>                \n                \r\n\n            \n                <p>By attacking Rubio using the Holocaust, the head of the DNC has shamed herself and her party. She should immediately resign. There comes a point when politics gets so dirty it corrupts the nation. We are at this point.</p>                \n                \r\n\n            \n                <p>It's not just the Democrats who are using despicable tactics, although they seem to embrace them at a very high level. Some Republicans are comfortable using falsehood and innuendo to smear liberals. When \"Talking Points\" sees that from the GOP, it will be reported.</p>                \n                \r\n\n            \n                <p>Summing up, there is no place for defamatory deceit in any political campaign. The presidential race now underway has the potential to get very nasty, and we will fight against that.</p>                \n                \r\n\n            \n                <p>We begin with Debbie Wasserman Schultz this evening.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The biggest smear so far in the Presidential campaign", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 9/24", "date": "2015-09-25T12:47:42Z"}