{"vcmId": "194c5096-0c84-410a-871b-cdcd715101f8", "url": "http://www.foxnews.com/transcript/2015/02/13/interviewing-david-axelrod.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 12, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Thanks for staying with us, I'm Bill O'Reilly reporting from California. And in the \"Weekdays with Bernie\" segment tonight. Let's get right to the purveyor of BernardGoldberg.com who joins us from Miami. All right. So, we had a pretty good back and forth. President Obama's close friend and advisor David Axelrod on Monday. His new book believer chronicles how Mr. Obama achieved power. What do you think of the chat?</p>                \n                \r\n\n            \n                <p><b>BERNIE GOLDBERG, FOX NEWS CONTRIBUTOR:</b> Well, you said in the lead-in to the interview that Axelrod in his book, he doesn't criticize the President who is his friend you said that Axelrod is loyal to the president. And you said that THE FACTOR thinks loyalty is a good thing. Okay? And I think I got that right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yap.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Let's be clear, Bill, David Axelrod is loyal to a politician and when one is loyal to a politician, one comes across as David Axelrod did as an apologist for the President of the United States. He came off in that interview as so many others who are loyal to the President do as if he is under Barack Obama's spell. I even got the impression watching the interview that if Barack Obama somehow for some crazy reason did a 180 on some big social issue, and sounded like Sean Hannity, David Axelrod would hurt his back doing a pirouette. So, he could also do a 180 --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But let me challenge you on that.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> The same side as Barack Obama.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Let me challenge you on that.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Let me make one more point.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You can do that. But I need a challenge here because it's exactly what you say.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>In his book, he says that Barack Obama wouldn't come out in favor of gay marriage for political reasons. All right? And then when he was reelected he did. So, that kind of comes into your argument that says that Axelrod is not a total phony. Look, this is why he did it.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Wait a second, it's your words in the lead-in that Axelrod doesn't criticize the President.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, he just stated a fact.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Now maybe he pointed -- yes, maybe he pointed that out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> How about this? How about this? The President didn't come out for gay marriage because he thought it was not in his political -- to his political advantage.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> And, frankly, that doesn't speak well for my friend, the President. He won't do that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, he won't do that.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> As far as the interview goes, your questions were sharp and focused, I have no problem with that. Here is where my problem is. I don't find interviews with apologists. Whether they are on the left or on the right. I don't find them especially interesting and I certainly don't find them at all enlightening.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> This is why I felt it was worthy and for this alone Al Sharpton. At the end of the interview, I asked him how, on this earth, a sitting president of the United States can embrace a man who owes millions of dollars to the IRS, who has a record of racial division that is unparalleled, how on earth and he could not answer it. That alone made it worthy.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> That's a good point.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Thanks.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> And sometimes a non-answer is better than, you know, some crazy apologist-type answer.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. So we got that on the record. Okay, Bob Simon, one of your former colleagues at CBS worked on \"60 Minutes\" in the later part of his career, died in a car accident in New York City. And I have always respected him as a good reporter. Tell me about him as a person.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Well, you know, in a week while we're focusing a lot of attention on a TV journalist who made things up and who yearned or celebrity, Bob Simon was the opposite of that. Bob Simon was old school. He was a throw back in the best sense of that word he was simply, I say simply, this is a lot more than simply, he was a reporter and if I had gotten the word last night, few would call me and said, Bernie I have some bad news about your colleague, Bob Simon, he was killed in a war zone, he was killed in Ukraine or he was killed in Afghanistan, I would have been saddened. But I wouldn't have been shocked. Because he went to so many war zones that I guess I would have figured, you know what? His luck ran out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. He is a brave guy.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>When I heard he was killed in a car crash on the west side highway, that is hard to take.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. It is. He was a good guy though, right? Personally a good guy?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Yes. We were not friends or pals. We didn't socialize. We were colleagues. And I respected his ability tremendously.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So did I.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Tremendously.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right, Bernie, thank you, as always</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Interviewing David Axelrod", "description": "Bernie Goldberg analyzes Bill's sit down with the President’s former top political adviser", "date": "2015-02-13T13:39:03Z"}