{"vcmId": "19c50cb2-c2c5-4fe8-ad9e-aa7c9346e44c", "url": "http://www.foxnews.com/transcript/2015/07/14/kate-steinle-parents-share-her-legacy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" July 13, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>No \"Talking Points Memo\" this evening because we have a \"Factor National Exclusive\" -- an interview with the parents of Kate Steinle who was shot to death by an illegal alien felon 12 days ago.</p>                \n                \r\n\n            \n                <p>By all accounts, Kate was a fine young woman. She grew up in Pleasanton, California outside of San Francisco earning a communications degree from Cal Poly. Kate loved to travel, exploring different cultures all around the world. She was also very charitable, working with the Challenged Athletes Foundation. Summing up, Kate was a generous and caring person.</p>                \n                \r\n\n            \n                <p>Her parents have set up a fund that will help causes close to Kate's heart. We will give you that information in just a few moments.</p>                \n                \r\n\n            \n                <p>Joining us now from Pleasanton, Jim Steinle Kate's father, and Liz Sullivan her mother.</p>                \n                \r\n\n            \n                <p>Ms. Sullivan, we will begin with you. What do you want the world to know about Kate?</p>                \n                \r\n\n            \n                <p><b>LIZ SULLIVAN, KATE STEINLE'S MOTHER: </b>Well, she was not only beautiful but a very soulful person. A lot of depth, a lot of spirituality always from a young age. And I think that's what is helping to give us the strength that we've conjured up here in this terrible, terrible situation. I feel her strength still with me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You have a very close family and Kate was even though she is a professional woman and lived outside the home, she was close to both of you, correct?</p>                \n                \r\n\n            \n                <p><b>JIM STEINLE, KATE STEINLE'S FATHER: </b>Correct.</p>                \n                \r\n\n            \n                <p><b>SULLIVAN: </b>Yes, yes.</p>                \n                \r\n\n            \n                <p><b>STEINLE:</b> She would come over quite occasionally and visit with us.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And the relationship that you had with Kate was one of mutual respect. You hear a lot about families these days that don't get along. But it looks to me like your family was extremely close and supportive of each other.</p>                \n                \r\n\n            \n                <p><b>SULLIVAN: </b>Very much so. Very much so. The last three weeks because of our situation of moving, Kate had spent a lot of time here with us. Had spent nights sleeping here and most recently she and I had just taken a nap together. When I came out of my yoga class on Wednesday, she was waiting for me outside the room. Just very, very close, very totally in contact all the time.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. She was helping you out on the move. I want to get that example across for younger people in America that your home had a lot of love in it and that makes this situation even more painful.</p>                \n                \r\n\n            \n                <p>Mr. Steinle, can you tell us what happened that night? Pick it up when you met Kate. What happened?</p>                \n                \r\n\n            \n                <p><b>STEINLE: </b>Well, a friend of mine that was here visiting -- Liz and I was here visiting. She hadn't been into the city. We thought we would go into the city just to visit. It was extremely hot out here, so we headed to the city and we gave Kate a call. And she met with us. And we walked around and did different things and laughed and went in the ferry building and came out and decided to walk down, you know, the pier and stopped at the pier and enjoy the day of San Francisco that it's been and it was.</p>                \n                \r\n\n            \n                <p>And we turned around and came back from whence we came and we heard a shot and she went down and the rest -- we all know what happened then.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What did she say before she went down?</p>                \n                \r\n\n            \n                <p><b>STEINLE:</b> \"Help me, dad\".</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And you had no idea what was happening at that point?</p>                \n                \r\n\n            \n                <p><b>JIM STEINLE:</b> None whatsoever. We heard a pop shortly and after that Kate went down. And then we had some kind souls come over you know, gave her mouth- to-mouth and did all I could. Some other kind souls come over and helped us until the paramedics got there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Did you see the man who shot your daughter?</p>                \n                \r\n\n            \n                <p><b>JIM STEINLE: </b>No. No. Everyone in that particular area was just concentrating on Kate and what had happened. It was pretty obvious something pretty serious happened and that was our response was to her. We weren't looking around or anything like that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, Ms. Sullivan, the outpouring to you and your family and Mr. Steinle has been unbelievable. Tell us about that.</p>                \n                \r\n\n            \n                <p><b>LIZ SULLIVAN:</b> Just the food, the cards, the offers for help, you know, the people that have come from very far to come and give us condolences. Her second grade teacher came from Auburn. It has just been absolutely unbelievable how many lives she touched.</p>                \n                \r\n\n            \n                <p>And the cards, the flowers, the service, the memorial. I mean I just was taken away with the amount of people and everything. It was overwhelming. Just nothing, you know -- I mean you can't prepare for anything like this but it was astonishing and it is astonishing. And we are hoping to carry this forward. We are hoping for some good to come out of all of this.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, that's where we come in. And in our next segment we're going to tell everyone what we are trying to do.</p>                \n                \r\n\n            \n                <p>But Mr. Steinle, was all of this outpouring for your daughter, was it of any comfort to you?</p>                \n                \r\n\n            \n                <p><b>JIM STEINLE: </b>Oh my, yes. It -- more than comfort. You know, we are a family that is strong in faith and that in itself kept us strong.</p>                \n                \r\n\n            \n                <p>Kate was faithful and she believed and she had a great spirit. And the thing as Liz said that amazed us the amount of people. Dubai -- she worked in Dubai for a while. People called there -- friends that we had lived there. And they flew in just to be at the memorial service, from India.</p>                \n                \r\n\n            \n                <p>We just -- we knew Kate had touched a lot of people. You had to meet her to get that but, no. It was a strength, the calls that people hear all the time. You can't do this alone regardless of how strong your faith and how tough you might be, but we're just astonished.</p>                \n                \r\n\n            \n                <p>Not that surprised, I guess, because Kate being Kate, but, you know, without all the love around the world, actually, toward Kate, this had been a little tougher road to hoe.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Now, we are going to hold Liz and Jim over for the next segment.</p>                \n                \r\n\n            \n                <p>But I want to give you some very important information right now. The fund that will promote Kate's legacy and generosity is gofundme.com/y2aneaw that's gofundme.com/y2aneaw and that will be a charitable fund and a legacy fund for Kate Steinle.</p>                \n                \r\n\n            \n                <p>We'll have more with Kate's parents after these messages.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Kate Steinle's parents share her legacy", "description": "Part 1 of Bill O'Reilly's exclusive interview with Kate Steinle's parents Jim Steinle and Liz Sullivan", "date": "2015-07-14T12:28:57Z"}