{"vcmId": "1afa5ba6-ef50-45da-8986-45ce0be85779", "url": "http://www.foxnews.com/transcript/2016/01/21/shrink-player-fast-and-furious-investigation-in-spotlight-again.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 20, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Factor Follow Up Segment\" tonight, remember the Fast and Furious gun scandal? That was a sting by the feds that allowed thousands of guns to be smuggled into Mexico from the U.S.A. so, federal agents could track them. Find out who is operating and selling guns south of the border.</p>                \n                \r\n\n            \n                <p>Well, one of those guns may have killed a border patrol officer and another was found in El Chapo's arsenal when he was captured last week in Mexico. In addition, federal judge has told President Obama he cannot use executive privilege to withhold certain documents about the Fast and Furious case.</p>                \n                \r\n\n            \n                <p>Joining us from Los Angeles, Fox News correspondent William La Jeunesse, who has been on the story from the beginning. Now, this started in 2012 it was a little story in the beginning and it got bigger and bigger and bigger.</p>                \n                \r\n\n            \n                <p>What documents does the President not want we, the people, to see? Do you know?</p>                \n                \r\n\n            \n                <p><b>WILLIAM LA JEUNESSE, FOX NEWS CORRESPONDENT: </b>Yes. So the Justice Department produced an index of the records that it was withholding after getting subpoena from congress that includes e-mails in detail how then Attorney General Eric Holder crafted the Fast and Furious talking points. 20 e-mails between Holder and his wife, e-mails and letters between Holder and the White House. And finally e-mails from and to the U.S. Ambassador to Mexico as well as about 16 other officials.</p>                \n                \r\n\n            \n                <p>So yesterday this judge said some of the records deserve executive protection, others don't giving the Justice Department two weeks to turn them over to congress which is still, Bill, trying to figure out basically this. When and how much did the top people of the administration know about Fast and Furious, which they were blaming on a few rogue agents in Phoenix? Of course we know that's not true.</p>                \n                \r\n\n            \n                <p>I will say minutes ago -- go ahead.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, no, no. Minutes ago what happened?</p>                \n                \r\n\n            \n                <p><b>LA JEUNESSE: </b>Ok so minutes ago I get -- I talk to the chairman of the oversight committee who told me that he and Senator Grassley are going to be writing a letter to ATF today demanding all the serial numbers of the weapons found with El Chapo. He feels that basically they are going to seek a stay on this judge's ruling and hopefully run out the clock before the President leaves.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. So they're going to try to appeal the judge's ruling that some of these e-mails from Holder be given to the congressional Republicans who are investigating who is behind the massive screw up of -- because that's the bottom line. They want to know why the thing went bad. Who is responsible for the mistakes because a border agent, Brian Terry was killed and one of the Fast and Furious weapons was found near the body.</p>                \n                \r\n\n            \n                <p>That -- do I have it?</p>                \n                \r\n\n            \n                <p><b>LA JEUNESSE:</b> Yes, sir. You do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. So, who screwed up and what was the extent of it so it doesn't happen again? That seems logical. I don't know why Barack Obama would want to stop information flow from that. If I were the president I would say, look, I was -- unless he was involved and I doubt it because that's an operation that you wouldn't think the President of the United States would be involved with -- guns going south of the border. Doesn't make any sense. What do you say?</p>                \n                \r\n\n            \n                <p><b>LA JEUNESSE: </b>Well, I was going to say that, of course, initially they said hey, listen, we in Washington knew nothing about this. This is a few guys in Phoenix who didn't know what they were doing. Well, as it was revealed over congressional investigation over basically two years we found out that wasn't true. Whether it be the --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Holder knew.</p>                \n                \r\n\n            \n                <p><b>LA JEUNESSE: </b>-- assistant head of the DOJ Laney Brewer.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>LA JEUNESSE: </b>Well, Holder claims he did not know anything until it made the press. We also know, of course, that there were documents that he received, that he claimed he didn't open the e-mail that actually did disclose what Operation Fast and Furious was and what it was doing in terms of number of weapons.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's why I said Holder knew. Holder knew. So, what? You know it's got screwed up and say I'm sorry. I don't understand. I don't know what the big subterfuge is here unless there is something else that we don't know.</p>                \n                \r\n\n            \n                <p><b>LA JEUNESSE</b>: Well, I guess if you claim that you don't know something and records actually show that you do, then that looks pretty bad.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Then you're a liar.</p>                \n                \r\n\n            \n                <p><b>LA JEUNESSE:</b> So maybe you don't want to tell everybody.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Then you're a liar. Obama is protecting his pal Holder. Could that be it?</p>                \n                \r\n\n            \n                <p><b>O2:</b> I suspect there are people within the Department of Justice who knew a lot more than they let on. There are records, I am telling you, Bill, that go back to meetings that took place where ATF was explaining to DOJ in Washington exactly how many weapons on a weekly basis they were feeding into Mexico and they said we don't know anything. I wasn't at that meeting.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok. All right. Well, let's hope that finally we figure out what happened there because El Chapo has some of the weapons and you can assume that a lot of people were killed with those weapons in Mexico.</p>                \n                \r\n\n            \n                <p>William -- good work. We appreciate you coming on tonight.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Shrink player 'Fast and Furious' investigation in the spotlight again", "description": "'Fast and Furious' rifle found in El Chapo arsenal as a judge rejects President Obama's executive privilege claim over the failed gun operation; William La Jeunesse with the latest on 'The O'Reilly Factor'", "date": "2016-01-21T13:40:11Z"}