{"vcmId": "1e5578c6-c179-4d8b-96d1-0db00273e0dc", "url": "http://www.foxnews.com/transcript/2015/03/16/growing-fallout-from-email-gate.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 13, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Hi, everybody. I'm Eric Bolling in for Bill O'Reilly. . Thanks for watching us tonight.</p>                \n                \r\n\n            \n                <p>Let's get straight to our top story: the growing fallout from the Hillary Clinton e-mail gate scandal.</p>                \n                \r\n\n            \n                <p>To review, on March 2nd, the \"New York Times\" reported that her use of a private e-mail account while secretary of state may have violated federal law. It took eight days for Mrs. Clinton to come out and attempt a public defense.</p>                \n                \r\n\n            \n                <p>Listen.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> I opted for convenience to use my personal e-mail account, which was allowed by the State Department, because I thought it would be easier to carry just one device for my work and for my personal e-mails instead of two. Looking back, it would have been better if I had simply used a second e-mail account and carried a second phone but, at the time, this didn't seem like an issue.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Her response, however, only seemed to raise more questions and encouraged her Republican critics.</p>                \n                \r\n\n            \n                <p><b>REP. TREY GOWDY (R), SOUTH CAROLINA:</b> I'm not sure how setting up your own private server is more convenient than just having an intern add an e- mail account to your smart phone. Secondarily, she said we went through the documents. I have no idea who \"we\" is.</p>                \n                \r\n\n            \n                <p>One thing that's clear is we don't get to grade our own papers in life. We don't get to call penalties on ourselves. She doesn't get to determine what's a public record and what's a personal record. Someone else needs to do that.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Mrs. Clinton and her supporters may want nothing more than the whole thing to just go away. But few outside her camp predict it will.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> It's not over. It's got legs, it's got long legs. It's got legs because the AP has now sued the State Department to get access to her e-mail, because three committees in the house are going to sue to get access or subpoena her e-mails, because we are now in a position where we are arguing over what is the proper meaning of the word \"is\".</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Joining us now with reaction from Washington, Republican strategist Lisa Boothe along with Democratic strategist Richard Fowler.</p>                \n                \r\n\n            \n                <p>Let me start with you, Lisa. The week -- it's almost every single day of the week something new came out. The scandal that they want to go away seems to grow bigger and bigger?</p>                \n                \r\n\n            \n                <p><b>LISA BOOTHE, REPUBLICAN STRATEGIST:</b> Absolutely because she keeps raising more and more questions. And look, she says this is for convenience sake her use of private e-mails. But what it is, is a demonstration of arrogance and a demonstration of a sense of entitlement. And what she has done in the process is violated the trust of the American people.</p>                \n                \r\n\n            \n                <p>According to a poll by Vox Populi polling, 52 percent of Americans don't trust her. But why should they? Not only has she broken rules and regulation, but she went through great lengths to hide information from subpoenas.</p>                \n                \r\n\n            \n                <p>Look, ultimately, I think one of the biggest issues here is she might have put our national security at risk by using unsecure server, which raises some serious questions about her lack of judgment as secretary of state.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Ok. Richard, we are two weeks into the scandal. How is Hillary Clinton handling all the blow back?</p>                \n                \r\n\n            \n                <p><b>RICHARD FOWLER, DEMOCRATIC STRATEGIST:</b> Let's start off with the facts. She should have used the dot-gov account. She admits it. Her camp admits it. Everybody agrees. I don't think there is as big of a blow back as folks make it out to be.</p>                \n                \r\n\n            \n                <p>I get it Miss Boothe is chomping at the bit to take down Hillary because they see her as the top contender to be the next president of the United States so they are going to destroy, destroy, destroy, destroy as fast as possible. But the truth of the matter is here is that the people at home don't care about this they care about how you make ends meet.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Richard, why do you say that? I think the people at home do care about it. I almost guarantee the people watching right now at home do care the way she is handling this. The fact that she went above the law, went above the law may have broken the law definitely broke protocol to do something that she knew very well she was doing.</p>                \n                \r\n\n            \n                <p>So, Richard, I'm not sure you are right on that. Go ahead, Lisa.</p>                \n                \r\n\n            \n                <p><b>BOOTHE:</b> Richard, I think you absolutely cannot say and try to paint this as some sort of Republican witch hunt. The fact remains that the \"New York Times\" broke the story. They Associated Press is suing Hillary Clinton. This isn't some witch-hunt by Republicans. This is a big issue and a big concern.</p>                \n                \r\n\n            \n                <p><b>FOWLER:</b> No, wait a second. Wait one second. Now, let's be very clear. She did not break any policies. She followed the same rules that Colin Powell did.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>No, no, no, no. Stop, stop, stop. Richard you can't do this.</p>                \n                \r\n\n            \n                <p><b>FOWLER: </b>She admits herself that.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Hold on you can't do. This you can't tell our audience that she didn't break any protocol. She broke protocol. The Obama administration developed a protocol. She herself admitted she knew about the protocol yet she went around the protocol.</p>                \n                \r\n\n            \n                <p><b>FOWLER: </b>Right. But her having a personal e-mail wasn't a clear violation of the protocol. Colin Powell did the same thing but that's neither --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> That was prior - before they changed the law. In 2009 President Obama changed the Federal Records Act to include e-mail.</p>                \n                \r\n\n            \n                <p><b>FOWLER: </b>The truth of the matter is though -- the truth of the matter is the 50,000 pages being reviewed by the State Department will be released to the public for public consumption. At that point in time --</p>                \n                \r\n\n            \n                <p><b>BOOTHE:</b> The e-mails that she chose to give over.</p>                \n                \r\n\n            \n                <p><b>FOWLER: </b>-- folks can read through all the e-mails. The point you made about the secure server.</p>                \n                \r\n\n            \n                <p><b>BOOTHE:</b> But it's not all the e-mails.</p>                \n                \r\n\n            \n                <p><b>FOWLER: </b>First of all, the State Department server has been hacked multiple times in recent history if my memory serves me correct. So the idea that it should have been on a secure server because it jeopardizes the national security to me seems to be a farce at best. That's neither here nor there. I think what this boils down to is that Hillary Clinton --</p>                \n                \r\n\n            \n                <p><b>BOOTHE: </b>You think it's ok for a secretary of state to possibly be e- mailing about important information to the country not a national security risk?</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Hang on guys, hang on. Hold on. Let me bring this topic up. Lisa I'm going to start with you on this. 2009 to 2013, Hillary Clinton secretary of state term; right in the middle of that 2012, Benghazi. Now, Hillary Clinton claims that not one single document that was sent to her or from her contained classified material. Do you believe for one second that during the whole Benghazi terror attack not one classified document passed through her server?</p>                \n                \r\n\n            \n                <p><b>BOOTHE: </b>I don't believe that at all. That is why I think she is lying. Here, this is the biggest problem Hillary Clinton is facing. This scandal not only falls on the heels of the revelation that the Clinton Foundation accepted money from foreign governments who are lobbying the State Department. No, wait, but, this is a long standing history of the Clintons skirting the law.</p>                \n                \r\n\n            \n                <p>We found scandal after scandal with the Clintons -- Whitewater, Monica Lewinsky -- this isn't the first time that the Clintons have dealt with controversy and scandal.</p>                \n                \r\n\n            \n                <p><b>FOWLER:</b> Here's the thing. Once again people are trying to tarnish her reputation with what her husband did.</p>                \n                \r\n\n            \n                <p><b>BOOTHE:</b> She tarnished it herself.</p>                \n                \r\n\n            \n                <p><b>FOWLER:</b> At the end of the day Hillary Clinton is a stateswoman, beyond being a stateswoman, she's a former senator and has a record to speak on. If we want to talk about Hillary Clinton -- let's talk about the merits. Let's talk about what she's done. Let's talk about the policies which you guys --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BOOTHE:</b> Let's talk about the Russia reset. Let's talk about her atrocious record as secretary of state.</p>                \n                \r\n\n            \n                <p><b>FOWLER:</b> You guys will continue to -- you focus on Benghazi like Benghazi isn't solved. The select committee said there wasn't any scandal. This wasn't any cover up.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>No, no, that's not what I said. I brought up Benghazi, Richard -- I brought up Benghazi because I find it very difficult to believe as Hillary Clinton claims that not one single classified document passed through her server, I find that hard to believe in light of what happened in Benghazi.</p>                \n                \r\n\n            \n                <p>Hold on for one second. Push the story forward. Start with you, Richard. How has she handled all the controversy? Is she handling it? Is she deflecting it and will she come out of this ok?</p>                \n                \r\n\n            \n                <p><b>FOWLER:</b> Listen, as a strategist, I think she has made some blunders. She should have went to the press a lot earlier. I think that her campaign if she decides to run ramps up. This will be fixed. It's part of bringing on a team and being able to be more agile to the 24 hour news cycle. With that being said I don't think it's damaged her as much as you want it to be.</p>                \n                \r\n\n            \n                <p>This is inside story. This is the Beltway, media industry, media society story. If you talk to the folks in Selma, Alabama or Tallahassee, Florida they care more about kitchen tables than they do about Hillary Clinton's e-mails, trust me.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Lisa, has she handled this scandal well so far?</p>                \n                \r\n\n            \n                <p><b>BOOTHE:</b> No, she has handled it horribly. And look, the American people care about trust and transparency.</p>                \n                \r\n\n            \n                <p><b>FOWLER:</b> They care about eating, not e-mails.</p>                \n                \r\n\n            \n                <p><b>BOOTHE:</b> And it was Hillary Clinton in 2008 that said she was one of the most transparent politician or public figures out there and clearly that isn't the case. So, American people do care about that.</p>                \n                \r\n\n            \n                <p><b>FOWLER: </b>The transparency that matters is how can I pay my grocery bill and electric bill not e-mails.</p>                \n                \r\n\n            \n                <p><b>BOOTHE:</b> It perpetuates -- and there it is -- this sense of entitlement that Hillary Clinton has and that is problematic for her politically. Not only was she a horrible candidate in 2008 race but we are seeing glimpses of that again.</p>                \n                \r\n\n            \n                <p><b>FOWLER:</b> People care about kitchen table issues.</p>                \n                \r\n\n            \n                <p><b>BOOTHE:</b> Richard, you are trying to deflect from the real issue.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> I'll bet you guys -- I'll bet you they care about both of those things especially how the leader reacts in times of crisis.</p>                \n                \r\n\n            \n                <p>All right. I really have to leave it there. Lisa and Richard -- thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The growing fallout from email-gate", "description": "The latest in the Hillary Clinton email controversy", "date": "2015-03-16T12:23:00Z"}