{"vcmId": "1ea4811d-65e4-42a9-bd82-b75b6484ca82", "url": "http://www.foxnews.com/transcript/2016/04/19/bill-oreilly-big-lie-presidential-campaign.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Apparently millions of American voters believe the federal government should be required by law to provide things for the folks. Education, health care, good jobs, financial security and old age on and on. That belief runs counter to how America was established in the late 18th Century when our first elected officials put their game plan into effect. Basically their vision was a limited one for government. Citizens would have basic freedoms to worship, vote, speaking openly without being punished, assemble without interference and pursue happiness within the framework of the law.</p>                \n                \r\n\n            \n                <p>It was entirely up to we the people how we would use those freedoms. No one was force to do go into the voting booth as they are in Australia. No one was forced to believe in God as they were in the Massachusetts Bay colony. Today, the question of individual choice, the quest to succeed or fail on your own has almost been obliterated by politicians and judges who do not respect the concept of competition and the struggle to prosper. In short, they are revolving away from how this country was established.</p>                \n                \r\n\n            \n                <p>In addition, they are deceiving you, the American people, into believing that their success and well-being, the folk's success will be almost assured by a giant federal nanny state. That's absolutely impossible in a nation of nearly 320 million people. Politicians deceive because it's an easy way to seduce you, the voter unhappy in some cases with your circumstance in life. When Bernie Sanders tells Americans the economic system is rigged against them, he destroys initiative. Why work hard. If the big banks will harm you no matter what. If I'm failing, it's not my fault. It's the phantom billionaires that are hurting me.</p>                \n                \r\n\n            \n                <p>Sanders is correct that the Feds need to stop fraud in the market place but his message of wall-to-wall capitalist corruption is false and pernicious. When a guy like Rand Paul tells Americans they should be able to intoxicate themselves at will and the public safety be damned, he gives license to behavior that has destroyed untold billions of people the world over. Not to mention the message that legalized drugs sends to kids. We don't live in a vacuum in this country. The condition of others directly affects us.</p>                \n                \r\n\n            \n                <p>Just look at the drunk driving stats. When Al Sharpton and his grievance lobby assert that Black Americans are oppressed by a racist system bent on hurting them. He provides an excuse for a litany of apathetic and destructive behaviors. The kids struggling in a bad school with parents who don't care, needs all the encouragement, leadership can give him or her. Not a list of historical atrocities that can cause even more bitterness for the child. The cold fact is, very few political people are willing to address vexing problems by telling you the truth. Here is what the government really owes us, protection from foreign concerns who would harm us. Protection from criminals who would harm us.</p>                \n                \r\n\n            \n                <p>A secure border, whereby our immigration laws are enforced and respected. An infrastructure of mass transportation that's safe and efficient. What the U.S. airlines are doing to their passengers is a scandal. And the fact that we don't have a high speed rail system is flat out irresponsible. The government also has an obligation to protect our constitutional rights and to protect private property. Seizing assets after Americans die is abhorrent. Many of us work hard all our lives to give our children a better situation. Finally, it is the duty of those in power to foster a system that allows every single American, a truly fair shot at material and emotional success.</p>                \n                \r\n\n            \n                <p>That means schools with strong educational and disciplinary standards subsidized benefits for the poor and affirmed that our delivered responsibly with clear guidelines. Also protections in the workplace against companies that would violate labor laws and exploit powerless employees. That's the heart of what the government owes us. And social engineering is not part of it. Nor is free education, free healthcare or free income if you choose to lay about. Hard-working people pay taxes to support the U.S. government. As well as for personal Social Security in old age, which the Feds have mismanaged in the extreme.</p>                \n                \r\n\n            \n                <p>We the people deserve honesty and responsible spending. Not wasteful programs designed to secure votes. Last week, I spoke with Donald Trump about his promise to return jobs from overseas. Mr. Trump, Senator Sanders, Secretary Clinton all say they will punish American companies who move jobs abroad. A president can certainly make life very difficult for corporations that ship jobs out. But the truth is that many of the lost jobs pay little. And even if they do come back it's a marginal play. The big problem is that millions of Americans are so poorly educated and personally irresponsible, they simply cannot compete in the free marketplace. So, what are the power seekers going to do about that? Blank stares. When I asked Mr. Trump how he would combat a culture among some African-Americans that scorns conventional behavior? He replied that job growth would take care of it.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL CANDIDATE: </b>My message is bringing jobs back to the country and they are going to have jobs.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But how are you going to get jobs for them. Many of them are ill-educated and have tattoos on their foreheads and, you know, and I hate to be generalized about it, but it's true. If you look at all the educational statistics, how are you going to give jobs to people who aren't qualified for jobs?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> We're going to bring jobs back. We will going to have Apple computers made in this country. Not just --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But you have to have skills to make Apple computers and the educational system -- what?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>We will get the skills. We will develop the skills.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, the race hustlers who have apparently have not walked the streets of poor neighborhoods lately immediately accused me of racism. And that is why the acute problem of cultural deprivation among under classed children of all colors is never addressed. The smear merchants hammer anyone who does so. It's beyond disgraceful that powerful people look away from the real problem. Mr. Trump is noble in his intent to create jobs and train Americans to do them. But that will require more than trade deals and rhetoric. It will require a cultural change in many working class and poor precincts. If you reject the conventional road to success, education and hard work, you'll fail in our capitalistic system.</p>                \n                \r\n\n            \n                <p>No matter what kind of outlandish promises Bernie Sanders makes. It's all about personal responsibility and motivation. And who is preaching that message? Who? The truth is that individual motivation is being destroyed by phony politicians seeking power. By promising an endless series of entitlements to a population that's moving away from achievement and into the give me zone. Gimme, gimme, gimme. Until that deep cultural flaw is exposed, until the phonies, race hustlers and corporate greed heads are called out. We'll continue to see big lies spouted by political deceivers and enabled by a gutless media, God help America.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The big lie of the presidential campaign", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 4/18", "date": "2016-04-19T19:15:08Z"}