{"vcmId": "1ed4a9e1-15e6-46fd-80ee-7c3ab0cde271", "url": "http://www.foxnews.com/transcript/2015/02/10/david-axelrod-enters-no-spin-zone.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 9, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Continuing now with our lead story. A new book called \"Believer\" by David Axelrod, very close friend and adviser to President Obama.</p>                \n                \r\n\n            \n                <p>Let's begin the segment with race. You write in your book about Reverend Wright. And it was only after, and you point this out. It was only after Wright attacked President Obama in Philadelphia that the President repudiated him and you made that clear in the book. So for years Obama was a close friend of Jeremiah Wright. We all know that he is radical preacher.</p>                \n                \r\n\n            \n                <p>Then there is Al Sharpton with a defined history of racial provocation and tax problems -- big time tax problems. And Barack Obama has embraced him. I don't understand any of that. Can you explain it?</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> Reverend Wright was his minister and obviously the things -- you call him whatever you call him and obviously some of the things he said were incendiary but that wasn't the relationship that the President had with him. That wasn't -- those weren't the sermons that the President heard in church. Those weren't the sermons that he regularly delivered.</p>                \n                \r\n\n            \n                <p>And, you know, you should also point out he is honored U.S. Marine and he is -- he was and internationally recognized religious leader. So, you know, I think you can characterize him one way or another.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You characterize him in your own book.</p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>But the President said -- what the President did was he criticized and very, very clearly the things that Reverend Wright said --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But only after --</p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>No, no, no. Bill -- I was there in Philadelphia when he criticized him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, you write about it.</p>                \n                \r\n\n            \n                <p>Right. But it was only after Jeremiah Wright came out and called Obama a flack.</p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>No, it wasn't. Again you got your ordering wrong. He did call him that --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I'm reading your book. I'm taking it right out of there.</p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>No you are not. I wrote the book. You are not taking it out of there. You're not taking it out of events. And I say this respectfully.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Sure.</p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>He gave a speech in Philadelphia after Reverend Wright's comments became known. Reverend Wright then attacked him --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's exactly what I'm saying.</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> -- and then Reverend Wright attacked him for the speech he made in Philadelphia. Later in a tour around the country and said -- and repeated some of the offensive things. It wasn't the attack on Obama. He repeated some of the offensive things for which Obama had criticized him and at that point the President said, you know, I'm not going to continue this. And he left that church.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Let's get to Sharpton.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O1:</b> Sharpton, you know, everybody knows the resume. All right. Why? Why would -- and I have to say I was invited by the President to the Brother's Keeper announcement at the White House. I was honored to be there. I think it's a great program -- the Brother's Keeper program.</p>                \n                \r\n\n            \n                <p>Sharpton, ok. I'm saying to myself, ok. It's ok for him to be there, but now it's morphed into Sharpton is there more than 80 times. He's got a signed picture that says \"To my fellow warrior for justice\". I mean, are you kidding me? With Al Sharpton?</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> Bill, you know, you don't decide and I don't decide who leaders in a community are. Al Sharpton is widely regarded as a leader within the African-American community. He is a civil rights leader.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Do you think the President respects him. Do you think the President respects Al Sharpton?</p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>Well, I think he respects his leadership on some of these civil rights issues -- yes, I do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He owes millions of dollars to the IRS, his organization millions of dollars. Is there any other American in the White House who owes millions of dollars to the IRS?</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> I don't know, I haven't gone through the tax returns of people coming to the White House.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But isn't that strange? Isn't that strange?</p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>No. I don't think it's strange. There are people who have had. Look, Donald Trump has I'm sure been in the White House. He has gone through bankruptcy proceedings. He has had financial problems. That didn't impeach him from being a visitor in the White House.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But it wasn't a debt to the federal government. See, I can't understand the Al Sharpton thing, I really can't understand it. There are so many other good civil rights leaders, not polarizing, not anti-cop, not tax dodgers -- so many. And why this guy has reached that pinnacle, I don't know.</p>                \n                \r\n\n            \n                <p>All right. Let's get to the economy.</p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>Yes, let's do that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You will well remember this sound bite. Roll it.</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> Ok.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES: </b>The problem is that the way Bush has done it over the last eight years, driving up our national debt from $5 trillion for the first 42 presidents, number 43 added $4 trillion by his lonesome. That's irresponsible. It's unpatriotic.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Number 44, president 44 has added eight trillion, almost, in six years. I don't understand. He was so against adding to the debt.</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> Let me try and enlighten you on this point since you don't understand.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I don't understand.</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> There was an intervening event. It was called the great recession.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Wasn't there --</p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>The big economic catastrophe.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What about 9/11? Didn't that intervene on George Bush?</p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>A serious economic catastrophe. Look, what happened under President Bush was that we had two huge tax cuts and a war that would cost trillions of dollars.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Two wars.</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> For the first time in history -- two wars, you are right. I'm sorry -- two wars.</p>                \n                \r\n\n            \n                <p>First time in history that we had tax cuts at the same time that we were waging war. And there were people John McCain and others who warned that it was fiscal madness. It was fiscal madness.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> President Obama knew that when he made that statement about it being unpatriotic to run up that debt. And he has run up more debt than all the other presidents combined.</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> Yes. But what I'm saying is that -- that wasn't a mandatory exercise for President Bush to cut taxes in the middle of a war. That wasn't a mandatory exercise.</p>                \n                \r\n\n            \n                <p>The fact is that the great recession was something that the President walked into. When we met before he even took office, the economist said to us this is going to add trillions of dollars to the debt. And it did add trillions of dollars to the debt.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But now we're out of the recession and he's still adding -- he's going to add three more trillion by the time he leaves office. We are out of the recession.</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> Bill, he has steadily cut these deficits to the point where they are --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It's not about the debt --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>Yes, that's how you add to the debt, Bill. That's how you add to the debt.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But he doesn't have to add to it with all the tax money coming in.</p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>Steadily cutting.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He's got more tax money coming in than any other time in history -- more than $3 trillion this year. I don't get it.</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> And look, the entire economy is growing. And as a percentage of the economy, the debt is about a third of or less of what it was when he -- I'm sorry, the deficits are about a third of what they were when he took office. So he steadily --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Still astronomical.</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> -- he steadily chipped away from that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> But listen --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Last question.</p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>-- I agree with you though that it is not wise policy to cut taxes when you are at war. I don't think future presidents will do that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. I don't know if it's wise policy to raise taxes when take home pay is going down as it has under President Obama.</p>                \n                \r\n\n            \n                <p>Last question. I believe and I think I'm right on this. I am probably wrong on everything else that I said to you tonight, that his main goal as president of the United States, what he wants to be remembered for, is social justice. Yes?</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> No. I think -- well, I think there are a lot of things. The main thing that he will be remembered for is leading the country through the worst economic crisis in history. He will be remembered for bringing the troops home from Afghanistan and most of the troops home from Iraq. 180,000 troops when he took office most of them are home today.</p>                \n                \r\n\n            \n                <p>He will be remembered for health reform. He will be remembered for financial reform. He will be remembered for ending discriminatory practices against gays and lesbians. And he will be remembered for trying to lead us forward to deal with this issue of flat wages and economic immobility that now every Republican is talking about as well.</p>                \n                \r\n\n            \n                <p>And the fact that they are -- Jeb Bush, Mitt Romney and the entire Republican field is talking about it -- I think is a tribute to the fact that the President was on the right track in the first place.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Mr. Axelrod, thank you very much. It was very interesting to talk with you tonight.</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> All right. Well, thank you for reading my book, Bill. I hope you're viewers will as well.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Listen, I enjoyed it and I hope everybody checks it out.</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> Thank you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And I appreciate your loyalty to your guy.</p>                \n                \r\n\n            \n                <p><b>AXELROD: </b>Well, thank you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> As I said in the beginning, loyalty is very important to us.</p>                \n                \r\n\n            \n                <p><b>AXELROD:</b> All right.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "David Axelrod enters the 'No Spin Zone'", "description": "Former presidential adviser on race, the economy and his new book ‘Believer: My Forty Years in Politics’", "date": "2015-02-10T13:19:57Z"}