{"vcmId": "20f53047-ac40-40d8-b8ae-895c43e6919b", "url": "http://www.foxnews.com/transcript/2015/09/22/new-developments-in-bowe-bergdahl-case.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" September 21, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Factor Follow Up Segment\" tonight: in a very unusual situation, the general, who investigated Sergeant Bowe Bergdahl says he should not go to prison. Major General Kenneth Dahl actually testified for the defense on Friday. Saying Bergdahl was naive and actually wanted to confront the Taliban more aggressively.</p>                \n                \r\n\n            \n                <p>Major General Dahl is the guy who took forever to even conclude the investigation. Here is what I said more than a year ago.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't believe that anything is going to happen' to Sergeant Bowe. I think the fix is in. I don't think that Chuck Hagel, the defense secretary is going to do it or the Pentagon is going to do anything. They want him out and they're going to just -- you'll see very quietly, they'll get him out. That's what's going to happen.</p>                \n                \r\n\n            \n                <p>Joining us now from Boston, Colonel David Hunt, Fox News military analyst with some new information about some tape recordings Bergdahl made. What's the headline, Colonel?</p>                \n                \r\n\n            \n                <p><b>COL. DAVID HUNT, FOX NEWS MILITARY ANALYST</b>: June 30th, 2009 Bergdahl deserts his post in southeast Afghanistan, July 1st and 2nd in standard briefing to a commander of his unit at Fort Brigade of the 25th Division. We have tapes of Taliban talking on Bergdahl's phone saying that Bergdahl wanted to join them and we have the Taliban on their phones talking about Bergdahl trying to join them.</p>                \n                \r\n\n            \n                <p>This information was known from July 2nd on and yet we still traded him for five terrorists, had a White House ceremony and now we have taken two years since he has come back to do something which takes 90 days.</p>                \n                \r\n\n            \n                <p>The government has not yet and doesn't sound like it's going to even use these tapes against Sergeant Bergdahl. It's inexplicable.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok. Now how did they ever managed to get the tapes.</p>                \n                \r\n\n            \n                <p><b>HUNT</b>: It doesn't make sense. Does the numbers make any sense about - - on Bergdahl?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: How did the government, the military gets tapes?</p>                \n                \r\n\n            \n                <p><b>HUNT</b>: Programs we have been doing it since World War II in which we listen to the enemy and people who speak Pashtun or whatever language the Taliban in that section was using were listening because they were told to and they're also listening for Bergdahl's' phone. What they heard was Taliban on Bergdahl's phone because he joined them by then and then Taliban on separate phones talking about him. So it's a military program, this is --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok. Let me stop you. Let me stop.</p>                \n                \r\n\n            \n                <p>So, it's surveillance. They have two set of tapes: one on Bergdahl's own phone, all right, where some Taliban are talking. They took the phone from him, I guess. And then on another phone, used by the Taliban. Once again, the tapes say that Bergdahl deserted and wanted to join the Taliban. Is that correct?</p>                \n                \r\n\n            \n                <p><b>HUNT</b>: yes. The tapes are available. The government is not using them. And, by the way, there were 30 people in that briefing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. It's safer there.</p>                \n                \r\n\n            \n                <p>And you have got to know that Dahl the Major General, he knows about the tape but he's still going out there peddling the thing that Bergdahl really wasn't a deserter at that level. Is that correct?</p>                \n                \r\n\n            \n                <p><b>HUNT</b>: Yes. Dahl -- there was investigation done by the naval intelligence when this first happened. They called him a deserter and then Dahl does an investigation. And now there is another investigation again since he has come back. It's taken two years to get to this point which normally takes 90 days and the tapes were not presented in this recent hearing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right but what I'm trying to get is I have always felt from the jump that Dahl is not interested in anything but getting this guy off.</p>                \n                \r\n\n            \n                <p><b>HUNT</b>: But he's not the only one not interested. He's not the only one. This entire chain of command --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: He is in charge and he testified on Friday. He's in charge.</p>                \n                \r\n\n            \n                <p><b>HUNT</b>: He's a two-star. There are four stars involved in this.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Stay on it and we will continue our investigation here.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "New developments in the Bowe Bergdahl case", "description": "Col. David Hunt joins 'The O'Reilly Factor' to discuss the latest revelations", "date": "2015-09-22T12:20:08Z"}