{"vcmId": "2165dd33-2538-48bf-8a31-b286f2881612", "url": "http://www.foxnews.com/transcript/2016/04/29/bill-oreilly-more-bad-news-for-american-economy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Talking Points believes the main issue in the upcoming presidential race will be who Americans trust more to create good paying jobs. On Tuesday, Bill Clinton defined the issue pretty well.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BILL CLINTON (D), PRESIDENTIAL CANDIDATE:</b> The problem is 80 percent of the American people are still living off what they were living on the day before the crash. And about half the American people, after you adjust for inflation, are living on what they were living on the last day I was president. Fifteen years ago. So that's what's the matter.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No argument. Under President Obama, earnings power has not improved. Democrats say the President is creating jobs and the President himself puts forth this assessment of the economy.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> After eight years, what would you say you want your legacy to be?</p>                \n                \r\n\n            \n                <p><b>PRES. BARACK OBAMA (D), UNITED STATES:</b> Saving the world economy from a great depression. That was pretty good.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. That's a subjective comment about a great depression. But, what about improving the economy in seven and a half years, Mr. President?</p>                \n                \r\n\n            \n                <p>Well, today, the Commerce Department announced that the U.S. gross domestic product grew at a paltry 0.5 percent in the first quarter of this year. That was the first quarterly performance in two years. Now, I don't want to bore you with all the economic stuff but the truth is, America, the most powerful economic engine is off track. Simply put, workers are not earning what they should earn. Yes, the private sector has added jobs for 73 consecutive months. However, the median income remains just about the same as it was when Mr. Obama took office. No progress in nearly eight years.</p>                \n                \r\n\n            \n                <p>In addition, the President has added nearly $9 trillion to the federal debt. He has increased it a whopping 81 percent. Added more to the debt than any other president in history. And much of that was money spent to stimulate the economy. Memo to Bernie Sanders and Hillary Clinton, the government cannot stimulate the economy, at least in any meaningful way. The private sector must do that by investing, developing new services and products, and hiring more workers in order to make more profit. Does everybody understand that? The big government folks like President Obama and Senator Sanders are wrong.</p>                \n                \r\n\n            \n                <p>And we, the people, are paying the price. Summing up, the economy will be the biggest issue in this year's presidential election. The folks need better paying jobs. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: More bad news for the American economy", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 4/28", "date": "2016-04-29T13:16:13Z"}