{"vcmId": "227b204f-1240-49f2-aee9-45f897b403a4", "url": "http://www.foxnews.com/transcript/2014/11/24/bill-oreilly-president-obama-dividing-nation.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As I've said before debate and discussion about the immigration problem in America rarely changes opinion. And many liberal folks want open borders, sympathizing with poorer people who have come to America for a better life. Some other Americans see the illegal alien invasion as an intrusion, resulting an America changing dramatically in many ways. Both sides are dug in and mostly unpersuadable.</p>                \n                \r\n\n            \n                <p>So \"Talking Points\" believes the President of the United States should now be the focus of the debate. There's no question that by unilaterally giving legal status to millions of undocumented people, the President is challenging the Constitution. It was only one hour, one hour before the President's speech last night, that the Justice Department put forth statement saying what the President was doing was legal. In the past, the President himself said it was illegal for him to grant millions of undocumented folks the right to stay in America.</p>                \n                \r\n\n            \n                <p>The \"Wall Street Journal\" a very sympathetic immigration editorialize today this way quote, \"Mr. Obama is issuing his order amid furious political opposition and after his own multiple previous declarations that he lacks legal authority. The politics of immigration is already fraught and Mr. Obama's order will make it worse.\"</p>                \n                \r\n\n            \n                <p>Indeed Texas and Oklahoma have announced they're going to sue President Obama on the grounds that he is violating the constitutional rights of those states.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>GREG ABBOTT (R), TEXAS GOVERNOR-ELECT: </b>He has a legal obligation to enforce the laws plus immigration is assigned by the Constitution to the United States Congress to determine not the President. The President has no legal authority to grant legal status to people who are here in the United States illegally.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Of course the Obama administration disagrees with Governor Elect Abbott and millions of dollars will be spent defending the President's actions in the federal court system, but in the end, the President may very well lose in the Supreme Court.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JUDGE ANDREW NAPOLITANO, FOX NEWS SENIOR JUDICIAL ANALYST:</b> The President has this power called the prosecutorial discretion so he says to the Justice Department ratchet and DHS, ratchet down the deportations. Ronald Reagan did that, George H.W. Bush can do that. He can do that for a class of people, a small class of people -- 100,000 here, 100,000 there.</p>                \n                \r\n\n            \n                <p>When he does it for half the foreign nationals who are in this country illegally the practical effect of that is not just nullifying their deportations, it's nullifying the law.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So according to Judge Napolitano it's about numbers it's about an abuse of prosecutorial discretion. The tragedy here is none of this had to happen. I believe the new Congress would have passed a fair immigration law if given the chance. Certainly, there was immense pressure on the Republican leadership to do that. But President Obama was in the rush and the question is why?</p>                \n                \r\n\n            \n                <p>Speculation from the right says the President wants to trap the Republican Party into overreacting. Also that he wants to reinforce his reputation as a liberal icon before he leaves office. No matter.</p>                \n                \r\n\n            \n                <p>What Barack Obama has done is setting off a constitutional brawl that will be harmful to a nation that needs united leadership, and intense problem solving.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: President Obama dividing the nation", "description": "Talking Points 11/21", "date": "2014-11-24T13:12:53Z"}