{"vcmId": "2390f162-152b-4103-a289-b3ba3a20ec74", "url": "http://www.foxnews.com/transcript/2015/03/17/deadline-for-nuclear-negotiations-approaches.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 16, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight.</p>                \n                \r\n\n            \n                <p>Secretary of State Kerry negotiating with the Iranians in Switzerland hoping to get a deal to stop the mullahs from developing a nuclear weapon. The situation's chaotic because a number of people do not trust President Obama to make an effective deal. Therefore, 47 Republican senators wrote directly to the Iranian leadership saying that any agreement might be changed after Mr. Obama leaves office. That has angered Mr. Kerry.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOHN KERRY, U.S. SECRETARY OF STATE:</b> This letter was absolutely calculated directly to interfere with these negotiations. It specifically inserts itself directly to the leader of another country saying don't negotiate with these guys because we're going to change this which by the way is not only contrary to the constitution with respect to the executive's right to negotiate but it is incorrect because they cannot change an executive agreement.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Rejoining us from Washington Charles Krauthammer. So, if John Kerry were sitting in this chair, right now. What would you say to him?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> I would say, Mr. Kerry, is it not rich that you should be criticizing 47 senators who are writing about an agreement that they believe is harmful to the country? And you are calling them acting unconstitutionally and contrary to the interest of their country when you yourself 40 years ago spoke openly and to the world declaring your own country guilty of war crimes while we were in the middle of a war, in fact, depredations worthy -- and these are your words -- of Genghis Khan in that fake Brahman accent of yours and you are here now accusing others of harming their country by speaking openly.</p>                \n                \r\n\n            \n                <p>That's the ad hominem. As to the substance of this I would say this was not a letter about the content of the agreement and disagreement with - - with what is in it. This was a letter saying you cannot do this without the Congress, Mr. President, and expect the United States as a country and the Congress, the entire government as an institution to be bound by it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But does Kerry have legal footing when he says you can't undo the deal once it's made? I understood that another president can come in and undo that deal. And say, look, you know, we don't think it's a good deal so we're not going to abide by it.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>That is correct. Kerry contradicted himself, having said a few days earlier that, of course the agreement is not legally binding. The point here is not even the legalities of it. The point is that always when we negotiate a serious arms control agreement in the nuclear age we always involve the Congress, either the House and the Senate or just the Senate. As a matter of constitutional decency that if you are going to do something of this import, of this gravity.</p>                \n                \r\n\n            \n                <p>And this Iran agreement if signed will be the most important agreement of this generation. To do this unilaterally, to cut out the Congress and to say that if Congress take as vote that it will be involved in the ratification of this the President will exercise a veto and cut it out completely? That is something that I think is utterly unacceptable. And the Senators in their objection to that kind of action are entirely correct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. Now, you said it would have been better had the Senators sent the letter to President Obama not the Iranian mullahs. By saying and kept it in-house because now John Kerry and others are saying, you know what? If we don't get a deal, it's the Republicans' fault. You know that's coming down the lane.</p>                \n                \r\n\n            \n                <p>So, if the Republicans could have sent it and kept it in house and said we need you confer with us on this thing because of the reasons you just stated that probably would have been a better play.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>Of course it would. That's the first thing I said on the first night it came up. You don't address it to the ayatollahs. Although, the implication of the opposition by saying this is an act of treason, you are going behind the President is, of course, preposterous. This is not a secret letter dropped in the mailbox and dropped somewhere, you know, in a forest so that an Iranian agent would pick it up. This was a bloody open letter to the world.</p>                \n                \r\n\n            \n                <p>So it should have simply been addressed either to the President, the American people, to United States allies or to no one in particular and say here's our position, you have to bring in the Congress because without the Congress on board, this agreement will be much more fragile and temporary than it ought to be. And that is exactly right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How do you see this playing out now? You know, it's speculative but, you know, you know what's going on here. How do you see it coming down? Because there is only maybe three months that they have got to get this thing done. And they have to have a framework within weeks. How do you see it?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. Well, they have got to have something to show by the end of the month. I think what's happened here is that the combination of the Netanyahu speech and of the letter, despite the fact that given the opposition, the opportunity for all these distractions about talking about protocol, and process, despite that, it has brought to the attention of the American people and the Congress how bad the agreement is. I think its immediate effect is that it stopped the administration in its tracks from giving away the whole store.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, even more.</p>                \n                \r\n\n            \n                <p>It gave away 80 percent of the store, but it has not been able to go the final few miles of this. And that's why I think there may not be an agreement because the Iranians want everything. The administration would otherwise, I think, have given them everything.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> So it may not happen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And then the President will blame the Republicans if no deal is made, right?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>That's exactly what he would do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Charles Krauthammer, everybody -- the doctor is in.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Deadline for nuclear negotiations approaches ", "description": "John Kerry negotiating with Iran to stop the mullahs from developing a nuclear weapon", "date": "2015-03-17T12:27:34Z"}