{"vcmId": "2459fb58-5150-46a1-afcc-dcf4363ced2c", "url": "http://www.foxnews.com/transcript/2015/01/06/bill-oreilly-progressive-left-and-police.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>There is a mini crisis brewing here in New York City. The NYPD is so angry that over anti-police demonstrations and the recent assassinations of two New York City police officers that they are engaged in a work slow down. Arrests for minor crimes -- minor crimes in the last part of December way down.</p>                \n                \r\n\n            \n                <p>Add to that the fact that thousands of New York City police officers despise the mayor, Bill de Blasio, and continue to show disrespect by turning their backs to him; this, despite the fact that Police Commissioner Bill Bratton asked his officers not to do that. At yesterday's funeral for murdered police officer Wenjian Liu, thousands of cops defied their boss and turned away from de Blasio when he spoke at the service.</p>                \n                \r\n\n            \n                <p>Now, for those of you who don't live in New York City, there is a bigger picture. And that is that the progressive left believes the American justice system is unfair to black people. There is no question African- Americans commit crimes way out of proportion to the general population. The real question is why.</p>                \n                \r\n\n            \n                <p>According to analysis done by a \"Wall Street Journal\" columnist today, blacks make up 14 percent of the U.S. population but account for 47 percent of all police killings. Based upon FBI stats, blacks are almost six times as likely as non-blacks to kill a police officer. That is why the cops are more defensive around blacks, especially young black men.</p>                \n                \r\n\n            \n                <p>The police themselves feel threatened because the violent crime rate among young African-American men is so intense. Does policing in the inner city neighborhoods is far more difficult and confrontational than policing in white neighborhoods. The fact that African-Americans commit crimes way out of proportion to the general population is the tipping point in the police controversy.</p>                \n                \r\n\n            \n                <p>But the left will never acknowledge that; instead excuses are made. According to some, the historical oppression of the African- American community is the root cause of violence and not individual behavior. Also many on the left believe the American police are the guardians of the oppressive justice system. They prop it up.</p>                \n                \r\n\n            \n                <p>Apparently that is what Mayor de Blasio believes, that there is injustice among his own police officers. He even told his own son, a mixed race teenager, to be careful around the NYPD. That point of view that the left is putting out there saying the police are instruments of oppression rather than a protective force is causing outrage on the part of the cops themselves. Any fair-minded person can understand that. It is easy.</p>                \n                \r\n\n            \n                <p>If young black men are killing police officers at a rate six times higher than other American groups, the cops are going to be wary of them. And then you add to that the fact that the progressive left in general does not want to punish many crimes.</p>                \n                \r\n\n            \n                <p>Activist Russell Simmons told me right here on \"The Factor\". He believes selling heroin, meth and crack and other hard drugs is not a violent crime. Mr. Simmons thinks incarcerating people for dealing drugs is oppression.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is selling heroin and crack on the street a violent crime?</p>                \n                \r\n\n            \n                <p><b>RUSSELL SIMMONS, MUSIC MOGUL:</b> But I am saying that whites and blacks --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That is an easy question. Can you answer that?</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>SIMMONS: </b>-- but 95 percent of the people who are incarcerated for that crime are black or white --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Am I invisible? Are you not hearing me? Are you not hearing me?</p>                \n                \r\n\n            \n                <p><b>SIMMONS: </b>I don't think selling drugs is a violent crime.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. Thanks. You and I have a final disagreement. Because I think selling hard drugs is a violent crime.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now to go back to Mayor de Blasio. Before he was elected mayor the New York City Police Department managed to drive down murders from more than 2,000 in 1990 to 328 killings last year 2014. That is a tremendous success. But de Blasio's view point elsewhere. He sees the protesting cops as the problem.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MAYOR BILL DE BLASIO (D), NEW YORK CITY: </b>Those individuals who took certain actions this last week or last two weeks, really -- they were disrespectful to the families involved. That is the bottom line. They were disrespectful to the families who had lost their loved one. And I can't understand why anyone would do such a thing in a context like that.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I disagree. The police who protested de Blasio's presence at the funeral were sending a valid message. The fact they attended the funeral showed their respect for the families. But they don't have to honor anyone at the service, especially someone who is putting their lives in danger.</p>                \n                \r\n\n            \n                <p>Don't believe me? Listen to this. Less than 24 hours after Officers Liu and Ramos were murdered by Ismaiiyl Brinsley who committed suicide, 18- year-old Devon Coley posted a picture on Facebook of a man shooting a gun into an NYPD car. Coley was arrested now facing a felony for making a terroristic threat. The Brooklyn D.A. asked for $250,000 bail because Coley has a long arrest record and is an alleged gang member.</p>                \n                \r\n\n            \n                <p>But Judge Laura Johnson ruled there should be no bail at all, nothing. Despite the fact that Coley is facing charges including assault and criminal possession of a weapon in a previous case before the terroristic threat on the cops. The NYPD is furious, as it should be. Judge Johnson had to be reappointed to the bench by New Year's Eve. Most of us felt she had no chance after that outrageous decision. But Mayor de Blasio did reappoint her symbolically spitting in the face of his own police department.</p>                \n                \r\n\n            \n                <p>And de Blasio wonders why these men and women are turning their backs on him? Why they despise him? You reappoint a judge that grants a thug no bail after the man posed a violent threat against cops in the wake of two assassinations? No sane judge does that. And no responsible mayor condones it</p>                \n                \r\n\n            \n                <p>A little later Megyn Kelly will analyze the situation for us but \"Talking Points\" believes Mayor de Blasio does not respect law enforcement, has directly insulted each and every member of the New York City Police Department and should resign his position.</p>                \n                \r\n\n            \n                <p>There is no way on this earth the mayor is ever going to command respect among the vast majority of the 35,000-member police community here in New York. There comes a point when ideology becomes so damaging to a society that it has to be stopped.</p>                \n                \r\n\n            \n                <p>Mayor de Blasio is as left wing as they come. For some reason the voters in New York City after electing Rudy Giuliani and Mayor Michael Bloomberg have given power to this man. He is going to ruin the city. There's no question in my mind he'll do that. His main concern is social justice. He believes the cops in general oppress black people. That message has been sent by the mayor, loud and clear to everyone.</p>                \n                \r\n\n            \n                <p>Former mayor, Rudy Giuliani, summed it up.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>RUDY GIULIANI (R), FORMER MAYOR OF NEW YORK CITY:</b> Never had the police turn their backs on me. I never had an issue about policing with them. I do believe Mayor de Blasio should apologize to the New York City Police Department. I said it day one. And I think he would get this over with if he did it.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I disagree with Mr. Giuliani. By reappointing Judge Johnson Mayor de Blasio has reached the point of no return.</p>                \n                \r\n\n            \n                <p>Policing is a dangerous job. A few police officers abuse their power -- the system must hold them accountable for that. But the vast majority of the NYPD and all other American police agencies do protect us from evil, from harm, from destruction. The one thing the police cannot protect us from is a politician like Bill de Blasio.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The progressive left and the police", "description": "Talking Points 1/5", "date": "2015-01-06T12:58:39Z"}