{"vcmId": "24f23887-6766-4552-b7ed-2c5f4110ca8b", "url": "http://www.foxnews.com/transcript/2016/07/13/bill-oreilly-president-obama-and-race.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Today in Dallas, Mr. Obama addressed the world trying to calm racial tension in the U.S.A.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> Scripture tells us that in our sufferings there are glory because we know that suffering produces perseverance. Perseverance character. And character hope.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All of that is true. But it's also rhetorical and while the President is trying to lift spirits, we do need some targeted programs in America to tamp down racial animosity. The President hit a high note and a dubious note. First, the good.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>We're going to have to be honest with each other and ourselves. We know that the overwhelming majority of police officers do an incredibly hard and dangerous job fairly and professionally. They are deserving of our respect and not our scorn.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Very well put by the President. But then Mr. Obama veered away from the present and into the land of grievance.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> We also know that centuries of racial discrimination, of slavery, and subjugation and Jim Crow, they didn't simply vanish with the end of lawful segregation. They didn't just stop when Dr. King made a speech or the voting rights act and the civil rights act were signed.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The President went on to say that race relations have, quote, \"improved dramatically in my lifetime.\" However, raising the specter of slavery and Jim Crow gives the haters an excuse and fuels the grievance industry. If we are ever to become one nation under God, we'll have to put the grievances behind us. And not use them as an excuse for current bad behavior. That means acceptance of past sins and a determination to never let mass discrimination happen again. To some extent, the President understands that. But he is not powerful enough in stating it. Instead, he dwells on the problem rather than on the solution.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> America, we know that bias remains. We know it. Whether you are Black or White or Hispanic or Asian or Native American or a Middle Eastern dissent, we have all seen this bigotry in our own lives at some point.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And white people have been the subject of bigotry as well. The truth is bias will always be with us. Every country has it. From the dawn of mankind, unfair treatment has occurred on this planet. Americans should all be in this together, but we're not. What we really need is a federal government to create laws that are fair to everyone and make sure they're enforced without prejudice. That's not going to be easy. But it is possible. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: President Obama and race", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 7/12", "date": "2016-07-13T12:06:13Z"}