{"vcmId": "26c858d9-7132-41e4-87c1-d3c6dbeae9ec", "url": "http://www.foxnews.com/transcript/2015/06/04/assessing-presidential-legacy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 3, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight.</p>                \n                \r\n\n            \n                <p>New CNN poll asks more than one thousand American adults to rank people favorably or unfavorably. President Obama: 49 percent favorable; 49 percent unfavorable. Former President George W. Bush: 52 percent favorable; 43 percent unfavorable. Wow. Good day for President Bush.</p>                \n                \r\n\n            \n                <p>And with just a year and a half left in his tenure President Obama is now looking ahead to his legacy. Trying to get a nuke deal with Iran and hoping the supreme court does not overturn a key component of Obamacare. But where does President Obama stand historically right now.</p>                \n                \r\n\n            \n                <p>Joining us from Washington Dr. Lara Brown teaches at George Washington University, author of the book \"Jockeying for the American Presidency\". Here in New York City Dr. Julian Zelizer, teaches at Princeton, author of book \"The Fierce Urgency of Now: Lyndon Johnson, Congress and the Battle for the Great Society\".</p>                \n                \r\n\n            \n                <p>All right. Dr. Zelizer, I'll begin with you. Where would you put President Obama right now?</p>                \n                \r\n\n            \n                <p><b>DR. JULIAN ZELIZER, PRINCETON UVTY:</b> You know, certainly not FDR or he certainly is not Ronald Reagan in terms of his overall impact but he has a good policy record just in terms of the number.</p>                \n                \r\n\n            \n                <p>He has significant domestic legislation. Significant changes in foreign policy. It's not whether they are good or bad but there is a record that's probably different than a Jimmy Carter, for example.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But when I'm ranking presidents and I do a little history as you may know. I'm looking for accomplishments that have improved the country, and I think President Obama is short of those and Obamacare is still debatable.</p>                \n                \r\n\n            \n                <p><b>ZELIZER: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We don't know how that's going to work out. Don't know if it's going to exist after the Supreme Court gets through with it. Would you point to another accomplishment of President Obama that would put him in the middle of the pack?</p>                \n                \r\n\n            \n                <p><b>ZELIZER:</b> Well, certainly some historians will say he helped guide the nation through the economic crisis of 2008 and 2009. It wasn't perfect. But the economy has moved in a trajectory and it's currently better than where it was.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Last quarter -- it contracted last quarter. So six and a half years we have median income hasn't risen and economy now contracting. I'm not sure that's going to get him out of James Buchanan territory but I could be wrong.</p>                \n                \r\n\n            \n                <p>Dr. Brown, how do you see the President?</p>                \n                \r\n\n            \n                <p><b>DR. LARA BROWN, GEORGE WASHINGTON UNIVERSITY: </b>Well, the way I see the President is that he is passing but not really succeeding. In other words, he's got a lot of accomplishments but those accomplishments are likely fleeting because they are either by executive action or other executive orders. Or they might even be problematic precedence that we may not want going forward or could be even more problems for future presidents.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But as historians evaluate Barack Obama, they're going to, as I just told Dr. Zelizer. They're going to have to say look, what did he do to improve the country? We have kind of a chaotic situation overseas that may become very, very serious quickly.</p>                \n                \r\n\n            \n                <p>And here in the United, working Americans have not improved their lot at all. So where you point to, to get him into the 30s or even the high 20's of American presidents?</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Well, certainly Democrats would point to the immigration executive order.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But how has that improved the country? It's already been knocked down by the federal courts? He can't even initiate it.</p>                \n                \r\n\n            \n                <p><b>BROWN:</b> What we're actually going to see is whether or not there is any legislation that eventually comes out of that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But let's deal with reality. What has he done in six and a half years that's, you know, in play in the country?</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Bill, what you have to realize is that presidents are judged both on whether or not they achieve their promises to their fellow partisans and then whether or not those historical accomplishments really do amount to something. And I think you're getting at an important piece, that what he has accomplished may not go down in history all that well.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. President Bush rose in that poll. Did it surprise you?</p>                \n                \r\n\n            \n                <p><b>ZELIZER: </b>No, that's not a surprise. We are far enough away from his presidency where some nostalgia will start to kick in and some of the contention from his presidency will start to, you know, damper down but at the same time we are not into the research yet. We don't have books about him. We aren't reevaluating his presidency.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I was surprised by that poll particularly because Jeb Bush taking a little heat from people who don't want him to run because of his brother. I was surprised that he is now, you know, pretty much significantly more popular than President Obama.</p>                \n                \r\n\n            \n                <p><b>ZELIZER: </b>It is. But I mean this happens with presidents.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It does.</p>                \n                \r\n\n            \n                <p><b>ZELIZER: </b>And you can see, you know, Truman ends in the 20's in terms of approval ratings. He's hated. He doesn't run again. And now he is considered one of the great presidents in terms of what he did for the Cold War. Eisenhower at the time was seen as this bumbling president.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's true. And even Reagan, his approval rating was up but not by -- it didn't surge. But, remember, the communism collapse happened under Bush the elder.</p>                \n                \r\n\n            \n                <p>Now, Dr. Brown, see, when I'm evaluating President Obama, again, I'm looking out and I got your point, but I'm not seeing anything that he has done. I'm not being partisan here. I'm not seeing anything that he's done that has strengthened this nation. Nothing.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Well, again. I mean I think it's about --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Give me one thing that you think may strengthen the nation?</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Well, his fellow Democrats would say that his guiding the economy through the worst --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But as I just pointed out it's -- median income is down and it's contracting now. Do you have anything else besides that?</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Well, I mean, look, I don't disagree with you on a lot of the way that President Obama has performed. I would give him a C, if I were grading him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, that puts him below -- no above Millard Fillmore but yes.</p>                \n                \r\n\n            \n                <p>I just don't know what accomplishment -- and can you give me one.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALKING)</b></p>                \n                \r\n\n            \n                <p><b>ZELIZER:</b> Well, healthcare works if you have millions of people coming into the healthcare system.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> This is working.</p>                \n                \r\n\n            \n                <p><b>ZELIZER: </b>Well we have enrollment in Medicaid as a result of ACA. So supporters would say that's a big --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you really think the history books are going to go hey, you have more people on Medicaid? That's going to be the defining moment?</p>                \n                \r\n\n            \n                <p><b>ZELIZER: </b>I think some will point to that if costs are contained over the long run. I think it will be a success.</p>                \n                \r\n\n            \n                <p><b>BROWN:</b> He also got Osama bin Laden which he will point to as a foreign policy win.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. And you can't argue that. Bin Laden is dead.</p>                \n                \r\n\n            \n                <p>Doctors, thank you.</p>                \n                \r\n\n            \n                <p><b>ZELIZER: </b>Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Assessing presidential legacy ", "description": "New favorability poll compares George W. Bush and Barack Obama", "date": "2015-06-04T12:18:08Z"}