{"vcmId": "274d7a88-92ee-4d2b-8b2b-48007f7b2d1b", "url": "http://www.foxnews.com/transcript/2016/05/20/feminism-and-reporting-on-donald-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" May 19, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Thanks for staying with us, I'm Bill O'Reilly in the Weekdays with Bernie segment tonight. Talking Points on Tuesday put forth that editors at the \"New York Times\" should not be assigning feminists or known anti-Trump reporters to cover the presidential candidate. After hearing that memo, where Bernie Goldberg was ever mentioned.</p>                \n                \r\n\n            \n                <p>Mr. Goldberg had some thoughts and here he is in New York City tonight. What say you?</p>                \n                \r\n\n            \n                <p><b>BERNARD GOLDBERG, FOX NEWS CONTRIBUTOR</b>: Well, look it's a safe bet that everybody at \"The New York Times\" is a feminist and that includes the men as well as the women. Right?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No, I don't think so.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Maybe there's one woman or someplace rather. But it's a safe bet that feminism is one of the guiding principles there. But you raised an interesting question. And that is, can a feminist cover somebody who, among other things, puts on pageants where beautiful women stroll around the stage half naked in high heels? Fair question. The answer, I think is, if that reporter, if it's known in the newsroom or worse if it's known publicly thinks that beauty pageants are a crime against humanity and people who are involved with them should be sentence to death in the electric chair, of course not.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But isn't that the feminist doctrine?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> You can --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Do you know any feminists who like beauty contests?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> You can have an opinion --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: -- even on something like that. And this is a bigger issue to me. And not be disqualified from covering the story.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. I disagree. If you are a Quaker, okay, you can't cover a war because you believe that anyone participating in a war is wrong. If you are a Quaker. So there are no Quaker war correspondents because they can't, they are so revolted by war in general, that's their doctrine.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: I would have to know if that particular woman thought that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But you would never know that, that woman is a good reporter by the way.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Here's how I would do it. Here's how I would do it, personally.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>First of all, if it was known that she thought it was a crime against humanity, she is out. That's easy. If I'm the editor --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: I say, look, I understand that on the upper west side of Manhattan, beauty pageants are seen as the stuff of Neanderthals. I understand that. But there's a whole country between Manhattan and now the world, a lot of people don't think that way. I need to know from you and think before you answer this, if you can be fair.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And you would ask the report of that.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What do you think they are going to say?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Well, I will tell you this, if they say they can, and they hand me copy that isn't there is going to be big problems.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: But I think the bigger issue.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Let me challenge because we want to be always fair here. This Megan Twohey and put her picture up there is a good reporter. I mean, who resonate the other guy, believe me, the other guy is a light weight. He is a tweeter. He tweeted out about Trump, you know, not egregious things as I said but little snarky stuff. But the other one, Megan is a good reporter. So we call her up. We call her up. And she is as I remember, on MSNBC, she is on CNN, all of this stuff. We call her up. We had one question. Are you a feminist? That's all. Hung up. Hung up.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: But you know the fox effect here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, no, no, no. You can't answer one question --</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Of course you can.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: About a legitimate point that we're trying to make that you can't be a feminist and cover Donald Trump?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Of course she can answer it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: And of course she should have answered it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: And she should have gone beyond the answer yes or no.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: On the program talk to me about it.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> I will tell you what, what I would have advised her to do is go on the program and say if she is, yes, I'm a feminist and here's why it doesn't matter.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. And I'm willing to listen.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: I think you would be willing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I will. I'm willing to listen.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Can I tell you what I think the bigger issue is?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Sure.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Look, everybody who follows the news has an opinion, the people out there have opinions. We journalists have opinions. There is nothing wrong with that. If you are pro-choice, can you be fair to somebody who is pro-life? If you are pro-life, can you be fair to somebody who is pro- choice? If you won't vote for Donald Trump, can you be fair to somebody who would vote for Donald Trump? None of that is a problem. Here's the problem. Newsrooms are overwhelmingly populated by Liberal journalists. Now, when I wrote \"Bias\" they wouldn't acknowledge that, today --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They have to. Surveys.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Exactly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> So they find the story interesting. And you and I know how this works. They get together and they say, let's investigate Donald Trump's treatment of women. That's a question that interests them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Here's a question and fine, if you want to do that, fine with me. Here's a question that interests a lot of other people. Did Hillary Clinton have any role, any role in sliming women who made accusations against her husband? Did she know about it? Was she part of the political bashing? And, by the way, it's accepted that there was a political campaign to delegitimize these women. Did she know about it?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Of course, her own statement.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> What I'm saying is, the editors who are interested in Donald Trump, they should be interested in that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But they are not.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> But if you don't have diversity in the newsroom, you are going to get that kind of bias.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Bernie Goldberg, everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Feminism and reporting on Donald Trump", "description": "Bernie Goldberg weighs in on the New York Times article on the GOP candidate", "date": "2016-05-20T12:20:50Z"}