{"vcmId": "2773d5b8-bc10-442f-ad16-06d20dce9b36", "url": "http://www.foxnews.com/transcript/2016/12/20/bill-oreilly-phony-stories-and-fake-news.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>You may have noticed The Factor has not covered anything about the Electoral College vote because it's a completely phony story.</p>                \n                \r\n\n            \n                <p>Donald Trump will be the next president. Doesn't matter if one or two electoral delegates defect. The left-wing press blowing the story up because they want to make Trump look bad. Not because it's any basis in reality. If there were to be chaos in the Electoral College, the House of Representatives simply certify Donald Trump as president on January 6th. So, again, it's a phony story. And all of those so-called journalists who participate in it are misleading you. Now, on to Russian hacking. That's a real story. And we spotlighted it back on October 12th.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Talking Points believes that if the Intel is correct and Russian hackers working for Putin did indeed intrude on the American election, President Obama must take action. First, he must speak directly to the American people about the evidence and second he must apply sanctions against the Putin government. These cyber-attacks are just that, attacks. So let's get on it, Mr. President.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But President Obama did not get on it. Did not debrief the American people. Did not do anything as far as we can tell. Also when I made that statement in October, no Democrat said yes, O'Reilly is right. Let's go. President Obama should confront the Russians with something more than words. What Democrat said that? But now they are whining all over the place. As for the President he says he took action but obviously according to his own people, that action did absolutely nothing.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>President Obama also said Friday that the cyber- attacks stopped after he warned Putin at an international conference in September. You've been briefed on the party's computer system. Is that right? They stopped?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> No. They did not stop. They came after us absolutely every day until the end of the election. They tried to hack into our system repeatedly.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ms. Brazil by the way is greatly embarrassed because some of the hacked email showed her dishonestly feeding questions that Hillary Clinton before CNN appearances when she was working over there. Ms. Brazil says she didn't do anything wrong but again those emails are very troubling for her and for CNN. Now the bigger picture. We are living in a very dangerous world. Just today in Turkey the Russian ambassador was shot dead by this nut. He was screaming Allah is great. And railing about the situation in Syria. Dead man is on the floor behind him.</p>                \n                \r\n\n            \n                <p>In Berlin, Germany, a man driving a truck ran over scores of people at a Christmas market. You can bet it's another act of terrorism as the body count piles up. The action specifically intended to bring harm in the Christmas season. We'll have more details shortly. Now, the President of the United States is not responsible, not responsible for terrorist acts but he is to be held accountable for actions of reprisal.</p>                \n                \r\n\n            \n                <p>Again, talking points says that talking tough is clearly not a strategy and doing nothing to the bad guys empowers them. It's clear Hillary Clinton and the Democratic Party did not believe that the Russian hackers would derail their presidential chances. So, no pressure was put on President Obama to stop the madness when it was uncovered. But now it's a different story.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON (D), FORMER PRESIDENTIAL NOMINEE:</b> We have to recognize that as the latest report made clear Vladimir Putin himself directed the covert cyber-attack against our electoral system, against our democracy apparently because he has a personal beef against me.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Mrs. Clinton speaking at a private party. Of course, somebody taped her, people tape everybody every second and then they gave it to the New York Times to put that audio on their website. Now it seems to me that Putin's alleged favoring of Trump, if that's a fact, may be very large mistake. By putting some very tough generals in charge of the Defense Department and National Security, a message being sent to Putin and to the world don't mess with the U.S.A. Clear the Russian leader and other tyrants ran wild and the Obama administration did not or could not stop them.</p>                \n                \r\n\n            \n                <p>I guess it's possible that Putin just dislikes Hillary Clinton and believes he can manipulate Donald Trump. But that's speculation. Right now the American public really doesn't know what the blank happened because the Obama administration will not tell us. So now Congress is getting involved.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. JOHN MCCAIN (R-AZ), CHAIRMAN, COMMITTEE ON ARMED SERVICES:</b> We need to get to the bottom of this. We need to find out exactly what was done and what the implications of the attacks were, especially if they had an effect on our election. There is no doubt they were interfering and no doubt it was a cyber-attacks.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Talking points believes Senator McCain is in a very good position to gather facts and tell the folks what exactly happened and how it pertained to the presidential vote. Now, we hope Mr. McCain will do that. We all should know. As for Donald Trump, he should stay out of it. Until he gets into office. And begins being briefed by the people he has appointed to intelligence positions. The Obama folks aren't going to level with Trump. No way that's going to happen.</p>                \n                \r\n\n            \n                <p>Last week we suggested to the President-elect that he not participate in speculation about the Russian hacking. Again, it makes no sense, it happened on Barack Obama's watch. Let him deal with it. Talking points believes that the Russian government was involved in embarrassing the Democratic Party. I don't know why. That's a job of the CIA to find that out. Talking points does not believe the hacking caused Hillary Clinton's defeat. That's a phony line of reportage.</p>                \n                \r\n\n            \n                <p>The American people do not care very much about what John Podesta said or what Donna Brazile did. Those are secondary issues. But the left is desperately searching for some reason to explain why Secretary Clinton and the Democratic Party lost so badly in November. Yes, I know the popular vote went to Mrs. Clinton but it was all California. And every fair-minded person knows that. Take that progressive state out of the mix, it was a decisive win for Trump in almost every category.</p>                \n                \r\n\n            \n                <p>Summing up, the left-wing media has an agenda. That Trump did not win the election fairly. The Democratic Party has an agenda. But the Russians threw the election to Donald Trump. Neither of those things are true. And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Phony stories and fake news", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 12/19", "date": "2016-12-20T13:22:12Z"}