{"vcmId": "27ee22e7-30e5-48f8-9fea-a79103538a3c", "url": "http://www.foxnews.com/transcript/2017/03/28/bill-oreilly-how-politicians-are-hurting-american-people.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The failure to pass a new healthcare proposal in the House has hurt the Republican Party and President Trump.</p>                \n                \r\n\n            \n                <p> The situation is confusing, but let me break it down so even the politicians can understand it.</p>                \n                \r\n\n            \n                <p> There are three basic things that America needs from a fair healthcare plan.</p>                \n                \r\n\n            \n                <p> First, a reasonable cost. Working people cannot be punished with high insurance premiums.</p>                \n                \r\n\n            \n                <p> Second, that the poor who cannot afford insurance are given access to healthcare in some way, Medicaid perhaps the best way.</p>                \n                \r\n\n            \n                <p> And third, that all Americans are protected from medical catastrophe.</p>                \n                \r\n\n            \n                <p> So if I am a sitting Republican congressman, how do I vote on the new proposal to replace Obamacare?</p>                \n                \r\n\n            \n                <p> Well it's impossible to know if the proposed new law would lower costs for everyone, but if health insurance companies are eventually allowed to compete all across America, which they cannot do now, market forces would likely bring the cost down.</p>                \n                \r\n\n            \n                <p> Also, I am evaluating the entire situation - what good does it do my party and the president if I oppose the first proposal the House put forth knowing that proposal will be changed in the Senate and come back to me for another vote?</p>                \n                \r\n\n            \n                <p> It seems logical that you move the process along and then at the end when the entire bill is before you, you vote your conscience.</p>                \n                \r\n\n            \n                <p> But by throwing the whole thing out for ideological reasons, nothing is accomplished other than the Republicans looking bad.</p>                \n                \r\n\n            \n                <p> Now this analysis is not based on any party sentiment by me, it's all about you what's best for the folks.</p>                \n                \r\n\n            \n                <p> It's a given that the Democrats are not going to turn on Obamacare; they'll support it to the bitter end.</p>                \n                \r\n\n            \n                <p> Yes, they may tweak it a bit, but they want a giant entitlement that costs a fortune and hurts working Americans by making them pay higher premiums.</p>                \n                \r\n\n            \n                <p> So if the Republican Party doesn't unite, Obamacare stays the way it is, which is the situation right now.</p>                \n                \r\n\n            \n                <p> The big reveal here is that conservative Republicans who voted against the new proposal will not compromise.</p>                \n                \r\n\n            \n                <p> <b>REP. TED POE (R-TX):</b> &#8220;There's some members of the Freedom Caucus, they'd vote no against the Ten Commandments if it came up for a vote. I think it's time that the Freedom Caucus work together with other members of the Republican Party.&#8221;</p>                \n                \r\n\n            \n                <p> Mr. Poe has left the Freedom Caucus, frustrated about the healthcare stance.</p>                \n                \r\n\n            \n                <p> The bigger picture is this President Trump did get hurt by the healthcare vote, but it's not a catastrophe all presidents lose on major issues president obama wanted to close guantanamo bay never got it done.</p>                \n                \r\n\n            \n                <p> He wanted much more social justice spending never happened.</p>                \n                \r\n\n            \n                <p> Making new laws is very tough as it should be.</p>                \n                \r\n\n            \n                <p> The Trump administration would be wise to move along and try to get a new tax code.</p>                \n                \r\n\n            \n                <p> That issue should unite all Republicans, who believe the free marketplace is the way to provide prosperity for Americans.</p>                \n                \r\n\n            \n                <p> If some Republicans oppose lower taxes, that will be stunning.</p>                \n                \r\n\n            \n                <p> But the president needs to move quickly.</p>                \n                \r\n\n            \n                <p> The tax reduction plan should become clear in early May. We need new tax rates for both workers and corporations, and we need to phase out deductions that only benefit the very wealthy.</p>                \n                \r\n\n            \n                <p> That doesn't seem to be too much to ask Congress to do.</p>                \n                \r\n\n            \n                <p> And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: How Politicians Are Hurting the American People", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/27", "date": "2017-03-28T12:09:00Z"}