{"vcmId": "27f6455d-d581-49af-83e5-2cc0ad14c6b4", "url": "http://www.foxnews.com/transcript/2016/03/11/rise-donald-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 10, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Impact Segment\" tonight. President Obama held a press conference earlier today with Canadian Prime Minister Justin Trudeau. The president was asked about Donald Trump.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>PRES. BARACK OBAMA, (D) U.S. PRESIDENT:</b> What you are seeing within the Republican Party is, to some degree, all those efforts over a course of time creating an environment where somebody like a Donald Trump can thrive.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>PRES. OBAMA</b>: But what I'm not going to do is to validate some notion that the republican crack-up that has been taking place is a consequence of actions that I have taken.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That was the slowest sound bite I have ever seen in my entire life. Joining us now from Boston, Mary Anne Marsh and here in New York City, Andrea Tantaros. So, I don't think the president is ever going to cop to the fact that we live in a polarized country and he is responsible for much of that polarization. Out of that polarization rises one Donald Trump. Correct?</p>                \n                \r\n\n            \n                <p><b>ANDREA TANTAROS, CO-HOST OF \"OUTNUMBERED\" WEEKDAYS AT NOON:</b> Correct. But, I have to agree with the president on this one. He didn't cause the rift in the Republican Party. In fact, the Republican Party establishment handed Obama four more years by nominating not one but two candidates, who weren't able to beat him the last one being Mitt Romney. Now, they are elevating Romney again and it's only helping Donald Trump. So, Obama is right. He didn't cause this. This he is the beneficiary of the establishment.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I think he caused it in the sense that he implanted, Mary Anne, in the minds of conservative Americans an anger. They don't like him. They don't like what he has done. There isn't anything they like about him. And, that anger is reflected by Donald Trump.</p>                \n                \r\n\n            \n                <p><b>MARY ANNE MARSH, DEMOCRATIC STRATEGIST</b>: True. But, no one has ever won the White House running against Barack Obama. And, that's pretty much what Donald Trump is trying to do right now because Hillary Clinton is Obama's proxy. Trump is going to bet that the third times of term, Clinton is betting that three strikes, you are out.</p>                \n                \r\n\n            \n                <p>And, it is on many of the same issues. So, to me that's the interesting part. And, I think really what Obama was getting to the heart of. You have may want to run on these issues. You may blame me for Donald Trump's rise, but you don't win in the end and you certainly don't win the White House.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I don't know if he is looking that forward, though. What I heard the president say, Andrea.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is that, look, \"You are not going to lay this on me, because I really didn't have anything to do with it.\" And, I disagree 100 percent on that. If you have had a mainstream democrat president, say a Bill Clinton, who I believe was kind of mainstream.</p>                \n                \r\n\n            \n                <p>You wouldn't have the unbelievable anger that you do have on the part of the conservatives, who don't think that the republican hierarchy is angry enough against President Obama.</p>                \n                \r\n\n            \n                <p><b>TANTAROS: </b>I think that they are angry at President Obama. That's the one thing that republicans can agree on.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Who?</p>                \n                \r\n\n            \n                <p><b>TANATAROS</b>: Republicans across the board, Bill. They are angry at Barack Obama.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You think Mitch McConnell and --</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> Yes. But, if you talk to republicans --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: -- this guy --</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> -Bill, if you pull republican voters now --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes?</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> -- the resounding answers are, yes, they are upset at Barack Obama, but they are more upset at the --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's because the establishment didn't do enough against Obama. Don't you see?</p>                \n                \r\n\n            \n                <p><b>TANTAROS: </b>Yes. Then whose fault is that?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's the establishment's fault.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: Exactly. That's my point.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. But, it's all driven the common denominator is Barack Obama, Mary Anne. He is the common -- that's where you start. Ground zero.</p>                \n                \r\n\n            \n                <p><b>MARSH:</b> Sure. He might --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: If it were Jimmy -- No. Jimmy Carter might not be the best example but even Carter wasn't as loathed as Barack Obama is by the right.</p>                \n                \r\n\n            \n                <p><b>MARSH</b>: He has been the republican's target for eight solid years. And, to what end? Instead, they end up with Donald Trump, who nobody in the republican establishment wants as their nominee. They put a process together because they thought Romney was going to win that was going to favor him in his re-election. Instead, they have a process now that can't stop Donald Trump and they created Donald Trump. So, you reap what you saw.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> I agree with Mary Anne.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't think the Republican Party created him. I think the folks created him. I think the populist sentiment that the Republican Party didn't do enough to derail Obama's agenda created Donald Trump.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> Right. So, that is what they are fighting over now. And, that's specifically what the president was commenting on. That's why I agree with Mary Anne. He is commenting on the circus.</p>                \n                \r\n\n            \n                <p>The circus is, the establishment republican versus the republicans, the blue collar and middle class Americans, who feel that they have been left behind not just by the right, but by the left. These are the republicans who did trade deals and were closing up to folks in davos.</p>                \n                \r\n\n            \n                <p>Then you have the democrats who are in bed with the Latino caucus, taking jobs away from manufacturing and construction. And, that bears out in the polls. That is the big vote that crossover appeal. 53 percent according to the \"Wall Street Journal\" Donald Trump is garnering with these blue collar voters. And, that's why the president --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You are giving a lot of microanalysis.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: Because that's how I do.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I know.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> That's what I do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But, I don't see the microanalysis at the Trump rallies. I see the raw emotion. And, let me put this out to you. The guy who has been consistently against Barack Obama has been Ted Cruz. All right.</p>                \n                \r\n\n            \n                <p>And, he is the most militant anti-Obama senator, by far. All right. He, then, if you ladies are telling me the truth, he should be the leader. But he isn't. Because the emotion has all gathered around Trump, Mary Ann.</p>                \n                \r\n\n            \n                <p><b>MARSH:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Because Trump is the avenger. Cruz is the intellectual. I don't like him. We got to get back to the constitution. But, Trump is the guy is this, Hillary is that. And, that's what people want to punish. That's what they want to do. And, it's because of President Obama.</p>                \n                \r\n\n            \n                <p><b>MARSH:</b> Trump is the outsider. And, that's what they want. They have seen Cruz as a failed senator for their cause. He can stand there and filibuster all day long and he still doesn't win. He is not a winner in their eyes. Donald Trump has been able to present yourself as one over many years now over many different platforms. And, so --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It is easy to present yourself as a winner at the arena. And, I will point to Ben Carson as an outsider, who didn't get traction, because Carson didn't feel the burn. Didn't feel the anger that Trump feels. Trump is a head because he is reflecting. It is not about policy.</p>                \n                \r\n\n            \n                <p><b>MARSH:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It is about anger.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> And, the anger there --</p>                \n                \r\n\n            \n                <p><b>MARSH:</b> Your absolutely right.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> -- And, the anger right now is in the Republican Party. And, that's specifically what he --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Democratic Party, that's why Sanders is there.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> And, I have to something too -- because on this program, you told the folks twice, once that I'm a supporter of Donald Trump and second that I like him. I'm a political analyst that gives microanalysis.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You like Trump, though, right.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: I play this fair and I call this --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I didn't say you are unfair.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Wait, wait, wait.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: But, you said I'm a supporter.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Are you not?</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> No. We're not allowed to do support.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You don't support --</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> No.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You don't support Trump?</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> No, I don't.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No?</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: I analyze every candidate fairly --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I didn't say you didn't. You can still --</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: No spin zone. No spin zone here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You can still be a supporter --</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: I am not a supporter.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>-- and analyze other people fairly.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: No.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You are not. He is going to be broken hearted. He thought you --</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: He is wrong.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I thought you made that pledge. Weren't you down there?</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> See, you got to give the folks the facts, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: I call this race fairly. I analyze all the candidates fairly. I don't support anybody, so I can do my job.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Andrea Tantaros and we know Mary Anne Marsh is not a supporter.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> We know that.</p>                \n                \r\n\n            \n                <p><b>MARSH:</b> There is no a chance, but I do call it fairly.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I think you are both fair. If I did not think you're fair, I wouldn't have you, ladies on the program. Simple as that. And, we should mention that Andrea has a new book coming out in April entitled, \"Tied Up On Knots: How Getting What We Wanted Made Women Miserable.\" Wow!</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The rise of Donald Trump", "description": "'The O'Reilly Factor' examines the President's comments on the impact of the GOP front-runner", "date": "2016-03-11T13:25:20Z"}