{"vcmId": "2b11a01b-7ba2-478f-959d-2e86e14f648e", "url": "http://www.foxnews.com/transcript/2016/07/12/poll-shows-disapproval-decision-not-to-charge-clinton.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" July 11, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thanks for staying with us. I'm Bill O'Reilly. In the \"Impact Segment\" tonight, some Republican congressman demanding the FBI investigate Hillary Clinton for perjury in front of the Congressional Committee when she explained the email deal.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>REP. JASON CHAFFETZ (R-UT), CHAIRMAN, HOUSE OVERSIGHT COMMITTEE</b>: Did the FBI investigate her statements under oath on this topic?</p>                \n                \r\n\n            \n                <p><b>JAMES COMEY, FBI DIRECTOR</b>: Not to my knowledge. I don't think there has been a referral from Congress.</p>                \n                \r\n\n            \n                <p><b>CHAFFETZ</b>: Do you need a referral from Congress to investigate her statements under oath?</p>                \n                \r\n\n            \n                <p><b>COMEY: </b>Sure do.</p>                \n                \r\n\n            \n                <p><b>CHAFFETZ</b>: You'll have one.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: New ABC News/\"The Washington Post\" poll asks the folks, do you approve or disprove of FBI Director Comey's recommendation that Clinton should not be charged with a crime? Thirty five percent approve. Fifty six percent disprove. Nine percent don't know anything.</p>                \n                \r\n\n            \n                <p>Joining us from Washington is Congressman Jason Chaffetz. So, I got a little -- when I saw that exchange last week, I said does he really need a referral? I don't think he needs a referral. He could have gone into that area and see if she had misstated stuff to you. Could he not?</p>                \n                \r\n\n            \n                <p><b>CHAFFETZ:</b> Yes. You don't need a permission slip from Congress to find out if somebody violated the law and it is against the law to provide false statements to Congress.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What was all that referral stuff?</p>                \n                \r\n\n            \n                <p><b>CHAFFETZ</b>: Well, what he was very careful, the Director Comey said that she didn't lie to them. But, you know, the public comments are one area. But when you lie under oath, that's a whole another level. And I was trying to get there because I want to do know if that went towards her intent. But to say they didn't even look at it, that was kind of ridiculous.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But I don't understand why he would do that. Why wouldn't you investigate the whole totality of the controversy, the email controversy which includes Secretary Clinton's testimony in front of your committee? I don't understand why he would need a referral if he wants to get to the heart of the matter. Do you?</p>                \n                \r\n\n            \n                <p><b>CHAFFETZ: </b>I have no rational explanation for it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>CHAFFETZ</b>: It's one of the shocking things that came out of hearing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I thought it was shocking and I was very disappointed in the director's statement there. Now, you have sent a referral over. Right?</p>                \n                \r\n\n            \n                <p><b>CHAFFETZ</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. So, now he has to take a look at whether she mislead your committee, is that correct?</p>                \n                \r\n\n            \n                <p><b>CHAFFETZ</b>: Yes. And as Trey Gowdy went down the list of all the public statement she made. They are very similar what she said under oath. And the director has already said that those statements aren't true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. But here is the game. She is going to say and he is going to back her up. I know it. She said, I didn't know at the time that I was misleading. This is the information that I thought was true at the time. And he even hinted that, Comey. He is not going to come down with any -- he is not.</p>                \n                \r\n\n            \n                <p><b>CHAFFETZ</b>: Well, he should. What he should do and what he does, maybe two different things but the other bit of revelation that came out of this is they were up to 12 people who didn't have the requisite security clearance that the secretary gave that information to. So, during the hearing he said she might not have been sophisticated enough to know how technology email and servers work.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. He's certainly makes an excuses for. But even so, you know, the thing that struck me about the investigation is I think Secretary Clinton should have been questioned by the FBI at the top of the investigation not two days before Comey came out. Don't you?</p>                \n                \r\n\n            \n                <p><b>CHAFFETZ</b>: Well, it's a common investigative tactic to interview somebody at the beginning. Do your investigation and then interview them at the end and see what sort of conflict there is.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>CHAFFETZ</b>: But, you know, he laid it out what he did and the American public gets to make the decision. For me it would be a different conclusion.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Later in that poll, they already made the decision. It's pretty --</p>                \n                \r\n\n            \n                <p><b>CHAFFETZ:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Whether they care enough to vote against Mrs. Clinton, we don't know. But, in my opinion, he is probably going to, you know, talk to you guys a little bit. But it's going to be she didn't know at the time when she was misleading that she was misleading.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>CHAFFETZ: </b>She is the secretary of state. She wasn't that official wildlife.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But you know what I'm saying to you is true. No, it's not going to come back your way. It's not.</p>                \n                \r\n\n            \n                <p><b>CHAFFETZ:</b> I can't argue with you, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, Congressman. Thanks for coming on.</p>                \n                \r\n\n            \n                <p><b>CHAFFETZ:</b> Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Poll shows disapproval of decision not to charge Clinton", "description": "New calls to investigate the former Secretary of State for perjury; Rep. Jason Chaffetz weighs in on 'The O'Reilly Factor'", "date": "2016-07-12T12:26:46Z"}