{"vcmId": "2c2d0c6e-d8b6-4176-b35e-17403cbbd9f6", "url": "http://www.foxnews.com/transcript/2015/02/13/bill-oreilly-are-safe.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>If you have been watching us over the past few weeks, you know that we have established beyond any doubt that most intelligence and military experts in the U.S.A. believe the terror threat from Muslim fanatics is getting worse. Also, that the Obama administration does not have an effective strategy to deal with the situation.</p>                \n                \r\n\n            \n                <p>Yesterday on Capitol Hill, Michael Steinbach, a big shot in the FBI's counterterrorism division was asked about ISIS.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>REP. BUDDY CARTER (R), GEORGIA:</b> So the message I'm getting from you here today is that you feel like we have got that under control or doing the best we can?</p>                \n                \r\n\n            \n                <p><b>STEINBACH: </b>We don't have it under control. Absolutely we are doing the best we can. If I were to say that we had it under control, but I would say that I knew of every single individual traveling. I don't. And I don't know every person there and I don't know everyone coming back. So it's not even close to being under control.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>According to our information, that is true. The ISIS terror killers now control thousands of square miles in Syria and Iraq, have now expanded into Libya and Egypt. And their assassins freely travel all over the world. So it is just a matter of time until they show up here.</p>                \n                \r\n\n            \n                <p>Now, to be fair, no president, no president can protect this country with a 100 percent certainty. It's impossible. But for nearly a year, President Obama has dithered and evaded the growing threat from ISIS. However now, after executing four Americans and setting a Jordanian pilot on fire, critical mass has been reached.</p>                \n                \r\n\n            \n                <p>That kind of personal violence puts pressure on Barack Obama to do something. And a new Fox News poll demonstrates that pressure. When asked does the Obama administration have a clear strategy for defeating ISIS -- just 19 percent of registered voters say yes, an astounding 73 percent say no. When asked is the federal government reducing the threat of terrorism from Islamic extremists -- 67 percent Americans say the feds are not doing a good job in that. However, when asked do you approve or disapprove of President Obama's policy on terrorism -- 42 percent actually approve, 53 percent disapprove. That makes no sense.</p>                \n                \r\n\n            \n                <p>But here's why the answer was put forth. There are a number of Americans who simply will not say anything negative about President Obama himself. So when his name, not the Obama administration, but his name appears in a poll question, the results are skewed. Most folks understand Islamic terrorism is not being dealt with aggressively right now. They know the President is hesitant to even define the threat. Yet, they retain an emotional bond with Barack Obama. So that's what you are seeing there.</p>                \n                \r\n\n            \n                <p>Finally, talking points believes that President Obama is gambling with his own legacy. If the U.S.A. sustains another terror attack by Muslims, his entire presidential profile will be ruined. Do you think Barack Obama even understands that? I'm not sure.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Are you safe?", "description": "Talking Points 2/12", "date": "2015-02-13T13:32:44Z"}