{"vcmId": "2d98b840-1f9a-4d8f-8dd0-fbeecced5444", "url": "http://www.foxnews.com/transcript/2017/03/02/bill-oreilly-president-trump-speech-to-congress.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It was well received, 78 percent of those watching the speech felt it was positive, just 21 percent, negative, according to a CNN snap poll. Also, when asked of the President made you feel more optimistic or pessimistic, 69 percent of that optimistic, just 28 percent pessimistic.</p>                \n                \r\n\n            \n                <p>Now, snap polls like that are based mostly on emotion and the sample was 33 percent Republican, 28 percent Democrat, 39 percent independent. But there is no question that fair-minded people came away from the speech impressed, at least most of them. But of course, that didn't stop the anti-Trump brigade.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>RACHEL MADDOW, MSNBC ANCHOR: </b>It will be a notable thing that the President spent a big portion of what was in fact a State of the Union trying to, you know, tell the country what vicious ordering criminals immigrants are.</p>                \n                \r\n\n            \n                <p><b>SEN. CHRIS MURPHY (D-CT), FOREIGN RELATIONS COMMITTEE</b>: He relished seeing those words. Just to stick it to Islam, to make sure that they knew that they were all a danger to the United States.</p>                \n                \r\n\n            \n                <p><b>KATHY GRIFFIN, COMEDIAN:</b> What an idiot. I mean, we got to watch this idiot for, you know, an hour and nine minutes? He just has one hateful thing after the other. He is so embarrassing.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Interesting word, \"hateful.\" It is embarrassing, isn't it? When you hear something like that? It's embarrassing. Well, let me correct that. It is not embarrassing, it is sad. Summing up, President Trump helped himself greatly last night. His base applauded his presentation throughout, independence broke his way, and he gained credibility among some of those who might have been doubtful and that is \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: President Trump's speech to Congress", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/1", "date": "2017-03-02T12:53:22Z"}