{"vcmId": "2dcde187-a62d-4466-8de9-8ab8c45fd637", "url": "http://www.foxnews.com/transcript/2014/10/16/bill-oreilly-ebola-situation-gets-even-worse.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>When President Obama cancels a fundraising trip, you know things are serious. And that's what happened today -- Mr. Obama meeting with his cabinet about the growing Ebola chaos in the USA instead of traveling.</p>                \n                \r\n\n            \n                <p>Late last night Texas health authorities announced a second healthcare worker at Texas Health Presbyterian Hospital has contracted Ebola. She is 29-year-old Amber Joy Vinson a registered nurse who treated the man who died from Ebola Thomas Duncan a Liberian national. That makes two American nurses infected after treating Duncan, the other nurse Nin Pham remains in isolation. But the latest case is even more harrowing than the first because Ms. Vinson took Frontier Airlines flight 1143 from Cleveland to Dallas on October 13th. Apparently she was carrying the Ebola virus. So now everybody on that flight has to be monitored as well as all the people they came into contact with. So you can see how Thomas Duncan coming into the USA on a false premise has led to disaster.</p>                \n                \r\n\n            \n                <p>As you may know, \"Talking Points\" has demanded that U.S. authorities stop admitting West Africans into America right now. We've also called for the resignation of Dr. Thomas Frieden, the head of the CDC, because he opposes that. Last night on the \"Kelly File\" Dr. Frieden was almost incoherent.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MEGYN KELLY, FOX NEWS HOST: </b>Why not put a travel ban in place until we have shorn up the system?</p>                \n                \r\n\n            \n                <p><b>FRIEDEN: </b>Above all do no harm. If we do things that are going to make it harder to stop the epidemic there, it's going to spread to other parts of Africa.</p>                \n                \r\n\n            \n                <p><b>KELLY:</b> How is it going to make it harder to stop it over there?</p>                \n                \r\n\n            \n                <p><b>FRIEDEN:</b> Because you can't get people in and out?</p>                \n                \r\n\n            \n                <p><b>KELLY: </b>Why can't we have charter flights?</p>                \n                \r\n\n            \n                <p><b>FRIEDEN:</b> You know are charter flights don't do the same thing commercial airliner do.</p>                \n                \r\n\n            \n                <p><b>KELLY: </b>What do you mean? They fly in and fly out.</p>                \n                \r\n\n            \n                <p><b>FRIEDEN: </b>If we isolate these countries what's not going to happen is disease staying there. It's going to spread more all over Africa and we will be at higher risk.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Does that make any sense to anybody? Anybody? It's just ridiculous. The man is spouting nonsense.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BRIT HUME, FOX NEWS SENIOR POLITICAL ANALYST: </b>His explanation, like previous ones that have been given for the reason for not imposing a travel ban in order to keep people from those infected areas out of this country for the time being I thought makes no sense.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And there could be even a more frightening scenario on the horizon. Marine Corps General John Kelly who is in charge of the U.S. Southern Command told the National Defense University that all hell could very well break loose in this country.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>GEN. JOHN KELLY, COMMANDER OF U.S. SOUTHERN COMMAND: </b>If Ebola breaks out, in Haiti or in Central America, I think it is literally \"Katie bar the door\" in terms of the mass migration of Central Americans into the United States; 68,000 children essentially wandered across our border this year. They get into the country pretty much unimpeded. So, these populations will move to either run away from Ebola or if they have been -- are in the fear of having been infected to get to the United States where they will be taken care of.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>O'REILLY: General Kelly's assessment is speculative but certainly possible. So now the federal government looks stupid. It under-reacted to the Ebola threat; it still isn't imposing a travel ban from West Africa; and our border is still porous in the south. That's what happens when leadership is weak.</p>                \n                \r\n\n            \n                <p>Dr. Frieden out of there. He botched it -- period. President Obama, stop the fundraising, pay attention to your country. For everybody else, stay calm, but let your senators and congress people know you want that travel ban now.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The ebola situation gets even worse", "description": "Talking Points 10/15", "date": "2014-10-16T13:56:31Z"}