{"vcmId": "2f9a6fe3-092d-4330-97da-44fcc32af1de", "url": "http://www.foxnews.com/transcript/2016/05/20/bill-oreilly-hillary-clinton-or-donald-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Policy issues order of importance. So, the first thing you will see on your screen in a moment is what Americans care about most.</p>                \n                \r\n\n            \n                <p>Number one, the economy. Who do you trust to do a better job? Trump wins big here 53 percent to 41 percent over Mrs. Clinton because I think of his business success. Second most important issue terrorism. Here Americans once again favored Trump 52 percent, Secretary Clinton only clocks in at 40 percent on terrorism. Third issue healthcare here Hillary Clinton does better 48 percent of Americans trust her more on the issue. Forty five percent for Trump.</p>                \n                \r\n\n            \n                <p>Number four, education, 51 percent for Hillary, 41 percent Trump. Education spending traditionally a big Democratic issue. Next up immigration. The big surprise here. Secretary Clinton comes out on top 47 percent to 45 percent over Mr. Trump. The anti-illegal immigration guy. Finally, social issues like abortion, secularism and that kind of thing, 50 percent of Americans trust Hillary Clinton, just 38 percent Donald Trump. Now, you would have to consider this poll good news for Mr. Trump because the economy will be the driving issue next November and he wins on that.</p>                \n                \r\n\n            \n                <p>Also terrorism which is number two. Talking Points was surprised that Mr. Trump did not prevail on immigration. That shows many Americans do not want illegal aliens deported. I do believe most Americans would like an effective wall on the Southern border, but we'll have to do an independent poll on that. Big headline this week in America's politics is that Donald Trump is very competitive with Hillary Clinton. Remember that much of the national press thought that impossible just a few weeks ago. Of course, that same press is rooting against Trump so there is that.</p>                \n                \r\n\n            \n                <p>Summing up, the more Donald Trump defines important issues the better of he will be, the more Hillary Clinton gets out of her campaign mode and in to one-on-one communications like doing interviews with me and others who don't openly support her, the more currency she could gain. We'll have more on that in the tip of the day. Finally, one footnote, FOX News also asked Americans about how they feel after almost eight years of the Obama administration. Just 26 percent, 26 percent feel they are better off now than they were when Barack Obama was elected in 2008. It says a lot. That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Hillary Clinton or Donald Trump?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 5/19", "date": "2016-05-20T12:15:52Z"}