{"vcmId": "30cc23be-40c4-4921-b5b0-07c4cc4ecd00", "url": "http://www.foxnews.com/transcript/2015/01/29/bill-oreilly-is-terrorism-overwhelming-obama-administration.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Former defense intelligence agency chief Lt. General Michael Flynn slammed the White House for not having a strategy to fight the jihad; also for refusing to use the term Islamic militants. General Flynn saying, quote: \"You cannot defeat an enemy you do not admit exists\", unquote.</p>                \n                \r\n\n            \n                <p>Flynn who worked for President Obama now joins a host of other former Obama officials in telling the world the administration has no plan to defeat Islamic terrorism. And that's true. \"Talking Points\" has been chronicling that for months.</p>                \n                \r\n\n            \n                <p>Here's the latest. Ten Democratic senators now telling President Obama that if there is no progress in the Iranian nuke negotiations by March, they will join with Republicans in embarrassing him in passing sanctions against Iran. Now, that country is a centerpiece of the terror war right now. If Iran gets a nuke, the jihad gains incredible power.</p>                \n                \r\n\n            \n                <p>Remember the Iranian mullahs want to spread the Shia brand of Islam and also want to destroy Israel and the United States. The mullahs as well as other Islamic fanatics believe Barack Obama is a weak leader -- no question.</p>                \n                \r\n\n            \n                <p>And then there is the Bowe Bergdahl situation again tied into the jihad. As you know, Sergeant Bergdahl was traded for five top Taliban terrorists back in May of last year. These men will most likely return to the battlefield to fight against America. Meantime, Bergdahl apparently left the battlefield deserting his unit in Afghanistan. Right now Sergeant Bergdahl is at the Fort Sam Houston barracks in Texas awaiting his fate.</p>                \n                \r\n\n            \n                <p>The army interviewed the sergeant way back in August. And by all counts investigation has been completed for months. Yet, there is no definition.</p>                \n                \r\n\n            \n                <p>The Factor broke a story earlier this week that says the White House is pressuring the Pentagon to go easy on Bergdahl. That's why Gen. Mark Milley has not reported back to we the people.</p>                \n                \r\n\n            \n                <p>Lt. Col. Tony Shaffer says the army has come to the conclusion that Bergdahl did indeed dessert. The army denies that but Shaffer's standing by his story which has also been reported by NBC News.</p>                \n                \r\n\n            \n                <p>But here is the nuance. There are different kinds of desertion and that is giving the army some wiggle room. The White House desperately doesn't want a trial where members of Bergdahl's unit would testify under oath that he put their lives in danger. We've already seen and heard that on TV. So President Obama would prefer that Bergdahl be charged with going AWOL Absent without Leave. Then he could be quietly punished with no big exposition.</p>                \n                \r\n\n            \n                <p>But the facts show that Bergdahl did desert his unit. Was captured by the Taliban in Afghanistan because of the desertion, and held by them for five years. So the sane way to do this is to charge Bergdahl with desertion and then on humanitarian grounds the President would pardon him. But the sergeant would lose back pay and be dishonorably discharged. That's what should happen.</p>                \n                \r\n\n            \n                <p>And there is more. The military is not supposed to be influenced by politics. The Pentagon is supposed apolitical but Colonel Shaffer reports politics is influencing the Bergdahl situation big time. If that's true, we the people need to know about it.</p>                \n                \r\n\n            \n                <p>Bottom line, \"Talking Points\" believes the army knows exactly what Bergdahl did and is stonewalling the process. As always I could be wrong.</p>                \n                \r\n\n            \n                <p>That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Is terrorism overwhelming the Obama administration?", "description": "Talking Points 1/28", "date": "2015-01-29T13:21:23Z"}