{"vcmId": "3257a9ad-cd9c-4c31-a33d-e5a78fc360ef", "url": "http://www.foxnews.com/transcript/2014/10/01/us-capitulating-iran.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><em>This is a RUSH transcript from \"The O'Reilly Factor,\" September 30, 2014. This copy may not be in its final form and may be updated.</em></p>                \n                \r\n\n            \n                <p><em>Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</em></p>                \n                \r\n\n            \n                <p>In \"Back of the Book\" segment tonight, a dire warning for the world.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>BENJAMIN NETANYAHU, PRIME MINISTER, ISRAEL: Once Iran produces atomic bombs, all the charms and all the smiles would suddenly disappear, will just vanish.</p>                \n                \r\n\n            \n                <p>And it's then the ayatollahs will show their true face and unleash their aggressive fanaticism on the entire world.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: And joining us now from Washington, Fox News Political Analyst Charles Krauthammer, who, last week, said on this program, the Obama administration is surrendering to Iran on the nuke weapons front.</p>                \n                \r\n\n            \n                <p>So, Benjamin Netanyahu obviously agrees with you -- that sound bite was at the U.N. I don't think anybody is listening though. What do we do.</p>                \n                \r\n\n            \n                <p>CHARLES KRAUTHAMMER, FOX NEWS CONTRIBUTOR: I think you're right about no one listening. This is the biggest story. History will remember this year for nothing else than the surrender on Iran.</p>                \n                \r\n\n            \n                <p>That will be the major event of 2014. It's not being talked about, in part, because we're trying to get ISIS to tacitly -- we're trying to get Iran to tacitly help us with the war on ISIS.</p>                \n                \r\n\n            \n                <p>And most importantly, because President Obama gave up on these negotiations long ago.</p>                \n                \r\n\n            \n                <p>O'REILLY: How do you know that. How do you know that he personally gave up. Because he knows how important it is.</p>                \n                \r\n\n            \n                <p>He knows his administration is tottering in the court of public opinion on foreign affairs. How do you know he gave it up.</p>                \n                \r\n\n            \n                <p>KRAUTHAMMER: You judge a man by his actions. His actions are being consistent. He weakened the sanctions even before this round of negotiations.</p>                \n                \r\n\n            \n                <p>So, he weakens his hand when sanctions were the only thing they brought around to the table in the first place. So, we already had tons of European companies lining up in Tehran, waiting for the full collapse of sanctions, which they know is coming.</p>                \n                \r\n\n            \n                <p>Second, you look at what we've been negotiating with Iran. Our position for 10, 15 years has been you cannot allow Iran to enrich. Because once you do, you cannot stop it from going --</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>-- nuclear. What did we do. We conceded in advance the principle of enrichment. They are allowed to enrich.</p>                \n                \r\n\n            \n                <p>Question is, how many centrifuges will we allow them to keep. So, we were going to keep it down to a minimum number of a thousand, 2,000. Iran, right now, has 19,000. You know what it's demanding, 190,000.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>And we are looking for all kinds of fixes and fig leaves which will allow it to enrich and then pretend -- this is if we have an agreement -- and then pretend that we have capped their program.</p>                \n                \r\n\n            \n                <p>We are negotiating to do nothing of the sort. Even if the negotiation is successful, it will leave Iran a few months away from Obama.</p>                \n                \r\n\n            \n                <p>We know it. Obama knows it. Iran knows it. The world knows it. They will sell it to a supine press as a kind of historic agreement.</p>                \n                \r\n\n            \n                <p>But what it means is Iran will be a few months away. And whenever it decides it's ready, whenever the ICBMs are ready, whenever the mechanization to put it on a tip of a missile was ready, they turn a key, in three months, four months, they're a nuclear power.</p>                \n                \r\n\n            \n                <p>And Obama tells us that our intelligence will tell us exactly when they turn that key. He now admitted he didn't even know ISIS was a threat after it took Ramadi and Fallujah.</p>                \n                \r\n\n            \n                <p>And he's telling us that our Intelligence is so bad on ISIS, and yet will be intensely and perfectly tuned to pick up developments inside Iran, of which we had no idea.</p>                \n                \r\n\n            \n                <p>O'REILLY: Now, if you're correct in all this -- because it is a little bit of a conjecture, then Israel is going to do something because they're not going to sit back and allow Iran to get these weapons.</p>                \n                \r\n\n            \n                <p>I mean, Netanyahu has made that perfectly clear, that he's willing to go to war to stop Iran from doing it.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>So, do you foresee that happening.</p>                \n                \r\n\n            \n                <p>KRAUTHAMMER: I foresee that happening if two things occur. Number one, if it is clear --</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>-- that the negotiations are done and that there's nothing the west is going to do. Obama doesn't -- I mean, Netanyahu doesn't want to do it now. He'll be accused of intruding on negotiations.</p>                \n                \r\n\n            \n                <p>He has to warm under. They were about to reach some historic agreement and he got in the way.</p>                \n                \r\n\n            \n                <p>So, his hands are tied right now. So, let's assume the negotiations do not succeed. And then, the second thing it hinges on is this -- do the Israelis have the capacity to damage the Iranian program enough to send it back maybe two to three years.</p>                \n                \r\n\n            \n                <p>The only thing that would prevent Netanyahu from attacking is the man who knows the weight of history is on his shoulders. And he's aware that Jewish history relies --</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>-- on his making the right decision. The only thing that will restrain him is if they think they do not have the capacity. I think --</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>-- Israel can do it. I think the assumption is he can do it. But if it doesn't attack, it will be for one reason only. They thought they couldn't do it.</p>                \n                \r\n\n            \n                <p>O'REILLY: Very dire. And we appreciate it, Charles. Now, I'm going to give Charles, his book, a plug.</p>                \n                \r\n\n            \n                <p>But, first, Charles, I want you to donate some money to the IndependenceFund.org for the wheelchairs, the TrackChairs, in return for this plug, OK.</p>                \n                \r\n\n            \n                <p>KRAUTHAMMER: I would do it nonetheless.</p>                \n                \r\n\n            \n                <p>O'REILLY: I know you would because you're a good man. The book is --</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>-- \"Things that Matter,\" absolutely a great phenomenon. It's back on the New York Times Bestseller List. It's an amazing situation. That's worth a couple of bucks to Independence Fund, right, Charles.</p>                \n                \r\n\n            \n                <p>KRAUTHAMMER: Absolutely.</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p>O'REILLY: FACTOR \"Tip of the Day,\" --</p>                \n                \r\n\n            \n                <p>KRAUTHAMMER: I'll come up with more than a couple.</p>                \n                \r\n\n            \n                <p>O'REILLY: Thank you. And the vets thank you, too.</p>                \n                \r\n\n            \n                <p><em>Content and Programming Copyright 2012 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2012 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</em></p>                \n                \r\n\n            \n\n            \n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Is the US capitulating to Iran?", "description": "This is a RUSH transcript from \"The O'Reilly Factor,\" September 30, 2014.", "date": "2014-09-30T04:00:00Z"}