{"vcmId": "33429bef-0210-47f2-94e1-b5ff8bf6c7cf", "url": "http://www.foxnews.com/transcript/2015/07/08/president-obama-latest-isis-strategy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" July 7, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Unresolved Problem Segment\" tonight. As we reported last night, President Obama went to the Pentagon yesterday across the river into Virginia to talk about defeating ISIS or something.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES: </b>Our strategy recognizes that no amount of military force will end the terror that is ISIL unless it's matched by a broader effort -- political and economic that addresses the underlying conditions that have allowed ISIL to gain traction.</p>                \n                \r\n\n            \n                <p>They have filled a void and we have to make sure that as we push them out that void is filled.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> This stuff drives me insane. Here's a bulletin for Mr. Obama. America is never going to solve economic and political problems in any Muslim country. We have a hard enough time doing it here.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington, Lt. Colonel Ralph Peters, author of the book \"Valley of the Shadow\". So why do you think the President is even bringing this up? I mean he has pretty much run away from it. Now he crosses the Potomac and then he holds a press briefing. Why is he doing it?</p>                \n                \r\n\n            \n                <p><b>LT. COL. RALPH PETERS, FOX NEWS STRATEGIC ANALYST:</b> Because he can't run far enough. I mean he went to the Pentagon for two reasons. One, he knows this is serious now; and two, that was a way of showing that he is serious as opposed to doing anything serious. Now, he is right about one thing. There are underlying problems, which, as you pointed out, we can't fix, the underlying problems are the collapse of the civilization. We can't do anything about that what we can do is go after our enemies.</p>                \n                \r\n\n            \n                <p>President Obama -- Bill, he is getting the high level briefings, above top secret, every day. He knows how serious Islamic state is. He knows how deep the caliphate's roots are going. He knows how many sympathizers there are. He knows how many foreign fighters are flocking to their standards.</p>                \n                \r\n\n            \n                <p>But he has a problem. It's cognitive dissonance. He knows there is a problem but he can't bring himself to accept that there is only a military solution. We have 2,000 years of evidence of religious insurgencies in virtually every major religion. None has been put down with empathy, aid and negotiations. You can't negotiate with cobras.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. I agree with you when you say he understands that the problem is now very intense and he is underplaying it to the American public. He's not leveling with us. But I don't believe that he thinks or believes that military action is worth it at this point. He believes he can contain it until he is out of there in 18 months. And then some other president will have to deal with it. I think that's his end game here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, I agree with that. He wants to drop it on the next president's lap. But it's getting so bad that he is being driven to take more actions.</p>                \n                \r\n\n            \n                <p>And Bill, you know, who was visiting the White House this week? The secretary general of the Vietnamese Communist Party. 40 years ago Saigon fell. I believe and I have no evidence for this whatsoever, I believe that the smarter generals in the Pentagon are looking at Syria and Iraq and they are seeing Saigon in Damascus. And fearing that Islamic state will take Damascus which will utterly change the game.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's not going to happen.</p>                \n                \r\n\n            \n                <p><b>PETERS:</b> But who thought they were going to take Mosul? Who thought they were going to take --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, but Putin had stopped the Damascus thing.</p>                \n                \r\n\n            \n                <p><b>PETERS:</b> Good luck.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Putin is not going to let that happen.</p>                \n                \r\n\n            \n                <p><b>PETERS:</b> Ok. But you have got to be concerned about the worst case. The military you can't be a Pollyanna like Obama. You have got to prepare for the worst thing that could conceivably happen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But the American people are willing to vote for Pollyanna these days, Colonel. That's why all of this is happening.</p>                \n                \r\n\n            \n                <p><b>PETERS: </b>True. That's true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They are willing to take Pollyanna. Polly's fine with a majority of the folks.</p>                \n                \r\n\n            \n                <p>All right. Colonel, as always, we appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "President Obama's latest ISIS strategy", "description": "Lieutenant Colonel Ralph Peters on defeating ISIS", "date": "2015-07-08T12:24:27Z"}