{"vcmId": "3364dc6e-df45-44e2-9abf-ba9d4542d2c3", "url": "http://www.foxnews.com/transcript/2014/10/08/leon-panetta-enters-no-spin-zone-part-2.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><em>This is a RUSH transcript from \"The O'Reilly Factor,\" October 7, 2014. This copy may not be in its final form and may be updated.</em></p>                \n                \r\n\n            \n                <p><em>Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</em></p>                \n                \r\n\n            \n                <p>O'REILLY: Continuing now with Leon Panetta, former Secretary of Defense and CIA chief. His new book \"Worthy Fights\" hits the marketplace today. It's going to be a big best seller.</p>                \n                \r\n\n            \n                <p>On September 11, 2012 terrorists in Libya murdered Ambassador Christopher Stevens and three other Americans in Benghazi. The attack remains controversial today because of misstatements by the Obama administration and unanswered questions. On the night of the attack, a group of American CIA security contractors were one mile away from Ambassador Stevens who was under fire. The men say they were ready to help but were ordered by a CIA officer to wait.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>UNIDENTIFIED MALE: We actually jumped up and got ready to go. And as we tell in the book, that we were ready to go within five minutes.</p>                \n                \r\n\n            \n                <p>O'REILLY: Within five minutes.</p>                \n                \r\n\n            \n                <p>UNIDENTIFIED MALE: Within five minutes we were jacked up and ready to go.</p>                \n                \r\n\n            \n                <p>O'REILLY: And then how, Mark, how long did they keep you from not going?</p>                \n                \r\n\n            \n                <p>UNIDENTIFIED MALE: Almost 30 minutes.</p>                \n                \r\n\n            \n                <p>O'REILLY: Ok. So you were ready in five and you wasted 25 minutes.</p>                \n                \r\n\n            \n                <p>UNIDENTIFIED MALE: Easy.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: So Mr. Panetta, do you believe those men?</p>                \n                \r\n\n            \n                <p>PANETTA: I have no reason not to believe them.</p>                \n                \r\n\n            \n                <p>O'REILLY: they wouldn't tell me the name of the CIA officer who wouldn't order them to help the ambassador and the other Americans under fire. They said they will tell Congress when Congress resumes hearings on Benghazi. Isn't that very disturbing?</p>                \n                \r\n\n            \n                <p>PANETTA: I think -- if, in fact, there was a 30-minute delay, I think that it is important for the congressional committee to look into that --</p>                \n                \r\n\n            \n                <p>O'REILLY: To find out why, correct?</p>                \n                \r\n\n            \n                <p>PANETTA: and to determine what happened.</p>                \n                \r\n\n            \n                <p>O'REILLY: The other thing I want to know about is Susan Rice going out telling the world, seven days after the attack, that it was motivated by a spontaneous demonstration off an anti-Muslim story. We all know the story. We don't have to listen to the sound byte, again, we all know it. All right.</p>                \n                \r\n\n            \n                <p>You, on the night of the attack say, you told President Obama you believed it was not a spontaneous attack, it was a terror attack. Is that correct?</p>                \n                \r\n\n            \n                <p>LEON PANETTA: General Dempsey and I were over talking to the President when we got word about what was happening, and what I told the President, was that there was an attack that was going on in Benghazi. And that we were concerned that the consulate there was in trouble. And it was based on that that the President then said let's try to do everything we can to see what happened.</p>                \n                \r\n\n            \n                <p>O'REILLY: Did you use the word terror attack?</p>                \n                \r\n\n            \n                <p>LEON PANETTA: I used the word attack, that there was an attack by terrorists.</p>                \n                \r\n\n            \n                <p>O'REILLY: You said attack by terrorists.</p>                \n                \r\n\n            \n                <p>LEON PANETTA: By terrorists.</p>                \n                \r\n\n            \n                <p>O'REILLY: By terrorists -- all right. Attack by terrorists. Now I want you to listen to this sound byte. Roll it.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: Did he tell you, Secretary Panetta, it was a terrorist attack?</p>                \n                \r\n\n            \n                <p>BARACK OBAMA, PRESIDENT OF THE UNITED STATES: You know what he told me was there was an attack on our compound.</p>                \n                \r\n\n            \n                <p>O'REILLY: He didn't use the word \"terror\"?</p>                \n                \r\n\n            \n                <p>OBAMA: You know, in the heat of the moment, Bill, what folks are focused on is what's happening on the ground, do we have eyes on it? How can we make sure our folks are safe?</p>                \n                \r\n\n            \n                <p>O'REILLY: I just want to get this on the record, did he tell you it was a terror attack?</p>                \n                \r\n\n            \n                <p>OBAMA: No, and I'm answering your question. What he said to me was, we have an attack on our compound. We don't know yet who's doing it.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: Disingenuous?</p>                \n                \r\n\n            \n                <p>LEON PANETTA: You know, look --</p>                \n                \r\n\n            \n                <p>O'REILLY: Come on -- disingenuous?</p>                \n                \r\n\n            \n                <p>LEON PANETTA: We told the President there is an attack that's going on, that terrorists are involved in the attack.</p>                \n                \r\n\n            \n                <p>O'REILLY: Ok, let me stop you there. The audience can make --</p>                \n                \r\n\n            \n                <p>LEON PANETTA: And that as a result, you have to respond to it.</p>                \n                \r\n\n            \n                <p>O'REILLY: Fine. The audience can make their own determination if it was disingenuous.</p>                \n                \r\n\n            \n                <p>LEON PANETTA: Of course.</p>                \n                \r\n\n            \n                <p>O'REILLY: However, seven days after that the U.N. ambassador Susan Rice goes out after you and Dempsey told them it was an attack by terrorists and says, no, no, it was spontaneous. When you heard Ambassador Rice say that, what went through Leon Panetta's mind?</p>                \n                \r\n\n            \n                <p>LEON PANETTA: the only thing I can think of is that she was working from the talking points that the CIA had provided and those talking points basically said that this was a demonstration that got out of hand.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right. So that was Petraeus who did that.</p>                \n                \r\n\n            \n                <p>LEON PANETTA: It was the CIA that provided the talking points.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right. And Petraeus was in charge. So you and Dempsey were ignored and Petraeus was accepted. Is that fair?</p>                \n                \r\n\n            \n                <p>LEON PANETTA: In those situations the CIA is the one that has to come forward with the analysis as to what exactly took place in that situation. And they were still in the process frankly of gathering the information. I thought those talking point frankly were not on point.</p>                \n                \r\n\n            \n                <p>O'REILLY: No. They obviously -- subsequently they were wrong.</p>                \n                \r\n\n            \n                <p>LEON PANETTA: my view was with the kind of weapons that showed up, there was no question in my mind that it was a terrorist attack.</p>                \n                \r\n\n            \n                <p>O'REILLY: again, you're way smarter than me, but that's what I said here on this set. Guys don't show up in a spontaneous demonstration with mortars -- all right. And they were casing the place and had video of them casing the place. Not exactly a great moment in the Obama administration - - correct?</p>                \n                \r\n\n            \n                <p>LEON PANETTA: no, I think the conclusion in the talking points really should have -- what they should have made clear is that we simply do not have the information we need in order to determine what happened.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right.</p>                \n                \r\n\n            \n                <p>LEON PANETTA: That's what they should have said.</p>                \n                \r\n\n            \n                <p>O'REILLY: Another quick break, I have another surprise question for Leon Panetta. He's loving this interview, everyone. Just look at him, he's loving this.</p>                \n                \r\n\n            \n                <p>We'll be right back.</p>                \n                \r\n\n            \n                <p><em>Content and Programming Copyright 2012 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2012 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</em></p>                \n                \r\n\n            \n\n            \n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Leon Panetta enters the 'No Spin Zone', Part 2", "description": "This is a RUSH transcript from \"The O'Reilly Factor,\" October 7, 2014.", "date": "2014-10-07T04:00:00Z"}