{"vcmId": "353a1bcf-4bce-4472-b031-75deea153dd4", "url": "http://www.foxnews.com/transcript/2015/07/13/bill-oreilly-funeral-kate-steinle.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Today, the Steinle family buried their 32-year-old daughter in San Francisco. The media was barred from the ceremony as it should have been. The situation is heart-breaking.</p>                \n                \r\n\n            \n                <p>Imagine if Kate were your daughter and her life was taken by a despicable criminal who had been deported to Mexico five times. Just imagine that.</p>                \n                \r\n\n            \n                <p>I have the same feeling I had when I heard that nine innocent people were gunned down by a racist in Charleston. These things should never happen in the United States of America. In the Charleston situation Americans came together condemning the blatant hatred.</p>                \n                \r\n\n            \n                <p>But in Kate's situation Americans have not come together, at least so far. That's because of politics. There is no question the uber-liberal sanctuary city policy of San Francisco directly led to the murder of Kate Steinle. If the city leaders had any shame, which they don't, they would have resigned already.</p>                \n                \r\n\n            \n                <p>It struck me yesterday when Jesse Watters confronted the 11 San Francisco supervisors how emotionless they are. And, of course, none of them have the courage to address the situation. Mayor Ed Lee blaming the hapless sheriff who is so incompetent it's painful. Imagine a law enforcement officer allowing a seven-time felon out on the street when the feds directly asked him to keep the man in custody? The sheriff is a disgrace. But even more disgraceful is the non-action out of Washington.</p>                \n                \r\n\n            \n                <p>The alleged killer 45-year-old Juan Francisco Sanchez is a drug pusher and addict,. a low level thug who managed to enter America illegally six times. That means anyone in the world can sneak into this country. That low life illegally crossed our border from Mexico six times? We don't have border enforcement. Does everybody understand that?</p>                \n                \r\n\n            \n                <p>Now, I'm very proud of the more than 200,000 folks who have signed the petition on BillOReilly.com calling for Kate's Law, which would incarcerate any deported felon who returns to America again. There would be mandatory five-year sentences for felons and lesser sentences for those committing misdemeanors who are deported and come back.</p>                \n                \r\n\n            \n                <p>It's shocking. Some Americans will not support Kate's Law. But you know the story. Ideology more important to some people than public safety. However I do believe Congress will pass the law and we will track it every step of the way.</p>                \n                \r\n\n            \n                <p>Finally a message to Kate Steinle's family on the day of her funeral. America let you down. Kate was a vibrant, loving person, a generous American of whom we are all proud. The fact that she is no longer with us tonight is a travesty.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The funeral of Kate Steinle", "description": "Bill O'Reilly's Talking Points 7/9", "date": "2015-07-13T12:26:33Z"}