{"vcmId": "361ef63e-5fcf-4411-a0fc-d7fcb33a1cb0", "url": "http://www.foxnews.com/transcript/2015/02/25/isis-on-march.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 24, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Continuing now with our lead story (AUDIO GAP), ISIS on the march, Putin invading the Ukraine.</p>                \n                \r\n\n            \n                <p>With us now in New York City Monica Crowley; and from Washington Kirsten Powers.</p>                \n                \r\n\n            \n                <p>Let's take ISIS first here. We talked about this before with you. It seems almost every day there are new atrocities. Now we've got the kids, you know, eight-year-old girls being raped, sold, slavery -- you name it. Ok. Even the NBC correspondent says it's evil, everybody knows it's evil.</p>                \n                \r\n\n            \n                <p>President Obama after a year still befuddled on his watch. It grew from the JV into now something that's in ten countries. Still doesn't have really an overall strategy to stop these people as they picked off 90 Christians last night.</p>                \n                \r\n\n            \n                <p>So what do you think he should do? What do you think the President should do?</p>                \n                \r\n\n            \n                <p><b>KIRSTEN POWERS, FOX NEWS ANALYST: </b>I keep saying this to you. I don't think that there is an easy answer to this. And if I was --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But what do you think should do? Do you have any answer at all?</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> I don't -- we don't know -- I think that he should get people together which I assume he is doing, and try to come up with some sort of plan to combat this and try to --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. After all this time?</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> -- I mean this should already be going on but --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But it's not.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> But the idea, Bill, that just sending troops in, which I think --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, I don't think anybody is saying just send troops in. I think everybody is wondering why after more than a year of horror and atrocities still -- no summit meetings, no NATO, nothing.</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>You want -- but you do want troops sent in, right?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I do under the banner of an international coalition that includes Arab troops and includes NATO troops, certainly. Because that's the way you kill them. You confront them.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> What I think, what I fear is that you are oversimplifying this, that you think that the same way we were going to go in and be liberators in Iraq.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, there's no occupying force in here at all.</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>But these people are not -- that we need to have a very, very clear plan if we're going to do this of how we're going to be successful.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But Kirsten, here's the deal. You don't have a plan and now I want to go to Monica.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Yes. I'm not the head of national security for this country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, but you're an analyst that are discussing these things.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> The idea that I won't just scream war the way the two of you do does not mean --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You don't have to scream war. If you don't have a plan, you don't have a plan. That's all.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> That's not -- you don't -- you can't -- your idea is so oversimplified here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Look, you don't have any plan. I have a plan of a coalition of world nations coming together and confronting them.</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>You think because you want to send troops in that that's like a plan -- done, and it's solved. What I'm saying is that we need to have people who are military strategists tell us exactly what that would mean. And if somebody can tell us exactly how that would work --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. Well, you would assume that if you're planning a military operation --</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> I would be interesting in hearing that but your idea that you are just going to like get a bunch of people together and invade a country and that's going to solve a problem.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. What do you say?&#160;</p>                \n                \r\n\n            \n                <p><b>MONICA CROWLEY, FOX NEWS ANALYST:</b> Actually you do have members of the military and military analysts putting out plans to the commander-in-chief and he refuses to do it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Where are those plans though? Where are those plans?</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> All over Fox News. You have got military analysts talking about how to smash ISIS.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But they're not official Pentagon people.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> But you're also hearing that --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Wait, Kirsten. Come on.</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>Former secretaries of defense, the new secretary of defense that they are laying out the options and they have been for a long time and the commander-in-chief refuses to do it. If you really want to smash ISIS, if that's your objective you do it in three ways. You do it militarily. You do it economically and you do it ideologically.</p>                \n                \r\n\n            \n                <p>Militarily you increase the special ops forces, yes, you will need ground troops but you increase special ops now. You also increase the use of air power for close air support, lift capabilities and intelligence. And finally you do Sunni tribal engagement -- that means arming and training the Sunni tribes on the ground willing to fight. That also includes the Kurds.</p>                \n                \r\n\n            \n                <p>You take them on economically. Bomb the oil fields that they control, Bill, you make them run out of gas.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>There are much smarter military people than the three of us, all right? But there isn't any organized meeting or summit, there is no urgency and every single day now we are seeing the terrible abuse of human beings, children and everything, and these guys are not afraid of us. Let's go to Putin.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> You don't need that if you have American leadership.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- which we don't.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> What you're seeing now with Putin and with ISIS is the logical result for the collapse of U.S. leadership.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We don't have leadership against ISIS right now. We are hoping that President Obama will step up.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>POWERS: </b>Right. And we had such a great plan before -- right. We had such a great plan to go into Iraq.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Look if you want to live in the past and say that we should be paralyzed because this happened in the past. Go ahead.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> It's important to remember how wrong people were. It is important to remember that when you guys are both just asking -- like you got it all figured out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know what -- I'm sure the people that are going to be beheaded who were captured yesterday they're going you know what, I wish the U.S.A didn't do Iraq.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> I don't need you lecturing me about caring about human rights. I have been writing about this stuff, Bill, long before we have ever been talking about it. So don't try to dismiss my concern.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. Kirsten, your whole ballgame is -- your whole ballgame is to blame the Bush administration for Iraq and Afghanistan and that's why we're paralyzed.</p>                \n                \r\n\n            \n                <p>All right. Let me ask you this. What would you do to Putin? What would you do to Putin?</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> I would blow him up like you and John McCain want to do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You don't have anything for Putin either. You have anything for Putin.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> You're solution is always to go to war.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Kirsten, let Monica take the lead on Putin. Go.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Look, in 1994, Ukraine agreed to give up its nuclear weapons in exchange from security guarantee from the United States. This president has abandoned that security guarantee.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What does that mean though, security guarantee?</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>It means the nuclear umbrella to protect Ukraine from invaders in Russia.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What does that mean though? What is Obama supposed to do there?</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>Well, since he has abandoned that, what he should have been doing that we're years behind on this is arming the folks on the ground a la the Kurds in the Middle East.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They're not going to beat the Russians. You can arm them all day long, they're not going to beat them.</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>The best that this administration is sending is meals ready to eat. You give them the weapons that they need on the ground so you don't have to send in U.S. ground troops.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. I'm not opposed to do that. But if anybody thinks the Ukraines can beat the Russians, they can't.</p>                \n                \r\n\n            \n                <p>Last word on Putin, Kirsten?</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> We should -- we have already done sanctions, we should do more sanctions. I don't think that all your military solutions are, you know, the answer to these problems.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Putin is probing. He probes in Crimea. He probed in Georgia.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. He's seeing what he can get away with and what he can get away with is fine.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> I think his succeeding here he's going for the Baltics next.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> New poll just out today -- Pew poll. Do you favor or oppose U.S. sending ground troops to fight ISIS? Favor 47; oppose 49 -- which is pretty much a dead heat in the margin of error. So that is a big, big change from October where only 39 favor.</p>                \n                \r\n\n            \n                <p>So, you know, people are starting to see. This is going to go on forever unless we confront them.</p>                \n                \r\n\n            \n                <p>Ladies, very good debate -- spirited as always.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "ISIS on the march", "description": "Monica Crowley and Kirsten Powers on the President's handling of global threats", "date": "2015-02-25T13:17:52Z"}