{"vcmId": "383b7dda-bbe8-4f8f-8565-2af18daad437", "url": "http://www.foxnews.com/transcript/2015/10/23/democratic-party-embracing-black-lives-matter.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 22, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Factor \"Follow Up Segment\" tonight, the radical group Black Lives Matter not all that different than the Black Panther Movement. They both believe America is a racist country where police actively target blacks for oppression. Black Lives Matter now causing trouble all over the country.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE</b>: If you are not black, please move out of the -- space.</p>                \n                \r\n\n            \n                <p><b>(Protesters)</b>: Pigs in a blanket. Fry them like bacon!</p>                \n                \r\n\n            \n                <p>Pigs in a blanket. Fry them like bacon!</p>                \n                \r\n\n            \n                <p>Pigs in a blanket. Fry them like bacon!</p>                \n                \r\n\n            \n                <p>What do we want?</p>                \n                \r\n\n            \n                <p>Dead cops!</p>                \n                \r\n\n            \n                <p>When do we want?</p>                \n                \r\n\n            \n                <p>Now!</p>                \n                \r\n\n            \n                <p>What do we want?</p>                \n                \r\n\n            \n                <p>Dead cops!</p>                \n                \r\n\n            \n                <p>When do we want?</p>                \n                \r\n\n            \n                <p>Now!</p>                \n                \r\n\n            \n                <p>What do we want?</p>                \n                \r\n\n            \n                <p>Dead cops!</p>                \n                \r\n\n            \n                <p>When do we want?</p>                \n                \r\n\n            \n                <p>Now!</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You would think if you have an organized group in America saying we want dead cops that all decent people would reject that group. You would think, correct? But the Democratic Party is actively embracing Black Lives Matter. This is part of a letter written by the DNC, quote, \"We believe that your organization would be an ideal host for presidential candidate forum. Where all of the democratic candidates can showcase their ideas and policy positions that will expand opportunity for all, strengthen the middle class and address racism in America.\" Unquote.</p>                \n                \r\n\n            \n                <p>Now, that disturbing letter written by Amy Dacey, chief executive officer of the DNC.</p>                \n                \r\n\n            \n                <p>Joining us from Washington, David Goodfriend, teaches law at Georgetown University. Served in the Clinton administration. And Keith Boykin from Miami who has also served as a special assistant to President Bill Clinton. Mr. Boynton, let me begin with you. What do you think about that letter?</p>                \n                \r\n\n            \n                <p><b>KEITH BOYKIN, FORMER WHITE HOUSE SPECIAL ASSISTANT TO PRESIDENT CLINTON: </b>I think it's a good move on the part of the DNC to work with the Black Lives Matter movement. The official movement. Not everybody out in the street. And I do think quite frankly that they are a natural coalition. The Democratic Party needs to have the support of the African- American community. And the African-American community is concerned about the 923 police shootings this year. They're concerned about the 2.2 million people who are incarcerated in our country, highest of any country in the planet. They're concerned about the issues of African-Americans not being addressed by the larger political climate. So, I think it's important to have that conversation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. So you believe that the Democratic Party is correct in embracing a radical group, a group that calls for police officers to be killed. Do I have your opinion correct?</p>                \n                \r\n\n            \n                <p><b>BOYKIN:</b> No, I did not.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, I mean the group.</p>                \n                \r\n\n            \n                <p><b>BOYKIN:</b> You mischaracterized my opinion.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How?</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>Mr. Boykin.</p>                \n                \r\n\n            \n                <p><b>BOYKIN</b>: No. I was there -- I was there -- I was there in December in 2014, marching with those protesters.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>BOYKIN: </b>I was covering it at that time for BET from whom I work. Did I not hear anyone talking about killing dead cops?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You just heard it, we just played it for you.</p>                \n                \r\n\n            \n                <p><b>BOYKIN</b>: You were able to find one clip of some people who were saying outrageous. That was not a reflection of the entire movement. Has anybody in the leadership ever said that?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Mr. Boykin. Did anybody --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BOYKIN</b>: Has anyone in the leadership ever said that?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Boykin you are either going to stop talking or I'm going to cut your mic off. Did anybody in the Black Lives Matter movement repudiate, we want dead cops? Thank you. Mr. Goodfriend, your time is done, Mr. Boykin.</p>                \n                \r\n\n            \n                <p><b>BOYKIN: </b>Yes, yes, yes --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Cut him down. Okay. Mr. Goodfriend.</p>                \n                \r\n\n            \n                <p><b>DAVID GOODFRIEND, FORMER DEPUTY STAFF SECRETARY TO PRESIDENT CLINTON</b>: Sir.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You just heard that point with Mr. Boykin.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND:</b> That's right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: My point is, this is a radical group that calls for violence against police officers. We have proven that. There was no repudiation of what Mr. Boykin and I just heard, okay? We have proven that. Should the Democratic Party ally themselves with that group?</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: Well, Bill, I looked very carefully at the letters you referred to. There were two put out on October 21st to two different groups, campaign zero.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Just deal with the Amy Dacey letter. She is the CEO of the DNC.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: Okay. Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Deal with that, please.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND: </b>Okay. So, in that letter there was actually support, they said what we will do is promote an event that you organize. But the request was actually for the DNC to have a bigger.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. Listen. All of this doesn't matter, Mr. Goodfriend with all due respect.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: Okay.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I'm in your class now. My hand is going up. Professor.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: Yes, sir.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is it right or wrong for the DNC to ally itself with this group that has called for police officers to be killed? Is that right or wrong?</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: I think the DNC isn't allying itself with this group.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They just said they want to have an event with them where their candidates can come.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: Yes. And they also said, Bill, that we repudiate any calls for violence. That's been \"on the record\" from the DNC.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They have not repudiated any calls for violence.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND:</b> Any calls for violence. They have.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Give me the name of the person who has done that. Do you have it?</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND:</b> Okay. I do. In a statement issued yesterday by the DNC, they said the DNC repudiates all calls for violence.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The DNC. I'm talking about -- look, would you be comfortable with the Republican Party bringing in the storm front, the Nazi people and saying we would like our candidates to talk to you guys. Would you be comfortable with that Mr. Goodfriend?</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND:</b> No, I wouldn't.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They are extreme group the Nazi party. The Black Lives Matter is also an extreme group as you have heard. As we have proven. They just this week interrupted a town hall meeting in Los Angeles where the mayor couldn't even speak to the folks.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: That was terrible.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They stormed in.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND:</b> That was terrible.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thank you. Thank you, Professor, for being an honest man. So, again, you don't object to the Democratic Party getting into a relationship with Black Lives Matter after all they have done, I have just don't understand. Mr. Boykin, I'm going to give you the last word. You have got 30 seconds. Think very hard about what you are going to say. Go ahead, Professor.</p>                \n                \r\n\n            \n                <p><b>BOYKIN</b>: I have a friend --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No, no, it's Professor now. You get the last word. Go.</p>                \n                \r\n\n            \n                <p><b>BOYKIN</b>: Okay.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: I live in a very nice neighborhood where we have a lot of great friends. My sons have friends who are African-American. Those folks worry about their sons who are my son's age being pulled over and hurt by police officers.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Have them go into a group that doesn't call for death of police.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND:</b> That worries people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I think that's the way it goes. All right, Mr. Boykin you have 30 seconds.</p>                \n                \r\n\n            \n                <p><b>BOYKIN</b>: The Black Lives Matter movement is not the Nazi party. It's an offensive suggestion to make that comparison, Bill. I'm outraged that you would say that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know you are.</p>                \n                \r\n\n            \n                <p><b>BOYKIN</b>: And the reality is that no one who I know who is part of the leadership has ever endorsed the killing of police officers.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I asked to you give me one name of repudiation and neither of you gentlemen can give me a name.</p>                \n                \r\n\n            \n                <p><b>BOYKIN:</b> Can you name me one person who has endorsed that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. We just played a videotape.</p>                \n                \r\n\n            \n                <p><b>BOYKIN: </b>One leader in the black live.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Looked like 16 maybe 100 people.</p>                \n                \r\n\n            \n                <p><b>BOYKIN: </b>One leader in the Black Lives Matter movement who has endorsed killing cops. Just give me one, Bill. Just give me one. You can't do it because it didn't happen. It's not true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The group is judged by its behavior. All America just saw the behavior on the videotape. We appreciate the debate.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Democratic Party embracing Black Lives Matter ", "description": "DNC agrees to town hall with radical movement; 'The O'Reilly Factor' investigates", "date": "2015-10-23T12:25:02Z"}