{"vcmId": "386463c3-675a-463a-823c-b267e166f1ff", "url": "http://www.foxnews.com/transcript/2016/01/26/bill-oreilly-conservatives-versus-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>When a bunch of right leaning scribes hammered Donald Trump last week, some Trump supporters were outraged. But why? If you do support Trump, you surely know his bombastic style and populist statements especially on immigration have angered many people. His generalizations about certain groups have garnered him massive attention but also much loathing.</p>                \n                \r\n\n            \n                <p>So there is absolutely nothing, nothing wrong at all with some conservatives voicing objection to Donald Trump. They're simply exercising their rights as Americans.</p>                \n                \r\n\n            \n                <p>At the same time, it's appropriate for Mr. Trump to hit back against his critics. He believes they are putting ideology above problem-solving and that may be true. Trump is smart not to allow others to define him. And his supporters expect him to lash out.</p>                \n                \r\n\n            \n                <p>For years, some on the right have criticized me for not fitting in to their narrow view of the world. The Factor marches to an independent beat and ideologues on both sides don't like it especially because we are a powerful voice.</p>                \n                \r\n\n            \n                <p>My recent go around with George Will illustrates that. By the way, Will and his crew are also dismissive of Donald Trump and come across as elitist in the process which actually helps Trump.</p>                \n                \r\n\n            \n                <p>This is one of the few times Talking Points can ever remember ardent conservatives and ardent liberals agreeing on something: no Trump. However, new polls show Donald Trump still dominating the Republican field despite his unorthodox campaign.</p>                \n                \r\n\n            \n                <p>That's because millions of Americans have grown tired of political talk. They want action. And believe Trump will bring it. No question that's an emotional play and the GOP establishment is rightly worried that there will be more votes lined up against Trump than for him in the general election.</p>                \n                \r\n\n            \n                <p>But Trump is not worried about that right now understanding he has to get the nomination first. And scorched earth is his way of doing it.</p>                \n                \r\n\n            \n                <p>Looking down the road Trump believes he will bring in legions of new voters to counter the liberal minority coalition that gave Barack Obama power. But in the end Independent voters will make the call this year. Not conservatives or liberals. Right now polls say Independents are not bullish on Hillary Clinton or Sanders so Trump has a chance in that precinct.</p>                \n                \r\n\n            \n                <p>No matter what your political philosophy, you have a perfect right to speak your mind on the Presidential election and attacks on that right are irresponsible, the product of small and sometimes hateful minds. We are a divided nation, that's reality. But out of robust debate can come clarity and strength. Hopefully that's what will happen next November -- hopefully.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Conservatives versus Trump", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/25", "date": "2016-01-26T13:13:38Z"}