{"vcmId": "38bae82f-2f91-4603-818c-358e0365dea7", "url": "http://www.foxnews.com/transcript/2015/05/19/bill-oreilly-finally-usa-attacks-isis-on-ground.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Over the weekend, we learned that an army Delta Force team crossed into Syria from Iraq killing about a dozen ISIS jihadist including Abu Sayyaf, a top leader. Sayyaf's wife was captured along a bunch of computers and cellphones. A young woman kept as a slave by the couple was rescued. No injuries to the Delta team.</p>                \n                \r\n\n            \n                <p>In just a few moments, Colonels Hunt and Peters will have the inside story on the dramatic operation. At the same time, ISIS was being confronted by the Americans, the Iraqi army was retreating from an ISIS attack on the town of Ramadi which is now under ISIS control.</p>                \n                \r\n\n            \n                <p>Reports say the Iraqis once again panicked, fled the battlefield. ISIS fighters then slaughtered hundreds of people according to reports by the Associated Press -- another horror.</p>                \n                \r\n\n            \n                <p>Here is how Secretary of State Kerry reacted.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOHN KERRY, U.S. SECRETARY OF STATE: </b>It is possible to have the kind of attack we've seen in Ramadi, but I'm absolutely confident in the days ahead that will be reversed, large numbers of Daesh were killed in the last few days and will be in the next days.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, you're not going to reverse the brutal execution of all those civilians. And the brutal truth is -- that the Obama administration and the entire world have allowed the ISIS savages to gain power and murder thousands of innocent people -- thousands.</p>                \n                \r\n\n            \n                <p>They're not hiding in the mountains of Pakistan. ISIS is an organized army fighting a ground war in Syria and Iraq. Yet the world stands by and doesn't really care even though the danger to the world is apparent</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. DIANNE FEINSTEIN (D), CALIFORNIA:</b> I'm very worried about the Islamic state. It is now in at least 12 countries around North Africa, around the Middle East. It is organized. It is an impressive fighting force. It occupies territory, it runs a government. And most importantly, it is evil and annihilates in the most brutal of ways.</p>                \n                \r\n\n            \n                <p>And so I think that we have to get very serious about what we're going to do not only to contain, but to eradicate this force.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Senator Feinstein is correct. Now, there are two strains about ISIS and Iraq that may influence the upcoming presidential election.</p>                \n                \r\n\n            \n                <p>First, there is no question that pulling all U.S. troops out of Iraq directly led to groups like ISIS quickly achieving power in that country. President Obama's top military advisers warned him against a withdrawal. He did it anyway telling the world the war had been won.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES: </b>We're leaving behind a sovereign, stable and self reliant Iraq with a representative government that was elected by its people. We're building a new partnership between our nations. And we are ending a war not with a final battle, but with a final march toward home.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, Hillary Clinton is going to have to deal with that miscalculation as she was secretary of state when it happened. So part of the ISIS debacle could be assigned to her. Unless she can demonstrate that she herself told President Obama not to withdraw the troops.</p>                \n                \r\n\n            \n                <p>Also it's apparent that President Obama doesn't have a cohesive strategy to defeat ISIS going forward. Does Hillary Clinton have one? We don't know.</p>                \n                \r\n\n            \n                <p>On the Republican side, the nation saw how Jeb Bush struggled with the Iraq war question last week. Although some still believe the coalition invasion of Iraq in 2003 was the right thing to do, President Bush and Vice President Cheney among them, history have will show that the tribal divisions in side that country made it impossible for a non dictator to govern Iraq effectively.</p>                \n                \r\n\n            \n                <p>The Sunni-Shia hatred runs so deep, unity was impossible and Iraq has now fallen apart because U.S. forces are not there to impose order and prop up the army. It's safe to say that the American government did not understand the brutal Iraqi internal situation when the war started. It is also a fact that nation building is no longer a viable strategy in the Muslim world.</p>                \n                \r\n\n            \n                <p>Talking Points believes history will judge that both presidents -- Obama and Bush -- made serious mistakes in Iraq. While removing Saddam Hussein in the face of a worldwide terror threat after 9/11 may have seemed like a sound tactical decision at the time, the unintended consequences have been staggering for America and the world -- the empowerment of Iran at the top of the list.</p>                \n                \r\n\n            \n                <p>So now the U.S.A. has to deal with an aggressive terror threat, ISIS, which is expanding. But because the nation has been exhausted by the wars in Iraq and Afghanistan, decisive action against ISIS has been very difficult. But the next president must, must defeat ISIS or face ongoing terror violence that could be cataclysmic.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Finally the USA attacks ISIS on the ground", "description": "Bill O'Reilly's Talking Points 5/18", "date": "2015-05-19T12:13:20Z"}