{"vcmId": "394ae714-b324-4be2-beff-2daf54bd20ce", "url": "http://www.foxnews.com/transcript/2017/03/09/bill-oreilly-treason-is-in-air.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>We now know that somebody either leaked or hacked into CIA files that explained how U.S. intelligence is tracking enemies of the nation.</p>                \n                \r\n\n            \n                <p>WikiLeaks says it has released almost 9,000 documents from the CIA Center for Cyber Intelligence.</p>                \n                \r\n\n            \n                <p>A Wall Street Journal editorial put it this way:</p>                \n                \r\n\n            \n                <p>\"The losses from this exposure are incalculable. These tools represent millions of dollars investment and man-hours. Many will now be rendered moot as terrorists or foreign agents abandon traceable habits.\"</p>                \n                \r\n\n            \n                <p>So again, ISIS, al Qaeda, other killers now know how the USA is tracking them.</p>                \n                \r\n\n            \n                <p>Therefore the leaks are a treasonous act.</p>                \n                \r\n\n            \n                <p>According to the Reuters news agency, the CIA breach happened during the Obama administration.</p>                \n                \r\n\n            \n                <p>The Factor has learned that some of the computer systems used by the agency are more than 40 years old, easily hacked into, easy targets of theft.</p>                \n                \r\n\n            \n                <p>We have also been told that bids are out to high-tech companies to upgrade the computer facilities of our intelligence agencies.</p>                \n                \r\n\n            \n                <p>That will cost tens of billions but is absolutely necessary in this dangerous world.</p>                \n                \r\n\n            \n                <p>But no matter how sophisticated the hardware gets, we still have people committing treason inside the government.</p>                \n                \r\n\n            \n                <p>We reported on that last night.</p>                \n                \r\n\n            \n                <p>Since taking office, President Trump has been bedeviled by leaks, classified information being fed to the anti-Trump press among them.</p>                \n                \r\n\n            \n                <p>So now we have a growing catastrophe. Obviously the CIA and other intelligence agencies cannot protect their secrets.</p>                \n                \r\n\n            \n                <p>And so far only a few individuals have been charged with violating national security.</p>                \n                \r\n\n            \n                <p>In 2013, then-Private Bradley Manning was convicted of six Espionage Act violations plus theft and computer fraud for giving stuff to WikiLeaks.</p>                \n                \r\n\n            \n                <p>Just before he left office, President Obama commuted Manning's 35 year sentence, allowing him to leave prison on May 17th after seven years.</p>                \n                \r\n\n            \n                <p>Many objected to the leniency shown Manning.</p>                \n                \r\n\n            \n                <p>Talking Points believes that leakers of classified documents are actively committing treason.</p>                \n                \r\n\n            \n                <p>And it is apparent that the federal government does not have a handle on how to apprehend these traitors, much less stop the espionage.</p>                \n                \r\n\n            \n                <p>America is the most sophisticated country in the world, but we cannot protect the private conversations of our leader, our intel secrets, and our counter-terrorism measures.</p>                \n                \r\n\n            \n                <p>Obviously, a dangerous situation.</p>                \n                \r\n\n            \n                <p>President Trump should order the FBI to aggressively investigate all leaks and hacks, assigning that a top priority.</p>                \n                \r\n\n            \n                <p>Today Republicans on the House Judiciary Committee requested a meeting with FBI Director Comey on the hacking and leaks.</p>                \n                \r\n\n            \n                <p>Mr. Comey should do that as quickly as possible and it should be televised.</p>                \n                \r\n\n            \n                <p>Americans need to know if this situation is completely out of control or what.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Treason is in the air", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/8", "date": "2017-03-09T12:48:25Z"}