{"vcmId": "3c2501a7-31ca-45ba-a64c-5e2d1d3e44dc", "url": "http://www.foxnews.com/transcript/2016/11/02/mike-pence-clinton-actions-corrupt.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 1, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thanks for staying with us. I'm Bill O'Reilly in the \"Impact\" segment tonight. Let's bring in Governor Mike Pence who is running with Donald Trump on the Republican ticket as everybody knows. He joins us from Pennsylvania.</p>                \n                \r\n\n            \n                <p>So, Governor, you guys caught a break with this Hillary Clinton email stuff, do you think it's enough to hand you the election a week from tonight?</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> Well, you know, long before that announcement last Friday, Bill, I mean, frankly polls around the country were showing tremendous momentum in this campaign. And frankly I saw it as I was traveling across the country campaigning for Donald Trump and with Donald Trump. The crowds, the enthusiasm, this is really a movement of the American people to make America great again.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What about the so-called October surprise. I mean nobody expected FBI Director Comey to come out Friday and say we have to reopen this because Huma Abedin's computer may contain national security stuff that shouldn't be on there. So, I mean, that's what I'm trying to get into perspective here whether that's enough to put you guys over the top. In your opinion, is it?</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> Well, I think that's in the hands of the American people. But the simple fact is that millions of Americans, Bill, were very troubled this summer when the FBI concluded that Hillary Clinton had been, in their words, extremely careless with classified information on a private server when she was secretary of state and, yet, they didn't recommend to continue the investigation or charges. We think it was ripe and we commend the director of the FBI for keeping his word to the Congress and the American people.</p>                \n                \r\n\n            \n                <p>We found new pertinent information. They are initiating investigation. But what we already knew about Hillary Clinton's years as secretary of state where she had a private foundation that took foreign contributions and has come out in this avalanche of emails, I truly do believe convinces millions of Americans that Hillary Clinton should never be elected president of the United States. At the end of the day, I want to tell you there was tremendous momentum in this campaign --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> -- even before this latest announcement and we are seeing it across Pennsylvania and everywhere we go.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Were you down by 11 in Pennsylvania according to the Franklin Marshall poll but we will get to that in a moment. I want to stay on Hillary Clinton here. Do you think that she is a corrupt person?</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: Well, I don't think there is any question that over the last 30 years, the Clintons' careers have been characterized.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, but her? Hillary Clinton, is she corrupt?</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: Well, I think there's been outright corruption represented throughout their careers, Bill. Good heavens! You have Bob Woodward famously of --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You're saying, yes. You're saying yes, you think she's a corrupt person.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: Well, Bob Woodward, Woodward and Bernstein said on this network about a week ago that having a private foundation taking foreign contributions from foreign governments while she was secretary of state, he said that's not unseemly, he said, quote, \"it's corrupt.\"</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But that's Bob Woodward saying it's corrupt. I want to know what Mike Pence says. Is Hillary Clinton corrupt?</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> I think her actions as secretary of state, the pay-to-play politics where you saw Hillary Clinton and aides to Hillary Clinton actually directing contracts for the reconstruction of Haiti to friends of the Clintons who were contributors to their campaigns and their private foundation, that's just -- that's the kind of pay-to-play corruption the American people are tired of in Washington, D.C. And going to come to the end the day Donald Trump becomes president.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I think Americans want to know if you think she is corrupt and you have said now that you do. Is Loretta Lynch the Attorney General of the United States corrupt? She does not want to investigate the Clinton Foundation. You just pointed to it. She does not want, according to reportage by the \"Wall Street Journal\" to investigate at all. Is Loretta Lynch corrupt?</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: Well, I don't think we really know. I know that the meeting between former President Clinton and the Attorney General on the tarmac on a private aircraft that was -- that would have been a clandestine meeting but for some industrious local television reporter who saw there it happened this summer was deeply troubling to millions of Americans.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Have you haven't decided whether you think she is corrupt or not?</p>                \n                \r\n\n            \n                <p><b>PENCE: </b>No. I don't think we have the facts. At the end of the day.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's not enough that she doesn't want to investigate the Clinton Foundation? It's not enough?</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> Well, Bill, look, I don't want to presume on what her opinions are on that or not.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> I have seen press reports and suggestions. But at the end of the day, Hillary Clinton is on the ballot, Donald Trump is on the ballot. The American people and Donald Trump have a choice in a candidate who's got an ethics reform proposal. We're going to move in the first 100 days that's going to drain the swamp. We're going to have government as good as our people. We're going to pass fundamental ethics reform in our nation's capital and change the direction of Washington, D.C.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. You are down by 11 as I mentioned in Franklin Marshall poll in Pennsylvania. You need Pennsylvania or Wisconsin one of those two, to pick off to win the electoral vote. We just analyzed it earlier on The Factor. Eleven, that's a big number, being down in Pennsylvania right now.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: Well, I will tell you what, you know, the only poll that matters is the one that's going to be finished on Election Day. And people are going to go to vote here in Pennsylvania on November the 8th. And I just have to tell you, campaigning with Donald Trump here in the Keystone State, he is in Wisconsin tonight, Bill, really and truly, the enthusiasm that we see from not just Republicans but Independents and many Democrats around the country is like nothing I have seen in my lifetime since the days of Ronald Reagan. The American people know we can be stronger, we can be more prosperous but we have got to have new leadership and that happens to be Donald Trump when he becomes president.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: There is no question. There is no question the enthusiasm level from the folks attending the rallies is much higher on your ticket than it is on the Democratic ticket. We appreciate your time, Governor, we know you are running around like crazy. It's very nice of you. I hope we can talk again before the vote. Thanks, again.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: Yes. Thank you, Bill.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Mike Pence: Clinton's actions corrupt", "description": "Republican vice presidential nominee joins 'The O'Reilly Factor' to discuss the final days leading up to election 2016", "date": "2016-11-02T12:28:34Z"}