{"vcmId": "3c52ec5e-db57-4ede-9970-6fac56bb0ff1", "url": "http://www.foxnews.com/transcript/2017/03/01/bill-oreilly-what-is-real-state-union.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The economy is getting stronger but wages are still rather stagnant.</p>                \n                \r\n\n            \n                <p>A tax cut for working Americans might change that, as consumers would likely increase spending, leading business to expand.</p>                \n                \r\n\n            \n                <p>The more labor needed, the higher wages will go.</p>                \n                \r\n\n            \n                <p>If President Trump announces a big expansion of infrastructure construction, that will stimulate the job market as well.</p>                \n                \r\n\n            \n                <p>So across the board tax cuts and spending on roads, et cetera, is what is needed right now.</p>                \n                \r\n\n            \n                <p>Of course, that will drive up the national debt, which we'll get to shortly.</p>                \n                \r\n\n            \n                <p>On the national security front, the president is committed to building up the military -- which is necessary, but must be done methodically.</p>                \n                \r\n\n            \n                <p>Mr. Trump is essentially correct when he says the USA has squandered about six trillion dollars in the Middle East.</p>                \n                \r\n\n            \n                <p>I mean, what have we achieved there?</p>                \n                \r\n\n            \n                <p>ISIS and other jihadists are still a major threat. Millions of refugees need care. Iran remains a huge enemy. Iraq and Afghanistan are chaotic.</p>                \n                \r\n\n            \n                <p>Two presidents tried and failed to bring stability to the Middle East using American blood and treasure.</p>                \n                \r\n\n            \n                <p>The goal was noble. The plans flawed to say the least.</p>                \n                \r\n\n            \n                <p>The truth is that President Bush's confrontation and President Obama's retreat did not make things better in that brutal region.</p>                \n                \r\n\n            \n                <p>Can Donald Trump do better?</p>                \n                \r\n\n            \n                <p>No one knows.</p>                \n                \r\n\n            \n                <p>Also on the security front there will be a partial wall on the southern border, plus increased enforcement of immigration law.</p>                \n                \r\n\n            \n                <p>The wall is largely a symbol. &#160;The enforcement, a message the Trump administration will not accept open borders and violators of federal law.</p>                \n                \r\n\n            \n                <p>As with the Middle East, immigration policy must be enforced methodically, with explanations given to the American people about why things are happening.</p>                \n                \r\n\n            \n                <p>The open border/sanctuary city folks have the media with them so to counter that, the president has to explain how his policy benefits the country.</p>                \n                \r\n\n            \n                <p>He should also be humane in this area. Desperate hard working people do not deserve harsh punishment.</p>                \n                \r\n\n            \n                <p>Thus, Congress needs to get off its collective butt and pass updated immigration laws.</p>                \n                \r\n\n            \n                <p>The issue is so intense that at tonight's speech, some Democrats are bringing undocumented folks as guests while President Trump has invited families whose loved ones were killed by illegal alien criminals.</p>                \n                \r\n\n            \n                <p>After immigration, the economy and security/terrorism, the problems are smaller. Except for the debt.</p>                \n                \r\n\n            \n                <p>It will continue to rise well past 20-trillion until health care and social security spending are redefined.</p>                \n                \r\n\n            \n                <p>Donald Trump knows he has to run up even more debt to accomplish his agenda and cutting some programs is not gonna balance things out.</p>                \n                \r\n\n            \n                <p>The president hopes that prosperity will eventually bring in more tax money but that's far down the road.</p>                \n                \r\n\n            \n                <p>Eventually, in order to bring the massive debt down, the government will have to restructure Social Security and Medicare payments for younger Americans. But Mr. Trump wants no part of that.</p>                \n                \r\n\n            \n                <p>Finally, if Donald Trump is successful in juicing wages, the culture war stuff will begin to go his way.</p>                \n                \r\n\n            \n                <p>Socialists like Bernie Sanders and Elizabeth Warren will be crushed if capitalism makes a comeback. And so will all the nanny state nonsense.</p>                \n                \r\n\n            \n                <p>Americans are tired of political correctness and left wing totalitarianism. Most of us have had it with extremism on both sides.</p>                \n                \r\n\n            \n                <p>The truth is that this country remains a citadel of opportunity and common sense views held by regular folks.</p>                \n                \r\n\n            \n                <p>But that profile has been smothered by big government zealots, ideological fanatics and a media that promotes the P.C. culture.</p>                \n                \r\n\n            \n                <p>If President Trump's vision brings increased prosperity and security, he will trounce his enemies. If economic opportunity rises, all the class warfare B.S. will be harder to sell.</p>                \n                \r\n\n            \n                <p>But in order for that to happen, America needs to be unleashed.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: What is the Real State of the Union?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/28", "date": "2017-03-01T13:12:34Z"}