{"vcmId": "3ef19390-f518-4fb1-9a82-d1d40f03531f", "url": "http://www.foxnews.com/transcript/2016/10/12/donald-trump-on-taking-shackles-off-campaign.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 11, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Caution. You are about to enter the No Spin Zone. The Factor begins right now.</p>                \n                \r\n\n            \n                <p>Hi, I'm Bill O'Reilly, thanks for watching us tonight. The Talking Points Memo will be a bit later on. The topic, how religious Americans are processing Donald Trump right now. But first, a Factor world exclusive. The first national television interview with Mr. Trump after the debate and the \"Access Hollywood\" exposition. One new ground rule I have put in, if at any time during the interview, Mr. Trump feels he is being treated unfairly, he has been asked by me to say that. We will give Hillary Clinton the same courtesy, should she decide to talk with us.</p>                \n                \r\n\n            \n                <p>So, joining us now from Dallas is Donald Trump. All right. First of all, you tweeted today, it is so nice that the shackles have been taken off me. And I can now fight for America the way I want to. What exactly does that mean?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, we've been having a problem. We have millions and millions of followers. We set records in the primaries. We have a group of people that want to see America be great again, and Paul Ryan, you know, open borders and amnesty and lots of other -- and bad budgets by the way, very, very bad budgets. Frankly, the only one that Obama negotiates well with is Paul Ryan with the budgets. Because that's the only negotiation he can win.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. All right. But what shackles did you have on? I mean --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> The shackles are some of the establishment people that are weak and infective people within the Republican Party, senators and others and Paul Ryan, led to a certain extent by Paul Ryan.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They were holding you back? They were holding you back?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: It's not a question of holding back, no. But they're not giving support. They don't give the kind of support. You know we got more votes, more than 14 million votes, more than anybody in the history of the Republican primaries, Bill, and they don't give the support that we really need.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Now, I think maybe I'm better off maybe without their support if you want to know the truth.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You might be. But I am so confused, you say, you say, okay, the shackles are off and now I can really do what I want. I mean, what are you going to do that you haven't done? I mean, are you going to be more outspoken?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I don't think I'm that outspoken to be honest with you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Oh, come on! Sure you are.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: No, I don't think, I think I've been very nice.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I didn't say you weren't nice. You're about as blunt as they come in political circles. That's why you won the primary.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I don't think so. Look, I went to Ivy League schools. I went, you know, I am not --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So did I, and look at the big mouth on me.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I think, I know, and look how we turned out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. All right.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> But the fact is that, I think we should get support, and we don't get the support from guys like Paul Ryan. He had a conference call yesterday with congressmen, with hundreds of them, and they practically rioted against him on the phone. One person stuck up for him. So, I am just tired of none support and I don't really want his support. You know, if he calls now -- this happens all the time. If you sneeze, he calls up and announces, isn't that a terrible thing?</p>                \n                \r\n\n            \n                <p>So look, I don't want his support. I don't care about his support. What I want to do is that I want to win for the people, because Hillary Clinton, she is a disaster.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> She is a disaster.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: When you --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: And four more years of Obama, which will be worse than Obama, but four more years of Obama through Hillary Clinton, this country can't take it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. I think you've gotten that point across. I think we all know that. So I want to go forward. I want to see what your forward strategy is. Four weeks from today, we'll all be voting. You're about six or seven percent down in the polling now, that's what's trickling out. Certainly, you could win. I think everybody, it was fair, you could win. But you're behind. So, let's start with risk assessment. Have you assessed how you're going to win back women who were offended by the recent exposition from \"Access Hollywood\"? Do you have a plan to get those women back?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, first of all, locker room talk, and most people have heard it before, and I've had a lot of women come up to me and said, boy, I've heard that and I've heard a lot worse than that over my life. And, you know, if that's why I'm going to lose an election to get rid of ISIS and to create strong borders and rebuild our military and do all the things we're going to do, including Supreme Court judges and saving the Second Amendment, because it's under siege with Hillary Clinton or as I call her crooked Hillary, which is what she is. If that's what it's going to take to lose an election, I would be pretty sad then I have to go back to my other life.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>But I will tell you what, I think we're going to win the election, Bill. I think we're going to win the election. People are tired of Obama and they're tired of Clinton.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. You're going the course of what you've been doing. You're not going to add anything new, any targeting commercials --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> We have a great commercial that went out today. I'm right now in Dallas, Texas, I'm flying to Panama City, Florida in just a little while as soon as I'm finish with this. And we're doing a speech, and we have thousands and thousands of people. I notice where Hillary is doing a speech some place in Florida. She has got a small crowd and they're making it like a big crowd. I had 20,000 people last night. Nobody talks about that. It's a very unfair press. But one thing I'll say about you, you agree that I've been treated unfairly by the press.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: In some cases you have been, but in some cases you're too sensitive. But if you are treated unfairly and we do have a talking points memo tomorrow that will prove some of that. And you'll be very interested to see what we've come up with. But let's again, women, women are the key with this. You're winning with men. All right? And I think you will continue to win with men. But women you're behind.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But you're behind with women. Are you going to target --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I'm not sure I believe it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You know, whether you believe it or not, that's what the polling says.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you have any plan to speak to women directly or target them with ads or anything like that?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I do, but what women want, you know, we do the child care program that really Ivanka wanted very, very much. My daughter Ivanka wanted it. I agreed with her 100 percent. But what women want is they want secure borders, they want safety, they want law and order, they want, you know, they want a police department that's allowed to do its job, they want justice for all. They want a lot of things that everybody else wants, and Hillary Clinton can't do it.</p>                \n                \r\n\n            \n                <p>She's been doing this stuff for 30 years and she has failed every single time. I mean, you look at her tenure in New York State. It was a disaster. She's failed at everything she's ever done including by the way, ISIS. She created ISIS in a sense because of the vacuum left by the way they got --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. It was an Obama policy, but remember, it's you know, when you're secretary of state, I'm not making excuses, you're working for the boss. So now, let's get back --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Bill, Bill, hold it, Bill, you said I could interrupt.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, go ahead.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Okay. Just one time.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yep.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I hope to not do it again. Just so you understand, there was no ISIS when Hillary Clinton came along.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Of course I understand that.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> The way they got out of Iraq. So there was no ISIS, so there were no countries, now they're in 32 countries all over the world including by the way --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And that's on Obama.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> She asked him -- no, it's also on her. She was secretary of state.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: A little bit. A little bit. But --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Not a little bit.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: If you get elected president, you're going to tell your secretary of state what to do and they'll do it or you'll fire them. But I want to get back to --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Bill, she was there at the beginning, she was there at the proud birth of ISIS.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I know.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> So, I'm sure she was very proud of it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, so she screwed up Libya too.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So she screwed up Libya too.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Her baby all the way.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> She screwed up everything.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I mean, just there's nothing she hasn't screwed up.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. All right. Now your support, all right, so Ryan is gone. You attacked McCain today as well, because he was mad about the tape thing. If you're elected president --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> You're going, you want to hear McCain? McCain was desperate --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Let me ask the question.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> He was desperate to get my endorsement. I gave him the endorsement because he needed it for the primary, and frankly, he ran against a very, very good woman. I feel very badly, I gave him the endorsement. But that's okay.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: He easily wins his primary. He easily wins his primary. And then all of a sudden, you know, he does the un-endorsement thing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He didn't like the tape thing.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> He's never heard, give me a break. He's never heard salty language before. You know, John McCain who has probably the dirtiest mouth in all of the Senate has never heard, you know, he talked about lewd --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Can I ask a question, please?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: If you're elected president, you're going to need McCain and you're going to need Ryan. You're going to need these guys.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> They will be there. They will be there. I would think that Ryan maybe wouldn't be there. Maybe he will be in a very different position. But McCain will be there, they'll all be there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And you think they'll going to all cooperate with you after you're trashing them?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I get along, I know you don't believe this. Well, I get along with you for 20 years, I guess I can get along with anybody, frankly. But to be honest with you Bill, I get along with people. And I think you know that maybe better than anybody, I get along with them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't know what good it does to trash people. You can say I disagree, I wish they would endorse me, but to trash them, I don't know what good that does.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Because he was begging for my endorsement, people are calling --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> His friends are calling. And then the first sign of a little bit of difficulty he unendorsed me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I wouldn't want to be in a foxhole with a lot of these people, that I can tell you --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But McCain is a brave man. He is a brave man.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: -- including Ryan. By the way, including Ryan. Especially Ryan.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I got that.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump on taking 'shackles' off campaign", "description": "Republican presidential nominee joins 'The O'Reilly Factor' to discuss how he will campaign for the remainder of the race", "date": "2016-10-12T12:14:33Z"}