{"vcmId": "3f2f58ed-4d5b-4506-a56e-f68c3e0bfa28", "url": "http://www.foxnews.com/transcript/2015/04/03/bill-oreilly-war-on-christianity-getting-even-worse.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Kenya, Africa -- five radical Muslim killers murdered at least 70 people at a college at that country. At least another 75 were wounded.</p>                \n                \r\n\n            \n                <p>Gunmen burst into a Christian prayer service, proceeded to shoot down the innocent worshipers. That comes after a mid March suicide bombing in Pakistan killing 14 Christians, wounding 70 others. A few weeks before that, Libya -- ISIS killers beheading 21 Egyptian Christians. So you can see Christians are being slaughtered all over the place.</p>                \n                \r\n\n            \n                <p>Here in the U.S.A., verbal attacks against Christians are the headlines. As we reported yesterday, some far-left people aided by a sympathetic media are now smearing Americans who oppose things like abortion and gay marriage. No question it is open season on Christians.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MAHER:</b> There are no great religions. They are all stupid and dangerous. And we should insult them --</p>                \n                \r\n\n            \n                <p>All religions, I think, sell you a problem and then sell you the solution. They remind me of a \"Three Stooges\" episode where they are exterminators but first they go to the house and plant roaches and rats.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Maher, a well known religion hater who is much lionized by the media, given a free pass to bash people of faith. His anti-religion movie got some negative reviews as it is attacks on Islam. But his vicious behavior toward Christianity largely ignored in the press.</p>                \n                \r\n\n            \n                <p>Now, a recent poll from the Associated Press is instructive. Here's the question: in states where same sex couples can be married legally, do you think that wedding-related businesses with religious objections should be allowed to refuse service to same sex couples or not? 57 percent say yes, they should be allowed to refuse marital service; 39 percent say no; 4 percent don't know.</p>                \n                \r\n\n            \n                <p>A public religion research institution poll asks: in America today do you believe that the right of religious liberty is being threatened or not? Yes, it's being threatened 54 percent; no, 41 percent; don't know, 5 percent.</p>                \n                \r\n\n            \n                <p>So, most Americans get it even though the secular progressives have succeeded in putting people of faith on the defensive. Perhaps the best example of this is the pizza shop in Walkerton, Indiana. The media went to the store, the owner said they wouldn't feel comfortable catering a gay wedding -- a theoretical question as pizza, not usually on the menu at wedding receptions. Well, all hell descended on the store as secular zealots threatened all kinds of things.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>NEWT GINGRICH, FORMER SPEAKER OF THE HOUSE:</b> I actually think what it shows is when you have a lynch mob underway and you have a number of people doing things that are purely symbolic that it's very hard to stand up to lynch mobs.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Once again, the reason all this is happening is the lack of push back by American religious leaders. It is very rare to see any high ranking Catholic cleric defending the faithful publicly. Protestants are a little bit better but organized efforts to defend the Christian faith are rare. Therefore, the anti-religion people have a free fire zone to attack at will.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The War on Christianity getting even worse", "description": "Bill O'Reilly's Talking Points 4/2", "date": "2015-04-03T12:11:17Z"}