{"vcmId": "3f42ea76-7786-488f-b724-f75467c2a429", "url": "http://www.foxnews.com/transcript/2015/09/15/kim-davis-returns-to-work.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" September 14, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Personal Story\" segment tonight. Forty nine-year-old Kim Davis, the county clerk in Kentucky who refused to issue marriage licenses to gay couple and was put in jail for it back on the job today.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>KIM DAVIS, ROWAN COUNTY CLERK</b>: I don't want to have this conflict. I don't want to be in the spotlight. And I certainly don't want to be a whipping post. I am no hero. I'm just a person who has been transformed by the grace of God and who wants to work, be with my family. I just want to serve my neighbors quietly without violating my conscience.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Joining us now from Maitland, Florida, Mat Staver, lead attorney for Ms. Davis. So, do you expect any more trouble in this case, Mr. Staver?</p>                \n                \r\n\n            \n                <p><b>MAT STAVER, ATTORNEY FOR KIM DAVIS</b>: Well, I don't really expect any more trouble. Today went with fairly well. I'm not sure that there is any other expected trouble. However, one of the problems that we have had from the very beginning is the intensity of the rhetoric and frankly even the death threats. Kim Davis had to change her home phone because her husband got a call saying that people were coming over to beat him, tie him up, rape Kim in his presence and then burn down the house with both of them in it. And she has gotten death threats that people are going to come to the office kill her and kill all of her staff. We have gotten death threats for the same thing that we are going to be carried out in body bags. We have gotten death threats that we are going to have bullets in our head, so that kind of rhetoric, I don't think is just going away quickly, but the intensity of it I think surprised all of us because it got so personal.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Really?</p>                \n                \r\n\n            \n                <p><b>STAVER</b>: Yes, in fact.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know, I know you guys aren't, you know, where I am but this kind of hateful stuff and it's on both sides, it's on both sides, it's getting worse because of the anonymity of the social media and all of that. And I'm sorry that you have to go through it. Now, Miss Davis, I understand, is not going to stand in the way of her subordinates issuing the gay marriage licenses in the county. Is that correct? She is not going to intrude on that.</p>                \n                \r\n\n            \n                <p><b>STAVER:</b> That's correct. She is not going to prevent them if they feel compelled.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. So that solves the problem right from the jump. So, my question to you, counselor is, why couldn't that have been worked out in the first 10 minutes of this controversy? Why did everything have to break loose?</p>                \n                \r\n\n            \n                <p><b>STAVER:</b> We asked the court to actually do this and the court refused to. And we asked the governor to do this. And so, today what Kim Davis did is she removed her name off the marriage certificate, she removed her title in authority. And she says, they are not issued under her authority. She has requested from the very beginning that this become under the commonwealth of Kentucky or the Governor if he wants to. But the Governor refused to lift a finger whereas last year he accommodated his own attorney general when he didn't want to defend the marriage laws. But he wouldn't lift a finger to accommodate Kim Davis --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. Obviously a political decision.</p>                \n                \r\n\n            \n                <p><b>STAVER:</b> It's a political decision.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You know, but I think it could have all been worked out very, very quietly and methodically when nobody would have had to go to jail. Nobody would have been threatening you and your client. And then I think this is a message for the rest of America. People of conscience have a right, all right --</p>                \n                \r\n\n            \n                <p><b>STAVER: </b>Exactly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>To say, I am not going to do a certain thing. But, but, the state has a right to carry out the law. However, under that umbrella, as you know, you can compromise. You can make compromises and you don't have to blow this thing up. I will give you the last word.</p>                \n                \r\n\n            \n                <p><b>STAVER: </b>That's exactly right. Well, that's exactly right. And that is what we have asked from the very beginning. I think when the general assembly comes back in they will make this permanent. This is what has happened in North Carolina. And I think this is a message to the other states, make sure that this doesn't happen in your state. Take affirmative steps now to accommodate people like Kim Davis. There is millions of her so that they don't have to choose between their conscience and their freedom.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right. Absolutely. Well said, Counselor, and we appreciate you coming on.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Kim Davis returns to work", "description": "Lawyer for Kentucky county clerk who refused to issue gay marriage licenses shares the latest on 'The O'Reilly Factor'", "date": "2015-09-15T12:25:10Z"}