{"vcmId": "3fc2ebe1-9f79-40f6-a703-185cf51d8825", "url": "http://www.foxnews.com/transcript/2017/02/03/bill-oreilly-donald-trump-and-terrorism.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Protests continue over the president's travel restrictions leveled at countries that have major problems controlling terrorists.</p>                \n                \r\n\n            \n                <p>The left's overreaction to this, branding it as anti-Muslim and anti-immigrant, is predictable.</p>                \n                \r\n\n            \n                <p>However the Trump administration should have explained exactly why it has chosen seven countries on which to impose travel restrictions to the USA.</p>                \n                \r\n\n            \n                <p>It all comes down to terrorism.</p>                \n                \r\n\n            \n                <p>The president believes that Barack Obama was far too soft on the Islamic Jihad.</p>                \n                \r\n\n            \n                <p>He also believes that America needs tougher standards when it comes to admitting refugees and more domestic security overall.</p>                \n                \r\n\n            \n                <p>None of that is unreasonable. But in order to blunt anti-Trump propaganda, detailed explanations have to be given to the folks.</p>                \n                \r\n\n            \n                <p>Mr. Trump began that process today:</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: &#8220;We have to be tough. It&#8217;s time we&#8217;re going to be a little tough, folks. We&#8217;re taken advantage of by every nation in the world, virtually. It's not going to happen anymore. That&#8217;s not going to happen anymore. We have seen unimaginable violence carried out in the name of religion. Acts of wanton slaughter against religious minorities, horrors on a scale that defy description. Terrorism is a fundamental threat to religious freedom. It must be stopped and it will be stopped.&#8221;</p>                \n                \r\n\n            \n                <p>Of course the president is talking about Islamic Terrorism and therein lies a problem with the left.</p>                \n                \r\n\n            \n                <p>As we all know, they do not want Islamic terrorism to be identified.</p>                \n                \r\n\n            \n                <p>After all these years, I still don't understand that.</p>                \n                \r\n\n            \n                <p>Reality is reality.</p>                \n                \r\n\n            \n                <p>One of the nations that cannot send people to the USA for at least 90 days is Iran.</p>                \n                \r\n\n            \n                <p>This week that nation again provoked the world by firing off a ballistic missile.</p>                \n                \r\n\n            \n                <p><b>GEN. MICHAEL FLYNN, NATIONAL SECURITY ADVISOR:</b> &#8220;The recent ballistic missile launch is also in defiance of U.N. Security Council Resolution 2231, which calls upon Iran not to undertake any activity related to ballistic missiles designed to be capable of delivering nuclear weapons. ((EDIT)) In these and other similar activities, Iran continues to threaten U.S. friends and allies in the region.&#8221;</p>                \n                \r\n\n            \n                <p>And so the Trump administration has put Iran on notice and it looks like new economic sanctions on Iran will be forthcoming.</p>                \n                \r\n\n            \n                <p>The left, again, will not like that.</p>                \n                \r\n\n            \n                <p>An editorial in the L.A. Times today criticized President Trump for saber-rattling with Iran.</p>                \n                \r\n\n            \n                <p>But it is clear that the soft approach President Obama took to confronting terrorism is now being completely reversed by the Trump administration.</p>                \n                \r\n\n            \n                <p>Apparently, President Trump had a rough conversation with the Prime Minister of Australia Malcolm Turnbull.</p>                \n                \r\n\n            \n                <p>According to the Washington Post, Mr. Trump thinks that President Obama's deal to accept 1,250 refugees from an Australian detention center is bad for the USA.</p>                \n                \r\n\n            \n                <p>However, the White House now says the deal will go through.</p>                \n                \r\n\n            \n                <p>But it is clear President Trump is a confrontational guy.</p>                \n                \r\n\n            \n                <p>The refugee problem all over the world will not settle down until America and NATO begin establishing world order.</p>                \n                \r\n\n            \n                <p>Ironically, the left does not want that either.</p>                \n                \r\n\n            \n                <p>In fact, the liberal community worldwide opposes any aggressive action against terrorism or any intrusion into chaotic nations where the refugee problem is exploding.</p>                \n                \r\n\n            \n                <p>So, on the left, there is no solution. They simply accept the jihad and the chaotic world that stems from it.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Donald Trump and Terrorism", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/2", "date": "2017-02-03T13:10:55Z"}