{"vcmId": "3fe35835-9d4d-44c9-a63d-65998ffb2086", "url": "http://www.foxnews.com/transcript/2014/12/09/bill-oreilly-why-grand-juries-give-police-benefit-doubt.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Back in 1993, Jesse Jackson was quoted by the \"New York Times\" as saying this, \"There is nothing more painful to me at this stage in my life than to walk down the street and hear footsteps and start thinking about robbery. Then look around and see somebody white and feel relieved.\"</p>                \n                \r\n\n            \n                <p>Reverend Jackson was just being honest, putting forth that many Americans feel uneasy in the presence of young black males, especially in the inner city. African-Americans now make up 13 percent of the American population, but 36 percent of the prison population; whites, 63 percent of the general, 33 percent of prison inmates; Hispanics, 17 percent of the general, 22 percent of prisoners. So you can see that crimes committed by blacks dominate the statistics.</p>                \n                \r\n\n            \n                <p>African-Americans commit more murders than whites, even though the population difference is huge. So that is the primary reason that grand juries give the police the benefit of the doubt when there's an incident in the black community. The high crime rate there permeates.</p>                \n                \r\n\n            \n                <p>Also most Americans understand that police work is difficult. Right now there are about 670,000 law enforcement agents in America. According to the FBI in 2013 -- the last stats available -- almost 50,000 police officers were assaulted; 76 cops died on the job. So there's no question that police work is intense, especially in poor neighborhoods.</p>                \n                \r\n\n            \n                <p>Now, we're all human beings, and we all form general impressions about life. Sad to say the overt impression formed about young black males who act and speak in a certain way is negative; it may not be fair but it's reality. Faced with that, some police officers unfairly target young black males, and those officers must be stopped. But most cops try to be fair -- I really believe that.</p>                \n                \r\n\n            \n                <p>Many politicians are too cowardly to tell you what \"Talking Points\" has just stated. They all know the truth. They all know the stats, but they refuse to discuss the core problems, poor education, poor family structure and an attitude of defiance toward law enforcement. Listen to New York City Mayor Bill de Blasio.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DE BLASIO: </b>There's something fundamental we have to get at here. And it's not going helped by accusing either the community or the police of having bad intention or not doing their job. In fact, I think everyone is trying to do their job. Of course communities want to keep themselves safe. Of course parents want to teach their children to be law abiding.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Most parents do try to teach their children to be law abiding. But as Mr. De Blasio well knows, the collapse of the traditional family in African-American precincts means fathers are not around, mothers are overwhelmed and parental guidance is scant.</p>                \n                \r\n\n            \n                <p>So for the mayor to claim that the parental unit in general is unified in supporting law enforcement is absurd. Rather than discuss the core problems that lead to police confrontations, politicians like de Blasio demonize the police and refuse to make judgments about personal behavior. That liberal attitude empowers chaotic young people who are not held accountable from a very young age. And then when they finally go over the line they wind up in prison or in the morgue.</p>                \n                \r\n\n            \n                <p>The truth is the government cannot control personal behavior. Only peer pressure can. Only united neighborhoods can. When the regular folks come together and say \"enough\", when they support the police by turning in violent people, when they speak out against teenage girls becoming pregnant, and when they encourage solid family values, that's when the underclass crime problem will begin to subside.</p>                \n                \r\n\n            \n                <p>One final thing, when you hear someone say they want to have a, quote, \"conversation about race\", that often means they want to bloviate about theory, about things that happened in America 150 years ago. They don't really want to solve the problem that exists today.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Why grand juries give the police the benefit of the doubt", "description": "Talking Points 12/8", "date": "2014-12-09T12:57:21Z"}