{"vcmId": "3ff6b115-9e2b-4c63-a44c-0d63cf19671e", "url": "http://www.foxnews.com/transcript/2015/01/27/bill-oreilly-is-president-obama-being-humiliated-by-speaker-house-john-boehner.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>On March 3rd, Israeli Prime Minister Benjamin Netanyahu will address Congress about Iran and terrorism in general. Speaker of the House John Boehner invited Mr. Netanyahu but did not tell the President until the last minute.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>WALLACE: </b>Does it make you get a sense of really how, forgive me, wicked this whole thing is. The Secretary of State John Kerry met with the Israeli ambassador to the United States for two hours on Tuesday and Ron Dermer, the Israeli ambassador according to the State Department never mentioned the fact that Netanyahu was in negotiations and finally agreed to come to Washington. I have to say I'm shocked.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Chris Wallace believes the Netanyahu move is designed to embarrass the President and many other Americans feel the same way. But \"Talking Points\" dissents. I want to hear what Netanyahu has to say. And I hope President Obama rebuts his remarks publicly if they are false or misleading.</p>                \n                \r\n\n            \n                <p>The Israeli intelligence agency -- the Mossad -- one of the best in the world, so Mr. Netanyahu has information about Iran. He and his nation are directly threatened by terrorism and Iran thus they have to be deeply involved in what's going on. Thus, it's important for all Americans to know what Benjamin Netanyahu knows.</p>                \n                \r\n\n            \n                <p>Now, the bigger picture -- Americans are in danger. We're all in danger from Islamic terrorists and from the nation of Iran. Some estimates say Iran is within two months of being able to put together the key components of a nuclear weapon. President Obama believes he is making progress in a new deal with Iran, but the current negotiations have been going on for 14 months and have been extended twice. The next dead line the end of June.</p>                \n                \r\n\n            \n                <p>Some in congress want to impose sanctions right now. Those sanctions would be dormant until June 30th and kick in only if Iran doesn't seal the deal. \"Talking Points\" has said that will be a mistake. Yes, severe sanctions would have to be imposed if the deal falls apart. President Obama has said he will do that but the U.S. Congress should not give Iran any excuse to walk away from the table. If there is no deal by the end of the June -- by the end of June, I should say then congress can unleash hell and President Obama will have no choice but to go along with it.</p>                \n                \r\n\n            \n                <p>Again we might get into a shooting war with Iran. That's possible. And if it happens, the entire world has to know that America did everything possible to make a nuke deal. So let's put the saber rattling aside for five months. Don't antagonize them. That's the same position. That being said, many Americans have no confidence President Obama will ever confront Islamic terrorism.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BROKAW:</b> ISIL or any of the other jihadist groups can reconstitute themselves on a moment's notice, move in and destabilize the government and behead a Japanese journalist and cause great chaos in the world and then disappear again into the hills. And we don't seem to have a plan for dealing with that kind of warfare and it's been going on for a long time.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's correct. It's been going on for a long time and we have no coordinated strategy to defeat the jihad. We know where the killers are and they sit there committing atrocities all day long in fact, some might surmise that the White House is actually afraid of the Muslim world.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DENIS MCDONOUGH, WHITE HOUSE CHIEF OF STAFF:</b> What we simply do not believe, Chuck, is that they should somehow be seen as representatives of Islam. They are not. It's one of the world's great religions. The overwhelming majority of Muslims do not abide by this hateful ideology. And so we just ought not to give them any kind of belief that somehow they deserve that title.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's right. We don't want to offend anyone in the Muslim world even though in general they have done very little to fight the jihad.</p>                \n                \r\n\n            \n                <p>The reason the White House gets away with this kind of nonsense is that the American public, by and large, not you guys, you guys care, but the American public by and large doesn't care to know what's going on. The Iran issue is under covered. People do not pay attention in general to complicated situations.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> I have a lot of things that are going on in my life that I don't have enough time to worry about what's going on in Iran. I barely have enough time to worry about what's going on in America.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Is the Iran thing on my radar a concern to me? No, not at all.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Would I be concerned if Iran got a nuclear weapon? No, not right now. Other people who are worse top them so we are fine.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> I don't think people think about it. There is a blizzard going on. I think people have other things in their minds.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> One of the reasons America was hit so hard in 2001 is that we were unprepared. Our intelligence services underestimated al Qaeda and our immigration authorities were asleep. Well, here is the truth in 2015. Immigration authorities are still asleep. Anyone can get into this country and while our intelligence certainly has improved, public interest in terrorism overseas and the dangerous Iranian situation is almost nonexistent. Instead, American citizens are fixated on personal matters as you heard and an obsession with the Internet.</p>                \n                \r\n\n            \n                <p>The jihadists know this. They know they can pretty much do anything and America and the West will not respond directly. By drones, that's it. ISIS doesn't fear the U.S.A. and certainly Iran is pushing us to the wall. Sadly the President doesn't seem to be very engaged.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>REP. JOHN BOEHNER (R-OH), SPEAKER OF THE HOUSE:</b> The President didn't spend but a few seconds talking about the threat, the terrorist threat that we as Americans face. This problem is growing all over the world. And, you know, the President is trying to act like it's not there but it is there. And it's going to be a threat to our homeland if we don't address it in a bigger way.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's a threat now. Speaker Boehner is correct. And, again, his invitation to Israeli Prime Minister Netanyahu is not out of line. President Obama should be able to counter whatever Netanyahu says with an effective strategy. Note the words \"should be able\".</p>                \n                \r\n\n            \n                <p>So let Netanyahu speak his mind. Let him spell out the danger he sees to the world. That will be instructive and maybe, maybe some Americans will finally pay attention -- probably not.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Is President Obama being humiliated by Speaker of the House John Boehner?", "description": "Talking Point 1/26", "date": "2015-01-27T15:19:37Z"}