{"vcmId": "42e41bf4-5944-406f-b48a-b43904ebcd3c", "url": "http://www.foxnews.com/transcript/2016/04/07/bill-oreilly-who-wants-to-be-president.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Both Ted Cruz and Bernie Sanders have new momentum tonight. After beating their opposition by wide margins in Wisconsin. The media running wild with speculation about what the vote really means. But, let's all calm down. First of all, Bernie Sanders will not defeat Hillary Clinton for the presidential nomination. Wisconsin is largely a white state.</p>                \n                \r\n\n            \n                <p>Minority voters are breaking big for Mrs. Clinton who will win big in the New York primary and that is coming up in about, what, 10 days? Eleven days? Senator Sanders is waging a spirited campaign though. But the fix is in. The super delegates who can vote for anyone they want are large for Hillary. End of that story. On the Republican side it's a bit different. Donald Trump remains the frontrunner and will also do well in New York, his home state. That might recharge his campaign but maybe not. Last night, after losing in Wisconsin, Mr. Trump issued a statement calling Ted Cruz names. Not presidential, not a smart move. Seems that the Trump campaign is confused.</p>                \n                \r\n\n            \n                <p>We were hoping the candidate would appear on The Factor this evening. We negotiated with his team for days, but he declined. That, of course, is his prerogative. Apparently there is angst in the Trump campaign because Charles Krauthammer, in particular, sometimes hammers the candidate on The Factor. But each time Charles addresses Mr. Trump, I make sure I put on someone like Newt Gingrich who has been kind to Donald Trump to balance the presentation. We have been very fair, very fair to Donald Trump on this program. But that does not mean we'll not criticize him or cancel guests who have a dim view of him. We will not do that. We provide balance and Charles Krauthammer is challenged as are all the guests. It's ironic because just last night I stuck up for Donald Trump on the race issue.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TAVIS SMILEY, HOST, TAVIS SMILEY SHOW ON PBS:</b> It took Mr. Trump too long to -- denouncing one David Duke and others with the robocalls.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But Travis, you make mistakes and so do I. That doesn't mean --</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> That's not a mistake. That's not a mistake.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All I can tell you is, I have known the man a long time and I have never seen him cast aspersions at any group at all.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, I have said over and over that you do not call someone a racist based on a rhetorical mistake. Trump has defined his position on David Duke and we should accept the explanation unless there is direct evidence of racism on Trump's part, which there is not. As Talking Points has stated, it is not racist to support a wall on the border. Or stringent vetting of Muslims entering the U.S.A. from terrorist precincts. I would hope that the Trump campaign would notice how fair we have been and stop the nonsense. Perhaps, they will after tonight because the more tough questions Mr. Trump faces directly, the more voters may be persuade to back him. His current level of support not nearly enough to secure the White House. To be completely fair, Donald Trump is right to be cautious with the media. Here's a vivid example.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> You don't feel I will-served for example to go on a very popular talk radio show and you said you did not know that they had been leading an anti-Trump show.</p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL CANDIDATE: </b>No, because if you listen to that, I don't mind that. I mean, you go into the enemy camp sometimes. But you have to take on the enemy. He is not a very smart guy, not a very bright guy. And if you listen to the entire show, you would have said Donald Trump totally won that debate. So, I mean, sometimes you go into unfriendly territory. That's part of the game.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>And that's what you consider Wisconsin to be?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No. You said about a radio talk show host.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> You're just talking about the radio host.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> See, that's what I mean about the dishonest media.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> I'm asking you a question allowing you to answer it?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Excuse me. You are asking me about a show host and I said that he was unfriendly territory and then you say is that, what? Wisconsin?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>You also talked about the Governor.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>No, that's so dishonest. No, no, look -- do you know what's that called? Dishonest media.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And Trump is correct.</p>                \n                \r\n\n            \n                <p>But that would never happen on this program and he knows it. Now, on the other side, we are also awaiting Bernie Sanders entering the No Spin Zone. He used to chat with us all the time before he became famous. Last night I closely watched the Senator's victory speech.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SANDERS</b>: I am not naive. I know the power of Wall Street and their endless supplies of money. I know that corporate America will shut down plants in America and move to Mexico or China if they can make another $5 in profit. I know that billionaires are funding candidates whose job it is to represent the wealthy and the powerful.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sanders basically gives the same speech every time, but he gives it passionately. He really believes what he is doing in the campaign is noble. That is listing a litany of imperfections that working class folks face in America. Sanders is tapping into the same anger Trump is tapping into, only from a different place. He promises to make life better for working people by slapping around corporations and wealthy Americans. He promises an endless series of entitlements, most of which would be free for those making not much money.</p>                \n                \r\n\n            \n                <p>The problem is Bernie Sanders does not have solutions to vexing problems that are far more important than giveaways. Islamic terrorism, Bernie says Sunni Muslims should take care of it. Putin, Bernie has nothing. Iran, nothing. Illegal immigration looks like Bernie supports the open border policy espoused by many on the far left. Anyone should be able to enjoy the benefits of America without restraint. Crime? Bernie laments that so many criminals are in prison. Even though violent crime in the U.S.A. has dramatically fallen, once tough felony sentencing was put into place.</p>                \n                \r\n\n            \n                <p>A national debt of $20 trillion, Bernie has no problem adding to that. Job creation, Bernie wants the federal government to mandate salaries and provide jobs for everybody. Taxation through the roof for American corporations and the wealthy. Of course, that would lead to a huge contraction in the private sector as business would stop expanding. Senator Sanders says free healthcare is a human right, and many corporations provide generous health benefits right now to their employees. But they would stop doing that if the government is going to provide healthcare and demand higher corporate taxes to fund it.</p>                \n                \r\n\n            \n                <p>On the plus side, Senator Sanders is perhaps the most sincere politician in the presidential race. He walks the walk. The problem is the walk leads nowhere as serious problems mount. If we have to depend on the Sunnis to protect us from terror killers, if we are willing to double the national debt and risk an economic collapse. If we say to the entire world, hey, come on over and get free stuff from American taxpayers. If we are aiming for all of that, we are doomed. Finally, the bold prediction I promised in the open. Ted Cruz will offer John Kasich the vice president slot before the Republican convention begins. It's a delegate in Ohio play. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Who wants to be president?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 4/6", "date": "2016-04-07T12:19:41Z"}