{"vcmId": "4436801d-daf2-4247-b765-79bff621b775", "url": "http://www.foxnews.com/transcript/2016/07/08/fbi-boss-questioned-by-house-committee-over-clinton-decision.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" July 7, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Hi, I'm Bill O'Reilly. Thanks for watching us tonight. The nation in an uproar over Hillary Clinton and today FBI Director James Comey had to explain himself in a House Committee. The talking points memo usually heard in this spot will be later on because the Comey testimony is our lead story. Republican congressman not happy with the director. Democratic Congress people trying to petty fog the issue not really interested in what happened. In other words, partisan politics. Dominated the hearing. But there were a few interesting moments.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Did Hillary Clinton lie under oath?</p>                \n                \r\n\n            \n                <p><b>COMEY</b>: Not to the FBI, not in a case we're working.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Did you review the documents where Congressman Jim Jordan asked her specifically and she said, quote, \"There was nothing marked classified on my emails either sent or received,\" end quote?</p>                \n                \r\n\n            \n                <p><b>COMEY</b>: I don't remember reviewing that particular testimony but aware of that being said though.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Did the FBI investigate her statements under oath on this topic?</p>                \n                \r\n\n            \n                <p><b>COMEY</b>: Not to my knowledge. I don't think there has been a referral from Congress.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Do you need a referral from Congress to investigate her statements under oath?</p>                \n                \r\n\n            \n                <p><b>COMEY</b>: Sure do.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>You'll have one.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, I don't really understand that, why the FBI cannot investigate public statements made under oath in the course of an investigation without a specific referral. We have been trying to find out very specifically. I don't want to make any mistakes here so we are working on it. Now, most of the other testimony was a rehash of what has already been said.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Secretary Clinton said there was nothing marked classified on her emails either sent or received. Was that true?</p>                \n                \r\n\n            \n                <p><b>COMEY</b>: That's not true there were a small number of portion markings on I think three of the documents.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Secretary Clinton said did I not email any classify material to any one on my email, there is no classified material, what is that through?</p>                \n                \r\n\n            \n                <p><b>COMEY</b>: There was classified material email.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Secretary Clinton said she used just one device. Was that true?</p>                \n                \r\n\n            \n                <p><b>COMEY:</b> She used multiple devices during the four years of her term as secretary of state.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: In the end few minds will be changed by the Comey testimony today. His fallback position remains the same.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>People are concerned. What does it take for someone to misuse classified information and get in trouble for it?</p>                \n                \r\n\n            \n                <p><b>COMEY:</b> It takes mishandling it and criminal intent.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: And so an unauthorized server in the basement is not mishandling?</p>                \n                \r\n\n            \n                <p><b>COMEY</b>: Oh, no, there is evidence of mishandling here. This whole investigation on the end focused is there sufficient evidence of intent.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Joining us now from Washington, attorney and former aide to President Clinton, David Goodfriend and former Attorney General for the Commonwealth of Virginia, Ken Cuccinelli. So, I know you are a state guy Mr. Cuccinelli. But can you give me a little bit of explanation about why the FBI ignored Secretary Clinton's under oath testimony in front of Congressional Committees because that speaks to perjury in a case that they're investigating. Does it not?</p>                \n                \r\n\n            \n                <p><b>KEN CUCCINELLI (R), FORMER ATTORNEY GENERAL OF VIRGINIA</b>: Well, there is also, in addition to that, Bill, there is a statute. We're used to hearing about obstruction of justice. There is a separate federal statute that addresses attempts to mislead law enforcement investigations and other investigations in to wrongdoing not based on sitting there with an FBI agent but on other statements and you identified in your introduction statements under oath that the FBI identified as false and there were public statements in Director Comey's press conference that he identified that were false. That's a felony by itself.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, it's disturbing here and because if Director Comey is saying and he did, Mr. Goodfriend that we did a thorough and honest investigation yet, on the record in front of a Congressional Committee, under oath, there is Secretary Clinton denying a bunch of things that Director Comey says happened. Then why wouldn't Comey then use the record under oath as part of his investigation?</p>                \n                \r\n\n            \n                <p><b>DAVID GOODFRIEND, DEMOCRATIC STRATEGIST:</b> Well, he essentially left the door open, I think.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But why wouldn't he do it in the beginning? Doesn't that disturb you as an American? This is supposed to be a comprehensive --</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: Well, I can answer it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Go ahead.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: So the answer to your question is, the law enforcement agency is addressing the allegation of a crime. They can expand their investigation. They can add other elements to it. But that was not within the scope of the FBI's charge.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay, explain that to me though. Let me pose the question, explain it to me.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What the FBI is trying to tell the American people is that there was no intent.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: Um-huh.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. To subvert the laws of the United States. Yet, the Secretary goes in front of a Congressional Committee under oath and does not tell the truth. Doesn't that indicate intent to deceive was there?</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: No. Because what the director said was she told the truth to me to the FBI, to our questions. So, look. You can ask and I think this is perfectly legitimate question.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Did she tell the truth to the FBI if that's what the FBI is saying.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: Now you have the committee saying.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Did you tell the truth to the Congressional Committee and that's provable and Comey didn't even look at it?</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: So I think, Bill, what Comey signaled to the chairman of this committee was there is nothing stopping me from taking that up. Give me the referral.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I got that but I'm upset, Mr. Cuccinelli --</p>                \n                \r\n\n            \n                <p><b>CUCCINELLI: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Because I heard the words out of Comey's mouth that this was a top shelf comprehensive investigation by the best guys in the country and here we have Congressman Chaffetz blowing the lid off it right in front of him.</p>                \n                \r\n\n            \n                <p><b>CUCCINELLI</b>: Yes, look, Bill, when law enforcement talks about a thorough investigation. That typically, especially in the case of the federal government, the FBI and the Department of Justice or department of whatever they are now, it usually means anything we find in this first narrow investigation that is similar or related will be included. That's what comprehensive, that's what thorough means. And they say this themselves.</p>                \n                \r\n\n            \n                <p>I mean, the biggest failure here on Director Comey's part is he did not meet his own measuring stick. You mentioned, Bill, that he talked about zeroing in not on intent but on criminal intent. And that's important because clearly then Secretary of State or incoming Secretary of State Clinton intentionally set that server up in a way that she knew would be off a classified system and then she used it for four years. That was intentional act.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> She can justify that by saying.</p>                \n                \r\n\n            \n                <p><b>CUCCINELLI</b>: That's not enough to prosecute.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay.</p>                \n                \r\n\n            \n                <p><b>CUCCINELLI:</b> That's not right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: She can justify by saying she has other secretaries of state have done it.</p>                \n                \r\n\n            \n                <p><b>CUCCINELLI:</b> That is not true. It is true. It is true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Not to the extent the other secretaries of state.</p>                \n                \r\n\n            \n                <p><b>CUCCINELLI: </b>No other secretary of state set up their own servers.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, I'm under the gun on time, gentlemen. I'm under the gun on time. One more question Mr. Goodfriend. You got 30 seconds to answer it. Okay. Isn't it troubling to you as an American, Mr. Goodfriend, that the head of the FBI, who had clear access to all of Secretary Clinton's testimony in front of a Congressional Committee under oath, says that he did not even take that into account in his comprehensive investigation? Is that not troubling?</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: Congressman Cooper from Tennessee put it best, a lot of armchair prosecutors today. I trust this top prosecutor and so should you and so should all Americans.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I'm troubled by it?</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND</b>: When we attack law enforcement, when we attack law enforcement, that attack the rule of law, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Not attacking. I'm raising the rule of law.</p>                \n                \r\n\n            \n                <p><b>GOODFRIEND: </b>The constitution of the United States, that's what we ought to be supporting here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. What we ought to be supporting here is the truth and to get to the truth because we're talking about the President of the United States here. Gentlemen, good debate. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "FBI boss questioned by House committee over Clinton decision", "description": "James Comey says investigation found no criminal intent; 'The O'Reilly Factor' examines the latest", "date": "2016-07-08T12:32:06Z"}