{"vcmId": "443b890b-1b5d-45f0-87ac-36f21661b874", "url": "http://www.foxnews.com/transcript/2015/05/14/bill-oreilly-is-president-obama-sexist-guy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>In perhaps the strangest political story of the year the President finds himself being attacked by the far left for criticizing Senator Elizabeth Warren. As you may know the President is trying to get a free trade agreement passed but Miss. Warren opposes.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> Elizabeth is a politician like everybody else and, you know, she has got a voice that she wants to get out there, and I understand that. And on most issues she and I deeply agree. On this one though, her arguments don't stand the test of -- of fact and scrutiny.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, upon hearing that, the National Organization for Women slammed down the hammer -- bang. President, Terry O'Neill said quote: \"Yes, I think it's sexist. The clear subtext is that the little lady just doesn't know what she's talking about.\" Of course, President Obama never said anything about a little lady. Maybe there was one in the room, but I didn't see her. That's the spin Miss O'Neil put on the fairly benign comment the President made.</p>                \n                \r\n\n            \n                <p>The far left Senator Sherrod Brown from Ohio piled on.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. SHERROD BROWN (D), OHIO:</b> I think the President was disrespectful to her by the way he did that. I think that the President -- I think the President has made this more personal than he needed to.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Of course, this whole thing is insane. It's a political disagreement. There is no sexism involved. But the White House which is sympathetic to the grievance industry generally now has to deal with it.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOSH EARNEST, WHITE HOUSE PRESS SECRETARY:</b> Senator Brown is a stand up guy. And given the opportunity to review the comments that seemed like they were made in some haste, that I feel confident he will do the right thing and apologize.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> As the cliche goes, good luck with that.</p>                \n                \r\n\n            \n                <p>again, there was no sexism in President Obama's comments toward Senator Warren. It's a fabricated situation. But this is preview of what we are going to see in the presidential campaign. The militant feminists and their enablers are firmly in Hillary Clinton's camp. So if Mrs. Clinton is criticized believe me the sexism deal will be all over the place.</p>                \n                \r\n\n            \n                <p>That's where America is right now. The far left making a living out of demonizing people with whom it disagrees. The irony is President Obama is a former uber liberal champion. Now he is a bad guy in a presser because he wants a free trade agreement and rather than debate that situation on its merits, the far left does what it always does, attacks personally.</p>                \n                \r\n\n            \n                <p>There is no better example I can give you of the political climate in the U.S.A. right now.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Is President Obama a sexist guy?", "description": "Bill O'Reilly's Talking Points 5/13", "date": "2015-05-14T11:50:37Z"}