{"vcmId": "46a69a31-bbec-4bcc-954b-2120b579b650", "url": "http://www.foxnews.com/transcript/2016/06/28/why-are-americans-turning-against-both-political-parties.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 27, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Personal Story\" segment tonight, Americans evaluate certain groups. According to a new NBC \"Wall Street Journal\" poll. The FBI does very well. Forty eight percent of Americans like the -- 16 percent don't. Apparently the rest don't know what the FBI is.</p>                \n                \r\n\n            \n                <p>Planned Parenthood also scoring. Forty eight percent like it, 29 percent don't. On the political front, 37 percent like the Democrat Party, three percent don't. Twenty eight percent like the Republican Party, 48 percent don't. Finally President Obama, 48 percent like him, 41 percent don't.</p>                \n                \r\n\n            \n                <p>Joining us from Washington, Newt Gingrich. So, before we get to the poll, you heard Kirsten and I debating. You know, my contention, the Brits voted emotionally. They don't like the fact that their culture is being overrun by the open border, EU policy and that the same sentiments is present here in America. Do you agree?</p>                \n                \r\n\n            \n                <p><b>NEWT GINGRICH, FORMER SPEAKER OF THE HOUSE</b>: Yes. I agree. In the case of Britain, there was also enormous resentment against the Brussels bureaucrats sort of comparable to what you are getting outside of Washington towards the Washington bureaucrats. I think the British people had this feeling that they were literally losing control of our country which is exactly the sentiment you are getting here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But why do they feel they are losing control of their country? It is because of influx of people that change the basic structure of neighborhoods? Is that why?</p>                \n                \r\n\n            \n                <p><b>GINGRICH</b>: Well, I think that's a piece of it. I think a bigger piece there is that some 70 percent of the rules now issued in Great Britain are demanded by the Brussels bureaucracy. And they have, in fact, there was a rule that they knew was coming that they had held off on that would have outlawed the traditional tea kettle for environmental reasons.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>So, you know, the average Britain, let me get this straight. Some idiot in Brussels is doing this. You get that same feeling across all America.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. But I think that, yes, I get your point about the bureaucracy and the imposition from Belgium. But I really believe that it's an emotional response to we're British, we do certain things in a certain way. That certain way is now changing and we don't like it. Now, let's get to, and this links in. Let's deal with the Republican Party first. Very, very low numbers. Why are the folks, including many Republicans like George Will, turning against their own party?</p>                \n                \r\n\n            \n                <p><b>GINGRICH:</b> Well, there are two different groups though. They are the Tea Party conservatives who feel that the Washington establishment hasn't done enough so they're unhappy. And then there is sort of George Will tori conservative, this is not elegant enough for me kind of group. So they are unhappy. And then, frankly, it also is a tribute to how serious Trump is. When you see somebody like a Brent Scowcroft who was the national security advisor to George H.W. Bush announced he can't vote if he is going to endorse Hillary. You know that these folks when they are pushed to choose between establishment and Republican, decide they are more establishment than they are Republican. This is a deep split.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But I think -- it may not be fair to Mr. Scowcroft and Mr. Will to say that because I think they may be rebelling against style not substance.</p>                \n                \r\n\n            \n                <p><b>GINGRICH</b>: I don't agree.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No, you don't think so. Let me just pose this to you. If Donald Trump were more like a traditional politician in the sense that he didn't use Twitter and that he didn't get angry, you know, about certain personal situations, yet, have the same message, border wall, stopping Muslim immigration, but he put it in ways that weren't quite as bombastic, don't you think those establishment people would have stayed in the fold?</p>                \n                \r\n\n            \n                <p><b>GINGRICH: </b>They might have. But, remember, there is real substance to the Trump rebellion. There is the trade deals have been a disaster.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Sure, sure. I know there is and that's not the argument.</p>                \n                \r\n\n            \n                <p><b>GINGRICH: </b>Look, but that's the Republican establishment that made the trade deals, you know, the two wars were a mistake. Well, it was the Republican establishment was involved in those wars. I mean, Donald Trump. Isn't just, you know, some kind of a profound personality. His critique of the last 30 years takes apart both establishments in both parties and you begin to see how uncomfortable many of the old Republican establishment are with somebody who represents a profoundly different approach.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. What about the Democratic Party? Now, again, there are some Democrats disenchanted with their own party, why are they bailing?</p>                \n                \r\n\n            \n                <p><b>GINGRICH</b>: Well, look, if you are a traditional liberal and you are anti- Wall Street and you are for the sort of thing that we thought up until the last 24 hours was personified by the senator from Massachusetts who has now decided she loves Hillary Clinton. You look at Hillary Clinton who does secret speeches for Goldman Sach's, whose family foundation collects 40 percent of their top-million-dollar plus donors are foreigners. She has 76 secret meetings according to the Associated Press with donors while she is secretary of state.</p>                \n                \r\n\n            \n                <p>I mean, Hillary Clinton is almost a caricature of everything that left wing Democrats thought they were opposed to. But her machine is so big and they dislike Trump so much that they are now caught in this trap of trying to deal with the reality of a party which is I think frankly pretty sick in terms of the level of corruption that she stands for.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Finally, President Obama comes out ahead in the poll by about seven percentage points, yet, in other polls, 66 percent of the respondents believe the country is headed in the wrong direction. He is the leader of the country for almost eight years. So, why is he still maintain ago 48 percent popularity base when 66 percent don't like the direction of the country?</p>                \n                \r\n\n            \n                <p><b>GINGRICH</b>: I think to his credit, technically, Barack Obama is the first American president to understand the Kardashian principle that being pleasantly noisy counts. So he gives you the final four and he shows you his 96 teams and he gets lot of publicity. What's to dislike? He works very hard at doing things that are trivial. And I think that that sustains him plus, frankly, the two people you measure against are Trump and Clinton. There is a certain national buoyancy to not being either Trump or Clinton and that's I think propping him up about eight points.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Mr. Speaker, we appreciate it as always. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Why are Americans turning against both political parties?", "description": "Newt Gingrich joins 'The O'Reilly Factor' to analyze the latest polling", "date": "2016-06-28T12:16:28Z"}