{"vcmId": "48fe4c74-51bb-4724-8d55-329e705c3816", "url": "http://www.foxnews.com/transcript/2014/12/04/truth-serum-john-kerry-misleading-us-on-iran.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 3, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>In the truth serum segment tonight. Two very hot topics. First Secretary of State John Kerry being accused of misleading the folks.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOHN KERRY, SECRETARY OF STATE: </b>It makes absolute sense to continue to talk. But there is more important evidence of why we should do this and that is that we are saying and I think as I said. We have earned the benefit of the doubt. We have produced an agreement that has worked. We produced an agreement that for a year Iran has lived up to.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But writing in the \"Wall Street Journal,\" Bret Stephens has the statements false. Quote, \"Iran will cheat on any undertaking it signs. We knew this, know it and will come to know it all over again.\"</p>                \n                \r\n\n            \n                <p>With us now FOX News correspondents Molly Line and Eric Shawn. So, is it fair to say that John Kerry is misleading the folks?</p>                \n                \r\n\n            \n                <p><b>ERIC SHAWN, FOX NEWS ANCHOR AND SENIOR CORRESPONDENT:</b> Well, the agreement does keep Iran underneath the threshold of 20 percent of the Iranian enrichment that would be needed to potentially make a nuclear bomb there at five percent. But look, Bill, Iran has a history of lying and cheating when it comes to its nuclear program.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, we don't know facts now as Mr. Stephens says look, Carrie is not telling you the truth. They have never negotiated in good faith all the while that were trying to get a deal they are sneakingly working on their nuke weapon.</p>                \n                \r\n\n            \n                <p><b>SHAWN: </b>Well, they have always potentially done that. We have the evidence of that exactly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Whatever this --</p>                \n                \r\n\n            \n                <p><b>SHAWN:</b> Okay, this huge amount of evidence from the idea the International Atomic Energy Agency, the U.N. watchdogs. Its head says, they are not fully cooperating. He says, they are not discussing. They refuse to discuss its past militarization of its nuclear program.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right. .</p>                \n                \r\n\n            \n                <p><b>SHAWN: </b>There are many reports at the Qom, nuclear facility they hid, the Partun (ph) military facility, they won't even let the U.N. inspectors in that, why not?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right. That's part of the negotiations to try to get more verification. But I think it would be fair to say, you know me Shawn for a long time. I'm the fairest guy on the planet. I don't think it's fair to say that Kerry is lying. I think it's fair to say that he might be overly optimistic.</p>                \n                \r\n\n            \n                <p><b>SHAWN: </b>Many would say that because of the past history of Iran.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. And the fact that there is a lot of stuff going on. Obviously they are not letting it see.</p>                \n                \r\n\n            \n                <p><b>SHAWN: </b>Yes. You don't want to deal like the Clinton administration had with the North Korean's in the early 90's.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>Yes, boom! Food and fuel and that they totally violated.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, Attorney General Eric Holder, Line, is going to investigate as we mentioned the Eric Garner killing in Staten Island. But he is also going to issue an order about the Justice Department about racial profiling. Roll the tape.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>ERIC HOLDER, U.S. ATTORNEY GENERAL:</b> In the coming days I will announce updated Justice Department guidance regarding profiling by federal law enforcement.</p>                \n                \r\n\n            \n                <p><b>(CHEERS AND APPLAUSE)</b></p>                \n                \r\n\n            \n                <p>This will institute rigorous new standards and robust safeguards to help end racial profiling once and for all.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, that will be interesting because racial profiling is in the eye of the beholder, is it not?</p>                \n                \r\n\n            \n                <p><b>MOLLY LINE, FOX NEWS CORRESPONDENT: </b>Well, that's a really interesting point. That's what the latest statistic show. And there was a recent study that just came out, Rasmussen reports showing that we talk to likely voters, most black Americans believe that African-Americans receive unfair treatment from police departments. That's 82 percent. White likely voters say just 30 percent.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. So blacks feel they are more scrutinized. But say you are policing in a neighborhood in New York City where Dominicans are drug traffickers. They control it. Well, who are you going to watch? This is where Holder makes his mistake. Go ahead.</p>                \n                \r\n\n            \n                <p><b>LINE:</b> Interesting points because historically as you've mentioned when you talk about New York. Michael Bloomberg. The stop and frisk issue. He wrote this long and not that long ago talking about targeting manpower in areas of high crime. And he said that 90 percent of all people killed in our city. Ninety percent of all those who commit the murders and other violent crimes are black and Hispanic. That it's shameful that so many elected officials and editorial writers have been largely silent on those facts.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Because that's not politically correct to say. And that's why racial profiling again, I will be interested to see what Holder does.</p>                \n                \r\n\n            \n                <p><b>LINE:</b> When you look at the numbers in Ferguson, it's really interesting stuff because 86 percent of the stops, 92 percent of the searchers were of black people. But the Ferguson Police Department was more likely to find contraband on white people. So, there's a lot of disparity here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. Ferguson is a bad example. That department, something wrong there. There's no question about it. All right. We have got to run. Thank you truth serum people.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Truth Serum: John Kerry misleading the US on Iran?", "description": "Eric Shawn and Molly Line break down John Kerry’s comments on Iran and Eric Holder on racial profiling", "date": "2014-12-04T13:19:55Z"}