{"vcmId": "491b5268-d8fd-4391-8672-46ac7c98b049", "url": "http://www.foxnews.com/transcript/2017/03/21/bill-oreilly-what-happened-at-congressional-hearings.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The House Intelligence Committee spent a few hours talking with FBI Chief James Comey and NSA boss Admiral Mike Rogers. It was clear from the beginning that there was a political agenda, as there always is. Republican Congress people wanting to know about the leakers, people within government giving classified information to reporters. That was their top concern.</p>                \n                \r\n\n            \n                <p>On the Democratic side, it was the Obama tap, the allegation that President Trump tweeted out. At this point, after today's testimony, there is absolutely no evidence that President Obama tapped the Trump Tower. But today, White House Spokesman Sean Spicer said, there will be more tap information forthcoming. Especially, about General Flynn's situation. Now, the fair thing here is to be fair, avoid speculation, but skepticism on this issue is warranted.</p>                \n                \r\n\n            \n                <p>In addition to the tapped business, Democrats zeroed in on two former members of the Trump campaign, hoping to link them with the Russians. First was a man named Roger Stone, who worked for Mr. Trump for two months in 2015. He was a consultant. Second was Paul Manafort, who worked for the Trump campaign for approximately five months, but did have a powerful position as campaign chairman.</p>                \n                \r\n\n            \n                <p>Democrats insinuated that both men were involved in some kind of corrupt scheme but the admiral and Mr. Cohen we would not take the bait, saying the investigation is ongoing, and they cannot comment, both men deny any wrongdoing. \"Talking Points\" will be surprised if anything comes of this Russian deal. However, that controversy is what drove President Trump to accuse President Obama.</p>                \n                \r\n\n            \n                <p>Mr. Trump is so infuriated that the media has obsessed on the Russian connection that he lashed out, trying to create a firestorm over the Obama administration's surveillance history. The problem is, there is no evidence that anything happened at the Trump Tower. There is evidence that the Obama administration surveiled journalists and even the German chancellor, but that does not go to President Trump's point.</p>                \n                \r\n\n            \n                <p>The accusation that President Obama was actively involved in harming the Trump campaign has now harm the President himself. He needs the American people to focus on the economy, the new health care proposal, border security, not alleged conspiracies. In the future, the President would be wise to embrace only facts in his pronouncements. The issue of leaks, of course, is of vital importance, but both the Comey and Rogers acknowledge that today. It was instructive to see that no Democrat on the House Committee really zeroed in on the leaks.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" expects -- expects -- the FBI to find out, not only who leaked stuff about General Flynn in the Russian ambassador, but also who violated the White House protocol of putting out the President's conversations with the Prime Ministers of Australia and the President of Mexico. If the FBI cannot do that, cannot arrest the leakers, this country is in major trouble.</p>                \n                \r\n\n            \n                <p>Summing up, Republicans want to get away from the tap thing, Democrats continue to peddle the Russia-Trump campaign situation. That is \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: What happened at the congressional hearings?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/20", "date": "2017-03-21T14:03:05Z"}