{"vcmId": "4a637316-c8a1-4bb4-81d7-dbaf2a9df6a0", "url": "http://www.foxnews.com/transcript/2015/07/29/donald-trump-and-media.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" July 28, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story\" segment tonight, Donald Trump. New monument university poll says, he's way out in-front New Hampshire among likely republican voters up there. Trump stands at 24 percent. Jeb Bush, John Kasich, seven percent. Scott Walker, seven. Marco Rubio, six. So, Mr. Trump's remarks about John McCain has not hurt him at least in that poll. Here's what I said about Trump a week ago.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He has no fear, he could not care about censoring himself, and the press does not intimidate him. So, because of that approach the media believe thy must punish Mr. Trump for being disrespectful and not cowering before them.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, some in the media said I was covering for Trump by stating what I stated. Absurd. I was speaking the truth. Roll the tape.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MAN:</b> Donald Trump, is he highjack the Republican Party? Was he hijacking -- at what point do you say, enough is enough?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MAN:</b> It is interesting how Donald Trump sticks to his guns even when he doesn't produce evidence to back off his claims.</p>                \n                \r\n\n            \n                <p><b>CHRIS MATTHEWS, MSNBC HOST, \"HARDBALL\":</b> Donald Trump has been driving the clown car for the last couple of weeks. And when it comes to the 2016 elections --</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And joining us now from Washington, Bob Cusack, editor-in-chief of The Hill. So, do you dispute the media in general despises Donald Trump?</p>                \n                \r\n\n            \n                <p><b>BOB CUSACK, EDITOR-IN-CHIEF, THE HILL:</b> I do dispute that. I think that most in the media, and there are exceptions since snarky reporters on Twitter, have given Trump a fair shake. And why, Bill? I think because he's a big story, he's an interesting story and it gets great ratings. And I think most of the media have done him well. Even though he's complained about the media. I think some of the interviews have been very fair he he's been allowed to go back at them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Let me go back to the cover of the New York Daily News which is absolutely outrageous. And, you know, I could give you a hundred of these from the print press across the country, and you're still going to tell me that the press doesn't despise Donald Trump?</p>                \n                \r\n\n            \n                <p><b>CUSACK: </b>Well, I'll tell you, Bill. If we were trying to bury him, we're not doing --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, no. It's not a matter of not covering him. They do. But they do it in an arrogant condescending vicious way. The latest is the smear I don't even want to get into it because I think it's just despicable from a left wing website about something that happened in his divorce 40 years ago or something. And it's designed to attack the man, not what the man is saying. You know that.</p>                \n                \r\n\n            \n                <p><b>CUSACK:</b> Yes, yes. Now, listen, Bill. I understand that there definitely are some examples out there without a doubt.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> A lot of them.</p>                \n                \r\n\n            \n                <p><b>CUSACK:</b> That he has been attacked. A lot of them. But I do think there are still a lot in the media who see this guy and maybe he's gotten more respect recently because he is now the front-runner and I think there has been a shift in coverage that has been more fair to Trump than maybe there was when--</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Can you give me an example of fair coverage lately outside of the FOX News Channel, which I think we've been fair here. Can you give me one other one?</p>                \n                \r\n\n            \n                <p><b>CUSACK: </b>Listen. We interviewed him last week.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. Your publication aside, anybody else?</p>                \n                \r\n\n            \n                <p><b>CUSACK: </b>Well, I think that a lot of the Sunday shows -- now, I know Chuck Todd has gone at it with Donald Trump. By I think the Sunday shows have covered him for the most part pretty fairly. And now, they're starting to -- I think that some of the media is saying, wait a minute, can this guy actually do this? Nobody in the media was saying that before.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right.</p>                \n                \r\n\n            \n                <p><b>CUSACK:</b> I think in some ways, the media is doing some reflection and saying maybe we were wrong --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The media doing some reflection. That would be almost the first since the constitution was forged. Now, you know when I read about me and that what I said about Trump's relation with the media was in the \"Tip of the Day.\" And I had the day before interviewed Donald Trump about the John McCain's situation. So, for anybody to say, I'm in a tank in trying to protect Trump is an outright lie. You saw that in various places.</p>                \n                \r\n\n            \n                <p><b>CUSACK: </b>Yes. Listen, I thought you were very aggressive in your interview with Donald Trump about his controversial comments, about John McCain, and Trump repeatedly refused to apologize but you kept pressing him. Listen, and you know this, Bill is that, you can't spend the whole interview on one topic. If he's going to keep going back --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, we got our point across and I think that he, you know, said if he had been mis-understood, he was sorry, whatever he said. The point of the matter is what that I said about Donald Trump, that many in the national media want to destroy him, they despise him, because he doesn't care what they think. It's true. Last word.</p>                \n                \r\n\n            \n                <p><b>CUSACK:</b> I do disagree. I think a lot of these reporters out there are actually enjoying this ride. And maybe a few of them are doing too much predicting instead of just reporting.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Mr. Cusack, thanks as always. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump and the media", "description": "How the press is covering the Republican presidential front-runner", "date": "2015-07-29T12:16:32Z"}