{"vcmId": "4a9a478c-5cce-402d-87cf-0be193c74827", "url": "http://www.foxnews.com/transcript/2016/10/25/bill-oreilly-donald-trump-wants-to-listen-to-him.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>On Saturday, at Gettysburg, Pennsylvania. Mr. Trump delivered a speech that promised a contract between him and the American voter. So, let's take a look at it. Republican says, he will push for term limits on all Congressional members. He will freeze hiring at the federal level. He will crack down on lobbying. And he will renegotiate trade deals that he feels are harming America.</p>                \n                \r\n\n            \n                <p>So far, nothing too dramatic. But then Mr. Trump ups the ante. Says he will stop funding sanctuary cities. Says he will remove two million undocumented immigrants, people he feels are dangerous and cancel visas from countries that won't take them back. He repeated that he will suspend immigration from terror prone regions like the Middle East. In addition, Trump promises middle class families with two children a 35 percent tax cut. Wow. He says he will spend $1 trillion on infrastructure over the next 10 years. He promises to repeal and replace ObamaCare. He says he will build that border wall.</p>                \n                \r\n\n            \n                <p>Also, Trump says he will support Kate's Law, mandatory five year prison sentences for those who illegally re-enter the U.S.A. with the felony conviction on their sheet. Now, most of these promises appeal to Republicans and are abhorrent to Democrats. So Trump is really trying to solidify his base here, which has slipped over the past few weeks. While also trying to attract Independent voters who are fed up with lax policies for immigration and national security. The question then becomes, did anyone actually hear Trump's Gettysburg speech?</p>                \n                \r\n\n            \n                <p>Again, it was given on a Saturday when most Americans are not watching TV and the anti-Trump news media gave it scant attention. What the media did trumpet pardon the pun was Trump's threat to sue some other women who are accusing him of improper conduct that was everywhere. And Talking Points believes that the election 2016 has really not served the voters well. That's a good example. There hasn't far too much hysteria, hatred, stupid partisan rumblings. Hillary Clinton and Donald Trump have opposite views of how this country should be run. That's the important thing. And anybody voting on November 8th should know exactly what those views are.</p>                \n                \r\n\n            \n                <p>Trump's contract should have been widely reported in a fair universe. But, of course, we are not in a fair universe. And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Donald Trump wants you to listen to him", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/24", "date": "2016-10-25T12:17:33Z"}