{"vcmId": "4b95213d-2a24-4031-b45d-685370078eba", "url": "http://www.foxnews.com/transcript/2015/03/09/is-president-obama-conceding-too-much-to-iran.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 6, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> In the unresolved problem segment tonight, is President Obama conceding too much to Iran in the nuclear negotiations? Several months ago, the supreme leader of Iran tweeted that our ally Israel should be annihilated. Now in the brink of a deal with the west, Iran is making a pathetic attempt to explain itself.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>REPORTER:</b> We were able to find the tweet that he referred to from the supreme leader, quote, this barrack, wolf like regime of Israel which has no crime, has no cure but to be annihilated. Mr. Prime Minister, can you understand why Jews and others would not like that kind of language?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: No, I won't because this is a regime. We're talking about Netanyahu who has butchered innocent children in Gaza. We're not talking about the annihilation of Jews, we never have we never will.</p>                \n                \r\n\n            \n                <p><b>(END OF VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Is this a regime America should be negotiating with? Joining me now, with analysis from Washington, Tom Collina, director Ploughshares Fund, a global security foundation and from Palm Springs California, my friend Rick Grenell, a former spokesman for several of America's US Ambassadors and a Fox News contributor. Tom let me start with you that were the Iranian foreign minister negotiating with John Kerry as we speak; this is a man who said he read the tweet saying Israel should be annihilated. He didn't have a good response, did he?</p>                \n                \r\n\n            \n                <p><b>TOM COLLINA, PLOUGHSHARES FUND DIRECTOR OF POLICY: </b>We can all agree we all want to stop Iran from getting a nuclear bomb. That's a shared goal. The question is, how best to get there. The negotiations that the United States and its allies are pursuing with Iran right now is the best path to get to Iran stopping a bomb from Iran and moving us in the right direction. The alternatives frankly are worse, we don't want Iran to have a bomb, we don't wanna have to use military action to stop it, and this is the best path we have right now.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> In your opinion Tom, but Rick there are other alternatives, sanctions on Iran were working by their own admission they were working. They said you got to help us out here, they're working too well. Is this the most dangerous path America could take putting a timeline on when they achieve that bomb?</p>                \n                \r\n\n            \n                <p><b>RICHARD GRENELL, FORMER ADVISOR TO FOUR US AMBASSADORS: </b>Tom just took military action off the table. With his statement, he says things like, and this is what all the liberals do. Credible threat, but we really don't want to go to war and we have the Syria example and the Ukrainian example. This Obama deal on Iran is weaker than the UN deal. The UN said, including Russia and china in 2006 that all enrichment must stop. Obama since then has taken this issue out of the Security Council, brought in the Germans because they're extremely weak on this issue to get backing and has tried to come up with a deal that allows some enrichment. It's a terrible deal and it's a very weak deal.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>And it's based on trust. We've never been able to trust them. On two separate occasions when inspectors got close, or found things within Iran that they weren't supposed to be doing, the inspectors were thrown out of the country, and then Iran said let's come back to the bargaining table and re-negotiate. You can't trust these people. Why should we start trusting them now?</p>                \n                \r\n\n            \n                <p><b>GRENELL: </b>This is not based on trust. This deal will be inspected by international monitors and verification.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>But, Tom two separate occasions international inspectors got close to seeing what they were up to, they didn't like it, and they tossed them.</p>                \n                \r\n\n            \n                <p><b>COLLINA: </b>Let's look at the track record, over the last year; Iran has been under what's called the interim deal. It has been working very well. All the aspects of that deal, you'll probably try to raise accusations that the deal hasn't been respected. Those have been discredited.</p>                \n                \r\n\n            \n                <p><b>GRENELL:</b> We just have to listen to the Iranians.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Something no one's talking about here. Why does Iran need to enrich uranium for the energy sector? They can bring a barrel of oil out of the ground for about three or $4 a barrel and produce 3.2 million barrels a day. Explain why they're so anxious to get their hands on nuclear.</p>                \n                \r\n\n            \n                <p><b>COLLINA:</b> I would be the first to agree that Iran does not need a nuclear power program, but it's their right to have one if they so choose, but only if they play by the rules. Do we have the inspections to make sure to verify</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>COLLINA:</b> It's not too late. If we get a deal going forward, then we will have stronger inspections.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Hang on, Tom I want to bring Rick in.</p>                \n                \r\n\n            \n                <p><b>GRENELL:</b> The whole idea that we're going to have inspectors that are going to somehow watch the Iranians and keep them in check is not based in reality. Let me tell you what they have reported. They've already told us the interim deal is not working. You look at all the other areas where they're doing RND.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>GRENELL:</b> That's not true. Those are false accusations.</p>                \n                \r\n\n            \n                <p><b>COLLINA:</b> Those accusations -- you're -- the information you're talking about is past. It's wrong. It's out of date.</p>                \n                \r\n\n            \n                <p>Tom, hang on. Go ahead, Rick.</p>                \n                \r\n\n            \n                <p><b>GRENELL: </b>The simple fact that the IAEA is not allowed going everywhere. When they are allowed to go in certain places and raise concerns, it's immediately dismissed by the left wingers who really just want to have a deal, any deal. And it's a dangerous...</p>                \n                \r\n\n            \n                <p>You're weaker than the UN.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> You have to consider Prime Minister Netanyahu did say this, a bad deal is worse than any deal at all. Rick and Tom, I have to leave it right there. Thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Is President Obama conceding too much to Iran?", "description": "Iran on the brink of a deal with the west in the nuclear negotiations", "date": "2015-03-09T13:30:39Z"}