{"vcmId": "4bfc6828-85ca-45b6-8b48-42677c101c2d", "url": "http://www.foxnews.com/transcript/2016/12/22/confronting-terror-around-world.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 21, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>JESSE WATTERS, FOX NEWS HOST:</b> Hi, I'm Jesse Watters in for Bill O'Reilly. Thanks for watching us tonight.</p>                \n                \r\n\n            \n                <p>Let's get right into our top story. Germany still reeling after that deadly truck attack on a Christmas market in Berlin. ISIS is taking credit for the attack leading former New York City Mayor Rudy Giuliani to slam President Obama's foreign policy legacy.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>RUDY GIULIANI (R), FORMER NEW YORK CITY MAYOR</b>: He is going out of office leaving us a world much more dangerous than the world that he was given. He was given a stable, I wouldn't say stable but relatively stable Iraq. Certainly not.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>Stable enough for him to feel good about pulling the troops out.</p>                \n                \r\n\n            \n                <p><b>GIULIANI</b>: YES. Stable enough so that he could have reduced the troops. He never should have pulled the troops out. That was pulling the plug. That opened the whole thing.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> Joining us now from Santa Fe with reaction, New Mexico Governor Bill Richardson, a former U.S. Ambassador to the United Nations.</p>                \n                \r\n\n            \n                <p>So, Governor, you disagree with Rudy Giuliani's assessment that President Obama has now handed over President Trump a very dangerous world and he himself was handed a relatively stable Middle East. Do you disagree with that?</p>                \n                \r\n\n            \n                <p><b>BILL RICHARDSON (D), FORMER NEW MEXICO GOVERNOR</b>: Well, I do disagree. Although I would have thought Rudy Giuliani would have been a better candidate for Secretary of State because he is respected abroad for his national security and counter-terrorism credentials. But, no, I think President Obama was elected. The American people wanted to get out of Iraq. That wasn't working.</p>                \n                \r\n\n            \n                <p>And he fulfilled that commitment, I don't believe that ISIS came from that decision. Donald Trump wanted to get out of Iraq. That was one of his campaign platforms.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>RICHARDSON: </b>So I disagree with Rudy. I do think President Obama had a sound military and diplomatic strategy to defeat ISIS.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Right.</p>                \n                \r\n\n            \n                <p><b>RICHARDSON</b>: But ISIS is around. They're dangerous. They are still there, Jesse.</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> Right. I know that the American public wanted to get out of Iraq when President Obama was elected. But they did not want to leave Iraq so that ISIS could take over because what happens now is ISIS is now in 30 different countries, they launched attacks in the U.S. Homeland. The Europeans streets are filled with blood now. And it's not a safe place. Syria is in civil war. Yemen is in civil war. Libya is a failed state. You cannot say that President Obama have kept things stable in the Middle East, you just can't say that.</p>                \n                \r\n\n            \n                <p><b>RICHARDSON</b>: Well, look, it's turmoil. It's disaster area. What I'm concerned about is, all right, President-elect Trump wants to defeat ISIS. He wants to destroy them. And I'm for that and I want to give him the benefit of the doubts. He is not in yet. You can't really criticize anything that he has done specifically. What I worry about, Jesse, is what he is saying that this is a clash of civilizations. He is playing into ISIS' propaganda by making this a contest between the Muslims and the west.</p>                \n                \r\n\n            \n                <p>And ISIS and Muslims, most of those that are killed are Muslims. ISIS kills them. And what we don't want to do is become a propaganda tool for ISIS by making this a clash of civilizations between Christians and Muslims and ISIS.</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> Yes. I do see what you are saying that this extreme rhetoric you believe leads to terrorist recruiting more effectively but I would argue that President Obama by twisting himself into pretzels and not labeling it Islamic extreme by basically emptying out Gitmo saying that is the way to tamp down on recruiting has not work because ISIS has exploited their ranks under President Obama's soft rhetorical approach. Wouldn't you agree with that?</p>                \n                \r\n\n            \n                <p><b>RICHARDSON</b>: Well, I think, Jessie, what is the difference between President Obama's policy and Donald Trump? So, they both wanted to destroy ISIS.</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> Well, I think President Obama wanted to contain ISIS. I haven't heard President Obama and seen President Obama trying to destroy ISIS.</p>                \n                \r\n\n            \n                <p><b>RICHARDSON</b>: I think the worry that I have is that it just can't be a military solution.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: I agree.</p>                \n                \r\n\n            \n                <p><b>RICHARDSON:</b> That could help. I think we need to bomb them military bombing which by the way, and we really need Germany here because they're probably one of the strongest military powers in Europe. What I'm concerned about is that by just talking about a clash of civilizations. By saying that ISIS is an extremist group which it is and not talking about those moderate Muslims that we are going to need. Moderate Muslim countries to fight ISIS. Muslim communities in the United States to help us root out potential ISIS sympathizers in the United States that were working against our purposes, but the reality is, you know, President-elect Trump, he is not in yet.</p>                \n                \r\n\n            \n                <p>And you know, I want to see what comes out of this military policy. All right. We are going to bomb them more. I accept that. I think that make sense. But you need diplomatic tools. You need to build a coalition of European countries. You have got to have Germany with us. And right now you know ISIS has targeted Germany because it's one of the most tolerant countries for Muslims. We need Angela Merkel --</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Right.</p>                \n                \r\n\n            \n                <p><b>RICHARDSON:</b> -- and she is being weakened by these terrorist attacks and by us saying listen, what ISIS is saying is let's bring those Muslims into ISIS and they are doing that by using simplistic language and then when we talk about a clash of civilizations, Donald Trump, that feeds into ISIS.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Got it. I understand. You want Donald Trump to be less honest about the enemy he is trying to defeat. I do understand that. I just disagree with it. Let's talk about Germany really quickly here. What's happening in Germany is the result of the migration crisis that was started by President Obama not enforcing his own red line. He said he was going to do something about it, he didn't do anything about it. We sat by and watched this humanitarian crisis unfold.</p>                \n                \r\n\n            \n                <p>We sat by and watched death after death after death in Aleppo and all over the Middle East especially in Syria. So then you feel guilty and you want to take all these refugees in but there is no way to vet these people. Merkel has taken them in. President Obama wants to take more in right now to this day. He is still opening up the flood gates. Isn't this a direct result of the vacuum of power that this president has created in Syria by not doing anything about it? You have people coming in willy-nilly, you can't check them? Wouldn't you agree with that?</p>                \n                \r\n\n            \n                <p><b>RICHARDSON:</b> Well, first of all, Angela Merkel has tightened a lot of the security points.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: It doesn't look very tight, Governor. It doesn't look very tight. They got attacked. They got seven times this year.</p>                \n                \r\n\n            \n                <p><b>RICHARDSON</b>: But secondly, I think the problem, Jesse, the problem has been Assad in Syria, he has caused this humanitarian crisis of millions coming into Europe. And Germany, yes, they're progressive country that has been humanitarian oriented, they've allowed a million in. What are you going to do with these refugees? They are dying. They are fleeing from political persecution.</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> Well, you have got to listen we want to be humanitarian, we want to keep people safe. But not at the expense of our own citizens. Governor, I have got to run. Thank you very much. I really appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Confronting terror around the world", "description": "Is President Obama's foreign policy legacy a failure? 'The O'Reilly Factor' investigates", "date": "2016-12-22T13:41:48Z"}