{"vcmId": "4c111fba-7159-4868-a6e1-4168cea0a9c6", "url": "http://www.foxnews.com/transcript/2016/11/21/donald-trump-team-begins-to-take-shape.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 18, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>ERIC BOLLING, FOX ANCHOR</b>: Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching us tonight.</p>                \n                \r\n\n            \n                <p>Let's get straight to our top story. Donald Trump's team begins to take shape. President-elect Trump today announced his choices for three key posts in his incoming administration, Lieutenant General Michael Flynn for National Security Adviser, Congressman Mike Pompeo a Republican from Kansas for the Director of the CIA. But the big announcement today is Trump's pick of Alabama Senator Jeff Sessions for Attorney General, a choice that has conservatives cheering and liberals in distress.</p>                \n                \r\n\n            \n                <p>The choice is generating so much controversy that the \"Factor\" himself, Bill O'Reilly is interrupting his day off to weigh in on the matter. Bill joins us now by phone. So, Bill, you want to first concentrate on Sessions as the A.G. nominee? What do you think of that why is it causing so much controversy?</p>                \n                \r\n\n            \n                <p><b>BILL O'REILLY, \"THE O'REILLY FACTOR\" ANCHOR: </b>Well, if you know the Alabama senator, you know, he is one of the most anti-illegal alien chaos politicians in the country.</p>                \n                \r\n\n            \n                <p>So this is a statement, first of all by Donald Trump that says we're going to go after alien criminals, all right. So -- because this guy, Sessions, former Justice Department official is going to do that.</p>                \n                \r\n\n            \n                <p>Now, for the Trump supporters that they're going to cheer, as you said, but there's going to be an unattended consequence because the open border people and the pro-migrant people who don't want any scrutiny on the situation are going to go wild, because Senator Sessions has a history of being very, very tough on this issue. So, it is going to be some controversy.</p>                \n                \r\n\n            \n                <p>But here's the irony of it all, he'll get confirmed. Sessions will get confirmed and so will Pompeo and so will the General because in 2013 Harry Reid and the Democrats put forth the so-called nuclear option where it's just a straight up or down vote in the House and Senate and so the Democrats can't stop it.</p>                \n                \r\n\n            \n                <p>So they thought that they were being clever in 2013, removing all the barriers to Barack Obama's appointments, well, now, Trump has turned the tables on them so it's going to be Attorney General Sessions.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Hey, Bill, the left is all over the place today complaining about some of the comments that Sessions had made, a couple of jokes he had made. Some of the things he had said 30 years ago. Should this weigh in on his confirmation?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, they're going to demonize Sessions because, again, it's a battle between open border pro-migrant amnesty folks on one side. And the people who want immigration law enforced on the other. And Sessions is, of course, the people who want immigration law enforced guy.</p>                \n                \r\n\n            \n                <p>So this is going to be a huge deal and they'll try to demonize Sessions, so dig up all the dirt on him. They'll throw it all out there, but it really ultimately will not matter.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: OK. One of the other big news items this week, late this week, Mitt Romney will come and meet Donald Trump over in Bedmister, New Jersey. The sit down has caused quite a stir in the non-establishment wing of the Republican Party. Your thoughts on the meeting?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, it's a surprise. And it's a smart move by President-elect Trump, because he sends a message that he's not a vindictive man because Romney obviously had some problems during the campaign, so he sends that message. I'm not vindictive.</p>                \n                \r\n\n            \n                <p>Romney could do the job of being Secretary of State. He is very smooth and he knows the world leaders. He could do the job. And it basically consolidates the moderate wing of the Republican Party because that's Romney with the Trump administration.</p>                \n                \r\n\n            \n                <p>So, to me, it's a pretty brilliant move and I don't think Romney be coming in to New Jersey if this wasn't a serious situation.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Do you think it's -- but, you know, the Secretary of State job, big job. In fact, one of Trump's most loyal supporters, Rudy Giuliani has said, \"That's the job I want.\" Do you think that's the right one for him or do you think that might cause a little bit of chaos on the right?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, I can't speak to Mayor Giuliani and his status within the Trump administration because I don't know anything about it. But I can tell you this that Romney is a pretty good dealmaker.</p>                \n                \r\n\n            \n                <p>I mean is he a Republican governor in Massachusetts so he got along with that very liberal state assembly up there and got a lot done. So in the Secretary of State position, you need someone who can convince other nations to do what the USA wants. Romney is good at that. And he's got stature overseas.</p>                \n                \r\n\n            \n                <p>So, again, it is interesting that Giuliani doesn't seem to be in the running for Secretary of State or Attorney General. So I wonder where -- maybe he'll be the Homeland Security czar. I'm not sure where that stands. But I think the Romney play, as i said, is a smart move.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Bill, we have a little bit of news that -- alleged news or a leak that David Petraeus maybe looked at for a job as well. That's not confirmed, but they call -- the Trump transition team called today national security day, A.G. Sessions we talked about, National Security Adviser Lieutenant General Mike Flynn and the CIA Director Mike Pompeo. Grade the Trump transition team's picking or Trump's picking on their national security day?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't know Congressman Pompeo, so I can't grade it, all right? I know the General a little bit. He is a tough guy. National security adviser, I mean, why not? What's the downside? I don't see it.</p>                \n                \r\n\n            \n                <p>On the Petraeus rumor, and that's all it is as you accurately reported, I think Petraeus would be pretty good as Secretary of Defense. I mean, I know he got in trouble, you know, back there with the -- giving classified information to the girlfriend, but David Petraeus is a brilliant military mind, brilliant.</p>                \n                \r\n\n            \n                <p>I mean, he saved the bacon (ph) in Iraq. He did a great job in Afghanistan. I don't know anybody more qualified to run defense than Petraeus. So, if that's true, if that rumor is true, that's another really smart move.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> So, on the surface, we are safer day one of the Trump administration or less safe day one of the Trump administration .</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Maybe it's all speculation. You know, I don't do that, Bolling. You can't ever project out on what might or could have or should have happened. I will tell you this. I think that the message was sent by Sessions that Trump isn't going to fool around with this illegal immigration deal. That's the message.</p>                \n                \r\n\n            \n                <p>If Romney is a serious player in Secretary of State, that's a positive. It also sends a message that Trump is not vindictive. He is looking to do the best for the country. And if Petraeus is in play, I think that's a brilliant move. So I would say it's a good day for the Trump administration today.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Very good, very good. Good day for the Trump administration. By the way, Sessions also had some of the ideas that you liked about immigration, illegal immigrants deporting and felonies when they've come back and commit felonies, they got to go away for a long time.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yeah. That's the Kate's Law and we assume that will pass quickly when Mr. Trump takes office.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> All right. Very good, Bill. Thank you for spending time.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, Eric, thanks for filling in for me. I really appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump's team begins to take shape", "description": "President-elect announces three key members of incoming administration; Bill O'Reilly with the latest on 'The O'Reilly Factor'", "date": "2016-11-21T13:01:10Z"}