{"vcmId": "4c5dc636-301b-4834-a596-660622bc9da5", "url": "http://www.foxnews.com/transcript/2015/06/24/how-do-american-muslims-see-jihad.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 23, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Impact Segment\" tonight: new poll about how American Muslims see the jihad.</p>                \n                \r\n\n            \n                <p>About 600 followers of Allah were asked a series of questions by the Center for Security Policy.</p>                \n                \r\n\n            \n                <p>First up, I believe that violence against those that insult the Prophet Muhammad or the Koran or Islamic Faith is sometimes acceptable. 29 percent say yes, it's acceptable sometimes. 61 percent disagree with that.</p>                \n                \r\n\n            \n                <p>Two: violence against Americans here in the U.S.A. can be justified as part of the global jihad. 25 percent agree. 64 percent disagree.</p>                \n                \r\n\n            \n                <p>Muslims in America should have the choice of being governed according to Sharia, 51 percent agree. 32 percent disagree.</p>                \n                \r\n\n            \n                <p>Joining us now from Portland, Oregon Harris Zafar, spokesman for the Ahmadiyya, Muslim community there. And from Phoenix Dr. Zuhdi Jasser, president of the American Islamic Forum for Democracy.</p>                \n                \r\n\n            \n                <p>The one that is a little disturbing, Doctor, we begin with you, is the 25 percent that say, you know, look, if there is a holy war, violence against Americans legitimate. 25 percent of the 600 that's 150, right?</p>                \n                \r\n\n            \n                <p><b>DR. ZUHDI JASSER, AMERICAN ISLAMIC FORUM FOR DEMOCRACY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's a little off-putting, is it not?</p>                \n                \r\n\n            \n                <p><b>JASSER:</b> Oh, it is. And I'm so glad this study is getting and I'm glad you are paying attention to this. Because Americans need to understand that the violence is not the problem. That's the tip of the iceberg.</p>                \n                \r\n\n            \n                <p>And we are learning from this, which is what our organization was founded on back in 2003, that the solution is to separate mosque and state. Sharia is the instrument of the Islamic state. So, American Muslim community as diverse as we are, the adherence, the allegiance to Sharia as law above state like ours, a secular state that separates Church or Mosque and State is very important to understand that's the tip of the iceberg.</p>                \n                \r\n\n            \n                <p>And until we empower Muslims that are that other 75 percent, that 70 percent that rejects that we are going to see where is the continuum going?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It's 51 percent that say sharia law should be the reigning law. I feel a lot of that is because some Muslim Americans weren't born here, they came here from other places where Sharia was in place.</p>                \n                \r\n\n            \n                <p>How do you see this, Mr. Zafar?</p>                \n                \r\n\n            \n                <p><b>HARRIS ZAFAR, AHMADIYYA MUSLIM COMMUNITY:</b> Well, Bill, the way I see this is this survey really underscores the two major points that the Ahmadiyya Muslim Community has been advocating for decades. Number one that although the vast majority of Muslim here in America are peaceful there is a great need for everyone -- Muslims, non-Muslims and extremists like terrorists and neo-conservatives to understand the true teachings of Islam.</p>                \n                \r\n\n            \n                <p>And number two, leadership matters because it influences the people that are the members which is why it's significant as the case point that Calipha or the Calipha -- the Calipha of Islam, his holiness Mirza Masroor Ahmad who leads the largest organized body of Muslims in the world has constantly called for exactly what you are saying that Sharia is not meant to be an instrument of coercion.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. But at 51 percent. Look, most people don't understand the Muslim community in America because there are so few Muslims here. And in many parts of the country there aren't any. But if you have 51 percent of American Muslims saying, you know what, we respect Sharia law more than American law. That sends a message they are not fully assimilated in America Mr. Zafar.</p>                \n                \r\n\n            \n                <p><b>ZAFAR:</b> Yes. So there is two things we said. One is that those people clearly either don't know the U.S. constitution or don't know Sharia law. If I was polled, I would even say yes, too. Because the U.S. Constitution is the most Sharia compliant constitution in the world because it advocates for the freedoms, the liberties that Islam champions.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No punishment under Sharia law would never see the light of day here.</p>                \n                \r\n\n            \n                <p>Go ahead, Doctor, what do you say?</p>                \n                \r\n\n            \n                <p><b>JASSER:</b> I mean those apologetic that denial is the exact problem that this study is trying to change. As long as we focus just on the violence and we say somehow this apologia of the compatibility -- this is nonsense. Most of the studies around the world show 90 percent adherence in states like Egypt and Afghanistan. So therefore we have to engage the fact that when you have 25 percent of three million, which is hundreds of thousands of Muslims that adhere to this the Sharia state that pulls and radicalizes Muslims towards ISIS.</p>                \n                \r\n\n            \n                <p>If we are going to have a strategy that we recommend to our government to counter radicalize it has to be not only engaging the violence but engaging the shariazation if you will the Islamic state.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Let me give Mr. Zafar the last word to be fair. Go ahead, sir.</p>                \n                \r\n\n            \n                <p><b>ZAFAR: </b>Thank you. I agree with everything you said w Which is why you will find that the Ahmadiyya Muslim Community -- the oldest Muslim organization here in North America -- has continually advocated for the Islamic principles which we ask everyone to join us on, which is non- coercion, absolutely justice and the separation of mosque and state. We've been here the longest, we've been saying that for a very long time --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. No jihad -- right? No holy war to establish Islam.</p>                \n                \r\n\n            \n                <p><b>ZAFAR:</b> Absolutely. The founder of our community promised messiah said that the jihad by the sword is dead, now jihad by the pen reigns.</p>                \n                \r\n\n            \n                <p><b>JASSER:</b> But you can't talk out of the both sides of your mouth. We have to acknowledge the problem.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Wait, wait. Let's net get into that. He said what he said. We'll let it stand.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "How do American Muslims see the Jihad?", "description": "New poll on the Islamic faith in the United States", "date": "2015-06-24T12:24:38Z"}