{"vcmId": "4ca1a8c0-1bc7-40cd-862d-1c6c55e0ed46", "url": "http://www.foxnews.com/transcript/2015/01/15/exposing-islamic-extremists.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 14, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And now I have to do something that pains me deeply. I did say \"orange\". His shirt was yellow. Now, I have to take Beckel to dinner. I'm old, you guys know it. You're seeing me just collapse here.</p>                \n                \r\n\n            \n                <p>All right. In the \"Impact Segment\" tonight, there's a group called The Clarion Project which is dedicated to exposing the dangers of Islamic extremists. Recently we asked Clarion to pinpoint for us five dangerous situations here in the U.S.A.</p>                \n                \r\n\n            \n                <p>With us, Ryan Mauro, national security analyst for the Clarion Project. So you have many, many more than this but we pick the top five that I think will be of interest.</p>                \n                \r\n\n            \n                <p>The first one is in Hancock, New York -- about 145 miles northwest of Manhattan. What's going up in Hancock?</p>                \n                \r\n\n            \n                <p><b>RYAN MAURO, CLARION PROJECT: </b>There is actually a place there called Islamburg. They have a sign that says \"Welcome to Islamburg\". It's about a 60, 70-acre large compound and it's the headquarters for a group calls Muslims of the Americas that follows a radical cleric in Pakistan. The videotape that on the screen is something that was given to me by law enforcement stores showing them engaging in guerrilla warfare training at that Islamburg compound.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. So Islamburg upstate New York, they have weapons, it's private property.</p>                \n                \r\n\n            \n                <p><b>MAURO:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. They are training on the property. Can the authorities do anything about it?</p>                \n                \r\n\n            \n                <p><b>MAURO: </b>Beyond monitoring them, no because they are not listed as a foreign terrorist organization. FBI documents that we have obtained do show that they consider them a threat. But because they don't have that designation, they are able to operate in the U.S. and we --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you know how many people are up at this compound.</p>                \n                \r\n\n            \n                <p><b>MAURO: </b>A specific one, no but the estimate is over the number of members that this group has across the country. They say they have 22 of these places across the country. It's somewhere around 3,000.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Training ground -- wow. All right. Now we have the Dar'el Harah (ph) Islamic Center in Falls Church, Virginia. What's going on there?</p>                \n                \r\n\n            \n                <p><b>MAURO: </b>Right. A history of leadership over there. Anwar al Awlaki used to be their Imam before he went over and he joined al Qaeda. And there was even video tape that was taken of the current imam speaking recently in Virginia where he specifically said that Muslims should be first in line to get the arms for jihad.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So at this center, in Falls Church, there is an imam there presently.</p>                \n                \r\n\n            \n                <p><b>MAURO:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Who wants to get arms for the jihad?</p>                \n                \r\n\n            \n                <p><b>MAURO: </b>He preaches that that is a requirement upon Muslims.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Wow.</p>                \n                \r\n\n            \n                <p>All right. The third one is the one I mentioned last night in Brooklyn, New York with John Stossel. It's the Naheed al-Taqwa Mosque. What's going on here?</p>                \n                \r\n\n            \n                <p><b>MAURO:</b> That's led by Siraj Wahhaj, one of the most radical imams in the country, yet he manages to be a rock star speaking at Muslim events across the country. Even at college campuses.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He is going to be in Dallas this weekend in Garland, Texas for a big conference. I brought that up to the imam we had on last night who didn't seem to think this guy was so radical.</p>                \n                \r\n\n            \n                <p><b>MAURO: </b>He didn't address that. He was addressing the issue of whether he has been prosecuted which is a whole another thing. If you look at what he's been preaching it's sheer anti-Americanism, turning America into a caliphate. And his mosque is even suing the NYPD because they are conducting surveillance on him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's right that de Blasio pulled off. This is a bad hombre there, as I said to (inaudible) last night.</p>                \n                \r\n\n            \n                <p>Then there's another one in New York City. This is Jamaica Queens -- the Islamic Circle of North America. What's this all about?</p>                \n                \r\n\n            \n                <p><b>MAURO: </b>This is a major organization with origins in Pakistan with an Islamist group over there. Only about two percent of Muslim-Americans say that this group represents them. But they are one of the most well- organized there. One of the leaders was actually indicted on war crimes in Bangladesh and we have a copy one of their teaching guys that tells Muslims to engage in deception in order to advance the jihadist cause and to implement Sharia governance.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Then this comes outs of Queens, right? Out of this mosque?</p>                \n                \r\n\n            \n                <p><b>MAURO: </b>That's the headquarters, yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's the headquarters. All right. Finally and this the most controversial one, have you CAIR, the Council on America Islamic relations, they have been on this program. They do a lot of media. What are you saying that they are a dangerous group?</p>                \n                \r\n\n            \n                <p><b>MAURO:</b> Yes. They are basically a political influence operation of the Muslim Brotherhood, according to the Justice Department not according to me. They specifically listed CAIR as an entity of the U.S. Muslim Brotherhood, specifically its Palestine committee that was secretly set up to advance the Hamas agenda. And the FBI wiretapped their leaders in 1993, talking about setting up CAIR, so they could influence the media in their direction.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And that's what they do. They come out and they say look, we are moderates and we just want to give you our point of view. But you say that they are directly tied into terrorist groups?</p>                \n                \r\n\n            \n                <p><b>MAURO:</b> Into the Muslim Brotherhood, yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- which is a terrorist group.</p>                \n                \r\n\n            \n                <p><b>MAURO:</b> Right. And Hamas is the Palestinian wing of the Muslim Brotherhood.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok.</p>                \n                \r\n\n            \n                <p>Now, final question is, this is pretty frightening stuff but you would assume the FBI knows about all of this if you know about it. And the Justice Department is surveiling them and have them under control. And in a free and open society, this is the rest of them that we didn't talk about, this is the map -- all of these have radical Muslim mosques or operations in all of those towns.</p>                \n                \r\n\n            \n                <p>And it's amazing. Look at them, Sacramento, outside of L.A., Pittsburgh, Chicago, on and on. So, my question is, should Americans be concerned or is this under control?</p>                \n                \r\n\n            \n                <p><b>MAURO:</b> It can't be under control just through monitoring them. And again when it comes back to the issue of the ideology which President Obama refuses to recognize.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>MAURO:</b> That's a problem here. It's not just about the person that's setting off the bomb. It's about the overall ideology that combines mosques and state that justifies jihad anywhere. And we need Muslim leaders to step up and fight against those interpretations. The most positive news I have seen is the poll that show that these organizations have so little support among Muslim Americans.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right. All right. Very interesting, Mr. Mauro. Thank you for coming on.</p>                \n                \r\n\n            \n                <p><b>MAURO:</b> Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Exposing Islamic extremists", "description": "The Clarion Project pinpoints five dangerous situations here in the USA", "date": "2015-01-15T13:14:27Z"}