{"vcmId": "4ca8ad31-6c5a-4451-8510-e2dc94bf96be", "url": "http://www.foxnews.com/transcript/2016/10/11/fallout-from-heated-trump-and-clinton-face-off.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 10, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Continuing now with the lead story, analyzing last night's debate. Joining us from Washington, Charles Krauthammer. Where am I going wrong, Charles?</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, SYNDICATED COLUMNIST</b>: Well, you're mostly right which in and of itself is a surprise. You know, and actually is a high point. But his reference to Lincoln, that was essentially a play on the Lloyd Benson line. That was essentially him saying, I knew Abe Lincoln. Abe Lincoln was a friend of mine and you are not Abe Lincoln. I thought that was extremely effective and it appeared spontaneous.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. It was.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> His low point was something that you seemed to brush off as something that would only concern the left. When you look at your opponent and you threaten to put your opponent in jail, you have gone way over the line of political decency in this country. That's not Hitler, Stalin. That's Banana Republic.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. I disagree.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: That's what happened -- but let me just -- I have a thought. I want to finish it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Go ahead. Go ahead.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> And that is, we have had 250 years of miraculous transfer of power which is done peacefully and consensually. The one thing we don't do is to put people in jail or to execute them. In other countries, your life can be on the line in elections. And we had a long history where you don't even talk about that. The breach of that etiquette, of talking about I'm in personally order, a special prosecutor, incidentally, the law wouldn't even allow that. But nonetheless, and then you would be in jail, as if he's pre-judging it, is something that should never be done and there is another example of Trump lowering the level of our discourse.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. I disagree because, number one, he has to play to a certain voter. All right? Who does believe that Mrs. Clinton got away with a national security violation that no one else would have gotten away with. Millions and millions of those voters out there. So, yes. You're right. He can't put anybody in jail if he's president. You can't just sign an executive order was it incarcerated, but certainly he would have the power to his Justice Department would to reopen an investigation that the government deemed to be not credible. He does have the power to do that and I wasn't offended by that so much in the sense that I knew it was a quip off the top of his head which, you know, and I think it helped him. I really believe that helped him.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: You always defend Trump by saying, he said \"x.\" Oh, perhaps it was not the right thing to do. Maybe it was --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Oh, you didn't believe he literally was going to put him in jail, did you?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: But he was appealing and it works for him. Works for him is different from saying, it's the right thing to do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Charles.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: The low point of the convention was the crowd saying, lock her up.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: That's not the peace civility.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We want civility and we on this program as you well know have stayed out of the swamp. But you can't tell me that you thought that Donald Trump was saying, if I'm elected, I'm going to incarcerate this woman like I would do in an inquisition. He was making a point that there would be a special prosecutor, the e-mail thing would be reopened because, again, many, many millions of Americans feel that this was the fix was in. That another president, Barack Obama, made sure that it wasn't an honest investigation did not take place. So, I hope we have a tradition in this country of honest investigations and that's how I took it.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Look. One of the presidents that we retroactively revere is Gerald Ford. In a situation with Nixon who was clearly guilty but he understood it would heal the country and that in America you don't put ex- presidents in jail. It cost him the presidency which makes it a profile encourage. But here we can all agree there was obviously way overstepping the line. He would have been impeached and all that and he probably would have been convicted.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But there's a difference.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> It's understood in this country that you don't put political losers in jail.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It's a difference. It's more than political losers. In the Watergate situation, the system worked. All right? The investigation led to wrongdoing on the part of Richard Milhous Nixon. All right? Now, what Ford did and I support that as a historian, you're absolutely right. He said it doesn't get us any further as a nation to punish this man. So I'm going to pardon him. But this is different because this investigation and there's a lot of evidence to point to this was a fraud.</p>                \n                \r\n\n            \n                <p>It was a fraud because of politics. So if Trump's going to go in and say, I want an honest investigation, if I'm elected I am going to see it happens, I don't think that's a cheap shot thing.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: It's worse than a cheap shot thing and you're probably right that it works at his base, and in one sense you could say, yes, this is allowing the justice to go ahead but the idea that you threaten your opponent with jail and he used the word jail, I didn't. It's to me is a breach of the decency of our system where we don't do that --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Even where it might be warranted as in the Nixon case.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I will cede that. There are two sides to this story and I'm glad we had this debate because you'll see this nowhere else on television.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: That's right. That's why I'm here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You'll never see it. But I'm going to stick to my guns. I don't believe that was an honest investigation into Hillary Clinton's e- mails. And as an American citizen I do not want the highest levels of our government, the President, the Attorney General and the FBI, to be in the tank on an investigation of this import. If I was president, I'd do the exact same thing. Last word.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Look. I understand the will to do that. I simply believe that there are certain limits to political discourse. And to what you do to your opponent. And in this case, it was something that you -- have you ever heard a presidential candidate ever threatening another with that kind of legal -- and he's done it with others. He said to the guy, owner of Chicago White Sox who put the money --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Cubs.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: -- in the campaign against him, he said he's got business things. He better watch out if I'm president.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't like the threats either.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: That is not unique to him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> And that's what he is doing and that's a misuse of the powers of the presidency.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Charles Krauthammer, everyone.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Fallout from heated Trump and Clinton face-off", "description": "Charles Krauthammer analyzes the second presidential debate on 'The O'Reilly Factor'", "date": "2016-10-11T12:21:43Z"}