{"vcmId": "4cdaf65d-85cb-4be3-9534-1df050d3f80f", "url": "http://www.foxnews.com/transcript/2015/06/23/hate-groups-in-united-states.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 22, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Unresolved Problem Segment\" tonight: hate groups. You can find them on both sides of the spectrum as stated -- Black Panthers, KKK, American Nazi Party, idiots like that. Two op-eds in the \"New York Times\" today, however, try to convince readers that far right terrorism is on the rise and should be considered almost at the same level as extreme Muslim terrorism.</p>                \n                \r\n\n            \n                <p>Joining us from Irvine, California Professor Brian Levin director of the Center for the Study of Hate and Extremism at Cal State.</p>                \n                \r\n\n            \n                <p>So I'm looking for some perspective here, Professor. How influential are these far right hate groups?</p>                \n                \r\n\n            \n                <p><b>BRIAN LEVIN, CENTER FOR STUDY OF HATE AND EXTREMISM: </b>Great question. They are influential but in a different way than groups in the past. In the 1920s, the Klan had 4.5 million members; about one in eight people in the electorate was tied to the Klan. That's no longer the case.</p>                \n                \r\n\n            \n                <p>So they are much more likely today to inspire violence than to orchestrate it. And they are also interested in hitting angry, unstable people to maybe do acts like we have seen in Charleston but, also, to get their conspiratorial and racist message over the fence into Web sites on the mainstream as well.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. But my reporting over the years classifies them as fringe groups -- fringe, not mainstream. You have to seek them out. Is that accurate?</p>                \n                \r\n\n            \n                <p><b>LEVIN: </b>Yes. But there is this kind of middle ground of groups that have a veneer of mainstream acceptability but spout conspiracy theories and falsehoods so we classify those as hate groups even though they may appear not to be.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. But a guy like David Duke has got his organization in Louisiana. David Duke doesn't have any cache in this country, does he?</p>                \n                \r\n\n            \n                <p><b>LEVIN: </b>No. Not anymore. And you made a great point. Of what we have seen is a shift away from the brick and mortar organized hierarchical leadership-driven hate groups like the Ku Klux Klan of the 80s or more. Two more leaderless type groups. We have seen some of the major groups. Aryan Nations, National Alliance, and many Klan factions actually implode where they're now serving as much as a vessel for folklore and inspiration than they are as a membership entity.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So that's what I thought because the hate (INAUDIBLE) up in Idaho, they fell apart. They have these Nazi compound up there with some nutty reverend they are gone. There is a group the Council of Conservative Citizens that donated money this guy Holt is the head of it in Texas. Donated money to some conservative Republican candidates, all of whom are now returning the money. What's this crew?</p>                \n                \r\n\n            \n                <p><b>LEVIN:</b> Oh, and rightly so. Stay away from this crew if you are running for office. It started in 1985 with a guy named Gordon Bound who was against integration of public schools. And what they did is they had used the mailing list from the White Citizens Councils which were a Klan enabler. Kind of like Klan in suits. At their peak they had 15,000 members. And interestingly enough they gained a fair amount of political traction in the South. But now they're verboten, forget it -- I mean they spew racial hatred.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. So they're on the downside. Final question.</p>                \n                \r\n\n            \n                <p><b>LEVIN:</b> Yes, they're a group that masquerades as a conservative group but they are really a hate group.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But they're not. They're extremists.</p>                \n                \r\n\n            \n                <p><b>LEVIN: </b>Stay away.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. You heard Professor Helmand, which we used to use her on this program but she got too radical so we couldn't anymore at Occidental College, say hey white supremacy is everywhere. It's actually moving the dial in America. How do you respond to that?</p>                \n                \r\n\n            \n                <p><b>LEVIN: </b>Well, look, I think today what we have is a much more diffuse type of bigotry. I sat in Reverend Vivian's at one time -- the civil rights legend and he said today a lot of this stuff is subtle and nuanced. What I think we have to do is to be careful. One thing we know about prejudice it has a direction, who is it directed at and a depth.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>LEVIN: </b>And we have to be careful not to buy into stereotypes that label people who may -- who are certain targets for aggression by hatemongers. And most hate crimes are committed by thrill offenders who are not hardened bigots but are acting on the desire for excitement and peer validation and stereotypes but their prejudices are very shallow. That's what we have to be careful of and these implicit biases which all of us have.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, Mr. Levin, thank you as always. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Hate groups in the United States", "description": "How much of a threat do domestic hate groups pose?", "date": "2015-06-23T12:10:48Z"}