{"vcmId": "4ddc176f-bcc3-4746-85f2-01dd52f14f08", "url": "http://www.foxnews.com/transcript/2016/02/27/analyzing-winners-and-losers-gop-debate-in-houston.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 26, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I watched him repeat himself five times four weeks ago. Now, let me tell you, he was a meltdown.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> I watched you repeat yourself five times five seconds ago.</p>                \n                \r\n\n            \n                <p><b>(AUDIENCE CHEERING APPLAUDING)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I watched him meltdown on the stage like I have never seen anybody.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE SPEAKER</b>: Let us stay focused on the subject.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I would probably take him out of swimming pool.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE SPEAKER:</b> Let us talk about your plans.</p>                \n                \r\n\n            \n                <p><b>SEN. MARCO RUBIO, (R-FL) PRESIDENTIAL CANDIDATE</b>: Well, I see him repeat himself every night. He says five things: Everyone is dumb.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE SPEAKER</b>: Senator Rubio.</p>                \n                \r\n\n            \n                <p><b>SEN. RUBIO:</b> He is going to make America great again.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE SPEAKER</b>: Senator Rubio.</p>                \n                \r\n\n            \n                <p><b>SEN. RUBIO:</b> We are going to win, win, win.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE SPEAKER:</b> Senator Rubio, please.</p>                \n                \r\n\n            \n                <p><b>SEN. RUBIO:</b> He is winning in the polls. .</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE SPEAKER:</b> Please stop.</p>                \n                \r\n\n            \n                <p><b>SEN. RUBIO:</b> And the lines around the states. Every night same thing.</p>                \n                \r\n\n            \n                <p><b>(AUDIENCE CHEERING AND APPLAUDING)</b></p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Continuing now with our lead story, analyzing the republican debate last night. Joining us from Washington, Kirsten Powers. What stood out for you?</p>                \n                \r\n\n            \n                <p><b>KIRSTEN POWERS, FOX NEWS ANALYST: </b>Well, obviously Ted Cruz and Marco Rubio came ready to tangle with Donald Trump, finally. And, I think that Rubio in particular was particularly strong on that front. He was able to do it while, you know, with a smile on his face and seeming very confident and not getting rattled by Trump.</p>                \n                \r\n\n            \n                <p>But, at the same time, Trump did not really get rattled by it. And, I think Trump had a really strong night. He was -- We did not see a lot of the stuff that we saw in the pre-South Carolina debate where he seemed sort of borderline unhinged. He seemed very calm and very strong. And, on that stage, I do not think they were really able to get him off of his game.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Do you think in the day like that Donald Trump convinced his people to support him or that he really has to do is keep his supporters there with him?</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> I think in the debate like that last night, he is not just keeping his supporters with him. I think when he has an appearance like that, where he seems very reasonable. He is willing to disagree with the Republican Party on certain things like Planned Parenthood, like universal healthcare is somebody who I think is probably appealing now to a group of people, who little bit of a general election, frankly, but I also think people who are, you know, maybe not with him already.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right, Chris Christie endorsing Trump. Do you think that matters?</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>I think that is a big deal, yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Big deal?</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Yes. Yes, it is.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Big deal.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Yes, he is obviously. Look, he is respected. He is not the top republican. He would not have had to drop out if he had been, but he is still respected. He is a governor. He is somebody who, I think people take seriously. And, that he is willing to put his support behind Trump, gives him sort of the being -- this guy is legit.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Because Rubio has gotten a lot of endorsements. Cruz not so many. But, yes, OK. I agree that having a sitting governor who is a Presidential candidate is very blunt.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Christie will help him. Hillary Clinton's sound by the about Trump today was very, very interesting. And, you know that Mrs. Clinton does not do anything spontaneous. And,I am not saying that as a dig.</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But, you know, she says, \"All right, I am going on the morning show and here is what I want to get out. And, she knows the questions. I do not know if they tell her the questions but she knows where it is going. So, she goes, \"You know, he used to be a real reasonable guy. We really had fun, Bill and I with him and he used to be OK. But, now he is a monster.\"</p>                \n                \r\n\n            \n                <p><b>(LAUGHING)</b></p>                \n                \r\n\n            \n                <p><b>POWERS: </b>Wow!</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, I do not think she would have said that if she did not think he was going to get the nomination. She is setting the tone like I do not know what happened. He is a werewolf and it was a full moon and he just gouged six people's throats out and I never knew he was a werewolf.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Yes. Well, look, I think a lot of people think Donald Trump's going to be the nominee and if you remember, Hillary Clinton you have to prepare for that possibility, that very high possibility. She also has to explain why she used to be friends with him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, because he was nice back then.</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>So, that is the story that she has come up with.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right.</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>That all this stuff did not exist, and now --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, you are agreeing with me that this was a strategic plan.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Put it out there, because now we did not think it was going to happen, but now I will make a prediction.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: OK.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know, Trump, if he does get the nomination, he is going to go after her like nobody has ever gone after a political candidate.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Maybe John Adams, Thomas Jefferson, people do not know how much they hated each other. OK. But Hillary is not going to do it herself. She has a little army of assassins that she has hired. All right? And, they are going to do it, the media matters people. The sleazy far left websites, and a few other people, I do not see her getting involved with that kind of invective, do you?</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: No, I do not. But, I also do not know that I do not care how big her army is. I do not know that it is going to make much difference. And, frankly, what Trump is going to do to her is going to be so much worse than anything they are going to come up with against time.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But, that is going to work to her advantage, because women may say, you know, she might make her sympathetic if he overdoes it.</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>Sure, definitely. But, I think that those women are probably already with her. You know, I think that the problem for her is that he is going to bring up things that nobody brings up.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> And, so, she is going to have to answer questions that she has never had to answer before.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But, she will not answer. She will not answer. I can guarantee it.</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>If she is on a debated stage with him, it is going to be harder, I think.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, it is not. She will just say this that, \"I am not going to answer these kind of questions. This is about policy. He can say anything he wants, but I am not lowering myself to that.\" I know she is going to do that.</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>Well, she may do that. But, the problem is, there are a people in this country, who actually do not think it is lowering your standards to answer a question.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Absolutely. But, they probably voted her anyway. She has to maintain her base. All right, her base is -- and we are going to discuss that with Bolling and Rivera coming up. She has a pretty good base. I have to say. Kirsten Powers, everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Analyzing winners and losers of the GOP debate in Houston", "description": "'The O'Reilly Factor' examines the state of the Republican Party ahead of Super Tuesday", "date": "2016-02-27T22:17:30Z"}