{"vcmId": "5015562b-7b2f-442a-b727-73995526da10", "url": "http://www.foxnews.com/transcript/2015/04/29/unrest-in-baltimore.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 28, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Hi, I'm Bill O'Reilly. Thanks for watching us tonight.</p>                \n                \r\n\n            \n                <p>The \"Talking Points Memo\" about who the big loser is in the Baltimore riots will be in our next segment.</p>                \n                \r\n\n            \n                <p>But first up tonight: the latest from Baltimore City. Public schools were closed today, tomorrow they will be open. The Baltimore Orioles have postponed a game for the second straight night.</p>                \n                \r\n\n            \n                <p>The situation this evening is tense - thousands of police officers and National Guard, patrolling the nation's 26th largest city. Tonight, there is a curfew in Baltimore 10:00 p.m. to 5:00 a.m. So far there have been more than 250 arrests. No official stat on people injured yet. No one killed but one remains in critical condition. Property damage will be in the multi-millions. Finally, at least 20 Baltimore police officers have been injured.</p>                \n                \r\n\n            \n                <p>As you may know the riots began after 25-year-old Freddie Gray was borrow idea last night. On April 19th Gray died from a sever injury that he may have sustained after being arrested by Baltimore police. Six officers have been suspended with pay but information about exactly how Mr. Grey was hurt has been scant. That's one of the reasons people are angry.</p>                \n                \r\n\n            \n                <p>Last night all hell broke loose as you know. And Fox News correspondent Rick Leventhal was right in the middle of it.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> Who's going to make sure you all pay?</p>                \n                \r\n\n            \n                <p>I suppose you'll all pay?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Really?</p>                \n                \r\n\n            \n                <p><b>(EXPLETIVE DELETED)</b></p>                \n                \r\n\n            \n                <p><b>RICK LEVENTHAL, FOX NEWS SENIOR CORRESPONDENT: </b>Whoa, watch out.</p>                \n                \r\n\n            \n                <p>We're trying to cover the news, bro.</p>                \n                \r\n\n            \n                <p>(EXPLETIVE DELETED).</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>All right. All right.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Joining us now from Baltimore, Rick Leventhal as well as Fox News correspondent Leland Vittert.</p>                \n                \r\n\n            \n                <p>All right, Rick, let's begin with you. What's the situation where you are right now?</p>                \n                \r\n\n            \n                <p><b>LEVENTHAL:</b> Well, it's somewhat tense, Bill. Nobody really knows what to expect when the sun goes down and that curfew kicks in. We have a line of SWAT Team officers here from Baltimore City. And they've been supplemented by SWAT teams from area counties including Anne Arundel and Montgomery County and Prince George's County.</p>                \n                \r\n\n            \n                <p>We know state police are here and the National Guard as well. But I want to point out there are also civilians lined up in front of those police officers, members of the community who are trying to prevent trouble by getting between the people who are out here demonstrating and the police officers.</p>                \n                \r\n\n            \n                <p>So you have sort of two lines here creating a buffer, if you will. And there are people out here in the streets that are demonstrating but in many cases it's been sort of a party-like atmosphere banging on drums and people dancing in the streets and that sort of thing, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Now, while you were talking a guy popped up behind you with a mask -- are there are a lot of masked protesters out there? Because that's the signal that these people might do some damage?</p>                \n                \r\n\n            \n                <p><b>LEVENTHAL:</b> There is a young person with a mask on right here. We have seen some of that. But we have also seen a lot of people who are holding signs suggesting there should be peace and chanting that there should be peace. And, again, Bill, it's been very different today than it was yesterday and last night. We have seen none of the police officers being attacked and the officers having bricks and rocks thrown at them. And we're not seeing cars burned or businesses burned.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is that because there is a stronger police and National Guard presence that they can't do it now?</p>                \n                \r\n\n            \n                <p><b>LEVENTHAL: </b>Well, that may be part of it. But there has been a big strong push from community leaders as well to get here and talk to people and reassure them and encourage them to behave themselves -- that seems to be having some effect as you can witness from the line of people who are here between the crowd and the police officers.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok.</p>                \n                \r\n\n            \n                <p>Leland, let's go to you. How far are you away from Rick and what's going on where you are?</p>                \n                \r\n\n            \n                <p><b>LELAND VITTERT, FOX NEWS CORRESPONDENT: </b>We are on -- it appears to be on the other side of those police lines and this was action alley last night Bill where we were. The police, the armored cars are up there. This back down here is where the liquor stores were looted and those kinds of things.</p>                \n                \r\n\n            \n                <p>This is a little seedier area and part of town. We have seen a lot of folks walking up, beginning to taunt the police officers. This isn't really the peaceful side of these protests.</p>                \n                \r\n\n            \n                <p>And as the sun has gone down over the past hour or so you get a sense that there is a level of anger that is beginning to bubble up. You are starting to feel it. The police are getting a little bit tenser out here. The kids are leaving the streets. And you are getting the same kind of guys out yesterday that we had and you see people walking around possibly with balaclavas and things to pull over their face and that kind of thing.</p>                \n                \r\n\n            \n                <p>And as you pointed out, Bill, that was really the tip off last night when things were going to really go south. We saw kids pulling their masks down.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right. Now, did the police take any action against people they feel are troublemakers or stirring things up because last night they kind of let the agitators. And I know that Rick just reported that there are a lot of community people who are, you know, they are actively trying to work with the police. But there are also agitators. And if the agitators start, the police move in quickly or do they let them vent?</p>                \n                \r\n\n            \n                <p><b>VITTERT:</b> Well, they certainly didn't move in quickly last night. We were watching liquor stores get looted as the people who were trying to keep the peace were praying and then the police were walking back. They walked from where I am standing right now back that way and watched the liquor stores that are about 75 yards in front of me get looted.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>VITTERT:</b> So not much was done by the police last night. The question is it going to be different tonight? And there may not be a new sheriff in town but it feels like the sheriff is giving slightly different orders tonight. These police officers seems a lot more ready --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes and there's more numbers.</p>                \n                \r\n\n            \n                <p><b>VITTERT: </b>-- and a lot more angry.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, the numbers are bigger with the National Guard as I pointed out and more police officers not only from Baltimore but around areas.</p>                \n                \r\n\n            \n                <p>Rick, we will end with you, did you feel you were in any danger last night in the sequence that we showed earlier?</p>                \n                \r\n\n            \n                <p><b>LEVENTHAL: </b>I did, Bill. It was definitely unsettling, and it was also disappointing because we really wanted to tell stories, we wanted to be able to talk to the people. Instead we got yelled at and attacked, got bottles thrown at us over our head and smashed at our feet. And they made it very clear that we were not welcome there. So it was --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Who is doing that?</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Who is --</p>                \n                \r\n\n            \n                <p><b>LEVENTHAL: </b>I assume they were people who lived there. There were people gathered on door steps in front of homes and there are people in windows and groups of younger people in front of some of those building that just started chucking bottles at us. I don't know who they were. But, you know, they were in the neighborhood and they didn't want us to be there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What's the average age of the people that you have been confronting who are protesting, not the people who are trying to help? What's the average age of the protests?</p>                \n                \r\n\n            \n                <p><b>LEVENTHAL:</b> It's a cross section bill. I mean there are little kids out here and there are older people and a lot of, you know, young men in their teens and 20s and young ladies as well. So I mean it's a real cross section of the community.</p>                \n                \r\n\n            \n                <p>I would say that the agitators, the ones who are causing the most trouble were definitely teenagers and young adults.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. All right, guys, we really appreciate it. You are both doing excellent job out there and it's dangerous.</p>                \n                \r\n\n            \n                <p><b>VITTERT: </b>Thank you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We really appreciate your professionalism and your bravery.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Unrest in Baltimore", "description": "The latest on the fallout from the death of 25-year-old Freddie Gray", "date": "2015-04-29T12:12:04Z"}