{"vcmId": "51342832-4881-4915-beb4-378ea888d01a", "url": "http://www.foxnews.com/transcript/2015/10/27/far-left-falsehoods-impacting-american-lives.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 27, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Continuing now with our lead story: big lies affecting all of us. Joining us from Washington, Charles Krauthammer -- you heard my \"Talking Points\" and the interview with the doctor. You say?</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, SYNDICATED COLUMNIST</b>: Look, I think I'm feeling a little bit more mellow than you are. Of course, that's not unusual. But, on -- there is another untruth that's out there about law enforcement. You might call it a lie. I think it's more of a myth. And that is that the sentencing is disproportionately rough, the automatic sentences, the mandatory sentences and are aimed at blacks.</p>                \n                \r\n\n            \n                <p>The fact is that those sentences were imposed in the 1990s with Bill Clinton as president probably the most anti-racist president we have had in our lifetime, genuinely not a racist and was supported by the Black Caucus. It was aimed at crack cocaine which was utterly devastating neighborhoods most particularly inner city neighborhoods.</p>                \n                \r\n\n            \n                <p>Now, there is some people now left and right, Republican and Democrat who a quarter century later say it's draconian. Perhaps it overshot. And, of course, it's less serious. There are other epidemics right now. But that's myth number one.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The reason the crack epidemic subsided was because of the stringent sentencing and then the people got out of that business.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> I agree with you. It's no coincidence.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No it wasn't a coincidence. And it worked.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> That when you increase the incarceration rate you decrease the crime. You know, the famous headline in the \"New York Times\" which said crime rate drops yet imprisonment rises and the \"New York Times\" ran that as a puzzle and it wasn't until paragraph 15 that they said well there is a theory that if the criminals are in jail then perhaps the crime rate will go down.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok. Now, the myth if you want to put it -- I say it's a lie all right -- that big time narcotics traffickers are nonviolent. When you see all of the devastation, physical devastation wreaked on people, yes. Nobody forced them to buy the stuff but if you consider that as Barack Obama does a nonviolent offense, you are living in a world of your own. You are not in the real world.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Look, I agree with you completely and compounding that myth or lie if you prefer is the idea that somehow the majority of these drug offenders are guys who are smoking dope.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I know, it's less than 1 percent.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> You know, having a joint. It's 1 percent. And if you look at all the incarcerations in the country -- they're overwhelmingly, of course, in the state and local prisons -- 87 percent of all prisoners, the majority of those are violent crime.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's right.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> 20 percent are property crime. And you have got 13 percent are drug crimes -- 16 percent are drugs of which 12 of the 16 are drug dealers, 3.5 percent are drug users.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And the users --</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> And as Heather MacDonald --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right. It's Heather MacDonald. We have to give her credit.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> -- plea bargain.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, they plea bargain down from the dealing to the possession and they let them do it.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> They make it sound like it's a guy with a Friday night (inaudible).</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. So it's a fraud. It's a lie, a fraud, a myth and it's being perpetuated by the President of the United States.</p>                \n                \r\n\n            \n                <p>Now here is another one, Kate's Law. Can you believe these people out in San Francisco saying that because I would like to have a mandatory sentence for somebody who defies deportation with an aggravated felony conviction that I'm demonizing gardeners and house painters? This is what they are throwing out there? That is an outrageous lie. An outrageous lie.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> I will get less mellow on that one because that is obviously an untruth. And it's also a slander because you are not talking about ordinary illegal immigrants. You are talking about felons. In fact, the only objection I have, I support Kate's Law, but I think more important Kate's Law is so narrow it's not going to have a large effect. The sanctuary cities is a much larger --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. And I hope that gets passed. But you have a much harder problem.</p>                \n                \r\n\n            \n                <p>But here's the thing about Kate's Law that you may be overlooking. Number one -- gives law enforcement a tool to break up the drug gangs because many of them are run by people who have been deported, ok, with aggravated felony. Number one, they can go in and break these foreign drug gangs up.</p>                \n                \r\n\n            \n                <p>Number two -- it's a deterrent for coming back here. It's a deterrent. When these people know that they are going to be picked up and they're immediately going to go for five or more -- all right -- maybe they won't come back.</p>                \n                \r\n\n            \n                <p>Last word.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> But Bill, the last word is this: a bigger deterrent is to know that if you go to any of these 600 jurisdictions, big cities and small towns where they have declared in advance they're not going to cooperate with the law of the land of deportation -- that is the biggest loss. And that is a big invitation (ph).</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But that's the big battle we have to fight because of the Democratic Party. It's a big battle.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> That's hanging a sign out outside the U.S. saying come on in to these cities and we won't touch you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We are a country of anarchy. Come on down.</p>                \n                \r\n\n            \n                <p>All right, Charles. Thank you very much. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Far-left falsehoods impacting American lives", "description": "Charles Krauthammer joins 'The O'Reilly Factor' to react to political narratives that negatively influence the country", "date": "2015-10-27T12:15:23Z"}