{"vcmId": "53371042-81d2-4fdb-824c-7f30213cc219", "url": "http://www.foxnews.com/transcript/2015/09/08/bill-oreilly-changing-republican-party.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Donald Trump held a press conference today here in New York City, telling the world he will not run as a third party candidate. Mr. Trump believing he will win the GOP nomination outright and that he is the man to turn the country around.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Our country can be doing much better. We have deficits that are enormous. We have all bad trade agreements. We have an army that the head said is not prepared. We have a military that needs help end especially in these times.</p>                \n                \r\n\n            \n                <p>Nothing works. Our country doesn't work. Everybody wins except us.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> According to Real Clear Politics average of national polling here's where the Republican field stands today. Trump leading with 27 percent, followed by Dr. Ben Carson 13 percent, Jeb Bush 9 percent, Ted Cruz 7, Marco Rubio 6 -- all the other candidates follow.</p>                \n                \r\n\n            \n                <p>In 13 days the second Republican debate will be held and that, of course, will influence the polling. Now some pundits say it's still early -- that's not true. The first vote in Iowa just about five months away.</p>                \n                \r\n\n            \n                <p>Now, there is no question the Republican Party is changing. Few expected a populist like Donald Trump to be dominating the campaign. But millions of Americans are very angry about what President Obama has done and how the Republicans have failed to counter it.</p>                \n                \r\n\n            \n                <p>Mr. Trump's signature issue is illegal immigration as you know. He was smart to seize upon that as every fair-minded American understands our southern border is a mess, and immigration in general chaotic.</p>                \n                \r\n\n            \n                <p>For decades, both parties have been unwilling to solve is the problem. Trump says he will solve it in dramatic ways. So standard politicians like Jeb Bush, for example, find themselves up against the man who has literally nothing to lose who says pretty much anything he wants, taking no prisoners, rhetorically speaking. Trump's posture has again changed the Republican Party.</p>                \n                \r\n\n            \n                <p>The other aspect is the rise of Dr. Ben Carson, polar opposite to Trump in personality. Carson is a political outsider as well who also speaks straight but softly.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BEN CARSON (R), PRESIDENTIAL CANDIDATE:</b> Well, of course black lives matter, but what I feel is that instead of people pointing fingers at each other, and just creating strife, what we need to be talking about is how do we solve the problem in the black community of murder?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Carson's entry into the race is problematic for liberal America. An African-American, he grew up in poverty, no father in a tough Detroit neighborhood. Through hard work Carson graduated from Yale and then the Michigan School of Medicine. He became a skilled neurosurgeon.</p>                \n                \r\n\n            \n                <p>The fact that so many Republicans admire Dr. Carson completely trashes the far left line that the GOP is a racist party. We'll get to that in our second block tonight.</p>                \n                \r\n\n            \n                <p>Summing up, the rise of Trump and Carson mean traditional Republican campaigning is over probably for the best.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The changing Republican Party", "description": "Bill O'Reilly's Talking Points 9/3", "date": "2015-09-08T12:14:31Z"}