{"vcmId": "53b9f69d-fb54-4643-b6d4-e269bbffe025", "url": "http://www.foxnews.com/transcript/2015/07/14/supporting-kate-law.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" July 13, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Continuing now with our lead story: an exclusive interview with the parents of Kate Steinle who was murdered in San Francisco by criminal illegal alien. So far about 400,000 of you have signed a petition posted on BillOReilly.com that we will deliver to the Senate and the House asking for Congress to pass Kate's law.</p>                \n                \r\n\n            \n                <p>That proposed law would mandate, mandate that any illegal alien convicted of a felony in the U.S.A. who comes back to this country after being deported would serve a mandatory five years in federal prison upon apprehension. Second offense 10 years. The key word is \"mandatory\" -- no wiggle room. The debate over whether non-felons who defy deportation should be part of the bill's procedure is underway but the vital part is keeping the felons off the streets of America. We are hoping to get one million Americans to sign a petition on BillOReilly.com which, again, we will deliver to Speaker Boehner and Senate Majority Leader Mitch McConnell.</p>                \n                \r\n\n            \n                <p>Re-joining us now from Pleasanton, California Kate's parents, Liz Sullivan and Jim Steinle.</p>                \n                \r\n\n            \n                <p>So I'm talking to you over the weekend, Mr. Steinle and you indicate you do support Kate's law. Why?</p>                \n                \r\n\n            \n                <p><b>JIM STEINLE: </b>Well, I support Kate's law because it would be a legacy in her name and her death would not go unnoticed. For an apolitical family we keep up with politics because we're citizens of the United States. And, you know, we feel the federal, state, and cities -- their laws are here to protect us but we feel that this particular set of circumstances and the people involved, the different agencies let us down.</p>                \n                \r\n\n            \n                <p>We are just a little tired of the finger pointing and just want to see some action and if Kate's law saves one person, then it is all for good.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And that's very well said, Mr. Steinle.</p>                \n                \r\n\n            \n                <p>Ms. Sullivan, that's exactly what I was trying to do. If it saves one American -- one American family that does not have to go through Ms. Sullivan what you are going through right now, then Kate's law is worth it. It should be done. It's only fair. And our laws are supposed to protect us not only from foreign felons but from domestic felons.</p>                \n                \r\n\n            \n                <p>We can do this -- I think it will happen. That is one of the reasons we wanted you to come on tonight. Do you have any thoughts about it, Ms. Sullivan?</p>                \n                \r\n\n            \n                <p><b>LIZ SULLIVAN: </b>You just want it to be a good, solid law that won't have holes in it. And I'm sure there will be a lot of posturing back and forth. I had no idea how many people have been killed by illegal aliens. And we've had quite a few people reach out to us and we had no idea it was an issue but something definitely needs to be done.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. The number is in the thousands.</p>                \n                \r\n\n            \n                <p><b>JIM STEINLE:</b> Bill, if I may add --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure, Mr. Steinle, go ahead.</p>                \n                \r\n\n            \n                <p><b>JIM STEINLE: </b>If I may add, the family wants to be involved in the language of the law so we have a sense of Kate within the law. That's very important to us.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, I think what we would like to do is bring you both to Washington to talk to the congressmen and the senators who are putting the law together. They go on vacation in August. I think when they come back we will get you both to Washington to talk to them face to face. Maybe to testify in front of some committees there so you can have input and we will report every step of the way.</p>                \n                \r\n\n            \n                <p>I think you are absolutely right that this law is named after your daughter and you should have input into it. So we are going to make that happen for you. It will be at our expense and we will fly you into Washington and we'll set up the meetings for you. Would that be ok for you guys to do?</p>                \n                \r\n\n            \n                <p><b>LIZ SULLIVAN: </b>That would be wonderful.</p>                \n                \r\n\n            \n                <p><b>JIM STEINLE:</b> That would be fantastic.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. Because we will make that happen.</p>                \n                \r\n\n            \n                <p><b>LIZ SULLIVAN: </b>Kate would be proud. Kate would be proud.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, we are doing it for her. We are doing it for you and we're doing it for all Americans.</p>                \n                \r\n\n            \n                <p><b>LIZ SULLIVAN: </b>Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I have researched your daughter. You know, I'm thinking if my daughter were shot dead, I mean I don't know how you guys can even sit for this interview. I don't think I could do it. I think you have so much courage.</p>                \n                \r\n\n            \n                <p>And I think that courage and I think your perspective has to be heard in Washington. You know, I will go so far as to say that I would like to get the President of the United States to talk to you as well. We will work on all of that. We will do it in early September when they come back rested from their vacation.</p>                \n                \r\n\n            \n                <p>In the meantime we want everybody to go to your Web site. And I know millions of people will. I know they will because Americans are a good people and we are concerned on a very, very intimate basis with crime victims and families that are suffering the way you are.</p>                \n                \r\n\n            \n                <p>So I'm going to each give you a last statement. Ms. Sullivan, you go first.</p>                \n                \r\n\n            \n                <p><b>LIZ SULLIVAN: </b>Well, you know, it's just a horrific situation and we find that it has touched so many other people and you just wanted to pay forward. You want to pay it forward and you want to make it so much better for everybody in the United States that this as you say would never happen again.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Steinle?</p>                \n                \r\n\n            \n                <p><b>LIZ SULLIVAN: </b>That's our hope.</p>                \n                \r\n\n            \n                <p><b>JIM STEINLE: </b>Well, it just -- again, our faith has kept us strong and the people have kept us strong. But Kate's bright light, you know, the battle of evil and goodness, what happened to Kate was evil personified but her bright light that has shone all over the world, has helped us and this show us and the people of the world, the United States and everywhere with this law that goodness trumps evil any time. And she was a kind person and we're hoping to just keep her legacy alive.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, thank you both. I can't tell you how much it means to the country. I would like to say from me and from the vast majority of Factor viewers that our prayers are with you and your family.</p>                \n                \r\n\n            \n                <p>Thanks again. We will be in touch.</p>                \n                \r\n\n            \n                <p><b>LIZ SULLIVAN:</b> Thank you.</p>                \n                \r\n\n            \n                <p><b>JIM STEINLE: </b>Thank you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We will continue this. We're not going to let this go.<br> &#160;</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Supporting Kate's Law", "description": "Part 2 of Bill O'Reilly's exclusive interview with Kate Steinle's parents Jim Steinle and Liz Sullivan", "date": "2015-07-14T12:37:32Z"}