{"vcmId": "54beb814-915b-4f9a-ba19-504b59a76199", "url": "http://www.foxnews.com/transcript/2016/03/03/how-would-ted-koppel-cover-donald-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 2, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Personal Story\" segment tonight. Legendary Anchorman Ted Koppel has interviewed thousands of people. Even though he is out of the dated age T.V. grand, he is closely following what is happening in America.</p>                \n                \r\n\n            \n                <p>Mr. Koppel also the author of the book \"Lights Out: A Cyber Attack, A A Nation Unprepared, Surviving The Aftermath\", \"New York Times\" best seller. He joins us now from Washington. So, let us assess Donald Trump. I have interviewed him a number of times. Not an easy interview. How would you do it?</p>                \n                \r\n\n            \n                <p><b>TED KOPPEL, FORMER ABC NEWS ANCHOR: </b>You know something, Bill, you and I have talked about this general subject many times over the years. It is irrelevant how I would do it. And, you know who made it irrelevant? You did. You have changed the television landscape over the past 20 years. You took it from being objective and dull to being subjective and entertaining.</p>                \n                \r\n\n            \n                <p>And in this current climate, it does not matter what the interviewer asks him, Mr. Trump is going to say whatever he wants to say as outrageous as it may be. And, the fact of the matter is his audience as much as anything is not even a television audience. It is an audience on Twitter. They deal in messages of 140 characters or less, which keeps it nice and simple.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK. But, you know, your old network ABC does interview Mr. Trump on a regular basis.</p>                \n                \r\n\n            \n                <p><b>KOPPEL</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And, you know, it comes in. And, you got to come in with a strategy with him. You have got to come in with sharp questions. And, you are right, maybe his supporters do not care what he says.</p>                \n                \r\n\n            \n                <p>However, our job, whether I am a commentator or a reporter, is to get as much information, number one, and two, show the viewer who the person really is. So, again, I will go back to he is sitting on \"Nightline,\" you are opposite of him. How do you do it?</p>                \n                \r\n\n            \n                <p><b>KOPPEL: </b>Well, the first way you do it is not in the interview. You do it by some reporting. It is an old fashioned concept, but I think demonstrating who and what Mr. Trump is and what his various policies really amount to is something you do not do in an interview, and he does not answer the questions.</p>                \n                \r\n\n            \n                <p>I have seen any number of your colleagues and mine ask him very pointed questions and do it in a perfectly professional and reasonable fashion. He just ignores the questions. When is the last time you have heard Donald Trump spell out a real policy on anything?</p>                \n                \r\n\n            \n                <p>Other than \"We are going to be the biggest. We are going to be best. We are going to be the greatest. I am going to negotiate the best deals you have ever seen.\" There is no substance in any of that. And, nobody among his followers seems to care about that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It is true that he is getting a pass because he is not a traditional politician and he is appealing to emotion, which is a brilliant strategy in this age of dissent in America. Bernie Sanders is doing the same thing. I mean, let us be honest. Bernie Sanders' programs are just as wild as some of Mr. Trump's programs.</p>                \n                \r\n\n            \n                <p><b>KOPPEL</b>: No, but he is coming in a poor second and Trump is way ahead the pack.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right. Right.</p>                \n                \r\n\n            \n                <p><b>KOPPEL: </b>So, it does make a difference.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>KOPPEL</b>: Nobody is able to hold Donald Trump to account, because he is not playing by the traditional rules.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is that a smart thing for him to do that if he wants to be president?</p>                \n                \r\n\n            \n                <p><b>KOPPEL</b>: It has obviously been an incredibly smart thing. I mean I do not want to pretend that I have been predicting all along that he is going to win, quite the contrary. I could not imagine that he would win. At this point, I find it hard to believe that he will not. I still think that the republicans are going to do everything they can to take it away from him at the convention if needed be.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But, as I said, if they do that, they lose election, because millions of Trump voters will say, \"You know what? The fix is in.\" And, Trump, himself, would run on a third party if that happened and then would destroy the G.O.P.</p>                \n                \r\n\n            \n                <p><b>KOPPEL</b>: He might, but, you know, Bill, I think what they are more worried about right now --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Senate and house.</p>                \n                \r\n\n            \n                <p><b>KOPPEL:</b> -- is the senate and losing the house.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. But with all of that defection, all of the republicans who support Donald Trump not voting for any republican, so, you know, you have got to be very, very careful. Now, would you, as an anchorman, you obviously do not approve of Donald Trump.</p>                \n                \r\n\n            \n                <p>And I tell everybody, look, because he gets angry at me sometimes because I will have commentators on the program that do not like Trump. And, I point out, \"Listen, it is their opinion, all right? And, they are entitled to their opinion and I am being fair and I ask their opinion and I challenge.\"</p>                \n                \r\n\n            \n                <p>But, I have just as many on who like Trump as Andrea Tantaros than do not. But, you are in the chair now, not when you were back at Nightline but now today, with all the things that you pointed out, it is a whole different ballgame on cable T.V., commentators like me have just ruined the country. I cop to that.</p>                \n                \r\n\n            \n                <p><b>KOPPEL</b>: That is true, you have.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. I have ruined everything. Although, journalists outnumber the commentators by about 50 to 1. And, maybe the journalists are not as powerful as they should be. But, anyway, would you show your disdain at certain point for a certain candidate? It should not have to be Donald Trump. It could be Bernie Sanders. It could be anybody. Under these new rules in television is that allowed?</p>                \n                \r\n\n            \n                <p><b>KOPPEL:</b> No. I do not like the new rules of television and, quite frankly, I do not think I would adhere to the new rules of television. It is not a question of what I personally\" think. It is a question of whether there is any substance there.</p>                \n                \r\n\n            \n                <p>You ask me what questions I would ask, I think the first thing that has to be demonstrated is, a little bit of journalism. Go into some of the details of who and what Mr. Trump actually is. What those policies amount to, and then after you have laid it out, you remember on nightline that is what we used to do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That is what you do. You opened up the piece.</p>                \n                \r\n\n            \n                <p><b>KOPPEL</b>: Sure. Exactly. A five or six minute piece that lays out the issues. Then you talk to the candidate and you say, \"Why is it that we do not have anything more than just fluff?\"</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK. But the problem is that now, the network news on the three, CBS, NBC, ABC, perceived to be liberal. So, the people that you might want to persuade are saying, \"You know what? They do not like them.\"</p>                \n                \r\n\n            \n                <p>And, they are going to twist their reporting and it is same thing with the \"New York Times\" and the \"The Washington Post\" that a lot of the straight reportage that used to be accepted is now questioned because of this perceived liberal bias, correct?</p>                \n                \r\n\n            \n                <p><b>KOPPEL</b>: And, the fact of the matter is, Bill, you deserve both credit and you have to accept responsibility. For the past 20 years, as I said at the outset, you have been changing the landscape. The fact of the matter is, it is hard to believe these days but 30 years ago, a television network Anchor Walter Cronkite was the most trusted man in America. There is not a man today, yourself included, on television, as an anchor who is trusted by anything approaching a majority of the American people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, I did get in the Gallup poll most admired in the top ten. Anyway, look, I am an honest guy.</p>                \n                \r\n\n            \n                <p><b>KOPPEL: </b>That is because you are tall and handsome.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, thank you. But, you know, I am an honest guy or you would not be sitting there. And, whether I have done anything, I always try to be fair and I try to bring the folks a straight story.</p>                \n                \r\n\n            \n                <p>Ted, thanks very much, as always. We appreciate it. Very provocative.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "How would Ted Koppel cover Donald Trump?", "description": "Legendary news anchor joins 'The O'Reilly Factor' to analyze how the national media is reporting on the GOP front-runner", "date": "2016-03-03T20:22:50Z"}