{"vcmId": "56a48225-74e1-4a5c-8f94-0b55b1a7ef35", "url": "http://www.foxnews.com/transcript/2015/10/08/will-bowe-bergdahl-face-desertion-charges.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 7, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Factor Follow-up Segment\" tonight, the military trial of Sergeant Bowe Bergdahl on desertion and other charges -- you may know the back story, the Sergeant leaving his unit in Afghanistan, captured by the Taliban who tortured him according to an army investigation.</p>                \n                \r\n\n            \n                <p>Bergdahl was traded for five imprisoned Taliban commanders, a great deal for that terror crew. An army general now deciding whether Bergdahl should go to trial.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington, Lieutenant Colonel Tony Shaffer who's following the story for us.</p>                \n                \r\n\n            \n                <p><b>LT. COL. TONY SHAFFER, LONDON CENTER FOR POLICY RESEARCH:</b> Yes, sir.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, a few weeks ago I said the fix is in that they are not going to put the sergeant in prison. Now I understand the army newspaper \"Stars &amp; Stripes\" has some new information. What is it?</p>                \n                \r\n\n            \n                <p><b>SHAFFER</b>: Mr. Fidell, working I believe with \"Stars &amp; Stripes\" reported that essentially the Article 32 hearing Bill that you just referred to was very favorable and that when the defense Mr. Fidell and company presented the information that General Dahl came up with is that the story is Bowe Bergdahl deserted his post to go 19 miles to find a general to report the wrongdoing in his chain of command.</p>                \n                \r\n\n            \n                <p>And so they're saying that that circumstance, that mitigating circumstance is going to be what's necessary to allow for General Abrams, the deciding official to say he's already suffered enough, nothing more to see here, time to move on. Perhaps some sort of discharge, less than honorable, dishonorable -- something along that line without any further action.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's what I think is going to happen, too. But the excuse that Bergdahl went 19 miles into Apache territory which is what they call the bad guy territory to report some disenchantment he has with the American command.</p>                \n                \r\n\n            \n                <p><b>SHAFFER</b>: That's correct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I mean nobody is going to buy that. It makes the army look foolish.</p>                \n                \r\n\n            \n                <p><b>SHAFFER</b>: It's a lie. Bill -- it's a lie.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But everybody's going to know that. Can't they come up with a better excuse?</p>                \n                \r\n\n            \n                <p><b>SHAFFER</b>: Well no, they can't.</p>                \n                \r\n\n            \n                <p>And look, Catherine Herridge has reported time and time again the factual evidence. I've had sources telling us what actually happened time and time again. Bill, this is what's going on. You see his defense attorney Mr. Fidell doing what his job is to -- try to try this in the media, with that said.</p>                \n                \r\n\n            \n                <p>And he says, you know, the prosecution didn't push back on any of this. They did. They laid out factually what actually what happened.</p>                \n                \r\n\n            \n                <p>This is the kicker. Let me read it here. \"His personal judgment and decision jeopardized the overall mission.\" That is from one of the senior generals, one of my mentors has said. Nothing has changed here. So let's divide what has to come next which essentially is court-martial which I think will happen and what the punishment should be.</p>                \n                \r\n\n            \n                <p>Fidell is trying to blur it all together. So Bill, I think the army is going to do the right thing here. I think they're going to move forward with some level of accountability first. And then you decide what the punishment should be.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I'm not so sure the army will do the right thing. The fact that at this point we have a crazy story. Look, I feel bad for the guy. He was tortured by the Taliban. And that will be the mitigating circumstance.</p>                \n                \r\n\n            \n                <p><b>SHAFFER</b>: After the court-martial.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He was tortured. You want to put him in jail after he's tortured. It was his own fault he was tortured but still.</p>                \n                \r\n\n            \n                <p><b>SHAFFER</b>: Exactly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: He was tortured.</p>                \n                \r\n\n            \n                <p>All right. There's another case that's troubling.</p>                \n                \r\n\n            \n                <p>Army Green Beret Sergeant Charles Martland roughs up an Afghan police official because the Afghan was raping a little boy, which is kind of common in Afghanistan --</p>                \n                \r\n\n            \n                <p><b>SHAFFER</b>: Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> As horrible as that is. So this Green Beret did the right thing and now the army is punishing him.</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> It's bizarre. Look, I and others come to the army trying to defend core values. One of the core values is in a situation like that, Bill, you defend those you are trying to protect. Children in Afghanistan are part of who we are trying to protect. And you have one of these thugs, who by the way, the homosexual acts we're talking about, pedophile, you know, is common there.</p>                \n                \r\n\n            \n                <p>But this sergeant did the right thing. He stood up for our values of what we believe to be correct and then what happened was he was given what we call a letter of reprimand. The technical term, the informal term is it was bad paper. And what's happened is because the army is cutting back, because the army is trimming down any piece of bad paper even in this case where the bad paper was not deserved. His actions were correct for the circumstance he faced --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But now, I understand the army is back pedaling on that because of bad publicity.</p>                \n                \r\n\n            \n                <p><b>SHAFFER</b>: A little bit. Because the pressure from Congress, because they've said, look, you have basically 60 days to go to the Army Board of Corrections and try to get the bad paper removed which then resets everything in motion. He may still end up getting kicked out. At least the bad paper may come out</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, he's not. If he gets kicked out, I'm going to go on a jihad against the army. This is outrageous.</p>                \n                \r\n\n            \n                <p><b>SHAFFER</b>: I'll join you. I'll come with you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I think that they have to right this wrong. The army should not -- they should promote him.</p>                \n                \r\n\n            \n                <p><b>SHAFFER</b>: Yes. I'd put him in a leadership position. Make him a sergeant major -- absolutely. Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right, Colonel. Thanks very much.</p>                \n                \r\n\n            \n                <p><b>SHAFFER: </b>Thanks.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Will Bowe Bergdahl face desertion charges?", "description": "Lt. Col. Tony Shaffer on possible mitigating factors in the military trial and the Army postponing a planned discharge of Green Beret; 'The O'Reilly Factor' investigates", "date": "2015-10-08T12:17:34Z"}