{"vcmId": "58a21ea0-8b26-4d88-8078-a039873f5289", "url": "http://www.foxnews.com/transcript/2014/10/13/greg-gutfeld-panic.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>On a flight from Philly to somewhere better than Philly an idiot told fellow passengers that he had Ebola. Causing the plane to sit for hours as men in hazmat suits came to pull the creep off.</p>                \n                \r\n\n            \n                <p>What a metaphor for the media, a sweaty entity that knows fear, gets eyeballs, after all Ebola is way more interesting than the rotavirus which kills thousands of children daily.</p>                \n                \r\n\n            \n                <p>Now that goof ball on the plane got hauled away but the hysterics in the media get to stay. Take Joan Walsh who blamed Thomas Duncan's death on Rick Perry's Texas. I blame that idiocy on Joan Walsh's brain. Now disease is spread by many things but hysteria is every bit as contagious and a mother pulling her kid out of school in Dallas has a greater risk of getting in a car accident than the kid getting sick.</p>                \n                \r\n\n            \n                <p>And we don't help by describing anyone who coughs as having Ebola like symptoms. The Dallas deputy who had Ebola like symptoms has now tested negative as flu season arrives, Ebola like symptoms will be as common as flu-like symptoms because for the most part they look alike.</p>                \n                \r\n\n            \n                <p>So take a breath and remember flight 370 where 239 people disappeared. We yakked until we were blue in the face on that story. Then we stopped. The moral? If you worry about Ebola now, remember, something worse is coming your way. Like the \"Sex in the City\" sequel.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Greg Gutfeld: Panic", "description": "Greg Gutfeld examines the panic surrounding the spread of the deadly Ebola virus.", "date": "2014-10-13T13:54:03Z"}