{"vcmId": "5991b3d6-6ab3-4a59-996f-6288a864d286", "url": "http://www.foxnews.com/transcript/2015/12/08/bill-oreilly-why-obama-administration-is-losing-war-on-terror.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Last night the President addressed the nation but did not change his strategy in the war on terror at all. Mr. Obama finally admitted though that ISIS is major threat but then he fell back on his belief we are actually defeating the terrorists. As \"Talking Points\" has said before, Mr. Obama may be delusional. The simple truth is the President does not want to fight and he does not want to bring the fight to the savages.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> -- be drawn once more into a long and costly ground war in Iraq or Syria. That's what groups like ISIL want. They know they can't defeat us on the battlefield. ISIL fighters were part of the insurgency that we faced in Iraq. But they also know that if we occupy foreign lands, they can maintain insurgencies for years.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No serious analyst wants to occupy Muslim countries. That's not a smart strategy but quick strikes on the ground and safe zones can be established. Mr. Obama should be sophisticated enough to know that.</p>                \n                \r\n\n            \n                <p>But here is the real deal. The U.S.A. is losing the terror war because the President of the United States will not fight it effectively. Once the Seals killed bin Laden, Mr. Obama packed it in with the exception of an occasional drone strike.</p>                \n                \r\n\n            \n                <p>Don't believe we are losing? Consider this. We need security at airports that cost billions of dollars and adds hours to everybody's travel. All large public celebrations in this country must be guarded by a massive police presence. Our intelligence agencies spend billions monitoring dangerous jihadists all over the world.</p>                \n                \r\n\n            \n                <p>Every single American has been affected. The national debt is skyrocketing. Our personal security in doubt. Just ask the good people of San Bernardino.</p>                \n                \r\n\n            \n                <p>In the face of all of that, what has the Obama administration really done? Retreated. That's what they have done. Don't believe me again just ask the former CIA chief and defense secretary Leon Panetta. That stalwart Democrat served Mr. Obama for four years -- he will give you an earful and he is not alone.</p>                \n                \r\n\n            \n                <p>Let's look at the facts. Mr. Obama pulled all U.S. troops out of Iraq thereby allowing the Shia government in Baghdad to marginalize the minority Sunni population in that country. Angered, the Sunnis allowed ISIS sanctuaries where they gathered strength much like al Qaeda did in Afghanistan before the 9/11 attack.</p>                \n                \r\n\n            \n                <p>Mr. Obama then ignored the growing threat, even as ISIS began controlling thousands of square miles of territory. Even though the President knew all that, he still told the world the savages were the junior varsity.</p>                \n                \r\n\n            \n                <p>Finally the President announced a 65-nation coalition to fight ISIS but few nations showed up. The phantom coalition was a pr stunt, a ruse. The President ordered bombing but placed so many restrictions on the action it didn't drastically affect ISIS at all.</p>                \n                \r\n\n            \n                <p>Also Mr. Obama refused to send modern weapons to the Kurds who are fighting for their own lives against ISIS. Just recently that has changed. But the President did spend $500 million arming and training pro-American Syrian rebels. The result: four or five battle-ready individuals, four or five for $500 million. When asked about that Mr. Obama said well, I never really liked the program in the first place.</p>                \n                \r\n\n            \n                <p>Even after the terror attacks in Paris and California, the President refuses to bring NATO into the fight, will not crush the ISIS command and control center in Raqqa, Syria and will not even admit the U.S.A. is at war with Islamic terrorism. Time to do that -- Mr. President.</p>                \n                \r\n\n            \n                <p>Also, time to be honest with the American people. We are not containing the jihad and the world is a much more dangerous place since you, Mr. President, took office. Somebody alert the media.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Why the Obama administration is losing the war on terror ", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 12/7", "date": "2015-12-08T13:14:48Z"}