{"vcmId": "5aa558ba-518f-4e76-9d13-70d406d7d788", "url": "http://www.foxnews.com/transcript/2015/02/19/bill-oreilly-judeo-christian-philosophy-versus-jihad.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>We received thousands of letters from clerics all over the U.S.A. after our discussion last night about the holy war. And on this Ash Wednesday it is appropriate to define the worldwide conflict between Muslim fanatics and nearly everybody else.</p>                \n                \r\n\n            \n                <p>As you may know, President Obama is a reluctant warrior, not willing to define the jihadist atrocities as anything other than criminal actions. The President does not even use the words \"Islamic terrorism\" for fear of offending good Muslims around the world.</p>                \n                \r\n\n            \n                <p>Now, some of you believe Mr. Obama is a Muslim sympathizer. Others on the far right even say he's an actual Muslim. There is absolutely no evidence to back that up.</p>                \n                \r\n\n            \n                <p>Today the President issued a statement marking Ash Wednesday, quote, \"Lent is a season of sacrifice and preparation, repentance and renewal. We remember those who are suffering including those persecuted for their faith. We join millions in deepening our faith as we look toward the Easter celebration,\" unquote.</p>                \n                \r\n\n            \n                <p>In that statement the President describes himself as a Christian. However, once again the President does not say who is persecuting people for their faith. That would be the jihadists primarily.</p>                \n                \r\n\n            \n                <p>It's important to understand that ISIS and al Qaeda want -- want a worldwide war against the U.S.A. and infidels in general. They want us to attack them on the ground. They believe such a military campaign would mobilize millions of other Muslims into the final worldwide confrontation they seek -- the long predicted ultimate holy war. That must understood when developing a plan to defeat, not downgrade, defeat these Muslim killers.</p>                \n                \r\n\n            \n                <p>There is no question that critical mass has been reached. Here's what Reverend Franklin Graham said last night.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>GRAHAM: </b>This is something that the White House doesn't understand the religious aspect of this. And these men are doing what they are doing because they think they are pleasing God because the Koran teaches this. Islam says you can have slaves. Islam says that you can cut the heads off of people, that you can kill Jews and Christians and Yazidis and anybody else that doesn't believe like you.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, with all due respect for Reverend Graham most Muslims don't accept the fundamentalist view of the Koran -- just as most Jews and Christians don't accept that slavery is permitted in the Old Testament. But an honest person, an honest person has to know that millions of Muslims do accept Sharia law and the human rights violations that come along with it in the name of their God. They do accept jihad and the atrocities that go along with that.</p>                \n                \r\n\n            \n                <p>Those Muslims have to be dealt with when they start murdering men, women and children as they are doing now. In our Judeo-Christian nation, murder is the worst crime -- taking a human life unacceptable unless in self-defense. But in some parts of the Muslim world murder is justified if you are a nonbeliever or even if you believe in another tenet of Islam.</p>                \n                \r\n\n            \n                <p>And now the fanatics who do believe that are on the march. And President Obama's reaction is confused to say the least.</p>                \n                \r\n\n            \n                <p>Last night \"Talking Points\" called for the American clergy to speak this Friday, Saturday, and Sunday about the moral obligation to protect innocent lives from fanatical killers.</p>                \n                \r\n\n            \n                <p>Many of the clergy have responded directly to me. Pastor Brad Dertichi (ph), Palm Beach Gardens, Florida, \"The church needs to be bold and courageous and take the leadership role that is theirs to take. It is time.\"</p>                \n                \r\n\n            \n                <p>Reverend Paul Whetstone, North Hollywood, California, \"I'm a veteran of the Gulf War era and senior pastor of the First Southern Baptist Church here. I will challenge my folks to call, write and email the White House to beg the President to actively oppose the jihad.\"</p>                \n                \r\n\n            \n                <p>Pastor Daniel Kitschel, Norman, Oklahoma, \"Mr. O'Reilly your call for the clergy to stand and demand that President Obama lead the way against ISIS is exactly what's needed. This Sunday from the pulpit I will address this. We are with you.\"</p>                \n                \r\n\n            \n                <p>Rabbi Barry Axler, Chicago, \"Mr. O'Reilly when Moses stood at the Red Sea with Egyptians charging, he prayed to God. God told him don't pray, take action. I applaud your call to clergy to encourage the President to act and I'm honored to join the effort.\"</p>                \n                \r\n\n            \n                <p>Father Rodolfo Vasquez Corpus Christi, Texas, \"This weekend I will ask my parishioners to speak out against the evil happening to Christians by demanding that our leaders lead a defense against the evil of radical Islam.\"</p>                \n                \r\n\n            \n                <p>Today President Obama spoke at the White House summit on countering violent extremism -- once again the summit was long on rhetoric and short on proposed action.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES:</b> Al Qaeda and ISIL and groups like it are desperate for legitimacy. They try to portray themselves as religious leaders -- holy warriors in defense of Islam. We are not at war with Islam. We are at war with people who have perverted Islam.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That is true the holy bar has been launched by those who misuse the Islamic faith. But again, there are millions of them and they are acting in the name of a deity. They are motivated to impose a barbaric religion.</p>                \n                \r\n\n            \n                <p>The Japanese worshiped their emperor during World War II. We Americans didn't diminish the danger from that country by saying their insane view of religion was not a threat. It was.</p>                \n                \r\n\n            \n                <p>President Obama is flat out wrong in not describing the terrorist threat accurately. Muslim fanatics want to kill us. And there are millions of them -- period.</p>                \n                \r\n\n            \n                <p>Summing up, \"Talking Points\" believes that Americans of faith and goodwill must demand our federal government begin to take the holy war seriously. That means developing an aggressive strategy to stop groups from slaughtering people. Stop them, not contain them.</p>                \n                \r\n\n            \n                <p>Up until now President Obama and Congress has been have been timid unwilling to define what everybody knows is true -- a violent strain of Islam is on the march, occupying vast amounts of territory. Executing and terrorizes pretty much at will.</p>                \n                \r\n\n            \n                <p>The civilized world needs to come together to eliminate the threat from the earth. And if the politicians won't do it, the clergy must lead the way.</p>                \n                \r\n\n            \n                <p>Once again, I ask all religious leaders, including Muslim imams to address their congregations this weekend. Once the American people rise up, President Obama will be forced to take the holy war seriously.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Judeo-Christian philosophy versus the jihad", "description": "Talking Points 2/18", "date": "2015-02-19T13:00:37Z"}