{"vcmId": "5baf97a8-96de-4107-beab-b18954668a65", "url": "http://www.foxnews.com/transcript/2016/12/09/bill-oreilly-donald-trump-critics-arent-happy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It is a problem almost every president-elect has had; certainly Barack Obama and George W. Bush experienced it.</p>                \n                \r\n\n            \n                <p>Those who opposed their election sought to undermine both men as soon as they won.</p>                \n                \r\n\n            \n                <p>And that is now happening with Donald trump.</p>                \n                \r\n\n            \n                <p>But here's the difference with Mr. Trump -- the undermining is occurring both on the left and the right.</p>                \n                \r\n\n            \n                <p>Case-in-point, conservative George Will, a Washington Post columnist who also provides analysis for Fox News.</p>                \n                \r\n\n            \n                <p>Will despises Trump, feels that he is an intellectual inferior and even left the Republican Party because of Trump's nomination.</p>                \n                \r\n\n            \n                <p>Now it is certainly George Will's right as both an American and a journalist to criticize not only Donald Trump, but any powerful person.</p>                \n                \r\n\n            \n                <p>We have no beef with that.</p>                \n                \r\n\n            \n                <p>What is troubling, however, is that much of Will's negative analysis is driven by personal animus.</p>                \n                \r\n\n            \n                <p>And it is here that he does his readers and viewers a disservice.</p>                \n                \r\n\n            \n                <p>Last night on Special Report, Will hammered Trump over the Carrier situation.</p>                \n                \r\n\n            \n                <p><b>GEORGE WILL</b>: &#8220;The problem is when you have in the Carrier case, political power used to bring pressure upon a privately held corporation that has fiduciary duty to maximize shareholder value and drive them off with political pressure from making economic decisions about economic assets, you are, in effect, at the end of the day, getting the federal government involved in capital allocation. There is a name for that, it's called socialism.&#8221;</p>                \n                \r\n\n            \n                <p>Putting the annoying \"at the end of the day\" clich&#233; aside, every hour of the day Will's analysis is ridiculous.</p>                \n                \r\n\n            \n                <p>It is true that the Carrier Corporation has an obligation to maximize profits.</p>                \n                \r\n\n            \n                <p>But if it does that by hurting the country in which it is operating, then the man in charge of that country -- the president -- has an obligation to challenge that.</p>                \n                \r\n\n            \n                <p>Under Will's absurd analysis, any corporation hurting American workers should be left alone. &#160;Hey, it's their business, let 'em do what they want.</p>                \n                \r\n\n            \n                <p>Does that make sense to anyone?</p>                \n                \r\n\n            \n                <p>President Trump's obligation -- and it should have been President Obama's, as well, but it wasn't -- is to try to protect American jobs.</p>                \n                \r\n\n            \n                <p>So Trump had a conversation with Carrier and basically said if you hurt your workers by moving to Mexico, expect that we will use legal tariffs to hold you accountable.</p>                \n                \r\n\n            \n                <p>That's not socialism, that's hard ball economics.</p>                \n                \r\n\n            \n                <p>Socialism, as George Will should know, is the government actually running the economy, telling Carrier what they can charge for their products or what wages they have to pay their workers. &#160;That's socialism.</p>                \n                \r\n\n            \n                <p>Trump is simply saying to every American company, we expect you to help the USA by finding a way to keep and create jobs here.</p>                \n                \r\n\n            \n                <p>And if you move abroad and jobs are lost, you'll pay a legal price.</p>                \n                \r\n\n            \n                <p>Again, that's what Trump should be doing, that's what Obama did not do, and that's a big reason why wages for American workers are stagnant -- too many jobs have been moved overseas.</p>                \n                \r\n\n            \n                <p>Memo to George Will: Drop the personal stuff.</p>                \n                \r\n\n            \n                <p>Tell the truth.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Donald Trump's Critics Aren't Happy", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 12/8", "date": "2016-12-09T14:29:34Z"}