{"vcmId": "5be502a6-8076-4982-bde6-3af722e0b0ff", "url": "http://www.foxnews.com/transcript/2017/01/24/president-trump-signs-executive-orders-on-first-day.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 23, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Continuing now with our lead story. Donald Trump on the job at the White House. Joining us from Washington, Charles Krauthammer. Did I miss anything about the first day, Charles?</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, SYNDICATED COLUMNIST: </b>No, I think there is something about the march that is I think even more significant, what the media are doing. What they are doing now, and I don't think this is a concerted effort, this is not orchestrated, this is simply the media being overwhelmingly liberal, they think the same way. But what they are doing is to try to call this the Tea Party of the left.</p>                \n                \r\n\n            \n                <p>They have been kicking themselves since 2009, 2010, for missing the Tea Party phenomenon, which became enormously important in the by elections, the elections of 2010, and the laws of the House and the Senate by the Democrats over time. They ridiculed the Tea Party. They condescended to it. They ignored it. So, what they tried to do is to look for that on the Left and they started with occupy Wall Street. Remember, \"The New York Times\" own ombudsman said that they were promoting the cause, pretending it was a real movement, it was nothing of the sword.</p>                \n                \r\n\n            \n                <p>It was spoiled, unemployed, overeducated college students who blew away with the first wins of winter disappeared. This, they see, the march of Saturday, they look at the headlines, \"Tea Party, Left-Wing Tea Party.\" Can they revive it?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: The fact is, is it not. They are overestimating it. They are going to promote it and they are going to fail.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What about the Soros factor? When you have this kind of billionaire behind 50 of the groups that sponsored the march and donating, according to reports, $90 million to those groups, that seems to be a little frightening when there is one guy and his crew, you know, pushing this as a Democratic movement, when it really is a contrived movement, is it not?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> You can put all the money you want into all the organizations you want. But the half a million people or so who showed up in Washington were not coming because of the waiving of money or because of a bunch of groups had the funding, look, all groups have for funding. The conservative groups, liberal groups, far left groups, big deal, that was real people showing up. My question to those real people was, where the hell were you on Election Day? You know?</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But don't you feel they showed up because they were told to show up? I mean, look, if you look at the totalitarian governments in the --</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Who tells anybody to show up?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> These people live --</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Yes. What is the threat? What is the threat? Why do they have to go?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, they have to go. They don't have to go to a negative, they have to go to be with her brothers and sisters and to show their solidarity and that they are good people and fight the fascist racists. I mean, it is a whip up. And if you study history, all the totalitarian regimes were fueled with whip ups, okay? And people turned out to the streets. Were they spontaneous? No. They were well organized and targeted and the target this time is Trump to get them out of there before the four years are over.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Look, you know, if you are talking about the fascists and the '20s and '30s, they actually took over governments, essentially by force. We are not talking about that. They, you know, when you are talking about people showing up, being whipped up, you are saying free people read the internet, they decide they sympathize with this idea or group, they get on a train, they get in a car, they cross country, they go to a demonstration. How is that different from the march on Washington in 1963? Were they wept up? Yes, by a civil rights movement.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Here's how it is different.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>I don't think there is a movement here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Here's how it is different. The civil rights movements in the '60s and all of the demonstrations that took place were against injustice. All right? You can see it. It was there. All right? The same thing with Vietnam. A lot of people felt the war was not being waged properly, it was unjust, the working class soldiers were being exploited and on and on. There is no injustice here. This is a perception, a perception of fascism and racism and bigotry. All right? There is no proof. You can't provide it. This is a contrived demonstration, Charles. It is not based on reality as the '60s were. Go.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Well, I mean, you are talking about perceptions here. Are you aware of how many communist groups there were for the march on Washington? How many there were in the Vietnam movement?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. Sure. A lot of it. Absolutely.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>You know all of these, a lot of them were funded by unsavory sorts. Look, what they are protesting, to the extent that they actually have an ideology, and you know, there were all kinds of groups with a lot of weird causes in there, it was more amusing to me than frightening. What they are protesting, if anything, is Donald Trump.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: And the threat they perceive coming from him. Well, we have a democracy. You've settled out at the ballot box. But they have every right to express themselves.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And I said that.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: And you may judge -- well, you may judge it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I think there something more nefarious going on behind the scenes than you do.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Oh, come on. So, you are afraid of these women?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I'm not afraid of anybody.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Are you?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I'm not afraid of anybody.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Yes, you are.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I think there is a lot of things behind the scenes that is not going to be reported by anybody, there's a lot of manipulation going on, a lot of propaganda going on, a lot of bad things going on, that people should know about. That is my job to tell them.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> I would recommend less paranoia, less conspiracy, and a little relaxation. It will be okay.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: It was just a demonstration. They are not going to take over the White House. I will give you my personal guarantee.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I'm going to take your advice and tomorrow's \"Talking Points\" will be delivered with me in a hammock.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> I'll just prescribe the valium. You take it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Never take it. Never. No drugs for me. Clearheaded at all times. Charles Krauthammer.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "President Trump signs executive orders on first day", "description": "Charles Krauthammer reacts to the President's full agenda on 'The O'Reilly Factor'", "date": "2017-01-24T13:12:16Z"}