{"vcmId": "5c04ccc3-8d5d-4fde-a3d5-a8c75e6028aa", "url": "http://www.foxnews.com/transcript/2015/10/07/bill-oreilly-free-stuff-for-americans.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Senator Bernie Sanders drawing big crowds like this one in Boston telling folks America should give them freebies. Sanders, of course, the nation's only socialist senator. And because old Bernie is doing so well with the entitlement line we now have Hillary Clinton getting on the train.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> Every young person who wants to go to college, number one, should be able to go to a community college for free. That's two more years of education on top of high school. I support President Obama's proposal for doing that but I want to go further.</p>                \n                \r\n\n            \n                <p>I think everyone who goes to it a public college or university should be able to do that without having to borrow a penny to pay tuition.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Wow. Mrs. Clinton says her proposal for essentially free college tuition would cost an average of $35 billion a year. Talking Points believes that figure is from the Land of Oz. It costs far more than that although I admit my opinion is speculation.</p>                \n                \r\n\n            \n                <p>What is not speculation is what Bernie Sanders wants to do. Free Medicare for all Americans cost $15 trillion over 10 years; an increase in Social Security payments cost $1.2 trillion; guaranteed family leave cost $319 billion; tuition free schools at all levels cost $750 billion; rebuilding the nation's infrastructure cost $1 trillion; preventing private companies from cutting pensions cost $29 billion to the federal government.</p>                \n                \r\n\n            \n                <p>The freebies and programs Senator Sanders supports would cost the American taxpayer $18 trillion over a decade. Obviously that's not fiscally possible unless the federal government begins seizing private assets, which is certainly in line with the socialist philosophy.</p>                \n                \r\n\n            \n                <p>On the other side, Governor Jeb Bush recently said this about courting African-American voters.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BUSH:</b> We should make that case because our message is one of hope and aspiration. It isn't one of division and get in line and we'll take care of you with free stuff. Our message is one that is uplifting that says you can achieve earned success. We are on your side. Things can get better.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Of course, the liberal press derided Mr. Bush for using the words \"free stuff\". But it is free stuff that the Democratic Party is promising in each and every election. That's what the party stands for these days -- entitlements. And many Americans are buying into that somehow believing the U.S. government owes them prosperity.</p>                \n                \r\n\n            \n                <p>So, with Hillary Clinton now imitating Bernie Sanders, the country faces a very interesting scenario: capitalism versus socialism. We will see what prevails.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Free stuff for Americans", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/6", "date": "2015-10-07T12:11:13Z"}