{"vcmId": "5dac934c-3097-4b92-a7cd-e4d0c778b895", "url": "http://www.foxnews.com/transcript/2014/11/18/ferguson-bracing-for-grand-jury-decision.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 17, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Thanks for staying with us, I'm Bill O'Reilly in THE FACTOR follow-up segment tonight. As you may know, the grand jury investigating the police shooting of 18-year-old Michael Brown in Ferguson, Missouri by Officer Darren Wilson last August will soon make a decision. Over the weekend, a die in protest was held in St. Louis.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>(NIGHT CHANTING)</b></p>                \n                \r\n\n            \n                <p>Fight back. Fight back. Fight back. Fight back. Fight back. Fight back. Fight back. Fight back. Fight back. Fight back.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Joining us now from St. Louis, the police chief there Sam Dotson. So, chief, I think Missouri is doing the right thick in preparing for the worst. How do you see it?</p>                \n                \r\n\n            \n                <p><b>SAM DOTSON, CITY OF ST. LOUIS POLICE CHIEF:</b> Bill, I think you are right. I've got three jobs. Law enforcement has three jobs. We have got to keep people safe that's our number one. I got to protect their rights, their constitutional rights to have their voices heard and I got to keep property safe. You heard today that Missouri Governor Jay Nixon activated the National Guard. That's to help us do those things to backfill some of the positions that we have. So police officers can go out and gauge the community to try and keep people safe.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Now, do you know where the guard is going to be deployed or are you going to wait until things happen and then the guard goes in?</p>                \n                \r\n\n            \n                <p><b>DOTSON: </b>Well, I think it's very simple. The guard is here to support us. So, I don't see a scenario under a normal every day operations where the Missouri National Guard is on the front line. What they are going to do is some of the more routine mundane jobs building security for us. So, we can put police officers in positions where they can interact with protesters and demonstrators. The guard is going to do a looting detail for us. And what do I mean by that? In the city of St. Louis had about 25 window smashings when the Michael Brown event happened in Ferguson. They're going to be in strip malls and in shopping centers so the general public as they are moving about can see a police presence, can see the National Guard, they can feel reassured that we have a plan.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is there a neighborhood in St. Louis that is particularly vulnerable to any kind of civic action?</p>                \n                \r\n\n            \n                <p><b>DOTSON:</b> I think the whole region is. And St. Louis is very fragmented with a lot of municipalities. Ferguson is a bedroom community outside of the city. I think that's ground zero.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Sure.</p>                \n                \r\n\n            \n                <p><b>DOTSON:</b> Clayton, which Clayton which is the county capital where Bob McCullough's office is, I think certainly sees some actions. And then we've got the signs like the gate way arch, the visible presence when you think of St. Louis. I think downtown has some issues too.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay, now, there's a coalition about 50 groups. The new Black Panther party, some communist groups, anti-American groups that have, you know, basically set up shop in St. Louis to mobilize when the decision comes down. Are these groups active? Are you keeping an eye on them?</p>                \n                \r\n\n            \n                <p><b>DOTSON: </b>Oh, absolutely we are. And here is the frustrating part for law enforcement. There are a lot of good people that just want to have their voices heard. We can engage them but this criminal element, New Black Panthers, communist revolution, they are here to do criminal acts. They are not here to have their voices heard. They are here because they have a stage and platform. It bothers me. It worries me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Do you have Intel on them.</p>                \n                \r\n\n            \n                <p><b>DOTSON: </b>We do. We spend a lot of time gathering information and working on criminal cases. And so, we want 95 percent of the people that come to St. Louis that are here to be able to go out and have their voices heard. But when those groups violate people's rights, when they break the law, we have a plan to go get them. And we are working with this local agencies and our federal partners.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Now, final question, do you know when this is going to come down? Are you going to get a heads up?</p>                \n                \r\n\n            \n                <p><b>DOTSON:</b> Well, the county prosecutor says he will give us a heads up. I came tonight. I haven't heard anything yet. His best guess is the middle to the end of the month. So we are getting close. And so, I think that's why the governor activated the National Guard today.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>DOTSON:</b> Not to antagonize but to reinforce to the community we have a plan and life is going to go on.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I think you guys are doing exactly the right thing and you're trying to tamp it down. I know you have officers on the street trying to get everybody calm. But we don't want everybody's thanksgiving to be ruined next week. You know, we want, you know, let's work together here. Everybody should work together no matter what the decision by the grand jury is respect the process. If you want to protest do it peacefully.</p>                \n                \r\n\n            \n                <p>All right. Chief, you are welcome at any time. We really appreciate it. Thanks.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Ferguson bracing for grand jury's decision", "description": "Authorities in Missouri preparing for the possible violence in the wake of the decision", "date": "2014-11-18T13:13:55Z"}