{"vcmId": "5ddb9eba-7e2b-4462-a9cb-e9ae3bc79a66", "url": "http://www.foxnews.com/transcript/2016/11/11/press-upset-with-election-results.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 10, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> FACTOR \"Follow-Up\" segment tonight. National Press still very upset about the Trump victory.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>RICHARD ENGEL, NBC NEWS:</b> Assuming, and that's what we're talking about, that he does win, people I'm speaking to think it's absolutely catastrophic. That it's catastrophic for the United States. That it's catastrophic for our position in the world. It emboldens our enemies and adversaries, it makes our allies terrified that we're not going to be their allies anymore. Most people think that this type of scenario happens.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That man, Richard Engel, NBC News correspondent not a commentator.</p>                \n                \r\n\n            \n                <p>Joining us from Washington, associate editor of \"The Washington Post\" Bob Woodward. I know you are an old school guy and you don't think that hard news reporters should comment with their opinion but we saw that with Martha Raddatz to some extent on ABC News. We saw it with Engle on ABC News. I could give you 20 other examples. So what do you think is going on?</p>                \n                \r\n\n            \n                <p><b>BOB WOODWARD, WASHINGTON POST ASSOCIATE EDITOR:</b> Well, I think in the case of Richard Engel, who is really one of the best foreign correspondents anywhere in the world for any U.S. or even foreign broadcast service, it seems like he might, when he said people he was talking to presumably those would be foreign government officials who are officials here. So I don't think that particular segment crossed the line at all.</p>                \n                \r\n\n            \n                <p>All right. Well, I disagree with you because if he is going to do that, he has to put a name on it, okay, number one. You don't do anonymous sources because anybody can make that up. Number two, he has got a history, you know Mr. Engel of left wing utterances. And number three, he should be a commentator. He could still be a reporter. He could still send people into the field if they have a commentator label. Best example on this network is Geraldo. Geraldo gets sent to all the war zones but he is a commentator and we let everybody know that. Wouldn't that be a fair solution to this kind of stuff?</p>                \n                \r\n\n            \n                <p><b>WOODWARD</b>: Well, I don't -- listen, this guy goes on the scene in places that are very dangerous, you and I are sitting in our chairs, so I have watched him and I think he is really terrific reporter, one of the best. But the larger point you make, there are people who were despondent in the dumps about Trump winning and I think it showed and I think --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It did. There is no doubt it showed. But I said that about Martha Raddatz whom I have known for many years, an excellent reporter. Excellent reporter. Okay? But she is on there and she is ticking off the -- hey, if you are a Trump voter, this is what you are voting for, you know? And ends up with the \"Access Hollywood\" tape. You know, come on. You can't be doing that unless you do it to both sides. All right?</p>                \n                \r\n\n            \n                <p><b>WOODWARD:</b> Yes. I think you have got to get in the middle.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. You got to do it to both sides. But what I'm trying to get at with you is, when you came up, when you're a young reporter at \"The Washington Post\" under Ben Bradley, they were strict rules Woodward, they were strict rules. All right? And when I came up, CBS and ABC, I couldn't give my opinion in the piece, which killed me but I didn't, all right? Those rules are gone.</p>                \n                \r\n\n            \n                <p><b>WOODWARD</b>: Yes. But under Bradley, the rule one was, don't go on television. In rule two was no gloating. And he had it right. And I think we need to get back to --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You're not going to get it. It's not going to happen. Newspapers are dying. They are going out of business. They got to be provocative. What about -- what about and I'm -- Chris Wallace was interviewed in the \"New York Times\" today and he said to his credit, and I got Wallace on tomorrow, hey, you guys, you didn't cover this Trump thing fairly. And you are even -- your editor said you didn't cover it fairly. You were out to get them. That's what you were out to do. What about that?</p>                \n                \r\n\n            \n                <p><b>WOODWARD:</b> I think there is some evidence of that. No question. But if you talk to the Hillary Clinton people they think as it pertains to \"The Washington Post\" that we were out to get her.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How and what possible way could you have been out to get her? I read your coverage. All do you is report the facts.</p>                \n                \r\n\n            \n                <p><b>WOODWARD</b>: Yes. But we stuck to the email issue, which is important. There are still unanswered questions in all of that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, how is that unfair?</p>                \n                \r\n\n            \n                <p><b>WOODWARD:</b> No. But I'm telling you people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, anybody can whine about anything. But facts are facts. I'm trying to do this as a journalist even though I'm a commentator with facts.</p>                \n                \r\n\n            \n                <p><b>WOODWARD</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I mean, if you have a Wikileaks thing coming out every day and it has provocative stuff about Hillary Clinton's main guy, John Podesta, you have got to report it. You can't say well, you know, we have got too many of them and we are not going to report them anymore. It's ridiculous.</p>                \n                \r\n\n            \n                <p><b>WOODWARD</b>: Of course. And you've stick to the facts. But as we all know what facts are you going to pick? Where are you going to do a major story and we stuck on the Hillary Clinton email story. If you go back even a couple of years, the Clinton Foundation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. But those are all legitimate story.</p>                \n                \r\n\n            \n                <p><b>WOODWARD:</b> Yes. It is. But people are angry about that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I think you guys should have done more on the foundation. I think that if you did you would find a hell of a lot more than has already been in print. Now, let's look ahead.</p>                \n                \r\n\n            \n                <p><b>WOODWARD</b>: I agree with you that on that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, you can do it, Woodward. I mean, you are not over the hill yet. You're getting there. You are almost at the summit but you're not over it. You should do it. All right.</p>                \n                \r\n\n            \n                <p><b>WOODWARD</b>: Thank you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You're welcome.</p>                \n                \r\n\n            \n                <p><b>WOODWARD</b>: It's nice to have another assignment editor in my life.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Sure. Any time you need advice you know who to call. I think the post and the other newspapers are going to go after Trump as president. They are going to be unmerciful. I don't see any difference between the candidate and president. He is still going to hammer them. Am I wrong?</p>                \n                \r\n\n            \n                <p><b>WOODWARD: </b>Well, I think it's a matter of what are the facts and what's going on? Now, what's occurring this love fest between Obama and Trump is not something you would expect unless you realize.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They have to.</p>                \n                \r\n\n            \n                <p><b>WOODWARD:</b> Sure. Well, it's in the interest of both, particularly Obama, because he -- the last thing he wants to do is have 10 weeks of fighting and tension with Trump and --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: He wants -- Obama wants --</p>                \n                \r\n\n            \n                <p><b>WOODWARD</b>: I think Trump -- you know, how long this will last, we'll see, but I think it's a really important thing. I think what Hillary Clinton's concession speech.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, yes.</p>                \n                \r\n\n            \n                <p><b>WOODWARD:</b> The best speech. Well, it was. And let's give her credit. Even you, I bet.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Look, I'm just glad that Secretary Clinton can take a break right now. But I will tell you what, Barack Obama is the smoothest, coolest cat there has ever been in the White House. And he is going to be classy right until the inauguration. And then he is going to go out and make a gazillion dollars. That's what's going to happen.</p>                \n                \r\n\n            \n                <p>Hey, Bob, always good to talk to you.</p>                \n                \r\n\n            \n                <p><b>WOODWARD:</b> Thank you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thanks very much. Thanks for being a good sport, too.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Press upset with election results", "description": "Bob Woodward joins 'The O'Reilly Factor' to discuss media reaction to Trump victory", "date": "2016-11-11T13:41:14Z"}