{"vcmId": "5e6e4ce7-53c2-4f55-a644-906d4c400c4f", "url": "http://www.foxnews.com/transcript/2015/02/20/bill-oreilly-more-terrorism-madness.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>A new CBS News poll shows a stunning turn around on how Americans see the fight against ISIS. Back in October just 47 percent favored using American ground troops to fight ISIS. That number has now jumped to 57 percent; 37 percent oppose.</p>                \n                \r\n\n            \n                <p>The American people seem to be getting the message that evil terrorists are slaughtering thousands of human beings all over the world and the most powerful nation on earth should lead the way in stopping that.</p>                \n                \r\n\n            \n                <p>But President Obama continues to play the long game saying that social problems and other factors must be weighed in any campaign against Islamic terror. That's a dangerous point of view because human beings are being slaughtered and the ISIS killers are expanding their territory. Perhaps President Obama should heed the words of the Egyptian leader.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CRUZ: </b>President el-Sisi is a Muslim and he said we Muslims need to stand up together against these radical terrorists who are perverting our faith and turning it into a mandate for murder. Why don't we see the President of the United States demonstrating that same courage just to speak the truth about the face of evil we're facing right now?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, that's a powerful statement from the senator because Mr. Obama is certainly taking his time in formulating an effective strategy to stop the mass murder.</p>                \n                \r\n\n            \n                <p>Here's what the President and his acolytes believe.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES: </b>We do have to address the grievances that terrorists exploit including economic reasons.</p>                \n                \r\n\n            \n                <p><b>JOHN KERRY, U.S. SECRETARY OF STATE:</b> We have a huge common interest in dealing with this issue of poverty, which in many cases is the root cause of terrorism.</p>                \n                \r\n\n            \n                <p><b>AYMAN MOHYELDIN, NBC NEWS FOREIGN CORRESPONDENT: </b>What struck out at me in this speech by the President is that we talked about so many of the issues -- poverty, education, the ideology. But one thing that was omitted very blatantly from this is the consequences of so many of the West's policies in the Middle East.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's right. It's America and the West's fault. We provoked the jihadists into slaughtering thousands of innocent people. That's just insane. But almost as crazy is believing as apparently Secretary of State John Kerry does that the United States can affect poverty in Muslim nations -- that we can somehow upgrade the standard of living in places like Yemen and Afghanistan. The federal government can't even eradicate poverty here in America.</p>                \n                \r\n\n            \n                <p>So why is the Obama administration putting out this blather? Why? It would be like saying because America was part of the World War I German surrender that crushed the Germany economy for years we're partially responsible for Hitler's rise. Maybe Secretary of State Kerry believes that FDR could have provided jobs for people in Munich, thereby preventing the rise of Adolf and his assassins who gained power because the German economy was so bankrupt.</p>                \n                \r\n\n            \n                <p>For anyone who knows history, what the Obama administration is putting out there is not only false, it's incredibly stupid. This country can't regulate how the government of Pakistan runs its economy. Over the decades American taxpayers have sent billions of dollars overseas to help people, and these loony far left people say we're the problem? We encourage al Qaeda and ISIS to commit barbaric acts? I mean this kind of stuff is off the chart.</p>                \n                \r\n\n            \n                <p>And then you get back to the President's unwillingness to confront radical Islam by name, yet he has no problem, no problem at all suggesting that the three Muslim young people in North Carolina might have been murdered over their religion.</p>                \n                \r\n\n            \n                <p>Ed Henry confronted the White House on that.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HENRY:</b> I'm curious, why didn't you mention it was 21 Christians killed by Muslims? Is that relevant?</p>                \n                \r\n\n            \n                <p><b>EARNEST:</b> It sure is, because the ISIL -- the ISIL extremists who carried out this attack indicated that the reason they were killing them wasn't just because they were Egyptian but also because they were Christian.</p>                \n                \r\n\n            \n                <p><b>HENRY:</b> Why were you not clear on Sunday, why not under your name? Why didn't you say 21 Christians were killed?</p>                \n                \r\n\n            \n                <p><b>EARNEST:</b> Ed, I tried to be clear here. I can't account for that specific line in the statement, but we've been clear there that we condemn this murder.</p>                \n                \r\n\n            \n                <p><b>HENRY:</b> Two days earlier on the 13th you put out a statement under the President's name about the tragic deaths of the three Muslim students at the University of North Carolina. And in there the President said quote, \"No one in the United States of America should ever be targeted because of who they are, what they look like or how they worship. Why was their Muslim faith relevant in that statement?</p>                \n                \r\n\n            \n                <p><b>EARNEST:</b> Ed, I think as we indicated, the situation in North Carolina still under investigation.</p>                \n                \r\n\n            \n                <p><b>HENRY:</b> So why was their faith invoked in the President's statement.</p>                \n                \r\n\n            \n                <p><b>EARNEST: </b>Well, Ed, I think it's important for the President in this case as he has in many others to articulate a pretty clear principle and I think it's the kind of principle that the vast majority of Americans should be able to support?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I mean my head is just going to blow off. Ed Henry will be here in just a few moments.</p>                \n                \r\n\n            \n                <p>Finally the far left is now desperate to stop the growing anger Americans have for the jihad. Today in the New York Times there's a full- page ad from a group that does not want war with Iran even if they develop a nuclear weapon. This group says it's fine if the fanatical mullahs have the ability to wipe hundreds of thousands of people off the earth.</p>                \n                \r\n\n            \n                <p>In the media, left-wing zealots on television are decrying the use of the words \"holy war\". No, no, no, no, no, no. You can't say \"holy war\". Not even if ISIS puts out a public statement saying they beheaded 21 Christians because of their religion. No holy war. That's what they want you to say.</p>                \n                \r\n\n            \n                <p>As Dennis Miller often says the world has gone mad, but what's really dangerous for all of us is that our leadership in Washington, not only the President, but Congress as well, doesn't have a plan to stop the jihad.</p>                \n                \r\n\n            \n                <p>Our leaders continue to dither while Syria, Iraq, Yemen, Afghanistan, many other places burn. As \"Talking Points\" has said time and again, sooner or later these Muslim fanatics are going to bring their death plan here again. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: More terrorism madness", "description": "Talking Points 2/19", "date": "2015-02-20T13:17:08Z"}