{"vcmId": "5e7ba8a2-98a1-43df-8873-b5bda09289e9", "url": "http://www.foxnews.com/transcript/2016/03/23/ted-cruz-on-battling-terror.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 22, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story\" segment tonight. Let's get right to Senator Ted Cruz. He is with us now here in New York City. I believe you are correct when you said earlier today that a lot of this Muslim violence in Europe is because of their failed immigration policies. As you know, the EU has open borders. Anybody goes anywhere, refugees flooding in. Nobody knows who is coming and who is going.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We don't have that here in the U.S.A. and we have some problems but not nearly to the extent that they have. Is that right?</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Well, you know, when it comes to open borders a few days ago I was down on the border in Arizona. And I will tell you it was a tiny little fence. My five-year-old daughter could have crossed that border in all of about 10 seconds. Actually, we had a bunch of reporters there. Several of the reporters jumped the fence into Mexico because they had a better shot from their cameras. And I was laughing we are literally watching them cross the border illegally and enter Mexico. And, you know, we have had 12 million people coming into this country illegally. We are not securing the border right now at a time with threats from ISIS and radical Islamic terrorism, it makes no sense to not know who is coming in this country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So, you agree with me and with your competitor Trump that you need a wall, you need a formidable wall.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Absolutely yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. We're all on board --</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: But a wall alone doesn't do it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: More important than that is boots on the ground. That's why we are going to triple the border patrol and used fixed wing and rotary wing aircraft to monitor the wall. The wall alone slows them down. But you've got to have the boots on the ground.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. That's like the Israeli too, that's the model we should be using.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, you made some other statements against ISIS today. And one of them caught my eye. You say you would carpet bomb them. You said that before.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Um-huh.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know that carpet bombing means women and children dead in the street. You know that?</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> It doesn't mean that. What I mean by carpet bombing is using overwhelming air power not doing --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They hide in civilian areas. You know that.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: The first Persian Gulf war we launched roughly 1100 air attacks a day. We carpet bombed them for 37 days. And then after that our troops went in and in a day and a half mopped up the Iraqi army.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Were you over there? I was over there. It was a different situation. We degraded -- we degraded Saddam Hussein's military. We didn't bomb Kuwait City.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. Where he was.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Nobody is talking about bombing civilians. But the difference is. Right now --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> We are doing between 15 and 30 air attacks today. It's pinprick. So, what we ought to use is overwhelming air power, carpet bombing to take out their command and control infrastructure. Take out their communication.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right. More bombings.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Take out their finance. Take out their transportation. Take out the oil fields. Take out --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Still not going to beat them. They are going to hide in the city --</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: That's not the only thing. Of course it's not the only thing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, I called earlier in the program here for a NATO declaration of war against ISIS.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> And I absolutely agree and indeed I noted this morning in the wake of this Brussels attack that it was more than a little ironic that just yesterday Donald Trump called for America pulling back from what NATO either weakening it or withdrawing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's because he doesn't feel they carry their weight financially there and -- but I think you and Trump --</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: That would be a catastrophic mistake. I mean, Bill, it's --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Withdraw from NATO at this point, it would.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> And that's what Donald called for, he'd said America needs to --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know that.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> -- step back and doing that would be a massive victory for Putin and a massive victory for ISIS. And we shouldn't -- there's a point that matters here. Donald's approach on foreign policy is one of weakness and isolationism. That's his position consistently across the globe.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. See, you are putting me in a difficult position because I'm not going to defend Trump but I will say that we will try to get him on tomorrow.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: You know what? I got an idea.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What?</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Why don't ask you Donald Trump to come here and defend himself. Donald is afraid to debate.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Debate you one-on-one.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> I would love to do a one-on-one debate. Bill, you can moderate. He wouldn't argue that you are unfair moderator.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, he would.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: So, I'm happy to have you moderate.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. We will going to work that.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: But Donald and NATO is a good example --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We'll work it.</p>                \n                \r\n\n            \n                <p><b>CRUZ: </b>-- where he throws out a foreign policy position that is weaker and more liberal than Obama's and Hillary Clinton's and then he doesn't get challenged on because he is afraid to have --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. But let's just talk about you. But I will follow up on that debate offer and I appreciate you making it?</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: I think it would be terrific.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. You are also taking heat because you said, U.S. law enforcement should patrol in America Muslim neighborhoods. That's not going to do any good.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> What I said is we should use law enforcement to prevent radicalization and to target radical Islamic terrorism. This president, President Obama.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: How do you do that specifically?</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> So, for example, here in New York City --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Mayor Bloomberg created a program that worked cooperatively with the Muslim community to target radical Islamic terrorism. Prevent radicalization and stop terror attacks. Stop terror cells.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You watch certain mosque and de Blasio has done away with that.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: De Blasio ended it because of political correctness.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Of course.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: And it's the same silliness that Obama and Hillary do where in the wake of these terror attacks they don't say the words radical Islamic terrorism. And even worse, predictably President Obama goes on TV and lectures Americans on islamophobia. Enough already. We need a president who makes clear to the world if you are a radical Islamic terrorist, if you are a jihadist, your day of reckoning is coming. And on January 20th, 2017, the world will change. We will come after you and we are not coming after to you negotiate, to compromise, to capture you, if you have declared jihadi in America, we are coming after to you kill you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. Let's just recap this segment so everybody is clear. All right? You don't believe in carpet bombing cities where ISIS is for the civilian casualties. You are not going to do that.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: You don't wantonly target civilians but at the same time, you don't use rules of engagement that make it impossible for our troops.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You step up the bombing. You would encourage NATO to declare war on ISIS.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You have all of that power then.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Launched against these savages. You want increased law enforcement surveillance here in the United States on radical Muslim concerns, would that be fair?</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And you are for a very stringent border with more backup.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: To keep the -- all right? Do I have it?</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> And we shouldn't be allowing in tens of thousands of Syrian Muslim refugees that ISIS has said they want to infiltrate and send jihadist --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Sure. That's what's happening in Europe. I mean, it's obvious that is happening there. All right. Now, we would hold you over to talk about the political thing. We have two votes tonight in Arizona and Utah. Senator is kind enough to stay over. I wouldn't. I would have left a long time ago. All right. Then we will work on that debate.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Ted Cruz on battling terror", "description": "GOP presidential hopeful joins 'The O'Reilly Factor' to discuss his strategy for defeating ISIS", "date": "2016-03-23T12:34:16Z"}