{"vcmId": "5eab6726-44e7-4cd2-b0eb-044b880d639c", "url": "http://www.foxnews.com/transcript/2014/12/08/bill-oreilly-who-is-organizing-racial-protests-breaking-out-across-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>First of all, peaceful protest is good. It's a hallmark of America. If you feel something is unfair. If you feel that, you should demonstrate your dissent. We saw the Tea Party do that a few years ago. We're seeing folks who think policing is unfair to blacks doing that today.</p>                \n                \r\n\n            \n                <p>But some responsibility goes along with protesting especially if your actions are causing distress to other people. Simply put, you need to know what you're talking about. The claim that American police are hunting down young black men is a lie -- a blatant lie. We have posted statistics on BillOReilly.com that refute any theory along those lines. So please check that out.</p>                \n                \r\n\n            \n                <p>But, in some places, African-Americans are not, are not being treated with proper respect. That's also true. And if you deny it, you are not living in the real world.</p>                \n                \r\n\n            \n                <p>Now, The Factor has learned that the New York City protests are being coordinated by hard core far left activists. The main crew seems to be \"This Stops Today\" -- a group of professional agitators who use social media to organize street confrontations. Aligned with this group are a variety of grievance organizations with names \"Hoodies for Justice\" and \"Communities United for Police Reform\".</p>                \n                \r\n\n            \n                <p>The demonstrations you are seeing are not, are not spontaneous dissent from regular folks. Rather, they are well-planned disruptions from professional anti-establishment provocateurs. That's important to understand. Because it is the American system that's being attacked by these people, not the individual sagas of Michael Brown and Eric Garner.</p>                \n                \r\n\n            \n                <p>Unfortunately, the deaths of those two men are being used by the far left to foment unrest. According to reporting by the \"Wall Street Journal\", as soon as the Garner grand jury decision was announced, instantly, Twitter and Facebook messages were blasted out by people using #s like \"I can't breathe\" and \"black lives matter\". Again, this was organized, designed to create as much chaos as possible.</p>                \n                \r\n\n            \n                <p>Last night here in New York City, more than 200 protesters were arrested. But in other cities around the country, the demonstrations were much less intense. New York is Ground Zero for the hard left right now as it was for the Occupy Movement.</p>                \n                \r\n\n            \n                <p>The Factor has learned that the radical left SEIU labor union deeply involved in the racial protests as are a number of other groups funded by the shadowy radical George Soros. So once again, there is nothing spontaneous about any of this.</p>                \n                \r\n\n            \n                <p>One person who has emerged as a voice of reason is Eric Garner's daughter Erica.</p>                \n                \r\n\n            \n                <p>(BEGIN VIDEO CLIP)</p>                \n                \r\n\n            \n                <p>UNIDENTIFIED MALE: Do you think it's a racial issue?</p>                \n                \r\n\n            \n                <p>GARNER: I really doubt it. It was about the officer's pride. It was about my father being 6'4\" and 350 pounds. And he wants to be, you know, the top cop that brings this big man down because he's just big.</p>                \n                \r\n\n            \n                <p>(END VIDEO CLIP)</p>                \n                \r\n\n            \n                <p>O'REILLY: It was brave of Miss Garner to down play the racial aspect. But many politicians are not doing that.</p>                \n                \r\n\n            \n                <p>(BEGIN VIDEO CLIP)</p>                \n                \r\n\n            \n                <p>CLINTON: Because despite all the progress we've made together, African-Americans, most particularly African-American men are still more likely to be stopped and searched by police, charged with crimes and sentenced to longer prison terms.</p>                \n                \r\n\n            \n                <p>(END VIDEO CLIP)</p>                \n                \r\n\n            \n                <p>O'REILLY: Well, Mrs. Clinton knows why black men are being scrutinized by police and also why they get more jail time. She was a senator here in New York. It goes to guns and drugs. Inner city drug gangs like the ones in Chicago right now are a plague upon the land, murdering thousands of innocent people across the country, destroying poor neighborhoods. When was the last time you heard Hillary Clinton or most other politicians, for that matter, put that on the table?</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Who is organizing the racial protests breaking out across America?", "description": "Talking Points 12/5", "date": "2014-12-08T13:29:54Z"}