{"vcmId": "60008ee9-7f1b-41f0-ba91-787284ae73b2", "url": "http://www.foxnews.com/transcript/2015/03/05/bill-oreilly-trust-factor.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It is quite clear that Israel does not trust President Obama to make a deal with Iran that protects the world from nuclear weapons. It's also apparent that many Republicans, perhaps most, do not trust the President's leadership on just about every issue. And finally, U.S. allies in Europe and around the world are not exactly rallying to Mr. Obama's call for a coalition to fight ISIS and the jihadis. Charles Krauthammer believes our allies don't trust President Obama to do what's necessary to defeat the jihad. So they are reluctant to step up with more than token assistance.</p>                \n                \r\n\n            \n                <p>The world is a dangerous, nasty place. Villains are running wild. Putin is a menace. ISIS, al Qaeda, other jihadis are simply savages with no agenda other than destruction. North Korea is run by a loon. Chinese are quietly plotting to dominate South Asia.</p>                \n                \r\n\n            \n                <p>If America ever needed a true leader, it is now. But trust in President Obama is almost rock bottom. The reason -- Mr. Obama's not a terror warrior. Not a person comfortable with confrontation. Also, he's a man of the left who sees gray, not black and white.</p>                \n                \r\n\n            \n                <p>Generally speaking, liberal America does not want to right wrongs overseas preferring to concentrate on social justice and income redistribution here in the U.S.A. Mr. Obama relishes that but does not want to police the world therefore the danger overseas grows even if some on the left will not admit it choosing to it attack the latest messenger Benjamin Netanyahu.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>AMANPOUR:</b> It was a very dark Strangelove-ian speech painting a picture of a really dystopian world r Raising the specter of a genocidal nation, a genocidal regime spraying nuclear weapons to annihilate the whole world and the whole region. Now obviously many people are very concerned about Iran and there is a deep lack of trust. But surely the same was said of the Soviet Union all those years ago.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Miss Amanpour was raised in Iran until age 11 and apparently does not believe the mullahs would act unilaterally with the nuke. She does, however, use the phrase \"deep lack of trust\". And that is the crux of the matter.</p>                \n                \r\n\n            \n                <p>Many Americans and Israelis will oppose any deal the President makes with Iran because they don't trust him. And, of course they don't trust the mullahs. The only thing Mr. Obama could do is lay the terms out so everybody could see them. But some in his party oppose that.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>REP. EMANUEL CLEAVER (D), MISSOURI: </b>We don't know what is being developed in that agreement. That's one thing we don't know for sure.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> That's true.</p>                \n                \r\n\n            \n                <p><b>CLEAVER:</b> And so we are having a lot of discussion about something that we don't know anything about. And the parts that may be most difficult I don't think we should know about right now.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So let me get this straight, Congressman. We, the people, should not know what America is proposing to prevent Iran from developing a nuclear weapon? Is that what you're saying? Good grief. This isn't some economic treaty. It's a matter of mass destruction in the hands of crazy zealots.</p>                \n                \r\n\n            \n                <p>Time for clarity, Mr. President, time for straight talk.</p>                \n                \r\n\n            \n                <p>That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The trust factor ", "description": "Talking Points 3/4", "date": "2015-03-05T13:13:41Z"}