{"vcmId": "612e7c0a-d178-4c21-ba28-4fcc4307fd57", "url": "http://www.foxnews.com/transcript/2015/05/21/veterans-against-isis.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" May 20, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight, a group called Veterans against ISIS is about to launch a combat mission to fight the jihadists on their own. Joining us now from Jacksonville, Florida, Sean Rowe, founder of the group and a former army sergeant who did serve in Iraq.</p>                \n                \r\n\n            \n                <p>So, Mr. Rowe, let me get this straight. You guys have a group of all Americans, mostly veterans, mostly combat guys and you are going to go on your own to Syria to fight ISIS is that it?</p>                \n                \r\n\n            \n                <p><b>SEAN ROWE, VETERANS AGAINST ISIS:</b> Well, our primary mission is to liberate Iraq from under ISIS control.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How many guys you got?</p>                \n                \r\n\n            \n                <p><b>ROWE: </b>We've got nearly two dozen veterans right now and I'm talking to a lot more recently.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. But two dozen is not going to liberate anything from anything. If you go over with just a few, don't you run the risk of being kidnapped and beheaded by ISIS? I mean certainly they are looking for Americans to take hostage.</p>                \n                \r\n\n            \n                <p><b>ROWE: </b>Well, we will be working with the locals -- various locals over there. And I will put my team against four times the number of ISIS. They don't have nearly the amount of training that we have.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, but you must acknowledge the danger. So you are going over to a foreign nation and the U.S. government doesn't want you to go, by the way, but they can't really stop you. You are going over there and then you are partnering up with some people who you really don't know that well, right? I mean they are supposedly anti-jihadists but you really don't know, do you?</p>                \n                \r\n\n            \n                <p><b>ROWE:</b> Well, the Peshmerga is a decent group and there's talk in congress right now about sending them aid although it doesn't really say what --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So you're going to go to Kurdistan not Syria? You're going to go up to Kurdistan first.</p>                \n                \r\n\n            \n                <p><b>ROWE: </b>Well, we are establishing connections in both Iraq and Syria. The Kurds are in both areas.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right. All right. So the Kurds, I would trust more than, you know, but if you drop yourself into Syria, you are going to get sold out. You know how dangerous it is over there.</p>                \n                \r\n\n            \n                <p><b>ROWE:</b> It's going to be dangerous regardless.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's going to be dangerous regardless but I don't want to see your head on a stick and an American is worth half a million dollars over there.</p>                \n                \r\n\n            \n                <p><b>ROWE: </b>They're not going to capture my men.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What?</p>                \n                \r\n\n            \n                <p><b>ROWE:</b> If they take me, they are going to be taking my dead body but that isn't going to happen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. You understand though the danger of dropping yourself into a war zone that's pretty much out of control. I mean there are some U.S. advisors over there and but I don't think they are going to hang with you guys, are they?</p>                \n                \r\n\n            \n                <p><b>ROWE:</b> Well, hopefully we can get us some. I mean we already got three rangers on our team. We have a pretty good team coming together.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ex-Rangers though. They are not service people now --</p>                \n                \r\n\n            \n                <p><b>ROWE:</b> Right. That's right -- former Rangers.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So I'm not sure about, you know, and I'm looking out for you here, Sean, I'm not sure about the wisdom of this.</p>                \n                \r\n\n            \n                <p><b>ROWE:</b> It's crazy I admit it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I mean obviously we want to defeat the jihadists, but I just -- you know, if you go over there and you take a wrong turn, you are going to be dead.</p>                \n                \r\n\n            \n                <p><b>ROWE: </b>We can't let fear incapacitate us, Bill. They need help over there no one can disagree with that and who better than American veterans?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How are you getting the money to go over?</p>                \n                \r\n\n            \n                <p><b>ROWE: </b>We are funding ourselves mostly. That's why we are reaching out for help because we are going to need all the help we can get in what is sure to be a lengthy and demanding mission.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How are you going to get arms?</p>                \n                \r\n\n            \n                <p><b>ROWE:</b> We're going to have to purchase them over there because we can't take them. So that's why we're raising money. Arms -- we're looking to raise funds for medical supplies. We're hoping to get armored medevac vehicle, maybe a couple of armored trucks if possible and even a mini drone.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How do you get them in there, though? How are you yourself going to get into Kurdistan? How are you going to do it?</p>                \n                \r\n\n            \n                <p><b>ROWE: </b>It's going to be a challenge and there's going to obstacles that we're going to have to overcome. But we can't let fear or doubt stop us, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, Sean. I wish you the best. I hope you guys think it out though. Because I don't want to be reporting three months from now that you are being held in some cage some place and set on fire. You know --</p>                \n                \r\n\n            \n                <p><b>ROWE: </b>-- it's not going to happen, Bill. Not going to happen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Thanks for coming on.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Veterans against ISIS", "description": "Group planning to launch a combat mission to fight the jihadists", "date": "2015-05-21T12:29:29Z"}