{"vcmId": "619a7e62-e2d8-462f-99a0-eea8787e3758", "url": "http://www.foxnews.com/transcript/2014/10/22/battle-for-senate.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 21, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>From \"Back of the Book\" segment tonight, the midterm election, just two weeks away and the Senate is on the line, as you know.</p>                \n                \r\n\n            \n                <p>If Republicans win the Senate, President Obama may become isolated in the White House. According to polling out today, Republican Senate contenders lead in Colorado, Louisiana, Kentucky, Arkansas, and are tied in Kansas.</p>                \n                \r\n\n            \n                <p>Also, Republican Scott Brown, just three points behind in New Hampshire.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington with analysis, Charles Krauthammer. So, all these races are close, Charles. But why aren't Republicans further ahead because of all the trouble in the country.</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, FOX NEWS CONTRIBUTOR: </b>It's a good question. And the answer is people don't particularly like Republicans.</p>                \n                \r\n\n            \n                <p>The latest poll, the favorable ratings are 36 percent, with unfavorable of 54. That's underwater by 18 points.</p>                \n                \r\n\n            \n                <p>Whereas, the Democrats are only seven points underwater. Now, I think the best explanation for that is very simple. People associated the Republicans in the last several years -- actually over the life of the Obama administration, as the Party of No, the party that says no.</p>                \n                \r\n\n            \n                <p>I think that's a good thing. If the guy in power is doing the wrong thing, the opposition is supposed to oppose.</p>                \n                \r\n\n            \n                <p>However, they want to see something more positive. No will get you so far. It worked very well in 2010. But it only gets you so far.</p>                \n                \r\n\n            \n                <p>You don't sweep with no. And, I think, the reason is this -- Republicans, when you're the party out of power, particularly in year six, it's impossible to get together a national program.</p>                \n                \r\n\n            \n                <p>The only example where an opposition party put together a national program was in 1994, Newt Gingrich and the \"Contract.\" In a parliamentary democracy, the opposition has its platform and has its shadow cabinet.</p>                \n                \r\n\n            \n                <p>People know exactly where it stands. It's not the same in our system. So, what do you need.</p>                \n                \r\n\n            \n                <p>The irony is that if Republicans can capture the Senate, they can then develop an agenda, pass legislation in the House and the Senate, dare the President to exercise the veto and show the country that they have a vision.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> And that would prepare them for 2016.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Here's what I would do if I were the head of the Republican Party -- I think Reince Priebus is the head of it, right.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>KRAUTHAMMER: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I think it's safe to say, very few Americans know who Mr. Priebus is. But if I were the head of --</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>-- the party, I would take out ads, you know, all of the states that matter, and I would say, \"The Republican Party stands for this,\" -- on a number of issues.</p>                \n                \r\n\n            \n                <p>Number one, a travel ban from West Africa with Ebola, because you capitalize on that, all right. Just a 30-second spot -- the Republican Party stands for this -- immigration reform, taxes -- and have short, pithy solutions under the banner of the Republican Party stands for.</p>                \n                \r\n\n            \n                <p>Because, right now, we have a distracted electorate. I don't know if the pundits understand that -- that, more than ever before in this country, people are developing their own fantasy lives on the Internet, not paying attention.</p>                \n                \r\n\n            \n                <p>Every week, we send Jesse Watters out. And every week, he comes back and people -- I can't believe they don't know what Ebola is.</p>                \n                \r\n\n            \n                <p>I can't believe they don't know what Vice President Biden looks like. I can't believe they don't know anything. You know what, Charles, they don't.</p>                \n                \r\n\n            \n                <p>And that is why I don't think the Republicans are getting any currency because they don't know what the message is. The folks don't know what the message is.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>Well, look, I don't think a 30-second ad by the party is going to make any difference. These are mostly local races.</p>                \n                \r\n\n            \n                <p>On one side, people are -- it's a referendum against Obama. And that's the reason there's wind behind the sails of the Republicans.</p>                \n                \r\n\n            \n                <p>On the other hand, the Democrats have relatively strong candidates in these red states, often with pedigrees, names like Landrieu in Louisiana. You know, names like Nunn in Georgia. Names like Begich in Alaska.</p>                \n                \r\n\n            \n                <p>That carries a lot of weight. So, in that case, I don't think a 30- second ad is going to make a difference.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I do. I think the Republican Party has to define itself, to some extent, on what they would do about these problems.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>Yes. But I don't think it's done in an ad. I think it's done on the ground, in the Senate when you win it and you pass -- look, the House has passed a ton of legislation that dies in the Senate because of Harry Reid. No one knows about that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's right. They don't know who Harry Reid is.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>And the press is not going to --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Tell anybody.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> -- is not going to talk about that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Because it's not interested in it. So, what do you do. You're going to win the Senate which, I think, they're going to do. And then you can have an agenda.</p>                \n                \r\n\n            \n                <p>You'd start with the Keystone Pipeline. You'd start with allowing oil sales overseas.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>And then you'd go to tax reform, corporate and individual. You go for the big thing, --</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>-- the thing Obama has talked about, the thing that would --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right, but let me stop you there. We're getting ahead of ourselves.</p>                \n                \r\n\n            \n                <p>So, you, Charles Krauthammer, two weeks from the vote, are predicting the Republicans will take the Senate. Is that what I'm hearing.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> I'm not exactly going out on a limb here.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But you're predicting it.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Yes, I am predicting it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>And I have -- I have been wrong in the past, rarely, but I have been wrong. I'm predicting the Royals also in the World Series.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, the Royals are a good bet because they have momentum and that's a scrappy young team. So, you see that the \"No\" vote, the anti- Obama vote is going to carry the day two weeks from now. Last word.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Yes, I do. I mean, the President, historically, low numbers. Again, relatively strong candidates for Democrats in these states.</p>                \n                \r\n\n            \n                <p>But I think the odds are quite favorable. I'd put them at three-to- one right now --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Wow.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>-- that Republicans win the Senate.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, Charles Krauthammer. \"Things that Matter,\" --</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>-- is his book. Check it out. Good read.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The battle for the Senate", "description": "Charles Krauthammer weighs in on how the GOP is polling ahead of the midterm elections", "date": "2014-10-22T12:17:00Z"}