{"vcmId": "61a39e8a-4158-4689-96c4-825b9351f721", "url": "http://www.foxnews.com/transcript/2016/05/19/was-jesus-socialist-sanders-supporter.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" May 18, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Impact segment tonight, New poll conducted by the Barna group asked Americans about economics and Jesus.</p>                \n                \r\n\n            \n                <p>First question, do you think either capitalism or socialism aligns better with the teachings of Jesus? 24% say socialism, 14% capitalism.</p>                \n                \r\n\n            \n                <p>The question apparently too difficult for the rest of those asked.</p>                \n                \r\n\n            \n                <p>Which presidential candidates' policies align closest to teaching of Jesus, 21% say Bernie Sanders, 11% Ted Cruz 9% Hillary Clinton and 6% Donald Trump.</p>                \n                \r\n\n            \n                <p>With that analyze, Eboni Williams and Monica Crowley. The Trump numbers no. Jesus would not be living in the Trump tower surrounded by gold. He wouldn't.</p>                \n                \r\n\n            \n                <p><b>MONICA CROWLEY, FOX NEWS CORRESPONDENT</b>: I don't think it applies to any presidential candidate ever. Jesus was a transcendent figure. You can't assign modern political philosophy - -</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Jesus himself would not be living in the trump tower. That's why I wanted to explain why that number's so low.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: He was a humble carpenter.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: He had no aspirations material things, Eboni. That poll isn't as crazy as some people might think.</p>                \n                \r\n\n            \n                <p><b>EBONI WILLIAMS, FOX NEWS CONTRIBUTOR</b>: It makes total sense to me. A lot of people feel the teachings of Jesus was about the collective. The well-being of the collective is more important than the individuals.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You said the word Christ. This poll did not assign religion. So Christ, if you call Jesus, Jesus Christ, that means you are defining him as the Redeemer.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> Jesus Christ it is to me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ascend to do heaven. This one was Jesus the man. Interestingly enough, the philosophy of Jesus was to reject materialism. To depend on other people for your well-being and to give to the poor as much as you could.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Here's the key distinction though, Jesus did not believe in government coercion to redistribute wealth or to demonize the wealthy. Biblical expression is the love of money is the root of evil. Not money itself but love it because it drives a wedge between you and God.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Creates a self-centered situation.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Remember Jesus said rendering unto Caesar what is Caesar's and to God what is God's. They are earthly responsibilities including that the tax man will always commeth. That you do have to take care of that as well.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Pay them.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: He believed in private charity. He believed the people taking care of each other, not through coercion, not through state force, for example.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What you think?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: That makes sense to me. I also think for many that they feel there is a moral issue around economics. There is this issue of many people having so little and so few people have a lot.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's what Bernie Sanders runs on. Morally wrong for the 1%, the billionaires.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> That's why he is so vocal of his praise of the current pope, I believe. That's a place where he really resonates- -</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But the Pope live in a lavish. He himself does not live in the chambers, he lives in much more modesty thing. The philosophy that Bernie Sanders spouts is not what Jesus, in my opinion, would be down with. Current vernacular. Because, Bernie wants to take. Jesus never ever took. He wanted you to give.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: That is correct. And also Bernie wants to use the full weight of the government.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: To take.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Take and then redistributed because the government knows best. Jesus was not a Robin Hood kind of figure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Know matter how hard Eboni, or Monica or me work. Bernie feels that he has authority, or should have the authority to take from us, all right, to an extent that inflicts pain.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Injury, we would say in the law.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. Because I don't want to pay more than 50% of my earnings to anyone.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: That goes back to classic Marxisms. You talked about how he took his honeymoon not in Vegas but in the Soviet Union.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's right. You see powers face? She was giving me jazz and I hit the honeymoon and she was out of here.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> It's all about the vanguard. The ruling elite taking from the people to redistribute and ultimately the state would wither away. But, it's never worked that way in practice.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I believe this poll is accurate, that most people thinking about well, Jesus, he probably would be with Sanders because Sanders wants to redistribute to the poor.</p>                \n                \r\n\n            \n                <p>All right. Here's what I've done. And I shouldn't say this, but here's what I have done. When I die, which could be anytime now because - -</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: - - That's a long time away.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I've been a lot of sugar.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> On the show for the ratings.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Most of my money will go to charity, my charitable foundation.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: That's great. You're giving it away voluntarily?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I'm trying to buy my way to heaven. That's the strategy. Frank Sinatra tried to do that.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: It didn't work.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Bernie wants to take more of that money that's earmarked for children and vets and all of that, so he can throw it away on government programs that we all know.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: The government is doing such a great job of managing it?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Bernie, get out of my face, I'm going to heaven - - well, maybe not.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Critical point what we know as socialism, the track record is pretty bad. Equal share of misery and poverty and oppression.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: I agree with not criticizing and demonizing prosperity.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Alright, ladies.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i><br> &#160;</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Was Jesus a socialist Sanders supporter?", "description": "Eboni Williams and Monica Crowley join 'The O'Reilly Factor' to discuss a new poll on Jesus, economics and politics", "date": "2016-05-19T12:24:44Z"}