{"vcmId": "61afb4c0-c230-4405-bc3f-ad5d2817ca46", "url": "http://www.foxnews.com/transcript/2015/01/29/how-to-defeat-hillary-clinton.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 28, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight: how to defeat Hillary Clinton. It is a forgone conclusion that if she wants the nomination, Mrs. Clinton will get it on the Democratic side. For the Republicans there are about a dozen people who may run, no clear cut favorite right now.</p>                \n                \r\n\n            \n                <p>The question tonight: what are the main issues that could be problematic for Hillary Clinton?</p>                \n                \r\n\n            \n                <p>Joining us now from Austin, Texas Karl Rove. Before we get going, we're going to do this on the Republican side as soon as some candidates emerge we're going to do the same thing. What are the issues that could cause so and so problem on the G.O.P. side? So this is not a partisan play.</p>                \n                \r\n\n            \n                <p>But I'm interested to see the three issues that you think Mrs. Clinton might have trouble with. Number one?</p>                \n                \r\n\n            \n                <p><b>KARL ROVE, FOX NEWS CONTRIBUTOR</b>: Foreign policy. The most obvious, she was Secretary of State under Barack Obama. You can't look around the world and not see a problem. She was the architect of the Russian re-set. We had Syria problem, Iraq a problem, Afghanistan a problem, the resurgence of ISIS, our deteriorating relationships around the globe. She was Secretary of State, you can't point to any success.</p>                \n                \r\n\n            \n                <p>And my suspicion is by 2016 under this president we are not going to be a more peaceful world, not going to be more secure. It's going to be even more complicated than it is today. So foreign policy -- number one.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. But you know that's not on the minds of the American people. That's not even in the top five in the general foreign policy arena. Terrorism is but not foreign policy. The other thing is Mrs. Clinton has said that now she wants to testify about Benghazi and get that all clear.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Yes, look. Benghazi could be a problem. My sense is this is sort of like potentially like President Obama. Remember how he let all this conversation go about how he was not really born in the United States of America and it took him years before he finally put it out? He loved having conservatives talk about it.</p>                \n                \r\n\n            \n                <p>I'm beginning to suspect that Mrs. Clinton might have been happy to let the Benghazi thing to go forward and controversy be there because she has some asbestos. She is really, if you get into, isolated insulated from it, I don't know. But the overall picture of foreign policy is going to be difficult for her to defend her record.</p>                \n                \r\n\n            \n                <p>I disagree with you on one thing. Foreign policy becomes central. People think about foreign policy very little when there is peace and prosperity. They think about it a lot when America is threatened. That's why, you are right. Terrorism is the way, the prism through which people - -</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. Terrorism -- that's what it is.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> And they are -- they are looking at Russia and they are looking at the relationships. They are looking at Iran. And all of those things will come into play.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. But just remember we send Watters out every week to talk to regular voters, younger people primarily and they have no clue and they couldn't careless. There is a huge voting bloc of Americans. This isn't even on their radar screens.</p>                \n                \r\n\n            \n                <p>This brings us to number two, what's the second issue?</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>Well, the jobs and the economy which is the number one issue in most elections and will be so probably in 2016. Mrs. Clinton's problem is this. She doesn't understand how the economy works. And she doesn't have a real concrete vision of how she thinks it ought to go. She is going to be stuck defending the anemic recovery that we have had under Barack Obama.</p>                \n                \r\n\n            \n                <p>In July she gave an interview with Charlie Rose in which she said he tried to prod her on what she was going to talk about. She said I may quote, \"tackle growth, the handmaiden of income stagnation.\" Now, let's take that sentence apart. Growth and the problem -- it's the handmaiden. The handmaiden means it's a servant of the problem, the creator of the problem of income inequality.</p>                \n                \r\n\n            \n                <p>I think the problem in America today is not that we have too much growth it's that we have got too little growth. Part of the problem is that she is looking at it through a very left prism. She went to Boston in October and made that same comment that had been made by Elizabeth Warren and previously made by the President by saying, you know, corporations and businesses don't create jobs. Well, who does? I think it's businesses and business leaders that create jobs.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's the one -- that quote in Boston will be absolutely used against her. What's the third one?</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Deficits and debt. President Obama will have chalked up an enormous amount. 40 percent of the national debt of the United States will have been raised on his time in office. There was a report this week by the Congressional Budget Office that said it's going to stabilize being the public debt of the United States being roughly equal to 74 percent of G.D.P. through 2016 and then it's going to begin to rise.</p>                \n                \r\n\n            \n                <p>So we're going to have a discussion in 2016 from the CBO and the OMB.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't know if you are going to get any traction on any of that.</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>No, no, no. No, no, no.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The board is back.</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>The board is back. \"Wall Street Journal\" poll this month, they had a list of about 15 issues and they said is it an absolute priority for Congress to do something about it this year? The top three, well above everything else, the next thing below this is at 58 percent saying absolute priority this year. Number one is creating more jobs; defeating ISIS and dealing with terrorism; reducing the deficit and the national debt. Those were the top three issues. Those are going to be that issues that are her problems in 2016.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Mr. Rove -- thanks as always.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "How to defeat Hillary Clinton", "description": "Karl Rove on the three main issues that could be problematic for the possible presidential candidate", "date": "2015-01-29T13:28:24Z"}