{"vcmId": "6341794d-6347-44d6-86d0-ee89e1efe54e", "url": "http://www.foxnews.com/transcript/2015/09/01/has-donald-trump-obscured-democratic-record.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 31, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Continuing now with our lead story. Is Donald Trump actually helping the Democratic Party?</p>                \n                \r\n\n            \n                <p>Joining us now from Washington, Charles Krauthammer, author of the book \"Things that Matter\". You know, I feel kind of bad because there is your book and I want everybody -- if you don't have it by now, you should get it. I feel kind of bad, because that was like a partisan analysis and I don't like to be a partisan guy. I'm an Independent.</p>                \n                \r\n\n            \n                <p>But if you really look at the facts. And you really look at the achievements and President Obama has like one year left, you know. You can say all right maybe Obamacare benefits the poor overall benefit to the country is still to be assessed. Maybe Bowe Bergdahl trade was good for the country -- that kind of escapes me.</p>                \n                \r\n\n            \n                <p>But the Republicans should be up 60 points on the Democrats but they're not. And I think it's the Trump factor -- am I wrong?</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, SYNDICATED COLUMNIST: </b>No, I think you have actually stumbled near the truth. But you have got one of the nuances wrong. Look, you are absolutely right, that given how dissatisfied the country is with its condition and given the fact that we have been under Obama government for six years this ought to be the driving theme of the Republicans and it ought to have them way ahead.</p>                \n                \r\n\n            \n                <p>Why isn't that true? Think back to the Republican debate. You heard all kinds of names thrown around including Hillary Clinton. But there was a very strange absence, a very low incidence of the use of the name Obama. The candidates led by Donald Trump were trying to be one more antiestablishment than the other.</p>                \n                \r\n\n            \n                <p>Trump's campaign and here is where I disagree. It's not just that the pizzazz around him, the hoopla around him and the sizzle, as you put it is what is distracting. It's also the fact that the substance of what he is saying. Look, Donald Trump is not running against the Democrats. He's running against Washington. He is running against the establishment. He's running against the politicians he says who are stupid and incompetent and are being out maneuvered by those clever Chinese and Mexicans, et cetera.</p>                \n                \r\n\n            \n                <p>So the substance of the campaign is antiestablishment rather than anti-Democratic. And that, I think, is the core of what's going on right here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But you can point to all of Trump's specific criticisms as the failure of the President of the United States because he's the leader. He is the guy that's got to rally the country to stand up to the Chinese or to stand up to the Mexicans or to stop all the illegal immigration. So I agree with you that it's an antiestablishment play, all right. But I don't agree that President Obama is not responsible because he is. He is the leader.</p>                \n                \r\n\n            \n                <p>But that's how I would argue if I were campaigning. That's how traditionally the out-party campaigns when it's running after six years, seven years and it wants to regain the White House. But the problem is that in Obama's case what you are getting is kind of a pass because Trump is leading the field. Trump is shaping the debate.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>And Trump is in effect running as a third party candidate. He is running an intraparty, intra-GOP insurgency against the leadership, against the establishment. And, therefore, the argument against the Democrats is left by the wayside.</p>                \n                \r\n\n            \n                <p>Look, historically speaking, you go back to 1953, with only one exception, every time one party has held the White House for two terms, they have been tossed out on their rear ends. The only exception, of course is, Reagan who was so successful they gave him a third term with George Bush Senior running it. But, otherwise, Americans usually after eight years are tired.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes they want a change.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> And this particular case, the failure of the administration as you outlined in your Talking Points is so overwhelming --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's massive.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> -- that it is a \"gimme\" -- it is a \"gimme\" for the Republicans.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> But Trump is leading them into an intraparty fight against the elite.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. But I don't know how much longer that lasts. We will see in the next debate in two weeks whether the Republicans come back to listen. 71 percent of the country is dissatisfied -- 71 percent. That includes a lot of Democrats and a lot of liberals, all right?</p>                \n                \r\n\n            \n                <p>And maybe they are dissatisfied in a Bernie Sanders way. They want to burn down capitalism and put in, you know, Cuba-light. But I don't think there is a lot of those people.</p>                \n                \r\n\n            \n                <p>Now, everybody goes the media, the media, the media. I don't buy that anymore because I think the message has gotten through as I just said. I think the stats show Americans know this country has lost an enormous amount of power -- enormous amount of power in almost seven years under Mr. Obama. Would you say that's true? Most Americans know that.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> But that's what is so, if you're a Republican, tragic about the course of this campaign. Of course it's true, it's overwhelmingly true. The world knows it, Americans know it, but it is not something Republicans are hammering.</p>                \n                \r\n\n            \n                <p>I will give you one small example. When Trump got into this John McCain thing. What he said was what I really have against McCain is about how the veterans are being treated. Now, this is really absurd. Who is in charge of the VA? Who runs it? The administration, the President, the cabinet. The people he appointed -- his political appointees. That's where the blame resides for six years of mistreatment.</p>                \n                \r\n\n            \n                <p>To blame it on one senator or even the whole senate is ridiculous. It's not the job of the legislature to run the Veterans Department. Here is an obvious case where you can argue against Democratic rule, show how it is corrupt and incompetent and yet it's not being made.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> And that I think -- it's not the media. It's not the pizzazz. It's not the hype. It's the substance of these arguments. They are leaving out Obama. They are leaving out Democrats.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The first Republican candidate that gets back to that, copies my talking points of tonight, believe me, somebody will, they are going to surge because I think that the Trump thing has now played out. He's established himself as an antigovernment guy. He has his constituency there. But now you have got to win and the only way you win is to defeat the Democratic Party which is in bed with the President.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>I agree.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They haven't rejected the President. Hillary Clinton hasn't rejected any of his policies. And they are ripe for the taking. Last word.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>Well, that's going to be the key. The only problem is Republicans have had a whole summer, a few months in which they could be pounding the President making the case in the debates, for example, you could have had 10 people attacking the Obama administration and the record. And that's going to be the key. The question is how long will it take them to get around to doing that because that's the only way they are going to win.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right, Charles, thanks a lot. We appreciate it as always.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Has Donald Trump obscured the Democratic record?", "description": "Charles Krauthammer reacts to the GOP front-runner's campaign", "date": "2015-09-01T12:23:27Z"}