{"vcmId": "645cdb49-8521-41aa-9d82-d3de6e7a95da", "url": "http://www.foxnews.com/transcript/2015/02/11/gary-sinise-enters-no-spin-zone.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 10, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Back of the Book\" segment tonight. Gary Sinise, very successful actor here in Hollywood, but much more importantly the Gary Sinise Foundation raising millions of dollars to help wounded American vets. And here is Mr. Sinise. Tell me about the Rise Project, R-i-s-e, what is that?</p>                \n                \r\n\n            \n                <p><b>GARY SINISE, ACTOR: </b>Rise is a program of the Gary Sinise Foundation restoring independence, supporting empowerment. We want to take care of our wounded. And obviously that means giving them as much independence as possible. You're doing that through the independence fund with the track chairs, he provides housing, especially adapted housing, adapted vehicles. Things that are going to empower them to have a better life.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So your foundation is now actually building houses for specific individuals with handicaps, so that they can live more comfortably, that's what it is?</p>                \n                \r\n\n            \n                <p><b>SINISE:</b> Yes. Smart technology homes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's amazing. And then also cars, equipped with cars so they can get around. So, my question is, you have devoted most of your life to this outside of your acting career. We have raised about $30 million with independence fund, as you mentioned, for the track chairs. Why isn't the federal government doing more?</p>                \n                \r\n\n            \n                <p><b>SINISE: </b>Well, I always say, you know, we can never do enough for our veterans, but we can always try to do a little bit more. Obviously, the government, it's a big giant bureaucracy, and there are a lot of veterans that have been served well by the government, they've done well. But we have a new generation of Lieutenant Dans from --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Iraq and in Afghanistan, where they got their limbs blown off. Because that's the way the savages fight against us. But the federal government should recognize this. I must say and I always say this, because I've been hard on President Obama on policy, that he helped immeasurably signing the pictures with the five presidents, and every time I asked him to help, he does, every time. But it doesn't seem to be a coordinated priority for the federal government to take care of the severely wounded. With tax income in 2015, tax money flowing to Washington, the highest in history. You would think they would peel off enough money to take care of a relatively few people who are debilitated like this.</p>                \n                \r\n\n            \n                <p><b>SINISE:</b> You would think.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You would think.</p>                \n                \r\n\n            \n                <p><b>SINISE: </b>Especially when you see how money gets wasted by the government.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>SINISE:</b> And it's infuriating to know that there are still veterans out there who are wounded who don't even have a bed to sleep on. Just the other day, we got a request for a wounded veteran who was returning back to his apartment from a hospital, and he didn't have a bed. He was sleeping on the floor with his seven-and-a-half month pregnant wife. We provided them with a bed. You know, I think the private sector has been very -- actually, very, very good. In the last 14 years, a lot of organizations like the Independence Fund, like the Gary Sinise Foundation, like the Semper Fi Fund, I work a lot with the disabled American veterans who have been around for over 90 years advocating for veterans, there are a lot of good nonprofit organizations out there filling the gaps. If they didn't exist, it would be a --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> These guys are being on the streets on crutches. All right. So you tour around with your band, Lieutenant Dan Band, off the Forrest Gump role that you played in. We're going to do something with you in New York City in May. Sinise and O'Reilly, how much charisma is that, okay? We will announce what it is, and I'm sure it will sell out and we'll raise a lot of money. You're also getting into the criminal minds franchise on CBS, is that correct?</p>                \n                \r\n\n            \n                <p><b>SINISE: </b>I am. We start shooting tomorrow. I'm doing an episode of the \"Criminal Minds.\"</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Are you a good guy or a bad guy?</p>                \n                \r\n\n            \n                <p><b>SINISE:</b> Of course. You know, yes --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Tracking down the criminal mind people, right? Those shows frighten me. I mean, there's a lot of stethoscopes, and you're looking at blood and stuff. I don't know. So, you know what, I think it's karma, your career is very, very good, but you give back more than any other actor I think in Hollywood. I think Sinise is the top on give-backs. Last word, tell people how they can get to Gary Sinise Foundation.</p>                \n                \r\n\n            \n                <p><b>SINISE: </b>Thank you, Bill. You can go to GarySiniseFoundation.org. We have a lot of various programs. My band, the Lieutenant Dan Band, is a program of the Gary Sinise Foundation. I don't make any money from the band.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Nope.</p>                \n                \r\n\n            \n                <p><b>SINISE:</b> It's supported just to help me with the military mission, and anyone who's interested in supporting us, go to the GarySiniseFoundation.org.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. It's GarySiniseFoundation.org. You're going to heaven, Sinise.</p>                \n                \r\n\n            \n                <p><b>SINISE: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Just to come on the program.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Gary Sinise enters the 'No Spin Zone'", "description": "Hollywood actor on raising money for wounded veterans", "date": "2015-02-11T13:24:15Z"}