{"vcmId": "6506cd07-9054-4bda-ae16-6dfa2865395f", "url": "http://www.foxnews.com/transcript/2015/03/11/gop-senators-send-controversial-letter-to-iran.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 10, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight, 47 Republican senators sending a letter to the Iranian mullahs saying any nuke deal President Obama makes not approved by Congress subject to revision. That has outraged some Democrats.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> I'd say this borders on treason. I've never heard of them doing this before. You don't undermine the President of the United States. It's never been done in the history of the country before.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Joining us now from Washington, Danielle Pletka from the American Enterprise Institute, a right-leaning think tank. So what do you think about the letter? The \"Wall Street Journal\" editorial page which is conservative criticized it today. What do you say?</p>                \n                \r\n\n            \n                <p><b>DANIELLE PLETKA, AMERICAN ENTERPRISE INSTITUTE:</b> Well, the Journal thought that the letter was a distraction from focus on the right things in the Iran negotiation. I think the letter's a good idea. And I think that it's important that everybody whether it's the Israeli Prime Minister or its members of Congress alert the world to the really lousy deal that the Obama administration is pressing for with Iran.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But we don't know how lousy it is yet because it hasn't been laid out to the public. And doesn't this letter by the 47 -- and seven Republicans didn't sign it, by the way. Doesn't this letter make it tougher for the Iranians to give anything? They'll say we're going to give x, y and z and as soon as the president changes this might be all moot so we're not going to do anything until that time. That could absolutely happen, could it not?</p>                \n                \r\n\n            \n                <p><b>PLETKA:</b> I don't think so. You know, the reality is very few members of Congress actually know what's going on in these negotiations.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, that's what I'm saying. We don't know.</p>                \n                \r\n\n            \n                <p><b>PLETKA:</b> Right. But what we hear about are leaks and we also hear concerns and we also hear what's been given by the Iranians. The reality is that the Iranians don't need to be worried about giving more because they have given almost nothing to the Obama administration. It is the Obama administration who's done all the moving.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, you are an expert on Iran, right?</p>                \n                \r\n\n            \n                <p><b>PLETKA:</b> I hope so.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you trust them?</p>                \n                \r\n\n            \n                <p><b>PLETKA:</b> No, I don't think we can trust them. Not at all.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. Do you believe that the Iranians are -- will cheat on the deal and try to be as aggressive as possible in gaining power in this world? No matter what we do.</p>                \n                \r\n\n            \n                <p><b>PLETKA: </b>You don't need to be an expert on Iran to understand that they're going to cheat on any deal because every single revelation about their nuclear weapons program has been after the fact, hidden from the International Atomic Energy Agency, hidden from the international community. We discovered Fardow, the enrichment site only after it was built and going; same with Natanz, their other site. The Iranians cheat. And they have a long track record of doing so.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So what's the point on even negotiating with them at all?</p>                \n                \r\n\n            \n                <p><b>PLETKA:</b> Well, I think this was a political effort on the part of the President. And don't get me wrong it would be good to have a deal. Nobody wants to see military conflict either by the Israelis or by the Americans or anyone else with the Iranians. A good deal is worth having.</p>                \n                \r\n\n            \n                <p>The problem is --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But if they cheat on -- say we got a good deal and they cheated on it. I mean what good is it?</p>                \n                \r\n\n            \n                <p><b>PLETKA: </b>Well, if it were good enough, there would be independent verification. There would be a very long lead time. All the things that Barack Obama said he wanted. No enrichment for example, all would be a much better deal that would make it harder for the Iranians to cheat. Right now they've got a great a pathway.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's not really possible. Iran's not going to deal with that. They're not going to agree to that, are they?</p>                \n                \r\n\n            \n                <p><b>PLETKA: </b>I don't think they're going to agree to it because I think they're hell bent on having nuclear weapons and they think they can have it with the ok of the President.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What a mess -- right. What a mess. Miss Pletka, thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "GOP Senators send controversial letter to Iran", "description": "47 Republican Senators tell Iran any nuclear deal not approved by Congress is subject to revision", "date": "2015-03-11T12:15:13Z"}