{"vcmId": "66122d74-8648-4f07-a2db-6e5dce3b3598", "url": "http://www.foxnews.com/transcript/2015/11/03/gop-candidates-calling-for-debate-format-changes.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 2, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thanks for staying with us, I'm Bill O'Reilly in the \"Campaign 2016\" segment tonight. Number of republican presidential candidates are demanding the debate formats be changed. This after the CNBC attack on the candidates last week.</p>                \n                \r\n\n            \n                <p>Joining us now from Dallas, author of the new novel \"The Immortal Nicholas,\" a Christmas kind of deal here. Good-looking book.</p>                \n                \r\n\n            \n                <p><b>GLENN BECK, AUTHOR, \"THE IMMORTAL NICHOLAS\"</b>: Thank you. The words inside are even better than the cover there, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. Can I just get the intro out?</p>                \n                \r\n\n            \n                <p><b>BECK</b>: Go ahead.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. The legendary Glenn Beck. Now, this debate stuff we will get to the book in a minute. Is this just whining or do the candidates have a legitimate beef.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> No I think the candidates have an absolute legitimate beef. There's nobody on the stage that actually except for FOX News, there hasn't been a moderator yet that would actually vote for anybody. And so how are they expected to relate to the -- and ask the questions that I want to hear, that you want to hear? These guys are not going to vote for them. They despise them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. But I'm not buying that because if you use that as a litmus test, I couldn't interview President Obama or Hillary Clinton.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>No, no, no. Just a second. Anderson Cooper when he did the debated for the DNC --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>BECK</b>: Those are questions I would have asked. And he did a great job. But the Anderson Coopers of the world, the Megyn Kellies of the world are pretty rare.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. But Anderson Cooper forgot all about foreign policy so I wasn't that jazzed on that debate. But I think that the Republicans should pull back a little bit and say, look we want a fair forum.</p>                \n                \r\n\n            \n                <p><b>BECK</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And if it isn't fair, we are going to make that known. CNBC got destroyed on this. Absolutely destroyed.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> Yes. They did.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>BECK</b>: The big winner was the FOX Business Network.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Whatever. They come up Tuesday and it will be obviously a much more thoughtful debate than the CNBC thing. But I don't like when candidates complain about hard questions, Beck. I don't like that.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> I don't either. I don't think they were hard questions. Bill, I mean, one of the questions was fantasy football for the love of Pete.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. And they got mocked them. They got mocked asking those things.</p>                \n                \r\n\n            \n                <p><b>BECK</b>: I know.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And they should have.</p>                \n                \r\n\n            \n                <p><b>BECK</b>: But why waste that time? Here's Bill, we wrote a letter from \"The Blaze\" today --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> -- offering to do the ninth debate in February. We would like to do it in a very, very different way. First of all we are all almost digital. And this would be one that would appeal to the millennials. It would go, you know, all digital all online. We also have network, radio, and television that we could cover. But what I want to do is, I want to bring people and I say like because I haven't asked him but people like Peter Thiel or Elon Musk to ask questions about the future of the economy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So, you would bring in some people but you Glenn Beck would moderate it and I hope you get it.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> Correct. But bring people that are going to ask intelligent questions.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I will come in disguise Beck, Wild Bill Hickok --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BECK</b>: Right. There is this Phil.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: From Long Island.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>Correct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. All right. Let's get to your book now.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Beck, I got to break it to you now. You got the little snow thing going down. It isn't snowing yet, Beck, it's November 2nd.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> No, it isn't here, in Texas --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. It's not snowing anywhere but Siberia.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> No, Texas, crazy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's not snowing.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. So, that's a fraud right there right in the back. Totally fraudulent.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> Absolutely real, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, it's fraudulent. Look, you don't need that gimmick to sell the book. It's a good book.</p>                \n                \r\n\n            \n                <p>You don't need the gimmick to sell the book. Go down to Miami and get your little shorts, and you could sell a book that way. It's a good book.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You don't need the phony snow and the church. You don't need it.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>All right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> Change the background, please.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Tell me why you wrote this book.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> I wrote this book, actually, partly because of you, Bill. Every year you do the war on Christmas and you talk about how bad it's getting and about four years ago my kids were -- they only wanted to talk about that stupid elf on the shelf. And Santa Claus over the Christ child. And our Christmas concerts have become winter concerts and Santa has completely become just about the mall. And so, I really thought I could either become a grumpy old man like Bill O'Reilly or I could -- or I could do something different and go at a different direction and say, how can I - - how can I refashion Santa and make him a messenger of Christ that points to Christ? And so this is kind of almost a little way like a Benhur. It covers the birth and death of the Christ child. It covers the real Saint Nicholas but my Santa character is unlike any other Santa character that you have ever met.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right.</p>                \n                \r\n\n            \n                <p><b>BECK</b>: How does he become immortal and what does it mean?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So what I'm getting of that is that you have Santa in a chariot like Benhur with the whip, whipping around the Roman.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> You don't have to read it now, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> It's damn.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I like the book, Beck. I read a little of it today. \"The Immortal Nicholas\" and it's a beautiful cover and all that. So, it's a nice stocking stopper.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>Thank you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> When it's winter, Beck.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>It's snowing outside right now.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> God! Glenn Beck everybody. There he is.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "GOP candidates calling for debate format changes", "description": "Glenn Beck joins 'The O'Reilly Factor' to discuss several Republican presidential campaigns demanding greater control over debates", "date": "2015-11-03T13:11:41Z"}