{"vcmId": "686bcee2-58dd-4447-8bcf-9b76c2c3bb8b", "url": "http://www.foxnews.com/transcript/2014/11/20/dick-cavett-enters-no-spin-zone.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 19, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Back of the Book segment tonight. It's a new book out by the legendary comedy writer Dick Cavett. It's called brief encounters, conversations, magic moments and assorted high jinx. In the book Mr. Cavett discusses some of the most amusing people he has ever known. I spoke with him last night.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, I wanted to talk to you about funny people. Because you're a comedy writer. Let's take Groucho Marx first. You bet your life, you know, big 50s show. I mean, the guy was lightning.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MAN:</b> Charles Snow. How tall are you, Charlie?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MAN:</b> Five foot, two. First time I have ever had five feet of snow in L.A.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>DICK CAVETT, BLOGGER FOR THE NEW YORK TIMES:</b> Ad-libs on that show were just splendid. The famous incident with the cigar the guest had a dozen or so children. And Groucho said you really have that many children. He said, is there anything wrong with that? He said, \"No, I love my cigar too but I take it out of my mouth sometimes.\" The radio days.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You tell a great story about Groucho Marx on a tour bus.</p>                \n                \r\n\n            \n                <p><b>CAVETT: </b>Yes. One of the -- homes, sorry, the map tour bus came up to Groucho's house. And the man with microphone said, oh, look, there is Groucho's gardener working in the roses, let's see if we can get anything about Groucho. And he takes the mic out broadcasting into the bus and this man he sees has the hat pulled down and he's working with his roses and, in fact, it was Groucho but he didn't reveal it. And the square John with the mic says, could you give us any insights into your boss? What kind of a job is this? And a familiar boy said the pay's lousy but he lets me sleep with his wife.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, Bob hope, you feel he was one of the funniest men that you've ever seen?</p>                \n                \r\n\n            \n                <p><b>CAVETT: </b>Absolutely, yes. This is a man who went to the top in Broadway, went to the top in theater.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MAN:</b> I'm the greatest father of them all --</p>                \n                \r\n\n            \n                <p><b>CAVETT: </b>Went to the top in television, went to the top in movies.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p>UNIDENTIFIED MAN: Doctor, doctor, glad I'm not sick.</p>                \n                \r\n\n            \n                <p><b>CAVETT: </b>Hope certainly was the most skilled brilliant comedian style of stand-ups, beautifully articulated.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MAN: </b>They pointed to where your bedroom was --</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MAN: </b>Outside your door is a blackboard.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MAN: </b>Do you keep score of some kind?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MAN: </b>Not only that, so flattering I'm going to plead guilty.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>CAVETT: </b>Intrinsically funny, move, funny and everything. Then he stayed on too long. He was a patriot. He loved the country that had done so much for him. He just loved fame to the exclusion of everything in his life.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Loved being famous.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MAN: </b>I'm a musical comedy now. I'm a big star.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MAN:</b> Not in this house.</p>                \n                \r\n\n            \n                <p><b>CAVETT:</b> When I was a kid he walked out on a stage and there was nothing between me and Bob Hope. I ran around the stage door, Hope came down the steps and he said, fine show, Bob. He said thanks, son. And years ago by, Bill, and I look in the wings, yes, he's here and he's going to come out on my show. I told him that story and said, hey, was that you?</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MAN: </b>When you just walked out of the studio and you dropped it in there. You know, move your career.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You wrote for Carson. You had your own show on ABC. A lot of them are tortured individuals, right?</p>                \n                \r\n\n            \n                <p><b>CAVETT:</b> I fear that is true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But isn't it interesting that you devote your life to making people laugh, but you yourself aren't enjoying levity. Look at Johnny Carson.</p>                \n                \r\n\n            \n                <p><b>JOHNNY CARSON, COMEDIAN:</b> Here's Johnny!</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Brilliant comedian, correct?</p>                \n                \r\n\n            \n                <p><b>CAVETT:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Timing impeccable.</p>                \n                \r\n\n            \n                <p><b>CAVETT:</b> Perfect.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Perfect presentation. In his private life he's a mess.</p>                \n                \r\n\n            \n                <p><b>CAVETT:</b> I know. He was a very good friend of mine.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MAN: </b>We're not going to get away with it another year.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>CAVETT:</b> One of the most tortured teds, like a wire about to snap. He had drinking, he had certain times when I was writing for him just like that -- and he looked like a man who couldn't possibly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, he didn't enjoy going out the curtain and all that?</p>                \n                \r\n\n            \n                <p><b>CAVETT: </b>Yes, he did enjoy that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I diddle, diddle when he got out there.</p>                \n                \r\n\n            \n                <p><b>CAVETT:</b> Yes, yes. He enjoyed going out. You're right.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MAN:</b> How to you great to a diddle diddle in the morning?</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>CAVETT: </b>And I would stand backstage with him and he would have his last cigarette until the show. And he would impeccably clad and he do like a little tap dance step to warm up, drop the cigarette. But things on with command and he'd go out there and the applause and Johnny was happy and in command and masterful for one hour.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And same with Robin Williams, I think, when he was performing and lost in that performance.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED WOMAN:</b> Thanks, Mork, but I was trying to put the boot on.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MAN: </b>I guess you started the day off on the wrong foot.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But I thought that was a tremendous pressure. You know, because people always looking to Robin Williams, Jonathan Winters to make them laugh.</p>                \n                \r\n\n            \n                <p>Well, Mr. Cavett, thanks for writing the book. It has got a lot of really good stuff.</p>                \n                \r\n\n            \n                <p><b>CAVETT:</b> You don't have to call me Mr. Cavett anymore. Mr. Dick would be all right. Whatever you want.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Dick Cavett enters the 'No Spin Zone'", "description": "Legendary comedy writer on his new book 'Brief Encounters: Conversations, Magic Moments and Assorted Hijinks'", "date": "2014-11-20T13:21:09Z"}