{"vcmId": "68b9988f-e59c-40f6-9627-00ac8cd47470", "url": "http://www.foxnews.com/transcript/2016/02/03/what-next-for-ben-carson-campaign.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 2, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Personal Story Segment\" tonight, last night in Iowa, Ben Carson gathered 9 percent of the vote. But the Doctor believes the Cruz campaign hurt him at the caucus by putting out false rumors he was quitting the race.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DR. BEN CARSON (R), PRESIDENTIAL CANDIDATE:</b> If Ted Cruz doesn't know about this, then he clearly needs to very quickly get rid of some people in his organization and if he does know about it, isn't this the exact kind of thing that the American people are tired of? Why would we want to continue with that kind of, you know, shenanigan?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Joining us now from Palm Beach, Florida -- Palm Gardens, Florida I should say, Ben Carson. I want you to explain what happened. Because everybody doesn't really know what happened. A CNN post of some kind went up at 7:20 Central time, 8:20 Eastern -- ok. And what did that say?</p>                \n                \r\n\n            \n                <p><b>CARSON:</b> Basically said that I was in the process of suspending my activities.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok.</p>                \n                \r\n\n            \n                <p><b>CARSON:</b> And that I was going back --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That you were quitting.</p>                \n                \r\n\n            \n                <p>Carson: -- that I was going to go back home, that I wasn't going to go to New Hampshire. I wasn't going to go to South Carolina.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. So CNN put that up. Let's just walk through this so we know what we are talking about. CNN put that up -- apparently that came from Steve King, the congressman in Iowa. Is that where that came from?</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Well, Steve King subsequently tweeted out that it looks like Carson is out of the race and, therefore, you need to reconsider.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, do you know who put the original CNN thing up? Who did that? Was that CNN itself?</p>                \n                \r\n\n            \n                <p><b>CARSON:</b> I have no idea where they derived such information or why they would not be interested in verifying it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, isn't it CNN's fault then rather than Ted Cruz? Because if CNN did that, and believe me, CNN has put out false information about me, this program, Fox News. We're not surprised. It seems like that's what they do over there. But, isn't it CNN's fault and not Ted Cruz's fault?</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Well, I talked to Ted Cruz earlier today. And he says that he didn't know anything about what the campaign did in terms of contacting precincts telling people that I was dropping out -- that a vote for me was a wasted vote. You know, my wife spoke at one of the caucus locations and a Cruz person before her had told everybody that I wasn't going to be in the race and that they should reconsider their vote.</p>                \n                \r\n\n            \n                <p>A Carson person had spoken already. But the people wanted to hear from my wife. She did go up. She spoke. They loved her. Standing ovation and we won that precinct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok.</p>                \n                \r\n\n            \n                <p><b>CARSON:</b> I don't know what the total impact would be across all of the precincts, but obviously this is the kind of thing that we don't want happening.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Absolutely. But I'm trying to find out who the villains are here. Look, you got 9 percent. If you were out of the race, that 9 percent, most of it would have gone to Cruz, all right? Because you guys, you know, are very religious-oriented, your message is tailored for the evangelical. It makes perfect sense.</p>                \n                \r\n\n            \n                <p>But I'm trying to figure out who the real villain is here. When you talk - - you talked to Ted Cruz today, ok. Are you satisfied with his explanation?</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Well, I have to accept at his word that he didn't know because he said if he had known, he would have not agreed with such a thing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. So you're accepting his word and a gentleman will do that his campaign still ran with false information -- information that helped them, no doubt. But the information, it looks like, came from CNN. That's what it looks like.</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Yes. But, Bill, here's the issue. A culture exists within the Cruz camp that would allow people to take advantage of a situation like this in a very dishonest way. Isn't this the same thing we see with the administration, the IRS scandal? No responsibility.</p>                \n                \r\n\n            \n                <p>Let's see what, in fact, the Cruz campaign will do about those individuals who inappropriately disseminated this information knowing that the caucuses were not over. They were awfully anxious to get it out there, weren't they?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Sure. But that's politics as usual to me. All right.</p>                \n                \r\n\n            \n                <p>So, did you call CNN? Do you have anybody in your people call CNN and say what the deuce is going on? Why would you put out false information? Have you investigated that?</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Our people are investigating that absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. So when you know, we need to know. All right? Because I agree with you. I want to put this -- I want to stop this. I want to stop it cold.</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Right.</p>                \n                \r\n\n            \n                <p>Well, there are so many people who have said that's just the way it is. It's a cesspool. That's the way politics is.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No. Don't stand for it.</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: I don't accept it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Don't stand for it.</p>                \n                \r\n\n            \n                <p><b>CARSON:</b> I don't accept it at all.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Absolutely. You are going to campaign in New Hampshire. You're going compete in New Hampshire. You're a viable candidate. And those people attacking you and spreading false information. We need to find out what's going on over there because that news agency has to be held accountable. I will give you the last word, Doc.</p>                \n                \r\n\n            \n                <p><b>CARSON</b>: Absolutely. Well, I just appreciate the fact, Bill, that you and some others do want to get to the bottom of it and if we expose these kinds of things, and we condemn them and the people are the ones who have to say this is unacceptable, we will not do this. This is not the right thing to do. It's not the Christian thing to do. Don't accept it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. I'm with you on this. Let us know what you find out. We will do our own investigation and we'll call over there and tomorrow we will update the story.</p>                \n                \r\n\n            \n                <p>Doctor -- thank you as always.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "What's next for the Ben Carson campaign?", "description": "GOP candidate reacts to Iowa caucus results on 'The O'Reilly Factor'", "date": "2016-02-03T13:26:31Z"}