{"vcmId": "69b64d64-c2ee-4186-ba1a-c250ad518850", "url": "http://www.foxnews.com/transcript/2015/06/03/chaos-in-american-public-schools.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 3, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Unresolved Problems\" segment tonight. Chaos in American public schools. For the past five years the St. Paul Minnesota School District has spent nearly $3 million on white privilege training done by a far left outfit called the Pacific Educational Group. That training tells teachers to overlook transgressions by minority students to treat them differently than white students. Some teachers at St. Paul according to the EAJ News website which broke the story are furious. The schools have lost almost all discipline now.</p>                \n                \r\n\n            \n                <p>Last night I talked with Aaron Benner who teaches fourth grade minority students in St. Paul, he says, he was almost fired for complaining.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You are teaching at an elementary school. And you were seeing behavior, not in your class, but in the cafeteria and school grounds, that is getting worse, correct?</p>                \n                \r\n\n            \n                <p><b>AARON ANTHONY BENNER, ST. PAUL, MINNESOTA ELEMENTARY SCHOOL TEACHER:</b> That's correct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. What was the behavior that was disturbing you?</p>                \n                \r\n\n            \n                <p><b>BENNER: </b>We are concerned about the behavior of the students throughout the building, our school and what we see in the hallways. You are teaching your class and a student from another classroom, just opens up your door, runs in, grabs a computer, grabs a computer and throws it down and runs out. That is pretty disrupting for anybody. But you would see that student who came into your classroom and disrupted it still in the school. And that's mind boggling. You're like, where are the consequences? What is going on around here? That was my concern.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, did you yourself report bad behavior to the principal, vice principal whatever the structure is and nothing was done?</p>                \n                \r\n\n            \n                <p><b>BENNER: </b>In December of 2011 when I was working at another school, the behaviors were so out of control that I addressed the St. Paul School board by myself and I told them, it breaks my heart to see children who look like me behave so poorly in our schools and nothing is being done.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What did they come back to you with?</p>                \n                \r\n\n            \n                <p><b>BENNER: </b>Basically, you know, it was a pretty much an empty board room in December of 2011. And there was sporadic clapping after my speech and that was it. Nothing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But what about the school you that worked in? Where you said, you have to help me. You have to discipline these kids who are running wild. What did they say to you?</p>                \n                \r\n\n            \n                <p><b>BENNER:</b> And I had an altercation with a student that actually punched me. I restrained the student, brought the student into the principal and I didn't want the student to be incarcerated. However, I wanted some consequences. That student was returned back to my class Mr. O'Reilly within 10 minutes. That's when I knew there was a problem at St. Paul public schools. I knew that there must be some sort of directive to keep these kids in school, in the classroom, no matter what.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Did they ever say anything to you, why they return a student who punched you, into your class? Did you ever get an explanation?</p>                \n                \r\n\n            \n                <p><b>BENNER: </b>No. I've never got. The only explanation was, the student has said he is sorry and he is back in your room. And that was in 2011.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Now you have put a lot of the blame for this on the Pacific Educational Group. Which consults to some St. Paul Schools. What does that group do?</p>                \n                \r\n\n            \n                <p><b>BENNER:</b> We have mandated training. And they are basically letting people know that white privilege and white people's biases are hampering black students from learning. That's peg in a nutshell. I think we are just crippling our black children in St. Paul by making excuses because we are trying to close the achievement gap. However, the ways we are trying to close the achievement gap are making things worse.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So they're saying that if a child misbehave, a child is late to class, a child uses profanity, all of that, it is not the child's fault, it is the white culture of America's fault?</p>                \n                \r\n\n            \n                <p><b>BENNER:</b> Let's say a student swears at you. You will be questioned, what did you do to trigger that response? Did you understand that child? They are just trying to lower the behavior reforms and they're trying to lower suspensions. But by the ways they are doing it is not working.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So what's the solution?</p>                \n                \r\n\n            \n                <p><b>BENNER:</b> The solution, and one of the solutions I gave to the school board in May of 2014, I said, we must, we must engage our black parents in helping them with their children. I said, we can make excuses all we want but until we have parents on board, nothing is going to change.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. But you're not going to get some of the parents on board. I used to teach and they did never showed up to Parents Teachers Conferences. They didn't care, you know that. However, we just got a statement from the St. Paul public school system says, you're going to be welcome back in your classroom in September. So, that's a good thing. So, keep speaking out. Keep doing the right thing. We appreciate you, Mr. Benner. Thanks for coming on.</p>                \n                \r\n\n            \n                <p><b>BENNER:</b> Thank you for having me. Have a goodnight, sir.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Chaos in American public schools", "description": "St. Paul teacher Aaron Benner claims he was almost fired for complaining about discipline", "date": "2015-06-03T12:21:28Z"}