{"vcmId": "69b6bbae-5fd1-485e-ade3-27ae33427f45", "url": "http://www.foxnews.com/transcript/2015/06/22/bill-oreilly-analyzing-charleston-terror-attack.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As we told you last night, there were a number of dubious statements made after the 21-year-old terrorist Dylann Roof slaughtered nine innocent people in a South Carolina church. Today Roof was issued $1 million bond in a Charleston courtroom where family members of those murdered got to speak to him.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>ETHEL LANCE'S DAUGHTER: </b>You took something very precious away from me. I will never talk to her ever again. I will never be able to hold her again. But I forgive you.</p>                \n                \r\n\n            \n                <p><b>TYWANZA SANDERS' MOTHER: </b>You have killed some of the most beautiful people that I know. Every fiber in my body hurts. And I will never be the same.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Clearly anyone who lost a loved one in that terror attack deserves to be heard no matter what they say but not so much those who are trying to exploit the situation.</p>                \n                \r\n\n            \n                <p>Let's run down some worthy statements as well as some foolish comments. First, CNN commentator Michaela Angela Davis.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MICHAELA ANGELA DAVIS, CNN COMMENTATOR:</b> This is terrorism. And the reason why I'm using those words is partly to bring the history current because that's how it felt to those living in the Jim Crow South. That's what the Ku Klux Klan is a terrorist organization. And up until this generation, I don't think we had the courage to call it what it is.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Miss Davis is correct. What Dylann Roof did was flat out terrorism. He did not murder someone for profit or for any other concrete reason. He simply wanted to terrorize black Americans.</p>                \n                \r\n\n            \n                <p>Next up, Senator Rand Paul.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. RAND PAUL (R-KY), PRESIDENTIAL CANDIDATE:</b> There is a sickness in our country. There is something terribly wrong, but it isn't going to be fixed by your government. It's people straying away, it's people not understanding where salvation comes from.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Paul is also essentially correct. The government cannot fix disturbed people like Dylann Roof. American society has veered away from moral judgments into a world where most anything can be justified with an excuse, thus making it easier for psychopaths to act out.</p>                \n                \r\n\n            \n                <p>Now, let's get into race and politics.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON (D), PRESIDENTIAL CANDIDATE: </b>The public discourse is sometimes hotter and more negative than it should be, which can, in my opinion, trigger people who are less than stable.</p>                \n                \r\n\n            \n                <p>I think we have to speak out against it like, for example, a recent entry into the Republican presidential campaign said some very inflammatory things about Mexicans. You know, everybody should stand up and say that's not acceptable.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Secretary Clinton referring to Donald Trump who wants to stop illegal immigration from Mexico by building a wall. Mrs. Clinton obviously finds that offensive.</p>                \n                \r\n\n            \n                <p>But to inject that issue into the Charleston analysis is strange to say the least. She is introducing a totally unrelated situation to the terrorism in Charleston. The only thing I can think of is she is trying to mobilize Hispanic support.</p>                \n                \r\n\n            \n                <p>And then there are the race hustlers.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HILL:</b> The problem is we can't eliminate these types of incidents if we don't get at the source of the problem. And the source isn't individual crazy people. The source of this is white supremacy.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>White supremacy? Good grief. That's like saying the Black Panthers are sweeping across America inciting violent acts from African- Americans. Now, I'm sure all of you see white supremacists walking around your town nearly every day, don't you?</p>                \n                \r\n\n            \n                <p>That kind of lunacy makes a mockery out of serious people trying to bridge the gap of understanding between black and white Americans. What we need here is serious analysis and honest discussion about differences. Not some phantom white supremacist madness.</p>                \n                \r\n\n            \n                <p>Also we don't need fanatical ideology either.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>EUGENE ROBINSON, \"WASHINGTON POST\" COLUMNIST:</b> I would also argue that the flames of this fire are fed quite often by right wing rhetoric, often from people who don't necessarily share these radical views, who don't, in fact, share these radical views but who sort of incite these feelings of white victimhood.</p>                \n                \r\n\n            \n                <p>You know, they are taking something away from you. And, you know, it's no secret where you hear that kind of rhetoric, it's all over the airwaves.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Robinson works for the \"Washington Post\" makes a living out of demonizing conservative Americans -- that's what he does. Right wing rhetoric -- yes, that's the ticket. That's what's causing all of these mass murders. Never mind that far-left rhetoric far more hateful these days than what the horrid right puts out.</p>                \n                \r\n\n            \n                <p>Mr. Robinson is fanatical left wing individual once again playing the ideological card in a bizarre way.</p>                \n                \r\n\n            \n                <p>Of course, none of this nonsense addresses the key question. How do we stop terrorists like Dylann Roof? As Talking Points stated last night, we live in a free country where crazy people are allowed to roam free until they do something heinous.</p>                \n                \r\n\n            \n                <p>Everybody who knew Dylann Roof understood he was an unstable racist individual. But you can't do anything to a person like that until he or she commits a crime. That's the price we pay for freedom. It is long past time for all Americans to demand honesty from our leadership.</p>                \n                \r\n\n            \n                <p>Yesterday, President Obama again played the anti-gun card. But the President's hometown, Chicago, has stringent anti-gun laws. Yet, the gun crime situation there remains out of control.</p>                \n                \r\n\n            \n                <p>In the next segment, I will tell you how gun crime can be curtailed and it's very simple. But does Barack Obama and the anti-gun lobby really wants to stop gun crimes? Do they really? I don't think so. Because there is an easy way to do it without all the crazy rhetoric.</p>                \n                \r\n\n            \n                <p>Summing up Talking Points urges all decent Americans to understand there is evil among us. And there is no solution to that evil. All we can do is try to minimize and isolate the actions of disturbed individuals like Roof. This country is somewhat united against terrorism abroad. Now we have to come together to fight it at home.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Analyzing the Charleston terror attack", "description": "Bill O'Reilly's Talking Points 6/19", "date": "2015-06-22T12:22:26Z"}