{"vcmId": "6a4bc951-28db-465f-ab0f-b2aed43841fa", "url": "http://www.foxnews.com/transcript/2015/04/13/eric-bolling-political-dynasties.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The office of the President is supposed to go to the man or woman who generates the most ideas to make America better. It's supposed to go to the man or woman who has the leadership skills to stimulate the economic power house that we have right here in America. It's not supposed to go to the most inevitable or the one whose dad, brother, or husband was president so therefore it's his or her turn.</p>                \n                \r\n\n            \n                <p>Hillary Clinton's plan is to announce her presidential run this weekend. And Jeb Bush is sure to follow soon after. So Bush and Clinton -- are we so devoid of men and women with strong ideas, values and leadership skills that we're down to a Bush versus a Clinton choice for the next president? I hope not.</p>                \n                \r\n\n            \n                <p>The last 20 years or so have been brutal on America's standing in the world. Globally, we were near the top in economic freedom now we rank number 12. In the past, America's created high paying jobs in manufacturing, construction, medicine; but now we create jobs in service industries like restaurants and bars. In fact, we lead the world in jobs created at fast food restaurants and that's a problem.</p>                \n                \r\n\n            \n                <p>We no longer lead in education. The United States is now ranked 14th in education even lagging behind Russia. We have had a Bush or a Clinton in the White House for 20 of the last 26 years. Do we really need more of the same?</p>                \n                \r\n\n            \n                <p>I will vote for the most conservative candidate for president. I just hope my choice doesn't come down to just a Bush or a Clinton. We're better than that.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Eric Bolling:  Political dynasties", "description": "Eric Bolling's Talking Points 4/10", "date": "2015-04-13T12:16:04Z"}