{"vcmId": "6b62309a-a152-4761-a9ec-8fa49abfa00f", "url": "http://www.foxnews.com/transcript/2016/03/25/bill-oreilly-what-have-learned-from-terror-attack-in-brussels.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Number one thing, President Obama will not engage the ISIS savages in a meaning way. He simply believes that getting involved in a shooting war with Islamic terrorists is bad for the U.S.A. No matter what happened short of another 9/11, the President is not going to change his opinion. Yesterday in Argentina he said this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA</b>: Groups like ISIL can't destroy us, they can't defeat us. They don't produce anything. They are not an existential threat to us. We defeat them in part by saying you are not strong. You are weak.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So to recap what you just heard. The President said, we can defeat ISIS, he says ISIL in part by telling them they are weak. Now, if I had just told you that without showing you the tape, you would have mocked me. At least the far left would have. So to repeat the President is not going to use American power to defeat ISIS. He is not going to do it. Second thing we have learned, Europe is in chaos. As you know, millions of mostly Islamic refugees are pouring in to Western Europe. Nobody knows who they are. Nobody know what is they are doing.</p>                \n                \r\n\n            \n                <p>In Belgium where the bombers struck this week intelligence agents cannot tap telephones nor can they look into computers. It's against Belgian law. And police are restrained from raiding private homes from 9:00 p.m. to 5:00 a.m. No matter what you do. They can't come in and get you. And Belgium wonders why it's a terror target? The incredible laxity on immigration and the ultra-liberal policing have made Europe the easiest target in the world for ISIS and every other terror group. And believe me if the far left had its way here, we would be just like Belgium. Third thing we have learned is that there is still no cohesive strategy at the federal level in the U.S.A. to neutralize terror act or to secure the Southern border. Even Liberal broadcasters understand there is no leadership in place to defeat ISIS.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TOM BROKAW, FORMER NBC NIGHTLY NEWS ANCHOR:</b> We have got to put together some kind of a bullet-proof syndicate to deal with all of this as a real urgency about it and he has got to convey that not just to the American people, but to the world, I think it was Mike Hayden has said earlier that he is the leader of the free world and this is the time to be the leader.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He being President Obama. And I'm not exactly sure what a bullet-proof syndicate means. So we called over to Tom Brokaw's office for clarification. He wouldn't give it to us. Tom, Tom, I'm your pal. What does that mean? What is a bullet proof syndicate? What is that? Now, the point is that even some Liberal Americans like Mr. Brokaw understand the danger posed by the jihad. And they also understand little is being done about it. Talking Points is, again, going \"ON THE RECORD\" this evening. As we told you last night, there is a likelihood of ISIS attacking with weapons of mass destruction. The longer the U.S.A. dithers, the worse we are going to suffer down the road. And there is no question we are dithering. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: What we have learned from the terror attack in Brussels", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/24", "date": "2016-03-25T12:10:59Z"}