{"vcmId": "6bd80059-abe2-4f69-9611-20d1b7f66805", "url": "http://www.foxnews.com/transcript/2015/10/30/bill-oreilly-reaction-to-republican-debate.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It is beyond question that many people who watched the debate last night believe the CNBC moderators were a bit arrogant toward the contenders. Some pundits opined the question were designed not so much to get information but to create controversy. Thus, the moderators got hammered but not by everyone.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>GOV. JOHN KASICH (R-OH), PRESIDENTIAL CANDIDATE: </b>I thought they did a good job tonight. I'm very pleased with them. I had time to be able to speak and talk about fantasy land and also be able to talk about my plans, my program. The things that I know we can do together to get the budget balanced and create jobs and fix this country. So I'm very appreciative of how they did their job tonight.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Governor Kasich in the minority but he is looking at it from his point of view which is the candidates like Donald Trump and Ben Carson were not really equipped to run the country and Mr. Kasich, of course, got that point across last night.</p>                \n                \r\n\n            \n                <p>One of the most controversial moments was when Jeb Bush criticized Marco Rubio's attendance in the Senate.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JEB BUSH (R), PRESIDENTIAL CANDIDATE:</b> Marco, when you signed up for this, this was a six-year term. And you should be showing up to work. I mean literally the Senate -- what is it like a French workweek? You get like three days where you have to show up? You can campaign or just resign and let someone else take the job.</p>                \n                \r\n\n            \n                <p><b>SEN. MARCO RUBIO (R-FL), PRESIDENTIAL CANDIDATE:</b> The only reason why you are doing it now is because we are running for the same position and someone has convinced you that attacking me is going to help you.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But it really didn't help Governor Bush. The media seized upon the whole thing and today Senator Rubio advanced the story.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> I still have tremendous admiration for him both as a person and what he did as governor of Florida. And I'm not going to talk bad about Governor Bush. My campaign is not about him. I'm not running against him or against anybody else.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now you can decide who won or lost the debate but there is no question that Jeb Bush is in trouble. The odds are long the governor will win the Republican nomination at this point. Mr. Bush did an excellent job in Florida as governor and he is an honest man. But fire in the belly has been lacking. This time around GOP voters not only want a president, they want an avenger -- someone to dismantle the liberal philosophy.</p>                \n                \r\n\n            \n                <p>And on the subject of liberals, it's amusing to see how they framed the debate last night. Far left crank Dana Milbank wrote in the \"Washington Post\", quote, \"Has there ever been a more peevish pack, a more petulant populace than the 2016 presidential contenders? The Republicans seem to be testing a strategy of winning by whining,\" unquote.</p>                \n                \r\n\n            \n                <p>Liberal columnist Doyle McManus in the \"L.A. Times\" quote, \"Anyone who tuned in hoping that CNBC, a financial network, could force the candidates into clarity on major economic issues of our time surely went away disappointed.\"</p>                \n                \r\n\n            \n                <p>That was the tone of it from the left. The Republicans are dunderheads and complainers. Now it's always astounding to read liberal columnists who totally ignore the disaster that has befallen America preferring to denigrate opposition to their preconceived points of view no matter what the facts may dictate.</p>                \n                \r\n\n            \n                <p>All in all, the Republican debate last night provided some perspective and entertainment. Next up, the Fox Business Network GOP debate on November 10th.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Reaction to the Republican debate", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/29", "date": "2015-10-30T12:13:37Z"}