{"vcmId": "6c7ea478-8873-43a1-8346-8cd009c3fd74", "url": "http://www.foxnews.com/transcript/2017/03/03/president-trump-plans-to-help-poor-american-students.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 2, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And in the \"Impact Segment\" tonight, helping poor American kids get the education they deserve. It is a sad fact that a public school systems in many poor neighborhoods has collapsed. Standardized test scores prove that. So, President Trump wants to allow poor students who attend private schools with government help. He addressed that on Tuesday.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Joining us tonight in the gallery is a remarkable woman, Denisha Merriweather. As a young girl, Denisha struggled in school, and failed third grade twice. But then, she was able to enroll in a private center for learning, great learning center, with the help of a tax credit and a scholarship program. Today, she is the first on her family to graduate, not just from high school, but from college.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, you would think most Americans would support anything that would improve the education system, especially in deprived neighborhoods. That is not the case. And Denisha Merriweather knows it.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DENISHA MERRIWEATHER, SCHOOL CHOICE SUCCESS STORY WHO ATTENDED PRESIDENT TRUMP'S ADDRESS</b>: This is not a partisan issue, this is really moral. Students and parents should have the opportunities to choose the best education for themselves.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And joining us now from Los Angeles, Leo Terrell, civil rights attorney. First of all, counselor, were you impressed with Denisha herself?</p>                \n                \r\n\n            \n                <p><b>LEO TERRELL, CIVIL RIGHTS ATTORNEY</b>: I was impressed with her but I was opposed to her message. I felt she was being used as a prop, Bill. If you let me explain. She is representing that because she went to a school that had a voucher system, she turned her life around. What turn her life around, Bill, was that she left her negligent mother and lived with her godmother. And I am simply saying that that inference was, if you go to a public school, you will going to get a poor education. And that was a wrong message. I think she was being used as a prop. I am offended by that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Finally, one other point.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Go ahead.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: I went to a public school, Bill O'Reilly. I went to public schools and I graduated from law school, past the bar, so I made product of public schools.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now your situation, you have two parents in the home, did you have encouragement in the home?</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: And that is what I'm talking about.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>TERRELL:</b> The misdirection -- the misdirection is --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>A lot of kids don't have that.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Right, Bill. But here is --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Let's deal with the facts, not emotion. Okay. Now, in 2010, there was a study, this has been going on for quite some time, all right? The poor children have not gotten the same education that middle- class and affluent children got. This study was done by the Department of Education and found that kids in the D.C. public schools, all right, who went into a private situation with health, scholarship health, scored 30 percent higher in graduation than the public school kids. Thirty percent higher, okay? So, there is no doubt that private schools are better for kids than public schools. No?</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: No, because you want me to take one statistic in Washington, D.C.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. You want another one?</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>And the reason we use the Washington study because it is all black. Okay. Here is another one. Brookings Institution. Brookings Institution. African-American participants in private school choice programs, 24 percent more likely to enroll in college. Twenty four percent more likely to go to college than in public school. Now, are you going to be a denier of all facts? Is that what you're going to do tonight?</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: No. I am not. I am simply telling you what you are trying to do is you are trying to indict the public school system across the entire country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No, I'm trying to give you study statistics, Wharton School of Finance. Okay? Pretty good school at the University of Pennsylvania. Right? It found a bevy of advantages for poor children without structure, okay, all right? To go to more discipline schools that require uniforms, that require standards of achievement, what you have to do, this is what Wharton school found out.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Fine. Congratulations on that study. Let me give you some facts. You take this voucher system and you give money to religious institutions who are trying to indoctrinate private institutions --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Who are trying to indoctrinate, is that what you just said? Is that what you just said?</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Yes, I did say that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. I mean, that is ridiculous, that's biased. That's flat out bias!</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Bill, I don't want public taxpayers' money to be used for religious institutions.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, no, no, that's fine. You don't like it, fine. But are you looking out for the kids?</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Yes, I am.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> When there is every, every blinking stat shows that private schooling is more advantageous to kids who don't have advantage? Are you looking out for them? I don't think you are.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Yes. You cited two studies.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Well, I got news for you, Bill. The L.A. unified school district is doing fine, thank you very much. We have academic decathlon winners here. We have people who are outstanding public school teachers.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. That is anecdotal and if you put it -- you are denying, all right? You are denying students --</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: How did I get through? How did I get through?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You are denying bad neighborhoods a lifeline and it is because of politics.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: I was born and raised -- no, Bill. I was born and raised in South Central, L.A. And I went to public school.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. But it is not all about you, man. It's not all about you. And these studies are rock-solid. All right. Good debate. Good debate.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "President Trump's plans to help poor American students", "description": "Why is there so much resistance? 'The O'Reilly Factor' investigates", "date": "2017-03-03T13:16:47Z"}