{"vcmId": "6ce944e2-4f6c-48fd-84f1-299a8c6295d3", "url": "http://www.foxnews.com/transcript/2014/10/02/bill-oreilly-ignoring-incompetence-until-today.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><em>By Bill O'Reilly</em></p>                \n                \r\n\n            \n                <p>Americans are amazed -- amazed that the White House apparently is not secure. On September 19th, a mentally disturbed person hopped a fence, got all the way into the White House without being stopped by Secret Service guards. That's a huge scandal. And yesterday the director of the Service made it even worst.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>JULIA PIERSON, FORMER SECRET SERVICE DIRECTOR: It is obvious that mistakes were made. It's self-evident that mistakes were made. We must identify what the facts are, learn from the facts.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: Too late, Ms. Pierson, you were not forthcoming about how bad the break-in really was. The \"Washington Post\" had to break the honest story. So you, madam, are out. You resigned today. We predicted it would happen yesterday. You're gone.</p>                \n                \r\n\n            \n                <p>Amazing -- since the Obama administration rarely holds people accountable for failure. In fact, the only other high level person we could think of who got fired was VA chief Eric Shinseki after the enormous scandal in his department.</p>                \n                \r\n\n            \n                <p>This week President Obama himself blamed his intelligence chief James Clapper for the ISIS intel failure. Mr. Clapper is still on the job. National Security Advisor Susan Rice misled the world about Benghazi, got promoted. Health and Human Services Secretary Kathleen Sebelius who totally screwed up the rollout of Obamacare kept her job for eight months before she voluntarily left. Secretary of State Hillary Clinton did not take the fall for assassination of Christopher Stevens, the American Ambassador to Libya. Current IRS Commissioner John Koskinen and former IRS Commissioner Douglas Shulman both caught up in a scandal whereby that agency targeted conservative groups. Neither has paid a price -- Koskinen still there, which is absolutely incredible.</p>                \n                \r\n\n            \n                <p>So you can see that time after time the nation is not well-served but the people in charge are not held accountable. Surely Ms. Pierson got what she deserved. Again, the actual intrusion may not have been her fault but her failure to report what really happened is right on her shoulders. We he cannot have that here.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" has said numerous times that the Obama administration is not governing the country properly. There are problems everywhere and few of them are being addressed in an effective way. Perhaps the best example of this Attorney General Eric Holder who announced his resignation just last week. Mr. Holder has never explained the \"Fast and Furious\" scandal, how it happened. And now the federal courts are ordering him to turn over documents he should have released months ago.</p>                \n                \r\n\n            \n                <p>Mr. Holder is even being held in contempt by Congress. Yet, the Attorney General kept his job because President Obama likes him. What's forgotten here by the media and by the politicians is that public servants are supposed to serve we the people and when they don't do the job like Ms. Pierson, they should resign. We need effective problem solvers not spinners and stonewallers. Every poll says the same thing. Americans are rapidly losing faith in their government and they should and that's the memo.</p>                \n                \r\n\n            \n\n            \n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Ignoring incompetence until today", "description": "By Bill O'Reilly Americans are amazed -- amazed that the White House apparently is not secure.", "date": "2014-10-01T04:00:00Z"}