{"vcmId": "6f5c5aba-f14a-4b39-84b4-3c2c5d704b58", "url": "http://www.foxnews.com/transcript/2016/06/07/bill-oreilly-counter-attacks-donald-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>No matter what happens in the Trump University civil litigation, it will not, not likely have much effect on the election. Voters having more important things to consider than the disenchantment of a few Trump U clients. But, the situation has put Donald Trump on the defensive. No question there is a political component to the legal action as the law firm behind the class action lawsuits often helps the Democratic Party.</p>                \n                \r\n\n            \n                <p>In fact, the firm has paid bill and Hillary Clinton a combined $675,000 for speeches since 2009. According to the website LawNews.com. That makes the legal action look like a political hit job. As it is likely the law firm is working on contingency. So Mr. Trump is correct to be indignant and defend himself vigorously. But part of that defense included a negative personal assessment of the judge in the case, a Mexican-American named Gonzalez Curiel.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESUMPTIVE PRESIDENTIAL NOMINEE</b>: He is a Mexican. We are building a wall between here and Mexico. The answer is, he is giving us very unfair rulings. Rulings that people can't even believe.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Immediately, an outcry arose and not only by Trump critics. Yesterday Newt Gingrich who supports Trump said the candidate was wrong to spotlight the judge's heritage.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>GINGRICH</b>: This is one of the worst mistakes Trump has made. I think it's inexcusable. He has every right to criticize a judge and has every right to say certain decisions aren't right and his attorneys can file to move the venue from the judge. If a liberal were to attack Justice Clarence Thomas on the grounds that he is black, we would all go crazy. All right. Every conservative would say it was wrong and it was racism.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Although appointed by Barack Obama, Judge Curiel is no raging liberal. In fact, he is a tough guy. At one point a Mexican drug cartel threatened to assassinate him because of his anti-drug trafficking stance. However, the Judge belongs to a group called San Diego La Raza Lawyers Association which does advocacy work on behalf of Latinos. It's not associated with the radical La Raza group but confusion is understandable. Because of that, Mr. Trump apparently believes the judge may be biased against him as it is well-known the candidate has taken a strong stand against illegal immigration, include building a border wall.</p>                \n                \r\n\n            \n                <p>Summing up the Trump U case is certainly political to some extent and it's a very high profile situation because of that. Talking Points believes the Judge should recuse himself. Not because he did anything wrong. He didn't. But to eliminate any doubt as to the motivation in court rulings. There are plenty of federal judges that could immediately step in. It is valid that some may see any recusal as caving to intimidation. But stark justice in a case this important, Trump's pardon the pun any theoretical argument. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The counter attacks of Donald Trump", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 6/6", "date": "2016-06-07T19:20:14Z"}