{"vcmId": "70079d78-15af-46ee-bc9e-17a3f457afbe", "url": "http://www.foxnews.com/transcript/2015/07/16/bill-oreilly-president-obama-defending-iranian-nuke-deal-and-other.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>After reading details of the nuke deal I can tell you that Iran got the better of the negotiations. The undeniable fact is that the Iranians do not have to submit to snap inspections, so they can cheat if they want to and they may get away with it. 24 days -- a long time to wait before inspectors can examine suspicious activities.</p>                \n                \r\n\n            \n                <p>Now, it is true some Americans and the Israeli government would oppose a nuke deal with Iran no matter what. The only thing that would win them over would be a total cessation of nuclear activity in that country to which the mullahs would never agree.</p>                \n                \r\n\n            \n                <p>It is also true that President Obama sees the issue in stark terms. Either you make a deal or Iran develops a nuke and war breaks out.</p>                \n                \r\n\n            \n                <p>But here the President makes a mistake. He could have held on a bit longer and upped the sanctions against Iran. That would have given the U.S.A. more leverage. Mr. Obama's press coverage today -- press conference today, I should say, was very instructive. He took a few questions and answered them as a college professor would, with long explanations full of asides. There were no follow-ups, no challenges to his answers.</p>                \n                \r\n\n            \n                <p>So that's what Talking Points will do right now. Here's the toughest moment of the press conference.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MAJOR GARRETT, CBS CORRESPONDENT:</b> As you well know, there are four Americans in Iran -- three held on trumped up charges, according to your administration, one whereabouts unknown. Can you tell the country, sir, why you are content with all the fanfare around this deal to leave the conscience of this nation, the strength of this nation unaccounted for in relation to these four Americans?</p>                \n                \r\n\n            \n                <p>And last week the chairman of the joint chiefs of staff said under no circumstances should there be any relief for Iran in terms of ballistic missiles or conventional weapons. It is perceived that that was a last- minute capitulation in these negotiations making the Pentagon feel you've left the chairman of the joint chiefs of staff hang out to dry. Could you comment.</p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> I have to give you credit, Major, how you craft those questions. The notion that I am content, as I celebrate with American citizens languishing in Iranian jails, Major, that's nonsense. And you should know better.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Obama went on to give a long, windy answer that made two points. The four American hostages being held in Iran could not be part of the negotiation according to him because that would have empowered Iran. And the U.S.A. will closely monitor any missiles and weapons to make sure Iran doesn't give them to terrorists.</p>                \n                \r\n\n            \n                <p>On the first point, the President certainly could have asked for the Americans to be released and should have. Maybe he is working behind the scenes -- maybe.</p>                \n                \r\n\n            \n                <p>On the weapons front, the Iranians will get them in five to eight years and will likely use them, including ballistic missiles. By that time Mr. Obama will be making millions lecturing.</p>                \n                \r\n\n            \n                <p>But all of that is small ball to the President. Here's the crux of his argument.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>The point I have repeatedly made and is I believe is hard to dispute is that it will be a lot easier for us to check Iran's nefarious activities, to push back against the other areas where they operate contrary to our interests or our ally's interests if they don't have a bomb.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's the old keep your enemies closer philosophy. Now, to address the very large concern that 24 days to inspect is absurd the President said this about confronting Iran's ability to cheat.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> In the agreement, we have set it up so we can override Iran's objection. And we don't need Russia or China in order for us to get that override. As for the fact that it may take 24 days to finally get access to the site, the nature of nuclear programs and facilities is such, this is not something you hide in a closet.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Maybe. But there is no question that if Iran decides to cheat, it will have breathing room to obscure the situation all over the place. It will take months.</p>                \n                \r\n\n            \n                <p>In the press conference today, Barack Obama demonstrated once again that he is a true believer in himself. His demeanor clearly showed he has no doubts that he did the right thing and once again diffused conflict overseas. That has been his foreign policy from the very beginning -- avoiding armed confrontation. And, we can see the result of that as the world absorbs a tremendous amount of instability and violence.</p>                \n                \r\n\n            \n                <p>Talking Points is not a knee jerk platform. War with Iran would be a disaster but this nuke deal is a gamble. One that like the total pullout from Iraq could lead to terrible consequences.</p>                \n                \r\n\n            \n                <p>President Obama, the gambler, believes he knows when to fold them. He did that for a deal that has delighted the mullahs and divided Americans. A deal that will clearly define itself only in years to come. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: President Obama defending the Iranian nuke deal and other controversial issues", "description": "Bill O'Reilly's Talking Points 7/15", "date": "2015-07-16T12:11:25Z"}