{"vcmId": "7065c0be-b29a-4c9a-a1ad-498be46a76ef", "url": "http://www.foxnews.com/transcript/2014/11/11/john-mccain-enters-no-spin-zone.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 10, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story\" segment tonight. Senator John McCain who is a friend to this program has a new book out called \"13 Soldiers,\" a personal history of Americans at war just in time for Veterans Day tomorrow. Last week the senator and I sat down.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Senator, a couple of political questions first. You are a big immigration guy. You had a bill that you didn't get passed. Now, President Obama says he may use executive authority's power to legalize some undocumented and the Republican Party in threatening him with Armageddon if he does. How do you see it?</p>                \n                \r\n\n            \n                <p><b>SEN. JOHN MCCAIN (R), ARIZONA: </b>Well, I see it a cynical action that means that the President really isn't that interested in comprehensive immigration reform. He is only interested in placating his base and his Hispanic population of our nation because he knows full well that that will cause a huge negative reaction amongst the republicans and frankly most Americans.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, he said in his press conference last week that he was willing to work with republicans on the immigration issue. But then he says, if it's not done at the end of the year, he's going to take unilateral action. So, I'm confused. I want you to try to make a prediction here. What do you think he is going to do?</p>                \n                \r\n\n            \n                <p><b>MCCAIN: </b>I'm very much afraid that he is going to take unilateral action so he can go back to the democrat Hispanic base, that that have been so very critical of him for not acting and say, see there, we'll blame it all on the republicans in Congress again.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So you think he wants a civil war for political reasons? Is that what you are saying?</p>                \n                \r\n\n            \n                <p><b>MCCAIN:</b> I can't say that specifically that that is, his intention. But I can certainly say that that's going to be the effect. And, Bill, this is an issue that we can sit down and resolve. We can work together.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I agree. I think so.</p>                \n                \r\n\n            \n                <p><b>MCCAIN: </b>And if we had a legislation started in the House in whatever form a dream act. By something like that. Then we could work in the Senate with him, but for him to unilaterally carpet bomb us here. Then that is going to cause a huge negative reaction. Frankly amongst my constituents.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Last week, the President, it was revealed. He didn't tell us when it was revealed. The President wrote a note to the Mullahs in Iran. Saying, hey, I want you to help a South fighting ISIS, and you objected to that because the Iranians have supported Assad and Syria who are killing the people that were supposed to be allied with, against ISIS and gets pretty complicated.</p>                \n                \r\n\n            \n                <p><b>MCCAIN: </b>It gets complicated. But it's immoral. We're now supposedly training about 5,000 or more Syrians who are going to go back in and fight against Bashar Assad. Who is it that's killing them? It is spiral bombs and equipment supplied by the Iranians. It is the Hezbollah, the 5,000 or more of them who are brought in from Lebanon by the Iranians. So, we're supposed to send them in to fight Bashar Assad while we are playing footsy and getting in bed with the Iranians. And for us to somehow believe that we can cooperate with probably our greatest enemy when you look at outright enemies on earth, to me, is both naive, cynical and frankly immoral.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Now, you have a new book out tomorrow \"13 Soldiers\" on Veterans Day. It's an interesting book because you're profiling guys from the revolutionary war all the way up to modern times. What is the take away from this book?</p>                \n                \r\n\n            \n                <p><b>MCCAIN:</b> A depiction of those individuals, most of them very ordinary people, from ordinary walks of life who were engaged personally in conflicts throughout our history and we described those conflicts a bit to some degree. Their feats of heroism, their bravery and the results of that. But they are ordinary citizens who did extraordinary things.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Senator, thanks very much. The book is \"13 Soldiers.\" Great gifts for a Veterans Day.</p>                \n                \r\n\n            \n                <p><b>MCCAIN: </b>Thank you, my friend.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "John McCain enters the 'No Spin Zone'", "description": "Arizona Senator on immigration reform and his new book ‘Thirteen Soldiers: A Personal History of Americans at War’", "date": "2014-11-11T13:42:59Z"}