{"vcmId": "70c27f0c-9ccc-4553-a1f8-875d16eecf37", "url": "http://www.foxnews.com/transcript/2015/09/18/bill-oreilly-what-america-learned-from-second-republican-debate.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Consensus is for Carly Fiorina, the former CEO of Hewlett Packard and a political outsider won the debate last night. I believe Ms. Fiorina did very well but that Senator Marco Rubio was just a bit stronger because Ms. Fiorina at times looked a bit dour out there and disposition matters in any debate.</p>                \n                \r\n\n            \n                <p>But it is truly incredible that a business woman, Ms. Fiorina, and a businessman, Donald Trump are schooling veteran politicians, men who have run states and who are serving in congress. But that's what's happening.</p>                \n                \r\n\n            \n                <p>Very simply Ms. Fiorina came across as powerful last night.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>FIORINA:</b> On day one in the Oval Office I will make two phone calls. The first to my good friend Bibi Netanyahu to reassure him we will stand with the state of Israel. The second to the Supreme Leader to tell him that unless and until he opens every military and very nuclear facility to real any time anywhere inspections by our people, not his, we, the United States of America will make it as difficult as possible to move money around the global financial system. We can do that. We don't need anyone's cooperation to do it.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Since polling shows many Americans, perhaps most, oppose the Iranian nuke deal, Carly Fiorina scored big with that assessment.</p>                \n                \r\n\n            \n                <p>Now, the other debate headline, it was unfair. The whole thing was unfair. Three hours far too long. When people get tired, they make mistakes but in truth there were few mistakes made on the debate stage last night. All 11 primetime contenders put forth cogent arguments. There were no gaffes.</p>                \n                \r\n\n            \n                <p>The real unfair part was the distribution of time. For example, Mike Huckabee got only three questions and spoke for just over nine minutes. By contrast, Donald Trump was asked 13 questions, spoke for 18 and a half minutes -- far more than any other candidate on the stage. Jeb Bush was second with 15 and a half minutes speaking.</p>                \n                \r\n\n            \n                <p>The CNN moderators obviously using Trump to stir up controversy. But in doing that they virtually ignored people like Huckabee, Governor Walker and Governor Kasich. It's impossible to make an impression when, in a three-hour forum, you get to speak for less than 10 minutes as those three men did.</p>                \n                \r\n\n            \n                <p>Television is a brutally competitive enterprise but I submit that these debates should be taken out of the commercial arena, no advertisements at all. That way you wouldn't have pressure to create incidents and controversy. And you would have more time in a reasonable two-hour debate to let the candidates speak.</p>                \n                \r\n\n            \n                <p>Look, this country is in trouble, we all know that. And these political debates allow we, the people, to at least get to know the candidate somewhat.</p>                \n                \r\n\n            \n                <p>Summing up, the debaters did, well, but most were not given nearly enough time to make their points. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: What America learned from the second Republican debate", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 9/17", "date": "2015-09-18T12:21:45Z"}