{"vcmId": "70d587a0-6842-42a8-8109-f076bc175c43", "url": "http://www.foxnews.com/transcript/2016/02/12/bill-oreilly-fairness-in-news-coverage-presidential-race.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Almost every politician feels that one news operation or another doesn't give him or her a fair shake. I, myself, have leveled charges of unfairness against some entities so I can sympathize with the polls a bit.</p>                \n                \r\n\n            \n                <p>Yesterday Senator Ted Cruz surprised me by saying this:</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: I am looking forward to a week of wall-to-wall coverage of Fox News at the impressive third place finish which Marco Rubio got. So I'm sure that's what we are going to see on every show on Fox today -- the shockingly impressive third place finish of Cruz.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The senator being sarcastic apparently believing that FNC favors Marco Rubio.</p>                \n                \r\n\n            \n                <p>Well, I can't speak for all of Fox News. But I can tell you that Senator Rubio has been much easier for us to book than Senator Cruz. In fact, Marco Rubio will be with us in about two minutes. And Senator Cruz will not be with us even though we invited him tonight. We also invited Ted Cruz on tomorrow night and we invited him on earlier this week.</p>                \n                \r\n\n            \n                <p>I don't really know what else to do. I will even buy him dinner. We hope to see Mr. Cruz some time.</p>                \n                \r\n\n            \n                <p>Now, earlier in the campaign, Ben Carson thought he was being treated unfairly.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DR. BEN CARSON (R), PRESIDENTIAL CANDIDATE:</b> I do not remember this level of scrutiny for one President Barack Obama when he was running. In fact, I remember just the opposite.</p>                \n                \r\n\n            \n                <p>My job is to call you out when you're unfair. And I'm going to continue to do that.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And that's a good thing. By the way Ben Carson will be here tomorrow. I want the candidates to complain if they feel aggrieved. But I don't want them to be paranoid.</p>                \n                \r\n\n            \n                <p>Here is how the campaign should be covered. Hard news, just the facts, please -- don't need any shading. Commentators like me are free to give opinions on just about everything. Morning hosts -- they are opinion people, too. Each show has a different definition.</p>                \n                \r\n\n            \n                <p>So while candidates like Hillary Clinton might feel Fox News is stacked up against them, that's only true in some precincts, not network wide. For example, I go out of my way to keep it all about issues, unless a politician strays into dubious areas like the e-mail deal.</p>                \n                \r\n\n            \n                <p>That being said, I have sometimes defended Hillary Clinton from cheap shots and have stayed completely away from any and all personal attacks.</p>                \n                \r\n\n            \n                <p>But it's easy for politicians to dodge tough interviews by saying oh, I'm going to be treated unfairly, and that's what often happens in these cases. One guy who does not dodge is Donald Trump, although he does hold a grudge if you hit him hard. Mr. Trump, like all the other candidates says he just want to be treated in a fair manner.</p>                \n                \r\n\n            \n                <p>Here is his assessment of the press in general.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL CANDIDATE:</b> I have to tell you on the press, on the press, 30 percent are good. And some are great. Some are really great. Some of the press is honorable and fantastic.</p>                \n                \r\n\n            \n                <p>But I will tell you have got 50 percent that are the worst people that I have ever met. They are scum. They are horrible people. They are horrible people.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's hard to argue with that. Myself, of course, excluded.</p>                \n                \r\n\n            \n                <p>Summing up hard news folks just the facts, please; commentators, say anything you want; and the candidates should not take it personally unless personal attacks are used. Those are unacceptable.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Fairness in news coverage of the Presidential race", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/11", "date": "2016-02-12T13:14:34Z"}