{"vcmId": "71bf957f-7e81-4871-ad04-4b5d57ef7db5", "url": "http://www.foxnews.com/transcript/2015/05/27/opposing-patriot-act.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" May 26, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight, three key components of the Patriot Act expire June 1st and Congress has not been able to put forth a cohesive vision to reform it. Many Americans believe the National Security Agency and other spy outfits have too much power, can intrude on every day Americans.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>PAUL:</b> I think the vast majority of the American people say you shouldn't be able to collect my phone records if I'm not suspicious, if you don't have probable cause. And if a judge hasn't signed a warrant why would you get to look moot my phone records.</p>                \n                \r\n\n            \n                <p>You can tell a person's religion 85 percent of the time from their phone records.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Senator Paul and some others want to do away with key parts of the Patriot Act altogether. But critics say that would damage our security against terrorism.</p>                \n                \r\n\n            \n                <p>With us now Fox News analyst Karl Rove.</p>                \n                \r\n\n            \n                <p>The key here and Senator Paul really does not really make this distinction is that the NSA and other spy agencies, they do collect data of phone calls made but they don't collect what was said in the phone call. They don't eavesdrop on the call -- is that correct?</p>                \n                \r\n\n            \n                <p><b>KARL ROVE, FOX NEWS CONTRIBUTOR:</b> That's correct. They collect the data of the call, the time, the length of the call, where the call was made from --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right. But they are not listening in.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Look, we had to build a gigantic center just to keep four pieces of information about phone calls. Can you imagine how big a data center we would need in order to keep tapes or digital recordings of people which incidentally advocates of doing away with this have suggested its existence?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It's true though that the people who want to maintain the Patriot Act as is have not made the case very well.</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>No.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And that Rand Paul and others who don't like it have overwhelmed them. It's almost like the gay marriage debate.</p>                \n                \r\n\n            \n                <p>So, my thing is that you could in Congress and Republicans as you know as everybody knows control both houses have a logical debate and compromise on this. Why would these pinheads do that?</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>Well, we have two debates going on here. We have a debate about Section 215 which is the bulk phone data program. There has been a compromise offered by some in the House. But we have a broader issue here which is Senator Paul once said I want to repeal all of the Patriot Act. Think about that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But that's not going it happen.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Well, it's not going to happen but it is a sign that we need to take it seriously. Oh, really you want to reinsert the wall that kept the FBI from talking to the CIA. You really don't want to have roving wiretaps and sneak and peek searches and business record searches for issues of terrorism when you've never sponsored a bill to get rid of those same tools which have been used for decades legally against organized crime and drugs and --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I don't want to make this into a Rand Paul bashing segment. He doesn't like me at all. I have full disclosure -- the senator won't come on this program.</p>                \n                \r\n\n            \n                <p>But he has a constituency. There are and it's not just left wing, there is a lot of conservatives and libertarians and Independents who say you know what? We don't trust the government. We don't trust the federal government.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Sure. Look I get that so the question is -- first of all you are right Senator Paul doesn't want to keep this program going. So the question is how can we find common ground between people who do and people who don't?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, a compromise.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Because at the end of the day, look we --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>At the end of the day? What day?</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Today. This expires June 1st.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> June 1st.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> But we have got to find a way to continue this program. We use it in law enforcement all the time. Why do we use it in law enforcement?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It has to be spelled out to the folks.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> But not use it against terrorists --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You know what I wish. I wish -- and I don't even care whether it's Republican or Democrat, one senator or congress person who could speak eloquently and specifically about these issues so everybody could understand it. Because a bunch of gobbledygook - it's like the Tower of Babel.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Like Joe Lieberman.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, he was good but he spoke very slowly. I had to like come on, get to the point. It's like the Tower of Babel. You know what that is, right? That's what Washington. Nobody knows what they are talking about.</p>                \n                \r\n\n            \n                <p>All right. Final question here. Rand Paul wants to be president: I think this hurts him because I think most Americans are like, I don't know about you, but me, we want protections but we want them defined. We want to know exactly what the NSA is doing. I don't think that's unreasonable.</p>                \n                \r\n\n            \n                <p>I think Paul with his foreign policy, you know, lay off everything, and this thing I think he becomes a fringe player.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, the Republican primary is going to be dominated by people who believe in a strong national defense believe that we're in a war against terror. And to the degree that this is seen as not being in sync with it, it limits his upward movement.</p>                \n                \r\n\n            \n                <p>But you're right. It does, in a state like New Hampshire, where people can come in to vote who are not Republicans -- an open primary.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's right. He'll gain currency there.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> If you don't have a tough contest on the Democratic side. There will be people in Keene, New Hampshire. Keene State University who say let's go vote for that guy. He is with us on dismantling the NSA.</p>                \n                \r\n\n            \n                <p>But again, the American people need to understand this program is a simple direct program.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Somebody needs to explain it to them.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> It allows people who -- when we find somebody calling from a bad number abroad into the United States, it allows us to check the connections and find out who is in touch with that person inside the United States.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Karl Rove, everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Opposing the Patriot Act", "description": "Karl Rove on Senator Rand Paul criticizing surveillance program", "date": "2015-05-27T12:20:56Z"}