{"vcmId": "7257ad9c-b288-4e2b-8657-7c20a47e485a", "url": "http://www.foxnews.com/transcript/2015/04/07/bill-oreilly-trusting-president-obama-on-iran.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Many Americans and many members of congress do not trust Mr. Obama on anything. Recent Quinnipiac poll asks who do you trust more to make decisions: President Obama or Republicans in Congress? 42 percent say the President; 47 percent the Republicans. But in that poll, just 4 percent of self-described Republicans trust Barack Obama more than their own party -- just 4 percent.</p>                \n                \r\n\n            \n                <p>That's because the President has not done much to persuade non-liberal Americans that his policies are good for them. Also American foreign policy is a mess as Mr. Obama has made major mistakes in the Middle East, has no solution for Putin and generally seems confused by evil in the world.</p>                \n                \r\n\n            \n                <p>So in a very vital situation stopping Iran from developing nuclear weapons, the President finds himself with little credibility. Therefore, when he says the deal is good, many Americans, perhaps most, simply don't believe him. Enter Congress who next week will debate a bill that would require President Obama to submit any nuke treat were with Iran to the Senate and House for approval.</p>                \n                \r\n\n            \n                <p>That seems to be logical because then, all the strengths and weaknesses of the deal would be public for the public to see. There would be robust debate which is a good thing. However, the President is threatening to veto any such congressional bill.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> My hope is that we can find something that allows Congress to express itself but does not encroach on traditional presidential prerogatives and ensures that if, in fact, we get a good deal, that we can go ahead and implement it.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, if President Obama defies Congress on the Iranian nuclear treaty, that's going to be a disaster for America and for the President himself even though he may not know it. There is no question that Iran is a terrorist nation. It brutalizes its own people through a vicious secret police and the militant Islamic Revolutionary Guard. Also, it has funded terrorism all over the world, killed Americans. Simply put, millions of Americans do not trust President Obama to protect us from the deranged mullahs who have committed atrocities for decades.</p>                \n                \r\n\n            \n                <p>Therefore Congress must, must provide oversight and reassure the American people -- that's the way our system is supposed to work.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Trusting President Obama on Iran", "description": "Bill O'Reilly's Talking Points 4/6", "date": "2015-04-07T12:10:58Z"}