{"vcmId": "7447e585-9f43-41d7-a83a-e5d28fa6dc18", "url": "http://www.foxnews.com/transcript/2016/02/12/marco-rubio-on-his-south-carolina-strategy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 11, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Now for the top story tonight: joining us from South Carolina the aforementioned Senator Marco Rubio.</p>                \n                \r\n\n            \n                <p>Let's start with this. When you told your supporters that your mistakes in the New Hampshire debate would never happen again, what mistakes were you referring to?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Well, look, I went into that debate in the hopes of not triggering a Republican on Republican fight. I think by and large when you have those, it helps the left, and it helps the Democrats.</p>                \n                \r\n\n            \n                <p>And so I was attacked by Governor Christie and I could have responded by attacking his record and perhaps in hindsight that's what I should have done. Instead, I tried to pivot back to something I will continue to say. And that is that what is happening in this country is part of a deliberate plan by Barack Obama to change the role of government in our country and the role of our country in the world.</p>                \n                \r\n\n            \n                <p>And I repeated it three or four times and I guess I said the exact words and so it created this narrative --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> -- and it was a distraction at the end of our campaign and I think it hurt us in New Hampshire. So I took responsibility --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You were once a football player, right? Down in Florida weren't you a football player?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Not a good one but yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I was one too. I think I was the same as you. After the game we would use -- watch films, right?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, did you watch the film of your debate performance?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Well, it's hard to turn on the TV and not see the film of those 90 second people pointing out that I used --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I know but what I'm trying to get at is it was more about -- yes, Christie hammered you, but you know, Christie himself it was a pyrrhic victory because he didn't gain anything and now he is out of the race. So maybe it wasn't wise for the New Jersey governor to do that to you.</p>                \n                \r\n\n            \n                <p>However, the portrayal was shallow guy -- you, shallow guy, rehearsed, they write his stuff, not presidential. That's what was being peddled rather than the message that Obama knows what he is doing and he wants to change the country in bad ways, which is what you were saying.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Do you see any validity to that? Do you see yourself as maybe being a little bit too reliant on the sound bite?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> No. Because if you look at the debates now, and I have answered it except for 90 seconds by and large it's been viewed as every debate I have had I have been among the best people. And in some cases people argue the best person in those debates. I have been asked questions you never could have anticipated.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> True.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> I'm on her with you tonight and you can ask me any question you want.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But I'm surprised that the -- I'm surprised the voters held it against you so much. I didn't know whether they would or not. I couldn't make a call. But they did. I don't know why.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Well, I think part of the problem was that in the last 72 hours you want to be closing your campaign with your message and instead that space got eaten up by talk about this question.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's a good point.</p>                \n                \r\n\n            \n                <p>Ok. Let's go on to South Carolina.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> South Carolina a totally differential state than Iowa and New Hampshire -- nothing in common. What do you believe is the primary issue South Carolinian Republican voters are interested in?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Well, by far it always has been national security and the military. Now, they care about everything else as well, of course. But this is a state that has a strong commitment to national security.</p>                \n                \r\n\n            \n                <p>By the way on economics, South Carolina is an example to the country of what we should be doing as Americans. This country has a vast manufacturing base. It is growing in manufacturing where America is shrinking and it's because they have reduced taxes and lower regulatory burdens --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. It's a favorable climate, Boeing came in and all of that.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>-- and been pro-business.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Let me get back to the national security thing.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>A lot of military people in South Carolina. My uncle lived in Columbia, South Carolina. And he was in the army and so we all know that culture.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But every Republican, every single one is saying I'm tough, I'm going to build up the military. I'm going to go stomp ISIS. You are not talking to Bernie Sanders here. You are talking to people of like mind. How are you going to separate yourself from the pack?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Well, there are differences. No, there are differences. Look at Ted Cruz, for example. Ted Cruz, in his time in the senate has only voted for one budget. And the only budget he ever voted for was a budget put forth by Rand Paul. And it's a budget that bragged about cutting the Defense Department. It bragged about cutting the military.</p>                \n                \r\n\n            \n                <p>So it's it's a budget -- we're already not spending enough on the military. And this budget bragged about cutting it even more. He did it probably as a wink to libertarians or he did it for some other reason but --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, he did it because the conservatives -- the conservatives want a balanced budget amendment. They don't want to spend any more money than the government takes in. That's why Cruz did it.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Well but there are -- yes. But you know what, there is a lot of fiscal conservatives in the United States senate that didn't vote for that because we understand that national security spending is not the reason why we have a debt. Our debt is being driven by the way Social Security, Medicare, and Medicaid and, by the way, the interest on the debt is structured in the years to come.</p>                \n                \r\n\n            \n                <p>And so that's what you deal. National security -- the military is the first thing we should spend money on. You have to fully fund that first. And then you should be paying for everything else. That's a big difference between him and I.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> In South Carolina I see it as two races. I see it as Cruz versus Trump and then you versus Bush versus Kasich. There's almost two races.</p>                \n                \r\n\n            \n                <p>You and Governor Bush used to be friends. Is it safe to say you are not friends any longer?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> No. I'm his friend. And I have never said a negative thing about him as a person.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So you're still his friend.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> I admire him very much. I think he was a good governor of Florida.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Yes, absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You are still his friend. You don't take it personally that he is trying to vie for the same crew that you are trying to vie for?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is there anyone in the race -- Trump, Cruz, Kasich, that you're not too fond of? You have got to tell me the truth now.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>No, no, no.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You are ok with all of them.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>No. Absolutely. And let me tell you though. Campaigns and elections are about differences. You have got to point out the differences. In the case of Governor Bush --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Absolutely. It's how you do it.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Right. So it's not personal. I like them. I like these people. And look, I get along with Ted Cruz. I get along with Donald. I get along with Jeb. I get along with John Kasich.</p>                \n                \r\n\n            \n                <p>But we're going to have a debate about differences because voters have to make up their mind. They can't pick five people or six people. They can only pick one. And if the differences are about policy that's very valid; if the differences are personal or insults or name calling, not only do I think that's inappropriate. I think it's counter productive and the Democrats would love to see it. I mean they would love to see -</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, they are yelling at each other now, too. They are having their own problems over.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> I know. Well --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Senator -- you're a good --</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>I understand.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>As I said, you know, Senator Rubio is available to us and answers the questions. And, you know, that's all we can ask. We appreciate it. Good luck in the debate.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And we will check in with you soon.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Marco Rubio on his South Carolina strategy", "description": "Is this the Republican candidates last stand? 'The O'Reilly Factor' investigates", "date": "2016-02-12T13:22:57Z"}