{"vcmId": "7549f0f0-ab63-462c-9f6e-abef96e5853f", "url": "http://www.foxnews.com/transcript/2015/06/18/bill-oreilly-perhaps-best-reason-should-all-leave-united-states-right-now.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>You will not see this story in most media because it's devastating to the Democratic Party in particular. This week the nonpartisan Congressional Budget Office issued a report that says the rising federal debt in America may doom the economy in the future. Now, I understand most Americans don't care about the federal debt. It's not real. Just a fuzzy fantasy. But right now the U.S.A. owes about $18 trillion with a \"t\" which is catastrophic.</p>                \n                \r\n\n            \n                <p>Under President Obama that debt increases about $3.3 billion with a \"b\" every single day. When the President took office six and a half years ago the debt was $10.6 trillion. So Mr. Obama has racked up $7.6 trillion in debt since he has been in the White House. That's simply hard to believe.</p>                \n                \r\n\n            \n                <p>Yet, Mr. Obama and his acolytes will tell you he is cutting the deficit which really doesn't matter when you are racking up debt to the tune of $3 billion a day, a smaller deficit is inconsequential.</p>                \n                \r\n\n            \n                <p>Here is the warning and I'm sorry to have to give it to you. The CBO says if Congress does not start balancing the budget the long-term economic situation will be dire. Taxes will go up on everyone -- they have to. Interest rates will go up because people around the world won't lend us any more money unless they get paid through the roof.</p>                \n                \r\n\n            \n                <p>In other words, the American economy will be strangled and could very well crash and burn in 10 years. Taking the savings and welfare of all Americans with it. Responsible politicians know this yet they continue to tell you, the voter, that they will rebuild the American military, stimulate the economy so everybody can have a good job, that they will provide health insurance for people who can't or won't pay for it.</p>                \n                \r\n\n            \n                <p>And who is really going to pay for that? People who lend America money. That's who. So we sink deeper in deeper into debt.</p>                \n                \r\n\n            \n                <p>It's long past time for politicians to finally be honest to level with us. In the pursuit of votes, both parties, but especially the Democrats, have irresponsibly spent money just to pander to the electorate. America at this point in history is a great country, but we are getting weaker by the day. And the reason we are getting weaker is because our debt is simply out of control and getting worse every second. $3.3 billion in debt a day.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Perhaps the best reason we should all leave the United States right now", "description": "Bill O'Reilly's Talking Points 6/17", "date": "2015-06-18T12:29:17Z"}