{"vcmId": "7570a16a-8b85-45e3-a010-cb65a623a58b", "url": "http://www.foxnews.com/transcript/2015/07/02/fighting-for-religious-freedom.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" July 1, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And in the \"Impact Segment\" tonight as mentioned in the T Points, Louisiana Governor Bobby Jindal issued an executive order saying that Louisiana court clerks and other employees do not have to issue marriage licenses to same-sex couples because of religious objections if they have them.</p>                \n                \r\n\n            \n                <p>In addition, the order prohibits the state from denying or revoking tax exemptions to religious organizations who dissent on gay marriage. Individuals are protected as well. If you don't want to provide services for gay nuptials in Louisiana, you are protected.</p>                \n                \r\n\n            \n                <p>But now the ACLU and six other organizations are suing Governor Jindal and the state for discrimination. The Governor joins us now from Lincoln, Nebraska.</p>                \n                \r\n\n            \n                <p>You must have anticipated that this was going to happen. What do you think the long game is for the ACLU? What are they trying to do in your state?</p>                \n                \r\n\n            \n                <p><b>GOV. BOBBY JINDAL (R-LA), PRESIDENTIAL CANDIDATE: </b>Bill, thank you for having me.</p>                \n                \r\n\n            \n                <p>You're right. We did anticipate this. We did our own Religious Freedom Restoration Act in 2010. We gave the executive order May 19th in anticipation of this court's, this awful ruling.</p>                \n                \r\n\n            \n                <p>Bill, I think their long game is, the ACLU used to be for religious freedom before they are against it. You mentioned in the earlier segment I think they want to get to a point where we no longer have First Amendment religious freedom rights.</p>                \n                \r\n\n            \n                <p>For example, you heard during the court case, the solicitor general was asked, if they ruled the way they did, would this impact, for example, the tax exempt status for institutions within a religious affiliation. He said it might. He didn't say it wouldn't --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Sure because if you're a Catholic college -- if you are a Catholic college and you have dormitories for married people and then there's a gay married couple that's attending college and you say it's against our religion and you might lose whatever advantage you have for being religious in the tax arena.</p>                \n                \r\n\n            \n                <p>But it's more than that. It's about individual liberty and you made a very astute point. In the beginning, the ACLU was all for individual liberty. That's why they were established, you know, freedom of expression, freedom of this, freedom of that. And now the baker -- and that analogy that I made is very, very pertinent.</p>                \n                \r\n\n            \n                <p>Because my religion says I can't do business with any Nazi or any totalitarian communist. I'm not going to do business with him, whether it's writing a book, whether it's shoveling snow off their driveway. If I know they are there, I am not doing it.</p>                \n                \r\n\n            \n                <p>And, you know, you can say you're discriminating against them. They are Americans. They have a right to x, y and z. I'm sorry.</p>                \n                \r\n\n            \n                <p>Gays are not a protected class right now. And if you're -- I would say if you're denying gay services just because they were gay, I think you've got a problem. But if you don't want to participate in the nuptials, then you should have the freedom to opt out there. And you say?</p>                \n                \r\n\n            \n                <p><b>JINDAL:</b> Bill, I think that's right. Look, the ACLU on their Web sites, it says religious freedom, religious liberty is a fundamental right. Here's hypocrisy -- they've actually used Louisiana's Religious Freedom Restoration Act to defend the rights of other religious minorities. And good for them for doing that. Now that it's evangelical Christians, now that it's Catholics who object to redefining marriage, we're simply saying we don't want to participate in weddings that violate our conscience, our beliefs -- now the ACLU is saying you can't have the same rights, the same First Amendment protections we want for other religious minorities. I think the left wants to take God out of the public square.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. There's no doubt about that.</p>                \n                \r\n\n            \n                <p><b>JINDAL:</b> I think they want to redefine America as a much secular society.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Absolutely. It's much easier for the secular progressives to get stuff passed if they can destroy the opposition that comes from religious Americans.</p>                \n                \r\n\n            \n                <p>Now, you are running for president. You know it's a long shot. You've got to come from 1, 2 percent in the polls all the way up to beat guys like Jeb Bush and Donald Trump, I mean he's doing well in the polls because he's so flamboyant and he's so opinionated.</p>                \n                \r\n\n            \n                <p>Are you doing this for a realistic -- do you really believe that you can do this because it's going to take $1 billion. Where are you going to get that?</p>                \n                \r\n\n            \n                <p><b>JINDAL:</b> Bill, I'm running to win. I'm running because I worry that President Obama is trying to turn the American dream into a European nightmare.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But they are all worried about that, all of the 19 candidates are worried about that.</p>                \n                \r\n\n            \n                <p><b>JINDAL: </b>Well, one of the things I think I believe that sets me apart is I'm saying we've got to embrace our own principles. Look Jeb Bush said you've got to be willing to lose the primary to win the general election. I think that's nonsense. We have tried to make the left happy, we've tried to appease the media. It doesn't work. Let's embrace our conservative principles.</p>                \n                \r\n\n            \n                <p>We've got a lot of talkers running. We need a doer. Somebody who can repeal Obamacare, somebody who's got a proven track record. I've cut my state budget 26 percent. We've cut 30,000 state bureaucratic positions. We need a doer, not a talker. We need to embrace --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. But you're going to be up against other governors -- Walker in Wisconsin, Kasich in Ohio -- just to name two. Christie in New Jersey, who are all going to have stories to tell in their own state, just as you do in Louisiana.</p>                \n                \r\n\n            \n                <p>It just seems to me that it's really -- I'm glad you're in the race. I'm glad you're in the race. You're a different, distinctive voice and we need that. But It's going to be really tough for you, Governor. Last word?</p>                \n                \r\n\n            \n                <p><b>JINDAL:</b> Well, look, the hour is late for America. We need somebody who will say the things in D.C. you are not supposed to say. Bill the smart guys in the Republican Party say you can't do term limits, you can't cut the size of government -- I think they are wrong. I think this country is ready to wake up and say let's get off this path towards socialism.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Governor -- thanks as always. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Fighting for religious freedom ", "description": "Louisiana ACLU sues Governor Bobby Jindal over religious freedom executive order", "date": "2015-07-02T12:09:23Z"}