{"vcmId": "759b6231-10c3-4fbe-861e-a8401f07608d", "url": "http://www.foxnews.com/transcript/2016/05/27/bill-oreilly-how-much-trouble-is-hillary-clinton-really-in.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Yesterday, the inspector general of the State Department harshly criticized former Secretary of State Hillary Clinton for conducting federal business on her private email system.</p>                \n                \r\n\n            \n                <p>Steven Leneck (ph) went on to say, that Mrs. Clinton did not seek permission to circumvent the rules. But most damning of all, the IG reports that Hillary Clinton refused to talk with him about the violations. Each Federal Agency has an inspector general who is in charge of investigating alleged wrongdoing. Now, this is a major development because the FBI is already investigating Secretary Clinton for possible criminal wrongdoing.</p>                \n                \r\n\n            \n                <p>And Leneck provides motive. His reports say, Mrs. Clinton refused to use the government email because she, herself, feared that some of her correspondence might be made public. Reaction to the story came quickly.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> Overnight Clinton's first response to that report, telling Univision her emails won't be an issue.</p>                \n                \r\n\n            \n                <p><b>CLINTON</b>: It's the same story. It's not an issue that is going to affect either the campaign or my presidency.</p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL CANDIDATE: </b>She's as crooked as they come. She had a little bad news today as you know from some reports came down weren't so good. But, not so good. Inspector General's report not good.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, at the State Department itself, there was this.</p>                \n                \r\n\n            \n                <p><b>MARK TONER, STATE DEPARTMENT DEPUTY SPOKESMAN</b>: You know there were attempts but none of them were successful.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> How do you know that none of them were successful?</p>                \n                \r\n\n            \n                <p><b>TONER: </b>I would just have to refer you to the --</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: How do you know that because the report does not say that none of them were successful?</p>                \n                \r\n\n            \n                <p><b>TONER</b>: I apologize, actually. I misspoke.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> All right.</p>                \n                \r\n\n            \n                <p><b>TONER:</b> But I will say, I just would refer you to Secretary Clinton's team for questions about the security of her system.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. They're talking about hacking there. And Mr. Toner is being ridiculous referring questions to Clinton's team? Come on. You are insulting us. Hillary Clinton is banking on the FBI not recommending charges. If the agency does, it's over for the secretary. But if no indictment is forthcoming, voters will most likely shrug especially because her base is so ardently anti-Trump. Summing up, not a good Wednesday for Hillary Clinton. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: How much trouble is Hillary Clinton really in?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 5/26", "date": "2016-05-27T12:18:59Z"}