{"vcmId": "75b6447b-0755-46c7-acc4-733cf8faabb0", "url": "http://www.foxnews.com/transcript/2016/02/01/marco-rubio-explains-his-stance-on-illegal-immigration.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 29, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Thanks for staying you with us. I'm Bill O'Reilly reporting tonight from Southern California. In the \"Personal Story\" segment. Senators Marco Rubio and Ted Cruz have been questioned very aggressively about their stands on illegal immigration. Tonight we'll talk about with Mr. Rubio.</p>                \n                \r\n\n            \n                <p>In 2010, he said that illegal aliens in America should be sent back home. Before they can apply for legal citizenship. However, in 2013, Senator Rubio supported legislation that would not have sent aliens home. Did not pass, but he supported it.</p>                \n                \r\n\n            \n                <p>He joins us now from Iowa. Now, this isn't a got you segment, Senator. I want you to know that right off the bat. I have changed my mind on a lot of issues myself. All right? Did you, indeed, change your mind about the illegal aliens going home before they applied for citizenship?</p>                \n                \r\n\n            \n                <p><b>SEN. MARCO RUBIO (R-FL), PRESIDENTIAL CANDIDATE</b>: Well, first, Bill, that's never been my position. What I said is we are not going to grant blanket amnesty. And in truth, when I got to the Senate, I saw this major issue that's been confronting our country for 30 years and I said, let's see if we can do something about it and try to fix it in a way that's good for America. And in the process what we have seen now is after two unconstitutional executive orders, a migratory crisis with minors, a problem that keeps getting worse. The American people are not going to support a comprehensive approach to this. You are going to have to do it one step at a time. And that begins with making sure that we can prove to people that illegal immigration is under control and until you do that, you are not going to be able to do anything else. You're not going to be able to do --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I agree.</p>                \n                \r\n\n            \n                <p><b>RUBIO</b>: -- it in the way that it was attempted to do in the past.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I agree. But I want to get this on the record. So, you are going to tell me here tonight that your position has been consistent from 2010 up until we're talking tonight. You have not had any change of opinion on this issue?</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Well, first of all there is a change in approach. Never on position. I never felt and I still do not support amnesty. The idea that we are going to go out handing out citizenship --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No. But you wanted to send them back. You wanted to send them back and then you supported a law that would not have?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> No, no, no, no. Bill, what I said was that I was not in support of blanket amnesty and in fact I had not supported previous efforts to do it that way, either. And I don't support that effort now to do it that way.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> There has to be a process. We are not going to round up and deport 12 million people. I have always said that we are also not going to grant blanket amnesty. So, we have to deal with the problem with the people we have here now. And by the way, Bill, the American people know this. It's just, they're not --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I think so too.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>And I don't blame them. Until we deal with illegal immigration first.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Let's move the policy forward. And this is a series of short questions and if you can answer them, you know, right directly we can get more in. The wall, all right? Trump wants the wall. He is going to build it. Mexico is going to pay for it all that stuff. You are president of the United States. You build a better wall to keep out narcotics and illegal people from coming in here.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Yes. We need 700 miles of fencing and walls. Particularly walls in key sectors of the border and all the experts acknowledge that that law requires it, Congress hasn't funded it. When I'm president they will.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: OK. The people that are here, probably around 12 million people, all right? Do you give them working papers? Do you give them the right to work while you're processing who they are?</p>                \n                \r\n\n            \n                <p><b>RUBIO</b>: Well, first of all we don't do anything until not just the wall but e-verify, entry/exit tracking system and 20,000 new border agents are hired and it's working. Until all of that is in place and working, we don't do a thing. Then we will see what the American people support. What I have suggested in the past is people that have been here a long time, that people that can pass a background check. Because if you can't, you can't stay. Pay a huge fine, start paying taxes they get a work permit. And that's all they should have for at least 10 years before they can even apply for a green card not awarded a green card apply for.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK. So, you would consider --</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> That's my suggestion. Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: OK. All right. So, I assume if you are president you will sign executive -- OK. I assume if you are president you will sign executive orders to get that wall built fast, to hire the agents you need, to get the e-verify up and running with strict penalties for employers who violate our immigration law. Now, sanctuary cities. You have got them in Florida in your home state. San Francisco is the most well-known. You cut off federal funding to sanctuary cities --</p>                \n                \r\n\n            \n                <p><b>RUBIO</b>: Remove the federal funding. Absolutely. Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>RUBIO</b>: Federal law enforcement funding is cut off. Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK. All right. Kate's law. All right. We are having a hard time getting that passed. You know the struggle that I'm involved with. And part of it is the Republican Party. They won't stand alone vote it, they keep attaching it to legislation they know is not going to pass like the sanctuary city bill. They know that. How do you get Kate's law on the books?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Well, I would ask Congress to pass it stand alone immediately and as soon as it reaches the Oval Office, I would sign it immediately. And as you know I'm a co-sponsor of that law. I think we should pass it as soon as possible.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Because that would stop the madness about convicted foreign alien felons defying deportation. Do you and this is just a personal question. No politics just me and you, guys, all right? Are you ready to be guys with me and you? Are you ready?</p>                \n                \r\n\n            \n                <p><b>RUBIO</b>: Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Can you believe that not every single politician in this country would support Kate's law? Can you blanking believe they would oppose that? I'm just stunned.</p>                \n                \r\n\n            \n                <p><b>RUBIO</b>: Yes, I know some of them. Well, I know some of them. And their arguments are pathetic. Look, the Democratic Party has reached a point now where they have been taken over by the extreme left. I mean, there are no moderate Democrats left, at least not in national politics. And you have got to be Bernie Sanders to be leading in the polls and Hillary is right there next to him. The Democratic Party has become completely unreasonable and it's not just about immigration. It's about a host of issues.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>RUBIO</b>: That's the great untold story of American politics is that the Democratic Party has been hijacked by radical, Left of center movement in this country that is completely outside the mainstream of American thought.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Listen, I'm politics aside, just on a moral basis, you're telling me that if you are an elected official in the United States that you're not going to try to stop felons, aggravated felons who are illegal? You are not going to try to stop that? I mean, it just makes my head blow off.</p>                \n                \r\n\n            \n                <p>Hey, Senator, we always appreciate your time.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>Thank you very much.</p>                \n                \r\n\n            \n                <p><b>RUBIO</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: OK.</p>                \n                \r\n\n            \n                <p><b>RUBIO</b>: Thanks, Bill.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Marco Rubio explains his stance on illegal immigration", "description": "Republican presidential hopeful joins 'The O'Reilly Factor' to discuss the key voting issue", "date": "2016-02-01T18:41:16Z"}