{"vcmId": "77e6a9de-53f4-46bd-b509-1e4bbc3d7b99", "url": "http://www.foxnews.com/transcript/2016/08/24/bill-oreilly-new-strategy-from-trump-campaign.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>To take the heat off their candidate, the Trump campaign is now focusing on Hillary Clinton's continuing email and foundation controversies. The plan is this. To demonize Mrs. Clinton with the corruption label. To demand an independent prosecutor be assigned to look at her behavior and to tell voters that ongoing scandal will not benefit the country. Yesterday, Mr. Trump made things clear.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (D), PRESIDENTIAL NOMINEE</b>: The Clintons made the State Department into the same kind of pay for play operation as the Arkansas government was. The amounts involved the favors done, and the significant number of times it was done require an expedited investigation by a special prosecutor immediately, immediately, immediately.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, for the next few weeks, we will be hearing that Attorney General Loretta Lynch should appoint a prosecutor to investigate the Clinton Foundation and perhaps the new email dump which we will tell you about in a few moments. For her part, Secretary Clinton is keeping cool. She appeared with Jimmy Kimmel last night.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON</b>: Jimmy, my emails are so boring.</p>                \n                \r\n\n            \n                <p><b>JIMMY KIMMEL, COMEDIAN:</b> Yes, mine are.</p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> I'm embarrassed about that. They are so boring.</p>                \n                \r\n\n            \n                <p><b>KIMMEL</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> And we have already released, I don't know, 30,000 plus so what's a few more?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, that's a smart strategy by Secretary Clinton not to run from the controversies but to underplay them. Mrs. Clinton well understands that her base doesn't care very much about the email or the situations. Her campaign is hoping that Independent voters are tired of it. All in all, this presidential campaign is nasty already. And it will get worse. Talking points predicted that because there is so much at stake.</p>                \n                \r\n\n            \n                <p>The difference between Donald Trump and Hillary Clinton is enormous. And partisans on both sides are mobilized to the highest degree. Obviously, we are all living in a time where America is a very divided country. Republicans have nominate a populist, a magnet for controversy who promises great change. Democrats have nominate a traditional politician, also a controversy magnet whose policies are not much different than those of President Obama.</p>                \n                \r\n\n            \n                <p>For me as a voter, I don't like all the strife. I don't like the polarization but it's a reality and we all have to deal with it. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: New strategy from the Trump campaign", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 8/23", "date": "2016-08-24T12:16:02Z"}