{"vcmId": "77f41d47-cb4b-4a23-93f9-edc01b112172", "url": "http://www.foxnews.com/transcript/2017/02/21/free-press-does-usa-really-have-one.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><b>O'REILLY: </b>\"Impact Segment\" tonight. A free press. Does the USA really have one? That is a subject of the second \"Talking Points\" memo this evening. With President Trump taking on the national media, saying much of it is corrupt and fake news. A major controversy has erupted, as you know. Mr. Trump has been criticized by both the left and the right.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MCCAIN</b>: I hate to the press. I hate you, especially. But the fact is, we need you. We need a free press. We must have it. It is vital. If you want to preserve, I'm very serious now. If you want to preserve democracy as we know it, you have to have a free press and many times adversarial press.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Senator McCain apparently believing that the American process is, quote, \"free.\" But is that true? Many Americans believe that the national media has now become an arm of the Democratic Party. That is, they don't coordinate with the Democrats, they are not attending meetings, but their sympathies are simpatico with a party. On television, the overwhelming number of newscasters are liberal.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>LAWRENCE O'DONNELL, MSNBC HOST:</b> The constitution anticipated this. The founding fathers anticipated Donald Trump. They feared tyrants.</p>                \n                \r\n\n            \n                <p><b>JOHN DICKERSON, \"FACE THE NATION\" HOST: </b>The question has the right to experience and had the right judgment. Hillary Clinton won those questions by a gargantuan amounts on numbers.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> He never denied it. But I think what the people are saying is, we don't care. We hear what you say about him. We don't want to hear it. We don't care.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And now, the President Trump has taken office, and the attacks on him are weathering.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JAKE TAPPER, CNN ANCHOR:</b> President Trump, if you are watching, you are the President. You legitimately won the presidency. Now get to work and stop whining about it.</p>                \n                \r\n\n            \n                <p><b>MARC LAMONT HILL, PROFESSOR, MOREHOUSE COLLEGE</b>: It is very irresponsible, ultimately dangerous moment in history, almost a proto-fascist moment in history which he is laying seatbelts in the minds of American people. The media itself is broken.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE</b>: As we know, since 2,000, there has been a couple dozen suspicious deaths of journalists in Russia who came out against the government there. Donald Trump has made no secret about going after journalists. His distaste for any news that doesn't agree with him here. Do you find that this is a dangerous path he is heading down?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, he is going to kill us. Again, it is not a stretch for any fair-minded person to believe that the national media leans heavily left and despises President Trump. Not willing to give him a chance or any benefit of the doubt. Surely, that is what is going on. Surely. As for the adversarial nature of the press, Senator McCain is correct. The founding fathers gave us specific freedom so we could tell you how the people in power were behaving. But when the press aligns itself with a political movement, in this case, liberalism, then, it is no longer objective or free, because it is sympathizing with a political point of view.</p>                \n                \r\n\n            \n                <p>It is tethered to a philosophy. This is not unique to America. The European press is far left, generally speaking. They are worse than the press here. But in America, President Trump has made this an enormous issue. Some believe that the FOX News Channel is not fair and free. I dispute that, pointing to analysis of our on-air personnel. We put forth both sides. President Obama would disagree. And remember, he complained about the press, too.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You think I am unfair to you? Do you think --</p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA (D), FORMER PRESIDENT OF THE UNITED STATES:</b> Absolutely. Of course you are, Bill. But I like you anyway, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. But give me how I am unfair. Give me how I am unfair. Come on! You can't make that accusation without telling me.</p>                \n                \r\n\n            \n                <p><b>OBAMA</b>: Bill, we just went through an interview, and what you asked about health care not working, IRS, where we are wholly corrupt. Benghazi --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>OBAMA</b>: Right? So, the list of issues that you talked about --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But these are my questions.</p>                \n                \r\n\n            \n                <p><b>OBAMA</b>: But they are defined by you guys in a certain way. But look, this is okay. If you want to be president of the United States, then, you know that you are going to be subject to criticism.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But if it is unfair, I want to know if it is unfair. Criticism is criticism. It is my job to give you a hard time.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And it is my job to give everyone in power a hard time. And I do. Your member that President Trump told me I should see a psychiatrist at one point. But I don't have an agenda, other than an honest presentation.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I like Barack Obama as I have liked George W. Bush. I think they are both patriots, okay? Now, you may not agree with their policies, you may think that they are not managing well. That's fine. Everybody has an opinion. But as human beings, I think they are both trying to do what is best for their country. So, I admire that, I respect that.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, for saying that, the far right hammered me. Summing up, if the American press wants to regain respect, it needs to ditch its outwardly liberal bent. I know all these people. I know all the anchors, most of the producers, I know who they are and how they think. In the national press, it is at least ten to one, liberal over conservative. And that is the truth. And that is \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "A free press; Does the USA Really have one?", "description": "'The O'Reilly Factor': Bill O'Reilly's Second Talking Points 2/20", "date": "2017-02-21T13:17:55Z"}