{"vcmId": "77f6a7fb-bfdb-4c97-8564-ce1672ed1b70", "url": "http://www.foxnews.com/transcript/2015/01/27/did-know-that-melissa-francis.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 26, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Personal story segment tonight. We begin a four-part series called \"Did You Know That?\" At Fox News there are some great back stories about people you see on the air every day. One of them is Melissa Francis from the Fox Business Network who at age eight played Cassandra on \"Little House on the Prairie\".</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> Maybe we should go back.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>No. We'll get to a road soon. We have to.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> But I'm afraid.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>Look, as long as we're together, nothing's going to happen. Come on.</p>                \n                \r\n\n            \n                <p>My leg. I think it's broken.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> What do we do?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> I don't know.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>I've got to go back.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> No, you can't.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED GIRL: </b>I have to. You could die.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED BOY: </b>Cassandra, no, no.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Wow. But everything turned out okay. And here now is Melissa Francis, author of the book \"Diary of a Stage Mother's Daughter.\" So, we will start there. Your mom, you were living out in L.A., right? And she was very ambitious for you, right?</p>                \n                \r\n\n            \n                <p><b>MELISSA FRANCIS, FOX BUSINESS NETWORK: </b>Yes. I had the Hollywood version of a tiger mom, which was a stage mother at the time who, you know, sort of pushed me relentlessly in everything I did. That's what a lot of the book was about. I mean, I think there are people out there that can relate to that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> You know, someone who drives very hard.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You are 8-years-old and you do this show for two years.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> Yep.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Was it enjoyable? Was it fun?</p>                \n                \r\n\n            \n                <p><b>FRANCIS: </b>You know, I loved acting as a kid. And I always laugh when you see child actors who say their parents forced them to do it. Because it's a lot of work. And to get a kid to memorize the lines --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>FRANCIS: </b>Be on there every day.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Sure.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> Hit your mark. Do things, cooperate, I mean, my kids wouldn't cooperate like that. So I loved it. I did love it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You did loved it. Okay, so when you were doing it, it was fun for you to do.</p>                \n                \r\n\n            \n                <p><b>FRANCIS: </b>It was.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Michael Landon treat you okay?</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> He was phenomenal, I mean, he was like Santa Claus and God rolled into one.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, he was a good guy.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> Very fun.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The show was a big hit.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Did you know you were in a hit show when you walked around? Did you have a little attitude when you were a kid?</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> No, it was actually very embarrassing to me. You know, you would go to the mall and, you know, you walk down the mall and everyone would turn. You know what's that like. I mean, that's your daily life.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I have never been to the mall, but I can assume that you were mobbed and Cassandra is here.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> Right. Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. So, you were educated then privately a lot of times?</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> No. I was in regular school.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You went to regular school?</p>                \n                \r\n\n            \n                <p><b>FRANCIS: </b>As I said, you know, my mother was over the top. We were going to do everything right. And so, you know, I had straight A's in school the whole time.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And you got into Harvard, right?</p>                \n                \r\n\n            \n                <p><b>FRANCIS: </b>That's right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You went from L.A. to Boston to go to Harvard.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> Yes, I did.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Very impressive. Did you have an uncle that went to Harvard?</p>                \n                \r\n\n            \n                <p><b>FRANCIS: </b>No. No.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I think there are big little house fans there.</p>                \n                \r\n\n            \n                <p><b>FRANCIS: </b>No. No. You know, straight A's all the way along and --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Did you get A's at Harvard, too?</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> Some. Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, you go to Harvard, which believe me is not easy to get into and then you wanted to be a TV journalist right away.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> I did so I used to do internships. NBC News. I actually interviewed at the local FOX affiliate in LA. First, it was the first thing I did.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>FRANCIS: </b>Carol Breashears (ph) is out there gave me my first shot. And I went home every day with a migraine, because everyone screams at each other with those deadlines and the raising for, and I thought this is fantastic. I'm going to do this.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So, you didn't wanted to like Jody Foster went to Yale and she went back to acting, you didn't want to get back to acting.</p>                \n                \r\n\n            \n                <p><b>FRANCIS: </b>No.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You wanted to be a serious TV journalist.</p>                \n                \r\n\n            \n                <p><b>FRANCIS: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. And so, here you are at FOX News, that's pretty good, how did you get here?</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> So, I got hired in Manchester, New Hampshire, WMUR, a guy named Jack Keene (ph) gave me a shot.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Good station.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> Because he thought because I had been on television that I could somehow do news. But he didn't realize it couldn't be further from the same thing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> I mean, in acting you have lines, a million rehearsals somebody else is telling what you to say.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You are crying all the time.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> Right. In news I got out there.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You can't cry in news.</p>                \n                \r\n\n            \n                <p><b>FRANCIS: </b>Well, you can't. I mean, well, a little bit. Anyway.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So WMUR I have to rush you through it because you know.</p>                \n                \r\n\n            \n                <p><b>FRANCIS: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, WMUR your first job and then you went where.</p>                \n                \r\n\n            \n                <p><b>FRANCIS: </b>I got fired from that job.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Why? What did you do?</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> Well, so I did the first live shot. And you look out, and it's just all you baby, I mean, there's no script or anything. And I bombed. I was terrible. They fired me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right on the spot they fired you for one bad live shot?</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> No. It's not that guy. New person took over it now. I did a couple bad live spot.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Because I did like 85,000 bad live shots.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> No.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I never got fired but they said, you know, maybe there is a better station for you.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> I pulled myself up and kept going.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So, where did you go?</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> Rhode Island, Maine, New Hampshire, Connecticut.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You did you did the whole thing.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> I did. And then I finally made it here to my dream job.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And you really wanted to work for FOX News?</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And that's because of me, right?</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> Absolutely.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>What else could I possibly say at this point?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> It's all about you. Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Well, it's an amazing story. Particularly the odyssey from the little kid running around crying.</p>                \n                \r\n\n            \n                <p><b>FRANCIS: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> To the FOX Business Network where you are crying about the stock market.</p>                \n                \r\n\n            \n                <p><b>FRANCIS:</b> I am, and you know, my kids come to me and they cry and they make up the fake tears and I have got it look at them and be like, that's terrible. When I was your age I got paid to do that. You're doing an awful job. So work on that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And there we go. Melissa Francis.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Did you know that? : Melissa Francis", "description": "Fox Business’ Melissa Francis enters the ‘No Spin Zone’ to share her story", "date": "2015-01-27T15:28:05Z"}