{"vcmId": "7a734205-eda9-46c2-b68a-c9cfbe396c5d", "url": "http://www.foxnews.com/transcript/2015/02/12/president-obama-proposal-to-fight-isis.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 11, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Impact Segment\" tonight. President Obama asking congress to give him formal authority to use the U.S. military against the ISIS terror killers and just in time a new Fox News poll says just 19 percent -- 19 percent believe the Obama administration has an effective strategy to fight ISIS.</p>                \n                \r\n\n            \n                <p>Also an update on the Bowe Bergdahl investigation.</p>                \n                \r\n\n            \n                <p>Joining us now from Orlando, Florida, Fox News military analyst, Colonel David Hunt; from Washington Lieutenant-Colonel Tony Shaffer has been our point coverage for Bowe Bergdahl.</p>                \n                \r\n\n            \n                <p>All right. What's the latest on the Bergdahl investigation, Colonel Shaffer?</p>                \n                \r\n\n            \n                <p><b>LT. COL. TONY SHAFFER, U.S. ARMY RESERVE:</b> Latest word is we are looking at a mid March decision and within mid March an announcement of that decision. And, Bill, this is a complicated issue in that you have the White House and I saw David Axelrod's comments the other night. David is completely misinformed. The President and company knew exactly about Bowe Bergdahl's status before they entered the deal regarding the Taliban.</p>                \n                \r\n\n            \n                <p>With that said the Pentagon, the White House, and the Bergdahl defense team are all trying to kind of push their way through this trying to gain advantage. So what you are seeing here a lot of this is each side, all sides trying to basically one up the other for purposes of trying to win the argument.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm sure you noticed that I told David Axelrod that that they had to know he was a deserter when he they made the deal we corrected the records there.</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> Right. Yes, sir.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And the second thing is -- it looks to me like they are trying to figure out how to sell this to the American public so it doesn't damage President Obama. That's what it is all about, is it not?</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> That's what the White House is doing. And I can tell you from talking to the Pentagon directly about this, Bill, is that and I think Dave will back me up on this. The Pentagon is trying to do what it is. The army is trying to do what it can to be honest. All the pressure here, Bill, is come from the White House. Let's be very clear about that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. You concur Colonel Hunt?</p>                \n                \r\n\n            \n                <p><b>COL. DAVID HUNT, FOX NEWS MILITARY ANALYST:</b> No. This is a four star general who has got paper now on his desk for two and a half, three months. This is a decision he has to make. And then they decide whether it's going to be court martial or not. So all the pressure, this is a combat veteran, four-star general.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Milley.</p>                \n                \r\n\n            \n                <p><b>HUNT:</b> Second investigation. He has to make a decision. If he takes the phone calls he should not there's a thing called command influence. This is inexplicable that this is taking this long.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's right. But you don't disagree with Colonel Shaffer. You are both on the same side that politics has intruded. But now at least Colonel Shaffer says that mid March is when we will know.</p>                \n                \r\n\n            \n                <p>All right, now, President Obama asking congress for permission to do what, Colonel Hunt? I'm not exactly sure what he is doing here.</p>                \n                \r\n\n            \n                <p><b>HUNT:</b> He wants extension of the war powers act. He wants to have it both ways -- increase the war or decrease. He wants and he wants politically Congress to do what they haven't done for six months since they've been bombing ISIS to make a decision, go on the record.</p>                \n                \r\n\n            \n                <p>We are leading the world. We have for 14 years in this war on terror. The problem is ISIS and we can't get anybody to say boots on the ground. We will not be able to do, have any success just bombing and everybody knows in the Middle East we're going to have to help. The problem he wants is people to say it with a vote and he wants the power to do what he wants as president. Not unreasonable either way.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He wants Congress to say yes you can put ground troops in there if you want to. But there is a little clause in there that says Colonel Shaffer, no enduring ground presence, which means you can't occupy.</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But, you know, there is a good silver lining to this story. When I was interviewing David Axelrod on Monday he was trying to tell me that the strategy the Obama administration currently has to defeat ISIS is a good one. We all know that's garbage, it's a terrible one.</p>                \n                \r\n\n            \n                <p><b>HUNT:</b> Completely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's awful. We are going to bomb them and train five guys from Syria and Saudi Arabia to come over and make lunch. Ok. Now, 19 percent of Americans know it they know this is a big charade. It isn't working. They're tired of seeing Americans like that poor girl yesterday, killed by these savages. And they want something done. That's the good news on this.</p>                \n                \r\n\n            \n                <p>Go, Colonel Shaffer.</p>                \n                \r\n\n            \n                <p><b>SHAFFER:</b> Well look, we have got to do things effectively. Today his comments, Bill, were terrible. He said -- this is what he said. He said we're going to do this deliberately. That's codes for slow rolling it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>SHAFFR:</b> I talked to my special operation command friends. Bill, there's whole pieces of special operation command being held back. This is the time they should be at the front doing stuff. This is totally insane. There is a road to ground troops. The Kurds are doing great job. They won Kobani without -- virtually with no help from us. We need to get in the Egyptians and Jordanians who are truly on our side to be the ground forces we need to use.</p>                \n                \r\n\n            \n                <p>There is a path forward, Bill. We have it on our Web site. We can do this. It's just that they don't have a clue on how to do it.</p>                \n                \r\n\n            \n                <p>Congress wants them to come up with a plan and this --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, the pressure is becoming unrelenting. And we understand, there's one other American being held by ISIS. And if they kill that person -- I mean everybody is getting it now. You can't just let these savages, Colonel Hunt sit there in Mosul, sit there in Raqqa. You have got to go get them.</p>                \n                \r\n\n            \n                <p>Now, if it's Egyptians, fine; if it's Jordanians, fine, who is going to organize that? That has to be organized by the U.S.A. Last word, Colonel Hunt.</p>                \n                \r\n\n            \n                <p><b>HUNT: </b>Of course, and it has to be supported logistically intelligence command and control. But there has to be more than just killing them. You have been doing it for 26 years. I get we want to go and kill ISIS. When they go into Syria, we have got to have a plan and a strategy that takes not just the killing.</p>                \n                \r\n\n            \n                <p><b>SHAFFER: </b>An instinct.</p>                \n                \r\n\n            \n                <p><b>HUT: </b>That has not worked. It has to be total. I don't think we are equipped for it. I don't think we are ready for a total effort.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I think that if we routed ISIS the other plan might be able to come together. But there is some urgency to the situation in my humble opinion.</p>                \n                \r\n\n            \n                <p>Gentlemen, thanks very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "President Obama's proposal to fight ISIS", "description": "Legislation sent to Congress seeking authorization for the use of military force", "date": "2015-02-12T13:16:11Z"}