{"vcmId": "7c2d2962-e605-40e1-a2ec-921ad6ccfd9e", "url": "http://www.foxnews.com/transcript/2017/01/26/bill-oreilly-big-crack-down-on-illegal-immigration.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Fulfilling a campaign promise, President Trump has ordered the immediate construction of a wall on the Southern border. And not only that.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Our order also does the following, ends the policy of catch and release at the border. Requires other countries to take back their criminals. They will take them back. Cracks down on sanctuary cities. Empowers ICE officers to target and remove those who pose a threat to the public safety.</p>                \n                \r\n\n            \n                <p><b>(END VIDEOTAPE)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Mr. Trump signing two executive orders earlier today, which send a signal, a strong signal, that illegal immigration is going to be dealt with in a very aggressive way. To explain further, catch and release is a policy reinstituted by President Obama, where those sneaking across the Southern border could ask for asylum and almost immediately be set free. Sometimes, handed a bus ticket that you and I paid for to an address anywhere in the USA.</p>                \n                \r\n\n            \n                <p>Few of those released ever returned for their court hearings. That policy was a scandal. Now, it is finished. Secondly, the sanctuary cities, as you know, have openly defied federal law for decades. Now, federal funds may be denied to those places. So, on day three of President Trump's first week in office, he sent shock waves through the liberal communities. Also, Mr. Trump is calling for a federal investigation into voter fraud, where he alleges that millions of illegal aliens are voting.</p>                \n                \r\n\n            \n                <p>That's a good thing, the investigation. We should know if fraud on Election Day is real or not. Also, the President has informed the city of Chicago that if the murder epidemic there doesn't stop, federal authorities will intervene. Another good thing. And that intrusion is likely to happen as Illinois Governor Bruce and Chicago Mayor Rahm Emanuel will not stop the brutal gang killings. They just won't do it. Which have taken thousands of innocent lives.</p>                \n                \r\n\n            \n                <p>How that situation has been allowed to go on for years is another scandal and perhaps the most vivid illustration of racism \"Talking Points\" is ever seen. So, President Trump is acting quickly and according to a Rasmussen daily presidential tracking poll, Americans are taking notice. Today, the pole has 57 percent of likely U.S. voters approving of Donald Trump's job performance, 43 percent disapproving.</p>                \n                \r\n\n            \n                <p>It remains to be seen, however, whether a border wall will be effective, whether sanctuary cities will finally obey the law, and whether ending the Catch and Release Program will slow down illegal border crossings. But at this point, strong federal action is being taken. No question about it.</p>                \n                \r\n\n            \n                <p>And that is \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Big crack down on illegal immigration", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/25; Plus reaction from Rep. Steve King and Sen. Ted Cruz", "date": "2017-01-26T13:08:52Z"}