{"vcmId": "7c8a2f3c-bd4d-48e7-9afa-884e7a9a046d", "url": "http://www.foxnews.com/transcript/2016/08/16/bill-oreilly-where-trump-campaign-is-right-now.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>First of all, neither candidate has momentum. Even though the polls say Hillary Clinton is up by about seven points nationally, voters are not jumping up and down for either candidate generally speaking. But it is certainly true that Donald Trump has lost support and in states like Florida, North Carolina and Virginia he is falling behind Secretary Clinton.</p>                \n                \r\n\n            \n                <p>One cautionary note. Polling in mid-August doesn't really mean very much. Only after Labor Day will polling begin to shed light on the race. And after the first debate on September 26th, the polling will become intense. There is no question that Donald Trump is hurting himself by using the same kind of rhetoric that helped him win the primaries. Very ironic. Trump's shoot from the hip, seek and destroy speech-making vaulted him over his Republican challengers. But now, when he makes a flamboyant statement. It's rammed down his throat by a hostile press.</p>                \n                \r\n\n            \n                <p>Some examples, on July 29th, the government announced that the growth in the second quarter was 1.2 percent. A disaster. And the Democratic Party immediately was on the defensive. But just two days later, Donald Trump criticized Ghazala Khan, the mother of an army captain killed in Iraq. Immediately all hell broke loose and the disappointing economic number vanished from view. Same thing happened on August 9th as emails showed that Hillary Clinton used her position as secretary of state to possibly benefit the Clinton Foundation. Big story, right? But the exact same day, Donald Trump said this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP, REPUBLICAN PRESIDENTIAL NOMINEE:</b> Hillary wants to abolish, essentially abolish the Second Amendment. By the way, if she gets to pick.</p>                \n                \r\n\n            \n                <p><b>(CROWD BOOS)</b></p>                \n                \r\n\n            \n                <p>If she gets to pick her judges, nothing you can do, folks. Although the Second Amendment people maybe there is. I don't know.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Immediately the liberal press accused Trump of threatening Mrs. Clinton. \"The Washington Post\" editorializing, quote, \"Encouraging armed resistance against the federal government is not the most worrisome of possible meanings. Other listeners assumed that Mr. Trump was encouraging supporters to train their weapons on Miss Clinton herself.\" Unquote.</p>                \n                \r\n\n            \n                <p>Think about it how insane that sentence is. Other listeners assumed Trump wants Clinton murdered? Yet, \"The Washington Post\" editorial board put that in the paper. Why? Well, they despise Donald Trump. And are using Saul Alinsky's rules for radical number 13. Quote, \"pick the target, freeze it, personalize it and polarize it. Cut off the support network and isolate the target from sympathy.\" That is what the anti-press, the anti- Trump press is doing.</p>                \n                \r\n\n            \n                <p>But back to Trump himself. There are two things in play here, he is not recognizing that explosive comments like those about Muslim women and gun control can and will be used against him. And that is an extremely hostile American press will use his words not only to denigrate him, but also to avoid reporting on real issues affecting the U.S.A. I predicted this would happen more than a year ago.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Finally tonight, the Factor \"Tip of the Day,\" the media despising Donald Trump. And here's why. He has no fear. He could not care less about censoring himself and the press does not intimidate him. So, because of that approach, the media believe they must punish Mr. Trump for being disrespecul and not cowering before them. Plus, they don't like his politics, generally speaking.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And that has come to pass. So the Trump campaign is now in some trouble. And today the candidate sought to begin rebuilding his base. In Youngstown, Ohio, Mr. Trump laid out his plan to aggressively defeat Islamic terrorism.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> My administration will aggressively pursue joint and coalition military operations to crush and destroy ISIS. International cooperation to cut off their funding, expanded intelligence sharing, and cyber warfare to disrupt and disable their propaganda and recruiting.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, in speaking with Mr. Trump over the months, it's safe to assume that he would attack ISIS on the ground using some American forces. That separates him from the Obama administration and perhaps Hillary Clinton. Mr. Trump also reiterated that he will not get any more specific about his ISIS strategy. That was immediately mocked by Hillary Clinton.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> My administration will not telegraph exactly military plans and what they are.</p>                \n                \r\n\n            \n                <p><b>(CHEERS AND APPLAUSE)</b></p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON (D), PRESIDENTIAL NOMINEE:</b> Sometimes he says he won't tell anyone what he will do because he wants to keep his plan, quote, \"secret.\" And then it turns out the secret is he has no plan.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, that's politics as usual. But it's clear that Donald Trump would take a far more aggressive policy against the jihadists than the Democrats are advocating. That's clear. So you, the voter, have that contrast to consider. But overall, the press has succeeded in marginalizing Donald Trump to some extent. And he has helped them do it. Again, the bombast worked in the primaries. His attacked worked. But they will not work in the general election unless the attacks that Trump makes are very specific.</p>                \n                \r\n\n            \n                <p>So, if you say President Obama created ISIS, for example, you have to immediately back that up with facts. If you say something about elections being rigged, you are going to get hammered unless you can point to some data to back it up. Now, talking points is dedicated to covering the Trump Clinton race in a fair way. It's a fact that if do you not condemn Donald Trump, you yourself are condemned by many in the media. Same thing in the far right precincts. If you don't call Hillary Clinton the devil, then somehow you become Lucifer.</p>                \n                \r\n\n            \n                <p>Those points of view are dangerous. We need clear on issues not mud based attacks. Despite all the controversy, Donald Trump could still win the presidency. He needs to discipline himself rhetorically. He needs to start spending money in the swing states to counter negative ads against him and he needs to present himself in a less personal way. Today in his speech he was strong about protecting America in the areas of immigration, security, and dealing with terror on the net. Liberal Americans aren't going to vote for Trump anyway so there is little risk in him continuing to lay out a tough anti-terror and anti-illegal alien program.</p>                \n                \r\n\n            \n                <p>Combine that with a faltering economy, and Trump has a chance. But right now, Hillary Clinton's definitely ahead. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Where the Trump campaign is right now", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 8/15", "date": "2016-08-16T12:22:08Z"}