{"vcmId": "7d24f03d-c3d6-48b0-b100-2e29b2031af3", "url": "http://www.foxnews.com/transcript/2015/02/12/bill-oreilly-why-brian-williams-story-is-important-for-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As educated viewers, you guys know that the founding fathers gave the press special privileges. They did that so reporters could keep an eye on powerful politicians and others who might cause harm to the folks. The founders were wise to do that and I just wish the press was half as responsible as the men who forged the nation.</p>                \n                \r\n\n            \n                <p>Poll last year by Gallup says only 40 percent of Americans now trust the mass media. It's down from 54 percent in 2003. The reason many Americans hold the press in contempt is two fold.</p>                \n                \r\n\n            \n                <p>First ideology, it's perfectly fine for commentators like me to give my opinion about events. That's what I'm paid to do. The Factor is clearly an opinion program just like the editorial page of a newspaper. But when hard news people deceive their viewers and readers to advance a political agenda, that's when the nation gets hurt.</p>                \n                \r\n\n            \n                <p>And to Brian Williams, the anchorman for the NBC nightly news every day about nine million people watched him report the events of the day. Mr. Williams was successful, beating out ABC and CBS news.</p>                \n                \r\n\n            \n                <p>But now we know that Brian Williams exaggerated certain stories and so NBC had to suspend him for six months. It wasn't just the Iraq helicopter deal. Mr. Williams apparently misreported other situations as well.</p>                \n                \r\n\n            \n                <p>For example, NBC News won a Peabody Award for its coverage of Hurricane Katrina in New Orleans. Mr. Williams was a big part of that. Subsequently he said he was attacked by gangs, gangs in the Ritz Carlton Hotel.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" was suspicious of the story and so was the \"Washington Post\". Yesterday, I talked with \"Post\" reporter Terrence McCoy who has been investigating.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TERRENCE MCCOY, \"WASHINGTON POST\":</b> I'm reflecting what the hotel manager said in her assessment of Brian Williams when he said that he misremembered that gangs were inside the hotel.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How can he misremember the gang -- you are a reporter, Mr. McCoy, I'm not trying to give you a hard time here. I appreciate you coming on. How you can misremember there are gangs in a hotel? You can't. It's impossible. If there are gangs, there are gangs. If there aren't, there aren't.</p>                \n                \r\n\n            \n                <p>According to your article, the manager of the Ritz Carlton Hotel clearly said there were no gangs in my hotel. Where did I get it wrong?</p>                \n                \r\n\n            \n                <p><b>MCCOY:</b> Well, what happened with the hotel --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. McCoy, did the manager of the hotel tell you or not tell you that there were gangs in her hotel?</p>                \n                \r\n\n            \n                <p><b>MCCOY:</b> No, the manager of the hotel said that there are no gangs in the hotel.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And that's the same information we have. Brian Williams said he was rescued from gangs by New Orleans police officer named Matthew Pingis (ph) but he was not rescued from gangs. So, combining that with the Iraq deal, Williams had to go.</p>                \n                \r\n\n            \n                <p>But NBC News has other problems as well. One of their foreign correspondents, Ayman Mohyeldin, said this about the American sniper Chris Kyle.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>AYMAN MOHYELDIN, NBC NEWS:</b> Some of what people described as racist tendencies as Iraqis and Muslims as he was going on some of these, you know, killing sprees in Iraq on assignment. So I think there are issues.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>Wait a minute, killing sprees? Chris Kyle was going on killing sprees?</p>                \n                \r\n\n            \n                <p><b>MOHYELDIN:</b> When he was involved in his on assignments.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Right.</p>                \n                \r\n\n            \n                <p><b>MOHYELDIN:</b> And in terms of what he was doing.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Right.</p>                \n                \r\n\n            \n                <p><b>MOHYELDIN: </b>A lot of the description that has come out from his book and some of the terminology that he has used.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Right.</p>                \n                \r\n\n            \n                <p><b>MOHYELDIN:</b> People have described as racist.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now a group of military people demanding that Mr. Mohyeldin apologize as he should. He is a hard news reporter, it's simply absurd to say Mr. Kyle was on a \"killing spree\" and was racist while he was in the Iraq war theater.</p>                \n                \r\n\n            \n                <p>Look, every news organization makes mistakes. But those mistakes are eroding the confidence of Americans in the press. With few constraints on the net, it's extremely important that the national media stop the corruption and begin telling the truth without an agenda.</p>                \n                \r\n\n            \n                <p>I get the \"New York Times\" every morning. That paper has tremendous resources. But over the years it's become a left wing enterprise and that's crept into its hard news coverage. I mean, the paper can't even put out an honest bestseller list for books without injecting ideology. The stuff has got to stop.</p>                \n                \r\n\n            \n                <p>Now on a personal note some of you have criticized me for not condemning Brian Williams. Here is what I said on Jimmy Kimmel Monday night.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Anybody who is enjoying the destruction of this man, you've got to look at yourself here. And there's a lot of people saying they'd be real happy that his career is going down the drain. That disturbs me.</p>                \n                \r\n\n            \n                <p>He embellished a story. Now, again, if it's just one time, he will get by. But if it's a pattern of this, it's going to be hard for him to come back and be the main anchor on NBC.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So now we know there is a pattern and it's my belief that Mr. Williams, after the New Orleans deal, will not return as the main anchor of NBC. They will find another place for him.</p>                \n                \r\n\n            \n                <p>I liked Laura Ingraham's take yesterday.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>LAURA INGRAHAM, FOX NEWS CONTRIBUTOR: </b>I know Brian Williams a little bit. I used to work at MSNBC. He is one of the first people who was frankly, you know, very nice and professional to me there. So he has always been very kind to me personally.</p>                \n                \r\n\n            \n                <p>But I will say, this it doesn't matter whether I watch -- whether I want him to be fired, excuse me, it matters what like the folks in Paducah, Kentucky think.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, that is right on. It's all about what you guys think. If you can't trust the news anchor or commentator, you are not going to watch that person.</p>                \n                \r\n\n            \n                <p>NBC News made more than $200 million in 2013 on the \"Nightly News\" with Mr. Williams. That was $30 million more than ABC; $50 million more than CBS. So obviously NBC didn't want Williams off the air but they had to take him off because if they didn't, it would insult you, the news viewer.</p>                \n                \r\n\n            \n                <p>Reporting comes with a big responsibility, the founding fathers made that point very clearly. They said to us we'll give you freedom. We'll protect you from government intrusion but in return, you, the press, must be honest.</p>                \n                \r\n\n            \n                <p>President John Adams got so fed up with the press he tried to shut it down. But the balance of power stopped Mr. Adams from doing that.</p>                \n                \r\n\n            \n                <p>Here on The Factor, we are in our 19th season -- an amazing run. And we have made some mistakes in the past, but very few. We put together an honest broadcast every day. Take great pains to present you with information that can be verified.</p>                \n                \r\n\n            \n                <p>All Americans who love their country should think about what has happened to Brian Williams, should think about other news agencies that are distorting the facts. We should all open that proverbial network window and yell out we're mad as hell and we're not going to take it anymore.</p>                \n                \r\n\n            \n                <p>That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Why the Brian Williams story is important for America", "description": "Talking Points 2/11", "date": "2015-02-12T13:06:40Z"}