{"vcmId": "7d38a0e3-223b-4f4c-a50e-cf1f884577b1", "url": "http://www.foxnews.com/transcript/2014/10/02/will-mexico-finally-release-sgt-andrew-tahmooressi.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><em>This is a RUSH transcript from \"The O'Reilly Factor,\" October 1, 2014. This copy may not be in its final form and may be updated.</em></p>                \n                \r\n\n            \n                <p><em>Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</em></p>                \n                \r\n\n            \n                <p>O'REILLY: \"Factor Followup\" segment tonight, will Mexico finally release Marine Sergeant Andrew Tahmooressi being held in Tijuana for weapons violation? You might know this story. The Sergeant has post-traumatic stress disorder after service in Afghanistan. He says he made a mistake crossing into Mexico unintentionally when he asked Mexican authorities for help they arrested him.</p>                \n                \r\n\n            \n                <p>That was on March 31st, he has been trying to get released from prison ever since. Today there was a hearing on the issue in the House.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>LT. COL. MONTEL WILLIAMS (Ret.), VETERANS ADVOCATE: And to me this is abomination. Six months. He didn't hesitate to say aye, aye sir to go off and serve. How dare we, how dare we as a nation hesitate to get that young man back.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: And joining us now from Washington the chair of the committee that heard the testimony from Montel Williams and others, Congressman Ed Royce from California. First of all, do you think the Sergeant will be released shortly?</p>                \n                \r\n\n            \n                <p>REP. ED ROYCE (R), CALIFORNIA: I think he will, Bill. I had a conversation with the Attorney General from Mexico. Who indicated that under Mexican law he would have the capacity should it be proved that he had PTSD. I sent a report to the Attorney General that showed that 10 days before in San Diego, at the Veterans hospital he was so diagnosed.</p>                \n                \r\n\n            \n                <p>And it is our understanding that that is weighing right now in the balance. But I think our hearing today may have assisted.</p>                \n                \r\n\n            \n                <p>O'REILLY: Also, yesterday, a Mexican psychiatrist examined the Sergeant and I understand it was reported that he did concur that the Sergeant has post-traumatic stress disorder. So, if that's the case, then they have to release him. So we -- we feel that maybe in a day or two, but, you know, the Mexicans, they -- they do this to rankle the United States. Nieto the President could have done a clemency thing months ago, you know that everybody knows that all right he had the power to do it. He could have said you know what? The circumstance are murky. The guy has got a condition. Because of goodwill we're going to let him out. Nieto could have done it he's got the power to do it he didn't do it. They like to jab us down in Mexico, do they not?</p>                \n                \r\n\n            \n                <p>ROYCE: Well I think one of the questions also is how high a level did this go in the United States?</p>                \n                \r\n\n            \n                <p>O'REILLY: Well, I want to get that to that a minute -- I want to get to that in a minute because that's what Williams was talking about.</p>                \n                \r\n\n            \n                <p>But, Mexico itself, they like to give us grief and they -- yes, in the end, they will let him out and they will do it. But the guy has been in there since March, come on. It's ridiculous.</p>                \n                \r\n\n            \n                <p>ROYCE: And they --</p>                \n                \r\n\n            \n                <p>O'REILLY: Go ahead.</p>                \n                \r\n\n            \n                <p>ROYCE: -- they certainly have given Andrew a lot of grief. I went down and saw him in the prison. We were able to move him from the Tijuana jail which was -- which was absolutely the worst place you would want to be in jail to it Takati which is a better condition.</p>                \n                \r\n\n            \n                <p>But nevertheless, when you are suffering from PTSD and those around you know that you have that problem, and you're compounding, basically you are compounding the PTSD by not allowing the treatment, then, yes, you are delaying.</p>                \n                \r\n\n            \n                <p>(CROSSTALK)</p>                \n                \r\n\n            \n                <p>O'REILLY: But it's -- it's even worse than that he is being held in solitary for his own protection. I mean they don't have any -- his mother was on a few days ago. They don't have anything to do. It's almost torture. It's almost like the Mexican government is torturing the man for, what? Because he had had three guns in his car? Because he was moving from Florida to California and he made a wrong turn? Even if you don't believe that so what, it's a low level beef. I mean give us a break. And that's what gets me angry about Mexico and I think it's got to change.</p>                \n                \r\n\n            \n                <p>Now, what you were saying is Williams -- Montel Williams say look, the Americans is not doing enough to get the guy out. Do you believe that?</p>                \n                \r\n\n            \n                <p>ROYCE: Absolutely I believe that we raise this question with the -- with the White House. The request for the President to make a call to the President of Mexico, that never happened. And you know at the same time, we had a situation where we traded five senior Taliban leaders who were all involved with al Qaeda who had cost American lives. We traded them and now they're going to, within a few months, be able to go back to Afghanistan or back to Pakistan.</p>                \n                \r\n\n            \n                <p>This makes no sense in terms of the balance.</p>                \n                \r\n\n            \n                <p>O'REILLY: How do you know -- how do you know President Obama didn't call Nieto? How do you know?</p>                \n                \r\n\n            \n                <p>ROYCE: Because I made the request to the Vice President that the President make the call and after the fact, when the conversation occurred, we heard that this had not come up. So we do know --</p>                \n                \r\n\n            \n                <p>O'REILLY: Biden told you he didn't make the call?</p>                \n                \r\n\n            \n                <p>ROYCE: No. The White House indicated to us.</p>                \n                \r\n\n            \n                <p>O'REILLY: Did they give you a reason why the President wouldn't call him?</p>                \n                \r\n\n            \n                <p>ROYCE: No, no reason why, but I think it has to do with the priorities here. And I think the priorities are backwards --</p>                \n                \r\n\n            \n                <p>(CROSSTALK)</p>                \n                \r\n\n            \n                <p>O'REILLY: What, how long does a phone call take? How long does that take?</p>                \n                \r\n\n            \n                <p>ROYCE: It doesn't take long to pick up the phone and make a call on an issue like this one.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right I'm going have Ed Henry, he's going to be here tomorrow and ask why they didn't do that if indeed they didn't. Kerry the Secretary of State did he call Nieto? What has he done?</p>                \n                \r\n\n            \n                <p>ROYCE: I do not know if the Secretary of State got involved personally in this or not.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right.</p>                \n                \r\n\n            \n                <p>ROYCE: I do know -- I do know that I have talked to the ambassador, the foreign minister, the attorney general, been down there in Mexico.</p>                \n                \r\n\n            \n                <p>O'REILLY: But you've been doing much you should do. All right. Now, I'm going to ask Rosen who is going to be on tomorrow with Henry if Secretary of State Kerry called him or did anything. So we will get to the bottom of that tomorrow. Good work, Congressman.</p>                \n                \r\n\n            \n                <p>ROYCE: Yes.</p>                \n                \r\n\n            \n                <p>O'REILLY: Again, we expect the Sergeant to be released and obviously we report that the moment it happens.</p>                \n                \r\n\n            \n                <p><em>Content and Programming Copyright 2012 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2012 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</em></p>                \n                \r\n\n            \n\n            \n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Will Mexico finally release Sgt. Andrew Tahmooressi?", "description": "This is a RUSH transcript from \"The O'Reilly Factor,\" October 1, 2014.", "date": "2014-10-01T04:00:00Z"}