{"vcmId": "7dae8320-c10e-42fd-b49b-bf78502701ec", "url": "http://www.foxnews.com/transcript/2016/10/25/analyzing-criticism-media-and-donald-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 24, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story\" segment tonight. Jennifer Rubin, a blogger for \"The Washington Post,\" writes a column and has been very critical of the Factor's coverage of Donald Trump. On September 26th, Ms. Reuben wrote, quote, \"It's not even surprising that talk radio host FOX News fake news people Bill O'Reilly right wing blogs and anti-immigrant extremists buy into Trump's candidacy.\"</p>                \n                \r\n\n            \n                <p>On September 21st, he said this, quote, \"Trump should do interviews with real news people not Sean Hannity and Bill O'Reilly in preparation for the debates. He's otherwise in for a rude awakening when someone asks a real question\" unquote. Pretty harsh.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington is Jennifer Rubin. So, thanks for coming on.</p>                \n                \r\n\n            \n                <p><b>JENNIFER RUBIN, WASHINGTON POST OPINION WRITER</b>: Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But you know you are entirely wrong about this. Your own newspaper posted a headline that said, the O'Reilly, Trump interviews are the best Trump views. Did you miss that? Did you miss that?</p>                \n                \r\n\n            \n                <p><b>RUBIN</b>: No. My criticism is really that you actually are in the Spin Zone. It's presented as a news program or pseudo news program and, instead, it's a lot of parroting what Trump is saying to you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Give me one example of how I parroted Donald Trump.</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> Sure. You have attacked the moderators in the other debates. Calling them the fix is in.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How did I do that?</p>                \n                \r\n\n            \n                <p><b>RUBIN</b>: Yes. Martha Raddatz and Anderson Cooper.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Wait, how did I attack Mr. Cooper and Ms. Raddatz.</p>                \n                \r\n\n            \n                <p><b>RUBIN</b>: You said the fix was in. I have a whole list actually here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The fix was in, how?</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> The fix was in that they were going to be hostile to Mr. Trump.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I said they were Democrats. All right.</p>                \n                \r\n\n            \n                <p><b>RUBIN</b>: Yes. Which also isn't true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Are they not?</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> Actually the only Democrat was Chris Wallace.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No Ms. Raddatz and Mr. Cooper are Democrats. You did not know that?</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> Right. No. The one who is a registered Democrat is Chris Wallace.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, what are Ms. Raddatz and Mr. Cooper?</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> They you will have to ask for themselves. But see what you're doing Bill is, you are taking up the argument of the candidate rather than acting as an Independent person.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's not true. If I see that two Democrats are sitting there, both who have been aggressive with Donald Trump, all right. And then you have a candidate, Hillary Clinton, that's three against one, all right? And to my, in my analysis, and I do what you do, I have a right to say that may be not the fairest position.</p>                \n                \r\n\n            \n                <p><b>RUBIN</b>: Right. It's a question of whether it's balanced. And unfortunately, over time, and like I said, I have a really long list of them. Essentially you have kept up what the Trump campaign has been saying. You have made excuses for the lock her up comment? You have pleaded.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: How did I -- when did I make excuses for lock her up? What did I exactly say?</p>                \n                \r\n\n            \n                <p><b>RUBIN</b>: Oh, let's see, that would have been on, let's see if I have the date, exactly. It would have been on -- lock her up would have been on in April and also in August. In August --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> Rather in October, if you remember, Charles Krauthammer came on and had a very rigorous argument --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Wait a minute, what did I stay in April and August? What exactly did I say?</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> Right. We can go through all of them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, I want that one.</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> Which one in particular?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> April or August.</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> Okay. Let's see, in August, uhm, let's see, uhm, we had comments that you were going to -- if somebody had being really dishonest, referring to the press corps, you would strip them of their credentials as well. Doesn't sound like an independent thing?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That doesn't have anything to do with lock them up. You are ill prepared for this interview, Ms. Rubin.</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> No, I have a whole list here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I just have given you a minute where you've hemmed and had. You said I justified a comment lock her up. You can't point it, and then you pivot to something else. You are ill-prepared for this. And this is the point I want to make.</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> No, it's not actually, Bill. It's not Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Your column and blog are fraud. We have been tough on Trump here and I'm going to roll some tape.</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> No, it's not. It is a little montage for all your guest. It shows the three things that you've said mean about him.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Are you worried that sometimes when you say these things that peaceful Muslims will be the victim of backlash? You're behind with him.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Are you going to target --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I'm not I believe it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know, whether you believe it or not. That's what the polling says.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So you think your birther position has hurt you among African- Americans? Are you getting mad at guys like me when I ask you the negative questions?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No. I think you have become very negative. I do think --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Me?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Why would I do that?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I don't know, who knows? I said, you have to ask your psychiatrist.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So birther, covered there.</p>                \n                \r\n\n            \n                <p><b>RUBIN</b>: Right. October 10th. You defend Trump's promise to put Hillary in jail.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, tell me how I did that, madam. You just can't throw out. What did I say?</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> You said that it was perfectly defensible position.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No, I didn't. That's not true. I didn't say.</p>                \n                \r\n\n            \n                <p><b>RUBIN</b>: Yes, you did.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Read my comment. Do you have my comments there? Read them.</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> I don't have them word for word.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You are ill-prepared for this.</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> Do you know what I will do, Bill? I will put them up on my website.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Go ahead. Do you know how many people are going to come to your website, zero. Because you are not an honest analysis person. You're not.</p>                \n                \r\n\n            \n                <p><b>RUBIN: </b>Well, you just don't like what I'm saying, Bill. I actually have all these --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know.</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> Here there is a time that Charles Krauthammer came on the show and he had to really castigate you for saying, you were using weasily words he said to defend Trump's violence.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK</b>)</p>                \n                \r\n\n            \n                <p>You have gone down the birther trail. You've gone down and call Judge Curiel to be withdrawn from the case. That is a racism.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. I know. I'm a racist. You are right, Mr. Rubin.</p>                \n                \r\n\n            \n                <p><b>RUBIN:</b> And you indulge Trump.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You are a real star. A real champ. Thanks for coming on. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Analyzing criticism of the media and Donald Trump", "description": "Has the GOP candidate been treated fairly? 'The O'Reilly Factor' investigates", "date": "2016-10-25T12:23:11Z"}