{"vcmId": "8021e1f9-cd92-4c05-b8e7-07e56a781c24", "url": "http://www.foxnews.com/transcript/2014/10/03/bill-oreilly-ebola-panic.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><em>By Bill O'Reilly</em></p>                \n                \r\n\n            \n                <p>All over the country people are discussing the deadly disease Ebola. Brand new Fox News poll asks how concerned are you Ebola will spread to the U.S.A. -- 68 percent concerned; 31 percent not so much.</p>                \n                \r\n\n            \n                <p>But as you may know, the disease is already here in Texas. Here are the facts. Liberia national Thomas Duncan currently being treated for Ebola at a Dallas hospital where he's in serious but stable condition. Duncan arrived in the U.S.A. on September 20th. Prior to that, he had helped a 19-year-old woman in Liberia who was ill. That woman died from Ebola.</p>                \n                \r\n\n            \n                <p>A few days after her death, Duncan apparently outwardly healthy, boarded a plane in Monrovia, flew to Brussels, Belgium, changed planes then flew on to Dulles airport in Washington where he again changed planes and went to Dallas.</p>                \n                \r\n\n            \n                <p>On September 24th Duncan begins to have symptoms of Ebola. On September 26th, two days later, he goes to Dallas Presbyterian Hospital where he is examined and sent home with medication. On September 28th, Duncan is taken by ambulance back to Presbyterian where he is properly diagnosed with Ebola.</p>                \n                \r\n\n            \n                <p>But here's the shocking thing. Before the ambulance arrived, Reuters is reporting that Duncan was seen vomiting in the parking lot of the apartment building where he was staying. Ebola is spread by bodily fluids. Dallas authorities now estimate that up to 100 people, some of them children may have had direct or second hand contact with Duncan. So, in Dallas right now, there is grave concern.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>UNIDENTIFIED MALE: When my daughter came home from school, my first thought was like any concerned parent. Are you serious?</p>                \n                \r\n\n            \n                <p>UNIDENTIFIED FEMALE: I just started crying. I was like hysterical.</p>                \n                \r\n\n            \n                <p>UNIDENTIFIED FEMALE: I was just wanting to get to my kids. So I went and got them.</p>                \n                \r\n\n            \n                <p>UNIDENTIFIED MALE: People won't shake each other's hands. They won't talk to each other. They are scared to go into the restroom.</p>                \n                \r\n\n            \n                <p>UNIDENTIFIED MALE: It's scary. Real scary.</p>                \n                \r\n\n            \n                <p>UNIDENTIFIED FEMALE: They need to tell us what child it is because I mean if it was in their class I'm going to be 10 times more pissed than I already am.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: So that's where we are -- many people frightened and angry that Ebola may spread throughout the USA. So what should the federal government do since it is Washington's obligation under the Constitution to provide for the common good? First of all, all flights from West Africa should immediately be discontinued to the U.S.A. and Europe should do the same thing.</p>                \n                \r\n\n            \n                <p>Now I feel sorry for the West African nations but there is an epidemic of Ebola there and it will spread because the incubation period lasts for up to 21 days. Also U.S. immigration should allow no one, no one to enter this country holding a passport from any West African nation. That policy should last until the Ebola epidemic subsides in Africa.</p>                \n                \r\n\n            \n                <p>As you may know many people hold irrational fears and that's contagious as well. Once Ebola starts spreading around the country, chaos will follow therefore West Africans should not be admitted into the USA until the epidemic is controlled in cases of life and death you must err on the side of caution. So President Obama should order right now an immigration quarantine from those areas.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The Ebola panic", "description": "By Bill O'Reilly All over the country people are discussing the deadly disease Ebola.", "date": "2014-10-02T04:00:00Z"}