{"vcmId": "80787b87-6c82-48f1-ba13-520fed0a6614", "url": "http://www.foxnews.com/transcript/2015/01/05/is-america-more-racially-divided-today-than-2008.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 2, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Let's get right to our top story. Is America more racially divided today than it was when President Obama took office? No one can deny that in the final moments of 2014, America witnessed an eruption of racial divide when grand juries in Ferguson, Missouri, and Staten Island, New York, decided not to charge white police officers in the deaths of unarmed black men. Protests broke out across the country and many leaders claimed the people of color experienced injustice at the hands of law enforcement.</p>                \n                \r\n\n            \n                <p>In light of that, the president was asked this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>INTERVIEWER:</b> Is the United States more racially divided than it was when you took office six years ago, Mr. President?</p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> No. I actually think that it's probably -- in its day-to-day interactions less racially divided, but I actually think that the issue has surfaced in a way that probably is helping.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>But according to the American people, that simply is not true. The new FOX News poll asks voters, since Barack Obama became president, do you think the relations between the races in the United States have gotten better or worse?</p>                \n                \r\n\n            \n                <p>Only 19 percent say race relations have gotten better, 62 percent say they've gotten worse, 17 percent say they're about the same.</p>                \n                \r\n\n            \n                <p>So, why does the president see things so differently than the American people?</p>                \n                \r\n\n            \n                <p>Joining me now to sort it all out is FOX News contributor Deneen Borelli, and from Washington, Simon Rosenberg, founder of the New Democrat Network, and a former campaign advisor to Bill Clinton.</p>                \n                \r\n\n            \n                <p>Deneen, I'm going to start with you. How can the president possibly say things are better now than six years ago? Ferguson, Missouri, Oakland, California, across the country, all the way here to Staten Island, New York, protests all over the place.</p>                \n                \r\n\n            \n                <p><b>DENEEN BORELLI, FOX NEWS CONTRIBUTOR: </b>Sure.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Is it better or worse?</p>                \n                \r\n\n            \n                <p><b>BORELLI:</b> What the president can't do is ignore the facts, and that is what he is doing. When you look at Ferguson, for example, President Obama inserted himself into that issue. President Obama is part of the problem. He sent Eric Holder down there with 40 FBI agents. Obama's speech before the U.N., he made it an international issue as well when he said race relations in America and agitation -- I'm paraphrasing. But Obama is a part of the problem.</p>                \n                \r\n\n            \n                <p>There's also Al Sharpton who's been in the White House over 61 times and has the ear of top officials in the White House, a known race baiter, which is absolutely outrageous.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Simon, how -- can you defend the president's comment that race relations in America are better now than when he took office?</p>                \n                \r\n\n            \n                <p><b>SIMON ROSENBERG, NEW DEMOCRAT NETWORK FOUNDER:</b> Look, the U.S. is going through an incredible transformation of our people, who are going through an overwhelmingly white country to one that will be a majority minority by the time my kids are my age.</p>                \n                \r\n\n            \n                <p>And there are going to be bumps in the road in this transition. This is not going to be a simple straight line --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Are they better, Simon? Are they better now when he took over? That was his claim. They're better now when he took over.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>ROSENBERG: </b>I think what we know is that America has seen its first minority president who on balance I think has done a pretty good job. And I think that we are seeing a different set of race relations that we have in the past, and I'm sure that if that poll was taken today, a month later, you know, during -- since that poll was taken, the president's approval rating has gone 10 points. He's gone by 10 points.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> If you would just get to answering the question that I just asked you. Are race relations better in America today --</p>                \n                \r\n\n            \n                <p><b>ROSENBERG: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>-- January 2nd?</p>                \n                \r\n\n            \n                <p><b>ROSENBERG:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Or when he took office January 20, 2009? Were they better?</p>                \n                \r\n\n            \n                <p><b>ROSENBERG:</b> I think they're better. I'm going to agree with the president.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> OK, Deneen. I would say not. I would say, Al Sharpton, you point out Al Sharpton, owes the American people $4.5 million. People are ticked off about that.</p>                \n                \r\n\n            \n                <p>Louis Farrakhan just days before two officers were murdered here right in New York City said a life for a life. How are things better now than they were then?</p>                \n                \r\n\n            \n                <p><b>BORELLI:</b> No, it's absolutely outrageous what we are seeing and witnessing, and contributing to the social unrest. When you look in the black community, with double digit unemployment, and average incomes are lower, what you don't do is push policies that will make things worse for Americans but especially with those numbers I just cited.</p>                \n                \r\n\n            \n                <p>Obama has an energy policy that's harming Republicans, driving up electricity prices. These are things you don't do. And Obama had an opportunity as a lawyer waiting for facts to come out on certain cases and he really jumped the gun and made matters worse.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Simon, one of the other things that's gone on under President Obama's watch is income inequality in America has widened, and it's widened at the expense, let's say, of the lower class. And a lot of times African-Americans are seeing less income movement upwards than the top end.</p>                \n                \r\n\n            \n                <p>So, this is one of the things he also promised. That can't help race relations in America either.</p>                \n                \r\n\n            \n                <p><b>ROSENBERG: </b>No. I think it's contributing to people's -- the struggle of everyday people is contributing to some of this conflict. But, again, if you back and look at the polling over the last couple of months, if you have your poll, there are other polls showing on balance. And the president's approval rating is going way up.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Simon, that's not -- we're not talking about the president's approval rating. We're talking about how race relations in America. Are you repeating what the president said because you want to repeat what he said?</p>                \n                \r\n\n            \n                <p><b>ROSENBERG: </b>No, Eric --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Or do you honestly believe are better now when you look back over the last couple of weeks versus six years ago?</p>                \n                \r\n\n            \n                <p><b>ROSENBERG:</b> Eric, the country is clearly in far better shape than it was six years ago, and I think that, you know, when he took office. And I think people are giving him credit for that, right? I think if you look at the economy and how things are improving, yes, for --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BORELLI: </b>Unemployment in a black community, how is that better?</p>                \n                \r\n\n            \n                <p><b>ROSENBERG: </b>Unemployment is too high. It's too high. On the balance, the country is --</p>                \n                \r\n\n            \n                <p><b>BORELLI: </b>We have a president who is pushing the narrative that our country is racist. We have racism that's rampant in America, and that's just not true. That is what's adding in the social you unrest.</p>                \n                \r\n\n            \n                <p>Obama has missed a great opportunity to unite our country. He's playing the race card. It's a dangerous thing to do. We've witnessed it with individuals who are coming out against the police force. My goodness, what you don't do is pit Americans against our law enforcement and pit Americans against white versus black.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Simon?</p>                \n                \r\n\n            \n                <p><b>ROSENBERG:</b> I don't think that's what the president's been doing. I think he's been very measured in how he's handled this. He's aware that these are primarily local issues, where communities have to work through them.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> OK. So let me ask you this. What's your opinion of Al Sharpton? Do you think he's good for race relations?</p>                \n                \r\n\n            \n                <p><b>ROSENBERG: </b>I don't think that's --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> It really is. Here's why it's relevant.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>ROSENBERG: </b>We're here to talk about the president and that's what the segment is about, right? And I think that on balance --</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>OK. Fair enough. Hold on. Hold on a second, OK?</p>                \n                \r\n\n            \n                <p><b>ROSENBERG: </b>Sure.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> But if Al Sharpton is visiting the White House some 60 or 70 times over the last few years, and if Al Sharpton has claimed himself that he's going to be part of the process for race relations in America, even part of the process in picking the next attorney general, which is what he said, don't you think it matters to the American people whether or not that man who has raced vehemently and vitriolic as they come in America visits the White House and our president?</p>                \n                \r\n\n            \n                <p><b>ROSENBERG:</b> And the new incoming majority whip for the Republicans spoke to --</p>                \n                \r\n\n            \n                <p><b>BORELLI: </b>Don't change the subject.</p>                \n                \r\n\n            \n                <p>(CROSSTALK)</p>                \n                \r\n\n            \n                <p><b>ROSENBERG:</b> In race (INAUDIBLE)</p>                \n                \r\n\n            \n                <p>This is a complicated set of issues.</p>                \n                \r\n\n            \n                <p><b>BORELLI:</b> No, it's not complicated.</p>                \n                \r\n\n            \n                <p><b>ROSENBERG:</b> Go ahead. Explain it to me.</p>                \n                \r\n\n            \n                <p><b>BORELLI: </b>No. We want to hear it from you. How many times do we have to ask? Obama has inserted himself in these issues and he has played the race --</p>                \n                \r\n\n            \n                <p><b>ROSENBERG:</b> I totally disagree. I disagree. He's the president of the United States. These have been difficult issues. I think he's been very measured in his engagement on these matters over the last several months.</p>                \n                \r\n\n            \n                <p>He is the president. He should be involved. He shouldn't pull back. I think he's been very dexterous in the way that he's gotten involved in this. But, clearly, we've got work to do.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> OK. All right. You know what?</p>                \n                \r\n\n            \n                <p><b>ROSENBERG:</b> The country has not resolved all these issues. We can get to a better place. Let's work on it together and stop calling each other names.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Let's be united instead of divisive.</p>                \n                \r\n\n            \n                <p>Let's leave at that. Deneen, Simon, thank you very much.</p>                \n                \r\n\n            \n                <p><b>BORELLI:</b> Thank you, Eric.</p>                \n                \r\n\n            \n                <p><b>ROSENBERG:</b> Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Is America more racially divided today than 2008?", "description": "New poll shows only 19 percent of folks believe race relations have improved", "date": "2015-01-05T13:04:05Z"}