{"vcmId": "80923ea6-f2d1-49f0-b566-5c4a791ea76c", "url": "http://www.foxnews.com/transcript/2016/07/26/how-will-dnc-handle-illegal-immigration.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" July 25, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You are looking at a live picture from the Democratic convention in Philadelphia. This evening Bernie Sanders, Michelle Obama, Elizabeth Warren all set to speak. Also an illegal alien mother and an American born daughter just wrapped up talking to the folks.</p>                \n                \r\n\n            \n                <p>Joining us now from Philadelphia, Congressman Luis Gutierrez who spoke earlier this evening as well. So you are speaking on immigration. I want to know a few things. Do you believe in open borders? Do you favor open borders like they have in Europe?</p>                \n                \r\n\n            \n                <p><b>REP. LUIS GUTIERREZ (D), ILLINOIS</b>: Bill, you and I have talked about this in the past. You know that I have introduced immigration reform bills and the first two chapters are securing our borders and making sure that people when they come to the United States they don't come with a coyote. They don't come illegally. They come with a visa.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ</b>: We want to make sure that we have a legal immigration system.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, you don't believe --</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ:</b> I want to say one thing really quickly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Go ahead.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ</b>: Absolutely not.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But there are members of your party who do. And we spoke to a few of them, members of the Democratic Party who want open borders who don't want -- they want a society that has free flow in and out like Europe. Now, when you say that you want to secure the border. See, now Trump says I'm going to build a wall and then I'm going it put legions of people behind and that's how I'm going to secure it. What's the Democratic Party's vision on securing the border? What are they going to do?</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ:</b> Here what we do, Bill. As part of immigration reform, we take those that are here in the country and we give them a background check. And if you haven't committed a crime.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>I understand that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ:</b> But in order to get to the border, I think the first thing we need to do is use our resources smart, right? So, if we have millions of undocumented workers in this country that have citizen children and they're working and they're abiding by the law and they've been here 10, 15, 20 years, why not give them an opportunity?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. And this doesn't have anything to do with securing the border.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ</b>: It does, it does, Bill. In this sense, now we can take all of those massive resources --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ:</b> -- that we use on this silly fantasy of picking them up so that we can have more security. And as part of it, Bill, here is what I believe. I want to make this absolutely clear. I think that every American company before they hire somebody should have -- make sure that that worker goes through a background check.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. E-verify. That would be a big thing.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ</b>: Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But you still haven't told me --</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ:</b> Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, I'm trying the third time, Congressman. How do you secure the southern border? What do you do?</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ</b>: Here's what you do. You make sure that in our agricultural industry. And, Bill, I have traveled to Florida, I have traveled to Georgia, I have traveled to California, you and I both know that there are millions of undocumented workers that work hard, sweat soil every day to put the food we eat on our table. That's not a myth, that's a reality. Why don't we let them come with visas to this country so that then we don't have people using that border.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Congressman, you know --</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ</b>: We can secure both the --</p>                \n                \r\n\n            \n                <p><b>O'RIELLY:</b> You know I love you. Right? You know I love you.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ: </b>And I love you, Bill. I wouldn't be on this program. I look forward --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: This is the fourth time. This is four.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ:</b> I thought -- all last night I thought two things. I'm going to give a speech at the convention on prime time and I'm going to be on the number one FOX cable news. Those are my two --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. But you're not answering the question. I'm going to asked it the fourth times.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ:</b> I am.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How do you secure the border? What do you do? Are you going to move all the illegal aliens down there and wall them out? We can have preventing other people from coming in?</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ:</b> We allow people to come out of the shadows, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That doesn't have anything to do with securing the border.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ</b>: It does. It does. Because here's -- can I just say one thing to you, Bill?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ</b>: There are 11 million undocumented workers. You keep talking about the border and securing the border.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ</b>: I want to secure LAX. I want to secure Kennedy. I want to secure --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: We can deal with that, that overstay the visas. We can deal with that.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ</b>: But, but. Forty five percent of the undocumented that's the way they came here.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And we have to solve that problem.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ:</b> Totality.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But you still have not told me how you are going to secure the border. I can't keep asking you the same question.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ:</b> Give me -- Bill, give me a suggestion.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Who, me?</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ</b>: Give me a suggestion.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: If anybody overstayed their visa, they would be fined $10,000. Solves that problem.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ</b>: Okay. And I will tell you one thing, here's what I think. No, I don't like it for this reason.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You don't like it. You don't want to solve it.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ</b>: But let me --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ten grand. You overstay your visa. Ten grand. You can't pay, you go to debtor's prison.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ:</b> Bill, Bill, Bill, Bill, we could solve the problem tomorrow --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ</b>: Because there are good men and women in the Republican Party that can work with good men and women.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You can't solve it unless you put forth some type of secure the border plan and you haven't.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ:</b> We have a secure -- look, Bill, there are fewer people crossing that border than in the last 30 years. We have already doubled the enforcement on the border.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They are detaining hundreds of thousands of people down there. You know they are.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ: </b>But what you are trying to deny is that there is insatiable thirst for the drugs that come across that border in the United States of America.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, there is nothing we can do about that unless we punish the drug dealers and the cartel people. All right, Congressman. I'm glad you came on. If you do think of an answer sometime this week, let us know. And we will put you back on.</p>                \n                \r\n\n            \n                <p><b>GUTIERREZ:</b> I gave you one. Thank you, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right, Congressman.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "How will the DNC handle illegal immigration?", "description": "Will border security be a major theme of campaign 2016? 'The O'Reilly Factor' investigates", "date": "2016-07-26T12:27:07Z"}