{"vcmId": "8212f959-0788-410e-8951-42354ad3ce8a", "url": "http://www.foxnews.com/transcript/2016/02/04/president-obama-visits-his-first-us-mosque.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 3, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BILL O'REILLY, HOST, \"THE O'REILLY FACTOR\":</b> \"Personal Story\" segment tonight. President Obama visiting a mosque today, the Islamic society of Baltimore, speaking to congregants, he said this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>PRES. BARACK OBAMA (D), UNITED STATES</b>: If we are serious about freedom of religion, and I'm speaking now to my fellow Christians who remain the majority in this country, we have to understand an attack on one faith is an attack on all our faiths.</p>                \n                \r\n\n            \n                <p><b>(APPLAUSE)</b></p>                \n                \r\n\n            \n                <p>And when anyone religious group is targeted, we all have a responsibility to speak up.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: With us now here in New York City, Eboni Williams and Monica Crowley. So, that strikes to me as an anti-Trump thing because there hasn't been really, I mean, there have been some isolated incidents by nuts, all right. But no concerted effort to demean American-Muslims other than Trump saying, I'm not letting Muslims in here. That is what I think this is all about.</p>                \n                \r\n\n            \n                <p><b>MONICA CROWLEY, PH.D., FOX NEWS CONTRIBUTOR</b>: I agree. I think it's all political because the timing on this, why now? Why is he doing it now?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. Why is he doing it now?</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: And look, in that last line when he says when any religious group is targeted, we all have a responsibility to speak up. OK, I accept that. But hate crimes and threats in America happen with far more frequency against Jews than they do against Muslims. Where is he on that? The second point is, where is he on the Christian genocide happening across the Middle East. Tens of thousands of Christians are being slaughtered at the hands of Muslims and, yet, very little from this president on that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What do you think, Eboni?</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> He should be consistent in his messaging and his actions.</p>                \n                \r\n\n            \n                <p><b>EBONI K. WILLIAMS, FOX NEWS CONTRIBUTOR:</b> Look, I think you are both right. Clearly this is responsive to what the President and some feel is divisive language by Trump and even Dr. Carson, a bit higher scrutiny for Muslims. And this is responsive in this way. I think what's unfortunate though about the visit is his objective which is the kind to coalesce and remind us that we have a religious tolerance here in America. It's underminded because of the mosque he went to which is rumored to be tied or suspected to be tied to extremist behavior.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They had an extreme Imam back in 2003.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So that's 13 years ago.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS: </b>Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The statute of limitations on extreme Imams run out?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Well, wait a minute, wait a minute --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Wait a minute! Come on!</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> -- Has a long record of supporting radical Islamic causes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Give me an example.</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>They've supported the Chechen jihad. They've supported the Palestinian suicide bombers.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But that was a long time ago.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> They did have an Imam that was linked to a charity or active in a charity that linked to terrorist funding.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: A long time ago.</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>Shut down by the Treasury Department, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't think it's fair. And I will tell you why. There have been.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: This is not the place for him to go with this message.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't care where he goes. And I'm not saying this was the best place or not. But 13 years ago, look how many Catholic churches embarrassed by bad priests. So you're going to say, because a priest was there 20 years ago that you don't go there? Come on!</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>The vast majority of the mosques in America are funded by Saudi Arabia. Most of them have their ideological spiritual guidance coming from the Muslim --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You've got to be specific, not general, it's not fair.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Monica is actually making my point though, Bill. That even though it's been 13 years ago. For many in this country and I think legitimately can make the distinction right between law abiding patriotic Muslims --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: -- and those that are extreme and cause terror amongst all of us. They are able to make it but when you even give the margin for error around it, I think it doesn't help the causes a much as it could.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't care that he went to this mosque. What I do care about though and I think the stronger point is the antisemitism against Jews.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right? Much more intense than against Muslims in this country. And the Christians being persecuted overseas by ISIS. So we're going to contain ISIS so they can still persecute Christians.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You know, you don't launch a holy war. But you make a bigger deal out of it because when the President visits any church or any place, it becomes a big deal, Eboni. It becomes the centerpiece.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: It is a big deal. Sure. This isn't the first time. You know, George W. Bush went to a mosque six days after 9/11 because again they're becoming --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, he wanted to tamp down.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> And that's fine. If that's the message he wants to put out there about tolerance and diversity especially in the Muslim community. There are plenty of Muslim organizations in America that don't have this kind of shady kind of background, places like Dr. Zuhdi Jasser's organization which is the American Islamic Forum for Democracy. These are Muslims, Bill --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's a good point.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> -- who wants to reform.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's a good point.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> The President should be supporting the secular Muslims who want a reformation in Islam rather than these types of groups.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> I don't think he intended to kind of be controversial but I do agree that he could have picked a place --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't think he cares.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: I think he cares. He cares tremendously, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He doesn't care.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: How about this? You know that the White House was not going to send him anywhere without vetting it, so obviously they thought this place was appropriate.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No. They don't care. They just go. Here is what they go. FOX News ain't going to like it. We don't care. That's what they do.</p>                \n                \r\n\n            \n                <p>All right, ladies. Thanks very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "President Obama visits his first US mosque", "description": "Was his speech at the Islamic Society of Baltimore politically timed? 'The O'Reilly Factor' investigates", "date": "2016-02-04T13:34:00Z"}