{"vcmId": "827a57b0-7511-422e-b3e3-4f715f34ca7c", "url": "http://www.foxnews.com/transcript/2015/05/14/marco-rubio-outlines-foreign-policy-doctrine.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" May 13, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight, this afternoon Senator Marco Rubio, who is running for president, gave a foreign policy speech in front of the Council on Foreign Relations here in New York City. The Senator joins us now.</p>                \n                \r\n\n            \n                <p>So keeping it simple, what's the most important thing America has to do overseas right this moment?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Well, there's three things that should underline our foreign policy.</p>                \n                \r\n\n            \n                <p>The first is the acknowledgment that the world is a better place and America is the strongest country in the world and that's why we need to increase our military spending. Get rid of these horrible reductions that we have seen and also our intelligence capability, they have to be robust. It is important that we re-authorize the Patriot Act.</p>                \n                \r\n\n            \n                <p>Second is America's foreign policy needs to keep in mind that in the 21st century global commerce matters more than ever. We cannot allow any nation on earth to control shipping lanes, airspace, the cyberspace, outer space for that matter.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>And the third is our foreign policy should always be built on our values as a nation. We support freedom. We support nations and people who aspire to democracy. We support human rights and the respect to human rights.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But we can't nation build anymore.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> No.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It didn't work in Iraq.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> You don't have to.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I agree. There is another way to do it but you can't get down and try to convince the Afghans to be democratic.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> No. But I'll give you an example, Cuba, right? We are doing all these relations with Cuba under the President and none of this was there ever a discussion about democracy which is not just in our national interest but it's a strong value of the United States.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>As you know, the thinking is if we get in there, we, being the United States, with our value system and people go there and spend money the Cuban people say hey, we want to be like them. So it's one of those.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> That didn't work in Vietnam or China. They're still a communist people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, but Cuba is only 90 miles away. I think it might work. I think that the influx of dollars and Americans into Cuba might give those people saying you know we really don't like that anymore.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Yes. But all of that will go into a government holding company that owns the entire economy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's right. And who is not giving any kind of freedoms at all to the --</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>-- you know, no human rights, they didn't do anything.</p>                \n                \r\n\n            \n                <p>All right. Let's get to Hillary Clinton. If you win the nomination, and your campaign is off to an impressive start and I'm not saying that. The polls show that. Where is she weakest? Where is Hillary Clinton weakest?</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>To answer that question, let's understand where we stand. For much of the 20th century, America was the greatest country in the world. Some very basic promises -- we were the most powerful nation on earth. We had an economy that told you if you work hard in this country you may not be rich but you will own a home. You'll be able to raise your family, take vacations.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Your parents did that.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>They lived that out. Now it doesn't exist anymore for millions of people and everyone is wondering why. Why don't the old way of doing things work anymore? The answer is because the world -- our economy and the world has rapidly transformed. We need transformational leadership, leadership that understands this new era --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But those are all slogans.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> No, but it's the truth.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Mrs. Clinton is going to say to you if you are debating her look I'm going to have government programs that's going to lift people up and stop this income inequality. I'm going to do this, all right? So is that a weakness for her to say that?</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>But they are not -- first of all they're not slogans. That's what's happening in our country and the proposals she is going to come forward with are same tired left of center proposals that are failing us now -- the exact same ones.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But Obama says -- the President says, hey, I got us out of a depression. My policies are successful and it goes around and around in a merry-go-round.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>But they're not because her policies, number one, in a global economy would make us less globally competitive. You can't raise taxes, increase regulations, grow your national debt and expect to be able to compete with dozens of developed economies.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. But that's a \"Wall Street Journal\" argument. You've got to get down -- I'm giving him advice here. You have got to be a gut fighter here.</p>                \n                \r\n\n            \n                <p>Look Romney and McCain tried to do what you are saying. They have tried to appeal to the American sense of traditional economics and traditional defense.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And they lost.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>But the problem is that today you have millions of people that are finding that the jobs they have had for 20 years don't allow them to be in the middle class anymore. Why? Because this new economy is either wiping out those jobs or they don't pay enough. So you have to have an economy not just to create the new jobs that pay more but you have to have a higher education system that gives people 21st century skills. And she wants to pour money into tired programs that don't give you those skills.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But those tired programs are now supporting 50 percent of the American households or getting some kinds means-testing which is beyond Social Security and Medicare money. They don't want to give the money up. That's her constituency.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>I think the vast majority of Americans would prefer to have a better paying job but they don't have the skills for that higher paying job or America isn't creating enough of them because we are not globally competitive.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, we have to unleash the free marketplace.</p>                \n                \r\n\n            \n                <p>But Hillary Clinton herself, all right? You are going to attack her as being dishonest woman? Are you going to do that?</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Well, I will tell you what we can't afford.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, no. Are you going to say that Hillary Clinton is dishonest?</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Look, we don't need any drama in the White House at this incredible hinge moment in our history. You're going to put back in the White House two people who have been everywhere they go bring drama with them. This country can not afford another eight years of a soap opera.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Are you going to point out what the dramas are?</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Absolutely. We see what they are already.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So you're going to go and say listen. If I were running for president I would say, listen, I want the FBI to investigate the Clinton Foundation.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Well, her time as secretary of state is now filled with drama because of the e-mail scandal. The foundation is filled with drama because of ties between the foundation and business deals.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you want an FBI investigation into that?</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>If it's appropriate. First of all --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you think it's appropriate?</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Well, we don't know enough about it yet.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How are we ever going to know if the FBI doesn't investigate?</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Well, ultimately I think we are going to find out more about these --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Well, you know, the House Oversight Committee is looking into the e-mail problems and from that I think we will know a lot more information.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But House looked at the IRS scandal and couldn't get to first base.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>And that's because the Justice Department doesn't want to move forward on it under this president. But the truth is that if this evidence were to come forward it would compel them to act. But at the end of the day Americans see it for what its. They understand that we are in a time of extraordinary uncertainty about our future. What kind of country are we going to be? We cannot afford to have drama in the White House.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> All right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It's fun. Is it fun so far for you?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> It has been. It's a lot of work.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's a lot of work. If you start to become the frontrunner, you are going to get attacked. You are ready for that.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Yes. That happens all the time.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You're going to be a sexist. You're going to be racist. You're going to be whatever -ist they can put on you.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Well.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But you are always welcome here and we appreciate you coming on in.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Marco Rubio outlines foreign policy doctrine", "description": "Presidential hopeful on global politics and assessing Hillary Clinton's weaknesses", "date": "2015-05-14T11:57:54Z"}