{"vcmId": "838f7128-121c-4bee-b4a6-e819d00e9cca", "url": "http://www.foxnews.com/transcript/2015/02/20/media-coverage-holy-war.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 19, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Thanks for staying with us. I'm Bill O'Reilly in the \"Weekdays of Bernie\" segment tonight. Let's get right to the purveyor BernardGoldberg.com joins us from Miami. So, you've been watching the coverage of the jihad. We've been really pounding it here. The ratings are big. We know the audiences are interested. But the nightly newscasts, they're really not doing the same thing. Let me give you the structural quick. ABC World News tonight so far this week, six minutes of jihadist coverage, did not mention the word Muslim or Islam at all. NBC News, they did a story Monday and Wednesday, seven minutes, 30 seconds. Mentioned the word \"Christian\" five times. Mentioned the word \"Muslim\" once. CBS covering the story Monday, Wednesday, six minutes, 30 seconds. Mentioned the word Christian three times, mentioned the word Muslim or Islamic six times along with jihadist once. So CBS is obviously covering the story at least verbally in the correct manner. In your opinion, is there an appetite for this story on the nightly evening newscast?</p>                \n                \r\n\n            \n                <p><b>BERNIE GOLDBERG, FOX NEWS CONTRIBUTOR:</b> Not like there is on this program, that's for sure. While you've been leading with this and as you say, the ratings have rewarded you for leading with this, they've pretty much been leading with the weather. But, Bill, the audiences are fundamentally different. The people who are watching us now are news junkies. And I mean that obviously as a compliment to the viewers. The people who watched the evening news, you know, they're cooking spaghetti dinner and then, you know, meatloaf and the news is sort of on in the background, so it's not the same audience. There is a sliver of sunshine, though, and it's this.</p>                \n                \r\n\n            \n                <p>The networks and other big news organizations have had a bad habit of covering the news pretty much the way Barack Obama wants the news covered. So if it's the IRS scandal which he calls the phony scandal, they treat it as the phony scandal. He doesn't want much discussion on the Sergeant Bergdahl trade-off, there isn't much discussion at the networks on the Bergdahl trade-off. But on this, when Josh Earnest as you reported earlier on the show comes out and says that 21 Egyptian citizens were beheaded, the network said, no, no, they were Christians. That may not be much, Bill, but it's something. They didn't go along with the network. And the President doesn't use the term Muslim or Islamic terrorists but this year from January 1st, \"The New York Times\" mentioned the Islamic or Muslim terrorists 18 times and the \"Washington Post,\" 41 times. Again, it's a sliver of sunshine. Usually they will cover for the President and report news the way he likes it covered. But they're not jumping through these hoops for him. It just -- it doesn't make sense what he's doing with his going out of his way not to use the term. And they've noticed that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. When I was at the network news when there was a conflict, a war, any kind of really violent crime spree, whatever, they're all over it. I mean even minor wars like the Falklands war, you know, I was down there in Argentina, in Uruguay, the Salvadoran war, I was there, when Grenada hit, there was big coverage of Grenada. All of that. And Iraq invasion, huge, huge coverage. Here there seems to be muted coverage of terror unit. No coverage in Nigeria. Can't get anybody in there, but it seems to me the appetite of this story, the jihad, all right, the Islamic fundamentalist trying to take over as much territory as they can take over isn't what it used to be as far as conflict is concerned, or am I wrong?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> No, I think you're on to something, but that's because television news isn't what it used to be. I mean, you talked about going to El Salvador and Grenada, I mean, that's when news organizations covered the news, you know. Now, you know, weather becomes --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. The weather is the big thing. I didn't go to Grenada. I want to make that clear to everybody. I don't want to get in trouble. But I was in Salvador and Argentina.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> No, I understand. I'm just saying, look. Nostalgia ain't what it used to be.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. So, you say it's just because it's downsized.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> It really isn't what it's used to be.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But here's the bottom line. Americans are interested in this story. They're interested in their president not confronting the evil and the network news doesn't seem to be as interested as the folks, and I'm just wondering whether there's something more there.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>I think you're right. And one reason, they don't cover it the way they covered Iraq or the others is because they can't get in. You've got to be a lunatic to go and try and cover the story.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We can't get in either, and we're finding every day, new seams, new themes, and we're doing pretty well with it. Bernie as always. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Media coverage of the holy war", "description": "Bernie Goldberg on how the network news is reporting the Jihad", "date": "2015-02-20T13:23:20Z"}