{"vcmId": "853fab2c-769a-4d8e-b7ca-96fe4995c7e0", "url": "http://www.foxnews.com/transcript/2015/03/12/rudy-giuliani-on-countering-isis.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 11, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story\" segment tonight. Perhaps the most outspoken politician in the country these days, the former mayor of New York City Rudy Giuliani and here he is talk. Let's talk a little ISIS and then a little Hillary Clinton.</p>                \n                \r\n\n            \n                <p><b>RUDY GIULIANI (R), FORMER NEW YORK CITY MAYOR: </b>Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Look, maybe I'm wrong here but you are war on terror guy and because we got hit here in New York City and you were deeply involved. I don't see anywise coordinated effort by the Phantom 60 national coalition or the President of the United States to confront this ISIS crew any meaningful way, am I wrong?</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>Well, I mean, today's testimony kind of confirms that. I mean, the secretary of defense was against the sunset clause before he was for it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What's the sunset clause again?</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>The sunset clause in three years we are out. That's crazy. The President is asking for authority and --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But he doesn't even need to ask this. He is bombing them now. If he wants to spend Special Forces in, and he can. And this is all a rues. It's a delay and he goes on for months and months.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> And unfortunately the strategy has become that Iran is going to defeat ISIS.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, and they'll take over Iraq and Mosul in Syria.</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>And then we have a northern against a southern Middle East.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. It's a Sunni Shia play. And we don't want to get bogged down but we want to have a little bit of control. And the 60 nation coalition. That is such a fierce.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Where are they?</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> I was in Dubai two weeks ago and the people in the emirates, people in Saudi Arabia, people in Jordan, I met with all of them. Enormously frustrated with us and say we are playing a backup role.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. They want us to lead and we are not.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> Yes. We won't even send in forces to extract pilots who get shot down.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. Now you know Hillary Clinton pretty well. She was senator in New York. Mayor of New York City. You are pretty friendly with her.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> I have high personal regard for her in many respects. I disagree with her politically but --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But you guys are kind of friends, right? I mean --</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> I wouldn't say we were friends but I would say --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Which is no -- no acrimony?</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> And I feel like I'm a friend of President Clinton's. I liked President Clinton a lot.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. All right. So, you watched her yesterday, Hillary Clinton.</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>Yes. She comes across as evasive, would you say yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. And I don't understand the basis of her testimony. She destroyed half of the emails.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> Half of them, 30,000.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> She is chatty.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> But the whole idea is when you work for the government, that this belongs to the government.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. But that's not the way she sees it.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> Well, I think she is going to have a real problem with it. I think the Freedom of -- FOI cases against her are going to be numerous. I think there are possible civil violations that have to be looked at. I think she is going to be put under investigation. And I think the best answer here is, you know, trust but verify.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. But --</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> We have to see those emails.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know America is a changing country. And you know that there are a lot of voters, they call them low information voters. They don't care about this. I mean, they vote ideology. Democrat.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> Democrat.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So she is banking on putting together a coalition of the willing women, minorities, democrats, liberals that will just give her enough over, that's --</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>-- doesn't it play into a feeling though? Doesn't it play into a feeling?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> For those who are paying attention.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> I'm not talking about the people who have made up their minds, but those people who haven't made up their minds.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Sure it hurts her.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> Also plays into another theme that I think is very strong. What did she accomplish as secretary of state?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Not much. It's a mess.</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>Everything in the world --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is a mess.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> -- is worse now than when she took over.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right. But then again, you know, are people going to really care? I mean, she is the first woman president. She is this, she is that. Now, if you were Hillary Clinton's advisor. Say she calls you tonight and says hey, Maher, I saw on the Factor. You really look dapper, I love that O'Reilly. What should I do about these private emails? Should I left the FBI come in and take a look with a guarantee? What would you tell her?</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> I would say have an independent FBI review of it. If they are truly personal --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, they are not going to burn her, right?</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> If they are truly personal, they're about, then final, they stay personal. But if they are not, then they should be put out. She cannot be the final arbiter of it trust but verify.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But you would say, bring in the FBI, let them take a look - -</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> I think this haunts her unless she does. And of course, Bill Clinton said they never exchanged emails. Maybe once or twice.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. He, only according to the \"Wall Street Journal.\"</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> And according to her she was emailing him all the time.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All the time. Well, maybe he just didn't want to answer.</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>Well, we have two contradictory answers. I'm a lawyer and in court that would be a heck of an argument and summation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Maybe, bang. He just clicked in and go -- so, I don't know. But you would advise her to little sunshine in there, you know?</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> I think this doesn't go away until people -- there were 60,000, 30,000 are being withheld. She was the secretary of state. Also, what is she doing taking the server home? Isn't it going to be guarded better? Isn't it going to be more secured? Isn't going to be more cyber- security when it's kept under government control? She is playing around with the security of our country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>GIULIANI: </b>That doesn't help the record of the secretary of state.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't think we will ever get to the bottom of it. And I know she must have a sore thumb, you know, that delete button.</p>                \n                \r\n\n            \n                <p><b>GIULIANI:</b> That's a lot to delete.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Thirty thousand, that's a lot.</p>                \n                \r\n\n            \n                <p>All right, Mayor, thanks for coming in. Good to see you as always.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Rudy Giuliani on countering ISIS", "description": "Former New York City mayor on confronting Islamic terror and the Hillary Clinton email scandal", "date": "2015-03-12T12:23:39Z"}