{"vcmId": "877bd168-a25c-4974-bb37-c83acd5ffd93", "url": "http://www.foxnews.com/transcript/2015/01/22/bill-oreilly-world-according-to-president-obama.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Some people I know were upset by the State of the Union address last night believing that Barack Obama is not doing the right thing for the country. But to me the President is consistent -- his liberal view of the world was on full display. So my question is what did you expect?</p>                \n                \r\n\n            \n                <p>Simply put, President Obama believes the federal government should give stuff to people who don't have very much. And take stuff from the affluent and business. That is a core liberal tenet in this country and it's never going to change. Also it's clear the President doesn't want to confront Islamic terrorism in a major way. He devoted only two minutes to it last night.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> We will continue to hunt down terrorists and dismantle their networks. And we reserve the right to act unilaterally as we have done relentlessly since I took office to take out terrorists who pose a direct threat to us and our allies.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The President once again talking about terrorists, not Islamic terrorists. He refuses to define the issue that way. Also ISIS is firmly entrenched now in Syria and Iraq and expanding in other places. They are murdering people daily. And if you think we're winning that situation, you're nuts.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>Instead of getting dragged into another ground war in the Middle East, we are leading a broad coalition, including Arab nations, to degrade and ultimately destroy this terrorist group.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Arab nations? Give me a break, Mr. President. Just five of them are opposing is in meaningful way. Once again the Obama administration has no strategy to defeat the jihad. America simply reacts to whatever the terrorists do and laments. Mark my words -- this is a dangerous strategy and it's only a matter of time until we get hit.</p>                \n                \r\n\n            \n                <p>Now on the home front, the reason Barack Obama remains fairly popular in the country is that many Americans feel they're not being treated fairly. Certainly, the minority communities believe that. And some white Americans are frustrated with their standing, as well. Money is tight. Good jobs are hard to get and we Americans want a lot of material things.</p>                \n                \r\n\n            \n                <p>Problem is we don't have much money. Wages have fallen significantly during President Obama's tenure. He will tell you that's because he inherited a terrible recession but I'll tell you the wage situation is due to the expansion of high-tech in the marketplace when machines replace people and the high cost of doing business in the U.S.A.</p>                \n                \r\n\n            \n                <p>Obamacare has constricted hiring -- we all know that. Federal regulations make it far more difficult for businesses to start up and high taxation drains profit. Remember, the U.S.A. now has the highest corporate tax in the world. And president Obama wants more. The result, fewer good jobs and plenty of applicants to fill them -- that means salaries go down.</p>                \n                \r\n\n            \n                <p>Yes, the general economy is getting a bit better thanks to the falling oil prices but that doesn't mean more money for workers. Only business expansion where employers need labor, need people will drive salaries higher.</p>                \n                \r\n\n            \n                <p>President Obama doesn't seem to understand macroeconomics. And that's why when he says he's looking out for the folks it kind of rings hollow. The President's entitlement jihad if you will cannot replace upward mobility driven by private sector good jobs.</p>                \n                \r\n\n            \n                <p>Bottom line -- it's easy to give a speech saying things are great. All presidents do that. The truth is we are not defeating the Islamic terrorists and America is not creating enough good-paying jobs to drive wages higher.</p>                \n                \r\n\n            \n                <p>That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The world according to President Obama", "description": "Talking Points 1/21", "date": "2015-01-22T13:16:49Z"}