{"vcmId": "87f00dfa-15ec-4c94-a063-311a1b178aba", "url": "http://www.foxnews.com/transcript/2016/06/08/can-hillary-clinton-persuade-her-doubters.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 7, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Personal Story\" segment tonight with opinions about Hillary Clinton set in stone in many cases. Is it possible for her to persuade doubters to vote her into power?</p>                \n                \r\n\n            \n                <p>Joining us from San Diego, Kirsten Powers. Little play on words there. Okay. So, Hillary Clinton first woman ever to secure the nomination of a major party. She is going to be speaking a little bit later on. But, negatives very, very high. Everybody knows her. Is it possible in your opinion for her to persuade people who don't really like her to come on over and vote for her? If so, how?</p>                \n                \r\n\n            \n                <p><b>KIRSTEN POWERS, FOX NEWS ANALYST</b>: Well, yes. She can persuade people to vote for her. I don't know that she can necessarily persuade them to like her. And I think the good news for her is that she just has to be more likeable than Donald Trump who also has extremely high negatives. And so if she was running against a different person, it might be different. But I think that they pretty much cancel each other out in terms of their negatives.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Then what about the stay home factor though?</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Um-huh.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I'm sure you -- I was -- surprised on how quickly the polls tightened up after Trump won Indiana.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You know, it's a tie right now. I mean, people are looking at both of them. And Hillary Clinton is going to need to persuade people to vote for her. And I'm not sure how she does it. Do you have any suggestions for her tonight?</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Well, I mean, one of the things is that you have to remember that the number of people who were actually persuadable voters has just been shrinking. It's a fairly small number of people. Even among Independents. They are mostly Independents leaning Republican. Or Independents leaning Democrat. So, what ends up happening what you saw with Trump was the people sort of rally behind the person who represents the party that they identify with.</p>                \n                \r\n\n            \n                <p>And I think you are going to see the same thing with Hillary. I think initially you are going to have Sanders' voters who are upset but probably ultimately will come around to her. Her problem is, of course, that a lot of these voters are young and those people don't tend to turnout unless they are incited.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. I'm talking the stay home factor here, it is going to be very high. And remember, Mitt Romney lost because of the stay-home factor. Because, you know, three to five million Republicans and Independent leaning people didn't show up. They didn't like him. And so Barack Obama benefited greatly from that.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: But don't you think that's possibly going to happen with Trump as well?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> I mean, look at what's going on with him right now in the Republican Party.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. I think there's going to be a lower turnout. Although there are a whole bunch of new voters engaged now in this race because of the populism of it. But you haven't given me any suggestions and I thought you might have one or two. For Secretary Clinton to say, okay, look, I have got the nomination now. So now my strategy is to try to persuade people that I'm not really all that bad who don't like me. I mean, her supporters love her.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Because it's not -- because she is not -- she has been in public life for 30 years, 40 years?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Nothing she can could. Magic tricks?</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Well, no, I don't think there is anything she can do to make herself more likeable. But I think she can convince people that she is the best person for the job. That she is the most experienced and that she is better than Trump, which is what she has to do in order to win. She doesn't have to convince people to like her.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I still think that in any election, the likability factor elected Barack Obama. I'm positive of that. I mean, eight years ago today, Hillary Clinton conceded to Barack Obama. And I covered that race and I really -- and Obama won because people liked him more not because he was more experienced or not because he has a big difference in ideology. They liked him because he looked like a better guy.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: You are oversimplifying as you often do, Bill.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>POWERS</b>: I think that it was more complicated than that though, a lot of reasons people voted for Barack Obama and it wasn't just because they liked him. But like I said, it doesn't matter because Donald Trump isn't well liked. So, she is running against somebody who has high negatives just like her. And so it cancels -- it really cancels each other out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. One of the two are going to have to get those people -- a few of them I concede very few but there are still few who could go either way and they have to try to get them. Kirsten, thank you as always.</p>                \n                \r\n\n            \n                <p><b>POWERS</b>: Okay.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Can Hillary Clinton persuade her doubters?", "description": "Kirsten Powers joins 'The O'Reilly Factor' to analyze the latest in the 2016 presidential race", "date": "2016-06-08T12:19:36Z"}