{"vcmId": "88dab96d-dd76-45a4-8487-2f5043d89f66", "url": "http://www.foxnews.com/transcript/2015/03/18/bill-oreilly-president-obama-defines-isis.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>A few days ago, President Obama granted an interview to Vice News, an organization that reports stories on HBO. Lately Mr. Obama likes to speak to outlets that attract younger viewers.</p>                \n                \r\n\n            \n                <p>Talking Points believes the number one problem in the world is now the Islamic jihad. That's because Iran is tied into the situation and is close to developing a nuclear weapon. But even without Iran, when you have millions of fanatical Muslims all over the place, believing they can murder infidels at will, you have a historical problem. That has become shockingly clear with the emergence of ISIS or ISIL as the President calls it.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>ISIL is a direct outgrowth of al Qaeda in Iraq.</p>                \n                \r\n\n            \n                <p>That grew out of our invasion, which is an example of unintended consequences, which is why we should generally aim before we shoot.</p>                \n                \r\n\n            \n                <p>We have got a 60-country coalition. We will slowly push back ISIL out of Iraq. I'm confident that will happen.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Slowly\" is the key word there. As thousands of people are being slaughtered, the U.S.A. and other western powers are acting slowly. So let's break it down. The U.S. defeated the Iraqi insurgency including al Qaeda in Mesopotamia. General Petraeus led that victorious campaign known as the surge. And when it ended, Iraq was a fairly stable situation.</p>                \n                \r\n\n            \n                <p>Subsequently, the Iraqi government totally blew it persecuting the Sunni minority, leading to chaos and corruption. In the face of that, President Obama went against nearly every general and national security person working for him and withdrew all U.S. combat troops from Iraq. Huge mistake -- perhaps the big error he has made.</p>                \n                \r\n\n            \n                <p>Faced with no controlling authority, Muslim jihadists began to run wild and infiltrated into Iraq from Syria where they were fighting against the Assad regime. The President ignored the situation at first. And when it finally got to critical mass he called the ISIS savages the junior varsity. Again, an enormous mistake.</p>                \n                \r\n\n            \n                <p>So now we have another war in Iraq -- Iran fighting ISIS, too bad crews against each other. The result: extreme violence. Thousands of human beings are being killed.</p>                \n                \r\n\n            \n                <p>Analyzing that, the President comes to the conclusion that it was President Bush's fault. Mr. Obama apparently believing that because Mr. Bush violently removed Saddam Hussein, terrorism flourishes to this day. While the Iraq war did indeed cause far too much blood and treasure for America, it was a victory until President Obama mucked it up.</p>                \n                \r\n\n            \n                <p>Again, if 10,000 U.S. forces had remained in Iraq, ISIS could never have achieved a foothold there and Iran would not be running the show today. But you will never convince Barack Obama of that. He will never see the situation clearly. And that is why the Islamic jihad continues to march throughout the Middle East.</p>                \n                \r\n\n            \n                <p>Finally, about the 60-nation coalition the President refers to so often? It's a phantom. It doesn't exist. These countries do little or nothing and President Obama hides behind this phony facade. If there were indeed 60 nations committed to wiping out ISIS, these savages would already be dead. Does everybody get that?</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: President Obama defines ISIS", "description": "Talking Points 3/17", "date": "2015-03-18T12:10:52Z"}