{"vcmId": "88ffcb3c-e112-41ec-bd56-a1042fb0f120", "url": "http://www.foxnews.com/transcript/2017/03/22/bill-oreilly-most-important-political-story-year.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Many Americans voted for Donald Trump because they feared that a Democrat winning the White House would appoint another liberal judge to the Supreme Court.</p>                \n                \r\n\n            \n                <p>In recent times, the court has often ruled on politics - not the law.</p>                \n                \r\n\n            \n                <p>Many Americans fear that, including this one.</p>                \n                \r\n\n            \n                <p>Mr. Trump nominated 49-year-old Neil Gorsuch from Colorado, who has a very solid judicial record.</p>                \n                \r\n\n            \n                <p>He serves on the 10th Circuit U.S Court of Appeals in Denver.</p>                \n                \r\n\n            \n                <p>Today, there were hearings in the Senate because that body must approve Judge Gorsuch to the nation's highest court. Predictably, some liberal politicians do not like the judge simply because he is not a liberal.</p>                \n                \r\n\n            \n                <p>So even though his record is stellar and his philosophy independent, some Democratic senators will not vote for him.</p>                \n                \r\n\n            \n                <p><b>SEN. DIANNE FEINSTEIN (D-CA):</b> &#8220;Judge Gorsuch has also stated that he believes judges should look to the original public meaning of the Constitution when they decide what a provision of the Constitution means. This is personal, but I find this originalist judicial philosophy to be really troubling ((EDIT)) I firmly believe the American Constitution is a living document, intended to evolve as our country evolves.&#8221;</p>                \n                \r\n\n            \n                <p>Senator Feinstein should know better.</p>                \n                \r\n\n            \n                <p>If judges are free to rule on judicial evolution, that means they become politicians.</p>                \n                \r\n\n            \n                <p>All judges in America should have just one rule - what was the intent of the original Constitution?</p>                \n                \r\n\n            \n                <p>Again, if they reject that, then they make decisions based upon their political beliefs.</p>                \n                \r\n\n            \n                <p>Here's the best example - there's no question the Constitution gives the president the power to stop some foreign nationals from coming to the USA.</p>                \n                \r\n\n            \n                <p>But activist judges have blocked President Trump's travel order saying, in essence, it is anti-Muslim.</p>                \n                \r\n\n            \n                <p>If that were the case, Muslims from Egypt, Saudi Arabia, Pakistan and other countries would be included in the president's order. They are not.</p>                \n                \r\n\n            \n                <p>So everybody knows politics, not the law, is involved here.</p>                \n                \r\n\n            \n                <p>And eventually, the president will win in federal court.</p>                \n                \r\n\n            \n                <p>But the activist judges don't care. They have temporarily blocked the order and are liberal heroes.</p>                \n                \r\n\n            \n                <p>As for Judge Gorsuch, it looks like he's a traditional man who believes the intent of the Constitution should reign.</p>                \n                \r\n\n            \n                <p>Again, that seems to be unacceptable to Senator Feinstein and others. They want a political judge. They want a liberal judge.</p>                \n                \r\n\n            \n                <p>Finally, the best example of constitutional debate is the Second Amendment, the right to bear arms.</p>                \n                \r\n\n            \n                <p>It is clear that the Founding Fathers wanted Americans to have the ability to protect themselves.</p>                \n                \r\n\n            \n                <p>Back then, militias were the mechanism - private citizens with guns organizing against threats.</p>                \n                \r\n\n            \n                <p>Today, the threats are more personal - terrorists and criminals, not frontier marauders.</p>                \n                \r\n\n            \n                <p>Americans have a constitutional right to defend themselves against those who would harm them.</p>                \n                \r\n\n            \n                <p>That's why firearms cannot be banned.</p>                \n                \r\n\n            \n                <p>But they can be limited. You can't have a bazooka or a hand grenade.</p>                \n                \r\n\n            \n                <p>That's reasonable. Public safety is involved and individual states have the right to mandate gun laws based upon the wishes of their people.</p>                \n                \r\n\n            \n                <p>But the left rejects that and in some cases wants to ban guns outright.</p>                \n                \r\n\n            \n                <p>At this point that is unconstitutional. But that could change if the Supreme Court becomes solely a political body dominated by the left.</p>                \n                \r\n\n            \n                <p>Summing up, intent, not evolution, should be the litmus test of constitutional law.</p>                \n                \r\n\n            \n                <p>And that's why a traditional judge like Neil Gorsuch is a vital situation.</p>                \n                \r\n\n            \n                <p>He will likely sit for decades, presiding over a country in the middle of a social civil war.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The most important political story of the year", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/21", "date": "2017-03-22T12:15:42Z"}