{"vcmId": "890b7d55-327a-4430-87d7-b8fba85d7284", "url": "http://www.foxnews.com/transcript/2017/03/14/bill-oreilly-how-obamacare-brawl-affects.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It is a classic left-right brawl.</p>                \n                \r\n\n            \n                <p>President Obama and the Democrats wanted to provide healthcare to Americans who could not or would not pay for it.</p>                \n                \r\n\n            \n                <p>The Republican Party and President Trump do not want to do that.</p>                \n                \r\n\n            \n                <p>So the battle lines are drawn.</p>                \n                \r\n\n            \n                <p>Here are the facts:</p>                \n                \r\n\n            \n                <p>Eighty-one-percent of all Americans who signed up for the Obamacare health plan will receive government assistance this year.</p>                \n                \r\n\n            \n                <p>Some will have their entire healthcare premium paid for by the government.</p>                \n                \r\n\n            \n                <p>That cost American taxpayers more than $100 billion last year alone.</p>                \n                \r\n\n            \n                <p>That's the essence of Obamacare, that all Americans are forced to buy health insurance so that the have-nots can be subsidized and covered.</p>                \n                \r\n\n            \n                <p>It is estimated that since Obamacare passed, 13 million people have health insurance who did not have it before.</p>                \n                \r\n\n            \n                <p>Enter President Trump, who says that Obamacare costs way too much and is a disaster in every way.</p>                \n                \r\n\n            \n                <p>So the Republicans will put forth a new national healthcare plan.</p>                \n                \r\n\n            \n                <p>This one will not order you to buy health insurance.</p>                \n                \r\n\n            \n                <p>If you don't buy it, your option will be to go to the emergency room and get treated.</p>                \n                \r\n\n            \n                <p>If you can't pay, the taxpayer picks it up just like the old days.</p>                \n                \r\n\n            \n                <p>If you cannot afford health insurance premiums, the Republicans want the states to handle it through Medicaid.</p>                \n                \r\n\n            \n                <p>President Trump and his acolytes essentially want out of the healthcare business and will send federal money to the individual states so they can decide who gets what.</p>                \n                \r\n\n            \n                <p>But the Medicaid tax dollars will be capped.</p>                \n                \r\n\n            \n                <p>Liberals hate that, they want the feds to dictate health insurance costs and who gets it free or subsidized.</p>                \n                \r\n\n            \n                <p>So that's essentially where we are.</p>                \n                \r\n\n            \n                <p>The key question for you, the American citizen, is, will your healthcare premiums go up or down once Obamacare is history?</p>                \n                \r\n\n            \n                <p>Today the Congressional Budget Office said that under the Republican plan, the feds will spend about $337 billion dollars less subsidizing healthcare over the next ten years.</p>                \n                \r\n\n            \n                <p>But about 21 million more Americans will not have health insurance by the year 2020.</p>                \n                \r\n\n            \n                <p>Again, that would mostly be their choice. &#160;</p>                \n                \r\n\n            \n                <p>The CBO does not know what might happen if the insurance companies are allowed to compete nationwide, which they cannot do now.</p>                \n                \r\n\n            \n                <p>Will that drive premiums down?</p>                \n                \r\n\n            \n                <p>That's the hope on the Trump side.</p>                \n                \r\n\n            \n                <p>But not on the left:</p>                \n                \r\n\n            \n                <p><b>SEN. BERNIE SANDERS (I-VT):</b> \"This really has nothing to do with healthcare. What this has everything to do with is a massive shift of wealth from working people and middle-income people to the very richest people in this country. It is a $275 billion tax break for the top two percent.\"</p>                \n                \r\n\n            \n                <p>Senator Sanders is angry because the Republican healthcare plan knocks out an Obamacare payroll tax and a tax on investment income.</p>                \n                \r\n\n            \n                <p>Sanders says that gives money to the rich people and that's always the argument from the left -- any tax breaks, especially on investment income sales of stocks, interest, that kind of thing, helps the wealthy.</p>                \n                \r\n\n            \n                <p>But the Trump administration has promised to lower taxes and their healthcare plan does that.</p>                \n                \r\n\n            \n                <p>It is simply impossible for you, the American consumer, to know how this will all turn out.</p>                \n                \r\n\n            \n                <p>As they say on the west coast, it's complicated.</p>                \n                \r\n\n            \n                <p>Summing up, liberals want a big entitlement culture. Some uber-conservatives want few, if any entitlements. More moderate Republicans want the states to handle healthcare entitlements with limits.</p>                \n                \r\n\n            \n                <p>There you have it.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: How the Obamacare Brawl Affects You", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/13", "date": "2017-03-14T12:01:41Z"}