{"vcmId": "897a8eb3-678f-48b0-8069-2689e9f9befb", "url": "http://www.foxnews.com/transcript/2017/04/12/bill-oreilly-crimes-against-humanity.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As we reported last night, it falls to America, to us to stop war crimes and atrocities all over the world. Other countries will not do that including great powers like China and Russia. So is left to we the people and our elected representatives to decide who were going to save.</p>                \n                \r\n\n            \n                <p> It's a gut wrenching decision as millions of people have been murdered all over the world by sick tyrants. President Trump's missile attack on Syria has sent a new message to the world that the USA is going to hold war criminals accountable at least to some extent. The previous president, Barack Obama would not do that. Instead, use negotiations which often failed.<br> <b><br> (BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> OBAMA</b>: We've eliminated Syria's declared chemical weapons program. All of these steps have helped to keep us safe and help keep our troops safe. Those of the results of diplomacy. And sustain diplomatic efforts no matter how frustrating or difficult they sometimes appear are going to be required to resolve the conflicts whirling in the Middle East from Yemen to Syria to Israel and Palestine.<br> <b><br> (END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> O'REILLY:</b> And now we know the negotiations were phony. Not on the United States as part, but Syria did not eliminate its chemical weapons program. Casting grave doubt on whether Iran will obey the nuke deal President Obama made. It is beyond a reasonable doubt that the Syrian Dictator Assad is a war criminal. He is. But there are many other countries around the world in the same awful category.</p>                \n                \r\n\n            \n                <p> According to Human Rights Watch, the North Korean Dictator Kim Jong-un allows the following. A systematic widespread and gross human rights violations including murder, enslavement, torture, imprisonment, rape, forced abortion on and on and on. Roughly 18 million people in North Korea do not get enough food according to a U.N. report released last month. But that's not enough to attack the country.</p>                \n                \r\n\n            \n                <p> There is some sense of responsibility on the part of the North Korean people themselves. Sometimes, you have to fight for your life and rights. The United States cannot declare war on North Korea despite the atrocities. But if the loony dictator continues to violate international weapons laws, targeted military action can be taken with justification. And then there's ISIS, which routinely rapes and kidnaps women, sells them into slavery, executes homosexuals, slaughters Christians and basically kills and maims at will.</p>                \n                \r\n\n            \n                <p> ISIS currently under attack by a coalition of nations headed by you guessed it, us. And there's no excuse for not wiping ISIS off the face of the earth. A lesser group Boko Haram based in Nigeria, Africa kills children. Reuters is now reporting that group may have murdered 15,000 people over the years. It's a Muslim extremist group. It uses female and child suicide bombers, at least 44 children were killed in suicide attacks in 2015 alone. The world has not yet united against Boko Haram. But it should.</p>                \n                \r\n\n            \n                <p> So, you can see that President Trump, the leader of the free world has his hands full. For eight years, President Obama expressed indignation over crimes against humanity and he did attacked evildoers with drones. But the problem is getting worse worldwide. And now it's up to President Trump to see if he can control it. And that's \"The Memo\".<br> </p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Crimes against humanity", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 4/11", "date": "2017-04-12T12:41:00Z"}