{"vcmId": "89985224-2016-476e-8f5b-85c6f0953623", "url": "http://www.foxnews.com/transcript/2017/02/24/bill-oreilly-most-important-problem-in-usa.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>According to a brand-new CBS news poll, its immigration. More Americans want that situation dealt with than any other current problem. Right now, 39 percent of Americans approve of the way President Trump is handling the immigration issue, 55 percent disapprove.</p>                \n                \r\n\n            \n                <p>Now, that number shouldn't come as a surprise because the media in general has hammered the President for his aggressive order to remove criminal aliens. As you saw last night here in The Factor, the left really doesn't want to consider the word criminal. Instead always falling back on peaceful migrants.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> It's immoral to divide mothers from their children the way that they're beginning to do now. They've expanded the definition of a criminal offense to include crossing the border multiple times, to come back to your family. To include using fake documents so when you're stopped that you are not deported to include driving without a driver's license when you couldn't get a driver's license.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, let's think about what the former mayor of Los Angeles just said. He's okay with illegal aliens, defying deportation multiple times to quote, come back to your family. So what does that mean? Does the mayor want open borders? Yes, he does. How about his rationalization of using fake documents? He's fine with that. Because everyone should be allowed to come in here. With few restraints.</p>                \n                \r\n\n            \n                <p>Same thing with licenses, why should states issue the privilege to drive to people were not supposed to be in the country in the first place, does that make any sense to you? So, when you examine the illegal immigration situation without emotional politics, it all comes back to the law. That being said, Talking Points believes the law should be changed. There should be a generous guest worker program put in place so American business have access to labor that they need.</p>                \n                \r\n\n            \n                <p>Also, the illegal aliens already here should have a hearing, all of them, to determine whether their presence is benefiting the country. That would take a while and the aliens would have to register but let's be fair on the issue. For decades, the federal government has turned to the other way while migrants streamed across the border. No question about that. So while the individual illegal alien did violate immigration law, our federal government permitted it. It's like the teacher who lets the students run around the classroom for weeks and one day shows up and say you're all suspended!</p>                \n                \r\n\n            \n                <p>Now, the apathy on immigration is going to change because President Trump wants the rule of law to be reestablished in America. South of the border, it's depressing, depressing! To watch the Mexican government object to a lawful display by the USA. What nerve they have. It's entirely Mexico's fault that millions of their own citizens feel they have to come here to earn a decent living. Canada doesn't have that problem, but Mexico does and always has.</p>                \n                \r\n\n            \n                <p>Because their system is chaotic. Same thing with the violent drug cartels, and the government of Mexico can't control them. So, we are not entitled to put up a barrier to try to prevent the poison from coming into this country? That's just insulting. Mexico should take full responsibility for its inability to provide a decent economy for its own people and for failing to defeat the vicious drug peddling monsters. But they never will. And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The most important problem in the USA", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/23", "date": "2017-02-24T12:56:57Z"}