{"vcmId": "8ac105fc-21ed-4c09-857d-277c921e049d", "url": "http://www.foxnews.com/transcript/2016/01/27/bill-oreilly-factor-coverage-presidential-election.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>People are coming up who me here in southern California asking who do I think will win the Republican nomination?</p>                \n                \r\n\n            \n                <p>There is incredible interest in this election process, everybody is talking about it. I always say the same thing, I don't know who is going to win. I don't support any candidate publicly and I don't root for anyone.</p>                \n                \r\n\n            \n                <p>Sometimes people are disappointed when they hear that. But I can't possibly cover the election in a fair way if I'm rooting for somebody. It's my job to ask the toughest questions I can to all the candidates; also my mandate to tell you the truth about each person who wants power over you. And I think I do that using facts and clarity.</p>                \n                \r\n\n            \n                <p>Today there is new polling -- I'm just going to summarize it for you. Nationally Donald Trump has a big lead in the Republican sweepstakes -- about 41 percent according CNN; Ted Cruz second, Marco Rubio third and at this point those three men seem to have the best chance for the Republican nomination.</p>                \n                \r\n\n            \n                <p>In Iowa, it's a brawl between Trump and Cruz, anything could happen there. New Hampshire, Trump is likely to win easily. South Carolina Trump well, ahead.</p>                \n                \r\n\n            \n                <p>But polls change quickly. For example in Iowa about 33 percent of the voters still say they could change their minds on Monday -- that's a big number.</p>                \n                \r\n\n            \n                <p>On the other side Hillary Clinton will defeat Bernie Sanders unless she's indicted in the e-mail deal. Sanders competing well in Iowa and New Hampshire but there's little change for the larger states. He's simply too far left for even many Democrats.</p>                \n                \r\n\n            \n                <p>The American media covering the race the way it always does chaotically. On talk radio you have rooting. Nothing wrong with that radio people are not reporters. They build their ratings on a particular point of view. TV as always leans left except for Fox News which gives conservatives a voice to be fair and balanced.</p>                \n                \r\n\n            \n                <p>However, at FNC, I don't see any pattern of support for anybody. It's all over the place. On the Internet, there is rank deception and you should understand how bad the situation is. Let me give you and example.</p>                \n                \r\n\n            \n                <p>Politico.com heavily covering the election. Recent article by somebody named Jack Shafer (ph) -- total distortion. He writes quite, if Trump were a cable news show he'd be a less articulate version of The O'Reilly Factor which channels many of the same century-old media currents Trump exploits.</p>                \n                \r\n\n            \n                <p>I'm not sure what century-old media currents is, but I am certain it's a cheap shot. Shafer continues quote, \"as Callum Borchers wrote recently in the \"Washington Post\" O'Reilly doesn't give Trump a free ride when he appears on the show. But O'Reilly tempers his criticism with support.</p>                \n                \r\n\n            \n                <p>Borcher's Notes in a November interview, O'Reilly said to Trump, look, you know I'm looking out for you -- right? Absolutely ridiculous.</p>                \n                \r\n\n            \n                <p>Here is the context.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know I'm looking out for you, right? You know that? I'm looking out for you. I look out for every honest politician. I don't care what party they're at.</p>                \n                \r\n\n            \n                <p>The Politico story was designed to mislead readers into thinking I'm supporting Donald Trump -- a blatant deception. This is the problem with American journalism today. There are no standards anymore. Each individual outlet does pretty much what it wants with little accountability.</p>                \n                \r\n\n            \n                <p>That makes it harder for you, the honest voter to decide who is really looking out for you. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The Factor's coverage of the Presidential election", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/26", "date": "2016-01-27T13:14:56Z"}