{"vcmId": "8b568d97-0634-46cf-95ea-c371f3c7d0d2", "url": "http://www.foxnews.com/transcript/2016/02/24/bill-oreilly-covering-presidential-race.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Some in the American media do not quite understand that reporting and analyzing what presidential candidates are doing and saying is not supposed to be a rooting experience.</p>                \n                \r\n\n            \n                <p>When you root for someone, you cannot possibly cover that person in a fair and balanced way. Now, if you are not a journalist, it really does not matter. Plenty of programs on radio and T.V. that use political campaigns for entertainment purposes. Comedy central, for example, makes a living doing that. With Stewart and Colbert becoming stars.</p>                \n                \r\n\n            \n                <p>But the serious business of actually bringing information to you, the American people, about those who want power over you, is no joke. It is well-documented national press in this country leans left. In fact, if the Fox News Channel did not exist, almost all the television reportage would come from liberal leaning companies. That is a fact.</p>                \n                \r\n\n            \n                <p>There is also pressure to get ratings, to bring in candidates who will attract a mass audience. Donald Trump is the best example of that. He is in great demand on T.V. Mr. Trump knows this. But, I have to say he has been fairly fearless, showing up pretty much everywhere to make his case. We hope that continues.</p>                \n                \r\n\n            \n                <p>However, like every other candidate Mr. Trump wants to be treated in a way that he considers fair, and therein lies the problem. What is fair? There is some political candidates who will not appear on certain venues because they do not want to subject themselves to rigorous questioning. Sometimes I tell you who those people are.</p>                \n                \r\n\n            \n                <p>Dick Cheney, for example, did not do \"The Factor\" while he was Vice President, because he knew that I had many questions about his Iraq war participation. After Mr. Cheney left office, he came in here a number of times. But, while he was serving he wanted no part of us.</p>                \n                \r\n\n            \n                <p>President Obama has sat with me for three interviews, but I do not believe he will do that again. Last time we spoke, the interview was very intense and the word on the street is the President did not like it very much.</p>                \n                \r\n\n            \n                <p>Now, that does not matter to me. My job is to ask every political candidate the type of questions I can think of. If you watched \"The Factor\" last night, you saw Marco Rubio, Ted Cruz, and Ben Carson all put through their paces. Well, we will have a very lively mail segment about that at the end of the program. The danger here is that some candidates will go only to venues that favor them.</p>                \n                \r\n\n            \n                <p>This week some pirated audio featured a conversation off the air between Donald Trump and MSNBC host Joe Scarborough and Mika Brzezinski. Some believe that conversation was inappropriate. It began with Ms. Brzezinski complementing Mr. Trump for bringing an Iraq war veteran on to the stage with him.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MIKA BRZEZINSKI, MSNBC HOST OF \"MORNING JOE\" PROGRAM: </b>You know what I thought was a kind of wow moment, was the guy you brought up on stage.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Yes, that was great.</p>                \n                \r\n\n            \n                <p><b>JOE SCARBOROUGH, MSNBC HOST OF \"MORNING JOE\" PROGRAM: </b>We played it several times this morning.</p>                \n                \r\n\n            \n                <p><b>BRZEZINSKI: </b>We played it up against Obama.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Both guys.</p>                \n                \r\n\n            \n                <p><b>BRZEZINSKI:</b> Both guys.</p>                \n                \r\n\n            \n                <p><b>SCARBOROUGH</b>: For years we played Obama first --</p>                \n                \r\n\n            \n                <p><b>BRZEZINSKI: </b>The young guy was a champ.</p>                \n                \r\n\n            \n                <p><b>SCARBOROUGH:</b> -- And then we played the guys.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Yes. I saw it. I watched your show this morning. You have me almost as a legendary figure. I like that. We have one more segment?</p>                \n                \r\n\n            \n                <p><b>BRZESKINSKI: </b>One more segment, and then we are good. Thank you for doing this.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: OK. I am doing it because you get great ratings and a raise.</p>                \n                \r\n\n            \n                <p><b>BRZESKINSKI</b>: Uh-huh.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Me, I get nothing.</p>                \n                \r\n\n            \n                <p><b>BRZEZINSKI: </b>We are getting a real window into your -- so --</p>                \n                \r\n\n            \n                <p><b>SCARBOROUGH</b>: Well --</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Just make us all look, good.</p>                \n                \r\n\n            \n                <p><b>SCARBOROUGH: </b>Exactly.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, I said Mika it is Mika. Now, talking points does not see anything wrong with that banter. I want to be quite clear. Donald Trump has said similar things to me off camera that he brings in big ratings and does not get much out of it, but he does it in a joking way and of course he gets a lot out of it.</p>                \n                \r\n\n            \n                <p>Some believe Mr. Trump tries to co-opt some journalists, tries to persuade them to be friendly. But, almost every political candidate does that. It is part of the process. Of course, politicians want favorable treatment and there is nothing wrong with them trying to get it.</p>                \n                \r\n\n            \n                <p>But, there is something very wrong, very wrong with news agencies providing favorable coverage to any candidate in return for access or because of simpatico ideology. Running for President is a very serious business and all of us covering the campaign have an obligation to be fair but tough. And make no deals. And, that is &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Covering the Presidential race", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/23", "date": "2016-02-24T13:20:10Z"}