{"vcmId": "8d67c53a-d13f-4d71-9303-31513124f542", "url": "http://www.foxnews.com/transcript/2015/05/15/economic-hardship-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" May 14, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Continuing now with our lead story: distorting the record on poverty off President Obama's remarks about Fox News. With us, the author of the brand new book, big hit -- My Journey with Maya\" very good read. Mr. Tavis Smiley. You heard Bernie and I, go.</p>                \n                \r\n\n            \n                <p><b>TAVIS SMILEY, AUTHOR, \"MY JOURNEY WITH MAYA\": </b>First of all, there are many of us who have been trying to get this president to talk about poverty for years now. So one I'm just glad to see the President finally talking about poverty, saying the p word. Not just income inequality, not just the middle class but poverty. So one, I'm glad to hear him say that.</p>                \n                \r\n\n            \n                <p>Number two there is no doubt about the data, Bill. Two parents are better than one. Let me underscore -- the right two parents. You all talk about the black family as if it just collapsed like a sort of souffle. There are reasons for the dissolution of the black family. Clearly some folk make bad choices but there have also been government policies that have gotten in the way.</p>                \n                \r\n\n            \n                <p>For example, there have been policies on the books for years where if you have your baby daddy in the house with you, then the government cuts your check. They cut those resources, but I thought we wanted the family to come together so there have been government programs that have led to this dissolution as well as bad choices.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. But that is public policy. I'm big on the personal thing.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Because I'm a former high school teacher. I taught a lot of black kids, all right? I saw the ones with involved parents prosper while the ones with parents who didn't give a fig go down. And so I want to declare a war on irresponsible parents.</p>                \n                \r\n\n            \n                <p>You are right about the government policy. But take that out of it, for example. If you have two parents, even if they don't have much money, who are just hell bent on getting their kid educated, he does his homework, he is respectful, this, and that. That child is not going to be in poverty, come on.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> I had two parents and I grew up in poverty. I had brothers and sisters. I am one of 10 kids. I have been blessed to do extremely well. But I have nine brothers and sisters who are still fighting their way out of poverty. Just because you grew up in a family two parents doesn't mean that you don't have to struggle in this world because racism is real. Discrimination is real. These gaps, these disparities between black and white economically are real.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. I want to go to another topic.</p>                \n                \r\n\n            \n                <p>There is a woman Cynthia Tucker, very far left woman who attacks Dr. Ben Carson and she says, quote, \"The good doctor's foray into Republican presidential politics threatens to become his epitaph to overshadow perhaps even overwhelm his academic and surgical accomplishments. He will likely to be remembered as the GOP's latest black mascot, a court jester, a minstrel show.\" He'll be the Herman Caine of 2016 because she doesn't like Dr. Carson's opinion on Obamacare.</p>                \n                \r\n\n            \n                <p><b>SMILEY: </b>Why is Cynthia Tucker using your word attacking Ben Carson but Ben Carson wasn't attacking the President?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I don't know about that.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> Oh, come on, Bill. Stop that. You heard the comments that Ben Carson made about the President. He has done it repeatedly and he's done it to Republican applause when he attacks the President.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You don't justify bad behavior by pointing to other bad behavior.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> I'm not justifying. I'm just asking you a question.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He attacked Obamacare.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> She attacked Ben Carson but you don't say that Ben Carson attacked the President.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Did Ben Carson use any racially loaded terms? No. This is a racially-loaded deal.</p>                \n                \r\n\n            \n                <p><b>SMILEY: </b>You are smarter than that the fact that you don't use a racially-tinged term doesn't mean you are not attacking.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You are deflecting a well-known talker's racism.</p>                \n                \r\n\n            \n                <p><b>SMILEY: </b>You are deflecting from the attack that Ben Carson --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It was on Obamacare.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> It wasn't just on Obamacare.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It was on Obamacare -- this is what's rolled this.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> It's on the President. Here is the bottom line on Ben Carson -- I won't use his language, that her language. Here is my assessment. Ben Carson has been respected and revered. Not just respected but revered, admired in black America for years for his gifted hands that he still possesses. But Ben Carson is, how might I put this is he a black bull in a Republican China shop. And if he's not careful, he's going to do himself irreparable damage. He's going to do the Party damage and I were a person in his face who professed to love Ben Carson I'd call for an intervention to stop him from doing what he's doing to himself and his reputation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Be that as it may, this is a racial attack on Dr. Carson because this woman holds a different opinion on Obamacare than he does. This is wrong. This is wrong.</p>                \n                \r\n\n            \n                <p><b>SMILEY: </b>You invited me earlier to read the entire piece that you did about LBJ and poverty.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I read the entire piece ten times.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> In this piece she makes it clear that he has been respected for years and she doesn't like the idea that he will allow himself to be a token at the risk of his reputation for the party.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Last question. Last question.</p>                \n                \r\n\n            \n                <p><b>SMILEY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> If a white person had written these words against Dr. Ben Carson or any other African-American, that person would be out of business.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> One, it happens every day. Number two, it's not in my language. Number three, Ben Carson has to be careful that what he does doesn't invite that same kind of attack on him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I think he can speak his mind. But this was off the chart.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> He ought to be stick to neurosurgery though. Politics is not his game.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's your opinion.</p>                \n                \r\n\n            \n                <p><b>SMILEY: </b>You have got to know the issues.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's your opinion.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> You have got to know the issues.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Tavis Smiley, everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Economic hardship in America", "description": "Tavis Smiley weighs in on the cause of poverty in America", "date": "2015-05-15T12:14:26Z"}