{"vcmId": "8e2202ae-670d-4bef-9d98-c2eff6157ee8", "url": "http://www.foxnews.com/transcript/2016/01/14/bill-oreilly-my-state-union-message-to-president.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Very long speech last night by Mr. Obama; very political -- not much substance. Few statements caught my attention. The President sensitive to charges that he has misused American power, basically retreating from evil.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> The United States of America is the most powerful nation on earth - - period. Period. It's not even close.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure, but what good is having strength if you're unwilling to use it wisely? Look, everybody knows that ISIS is causing a massive amount of trouble in the world. Everybody knows that -- millions of refugees, the collapse of Iraq, human rights violations daily and on and on. But Mr. Obama has not neutralized the jihad, ISIS. In fact, it's become stronger since he has been in office. No question about that.</p>                \n                \r\n\n            \n                <p>Now, the solution is to compel NATO to fight ISIS directly and at the same time set up safe zones for the suffering people of Syria. That's the solution. Many Muslim nations would assist if NATO were mobilized. So why haven't you done that, Mr. President?</p>                \n                \r\n\n            \n                <p>Sadly, the President used a part of his speech last night to politic.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>That's why we need to reject any politics, any politics that targets people because of race or religion.</p>                \n                \r\n\n            \n                <p>The world respects us not just for our arsenal. It respects us for our diversity and our openness and the way we respect every faith.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Fine, swell, no problem -- but many in the world don't respect us. Again, the fact is that most of the terror violence in the world comes out of the Muslim precincts. So instead of taking a shot at Trump, why not address that in a meaningful way, Mr. President?</p>                \n                \r\n\n            \n                <p>Finally, prosperity. It simply has not happened on President Obama's watch. More than half of all working Americans now make less than $30,000 a year -- about half.</p>                \n                \r\n\n            \n                <p>That's because corporate America is not bullish on Mr. Obama's high tax and spend agenda. Companies are not expanding the way they must in order to create well-paying jobs. Instead they are penny pinching and workers have little leverage. All that is apparently lost on the President who instead, puts economics into the political arena.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> The future we want, all of us want, opportunity and security for our families, a rising standard of living, a sustainable peaceful planet for our kids -- all of that is within our reach. But it will only happen if we work together.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Not quite. An aggressive push to stimulate the private marketplace by making it easier for companies to make money is the way to create opportunity and security for American workers in order to help the kids.</p>                \n                \r\n\n            \n                <p>Summing up, another windy political speech by the President that did not even come close to addressing the latest Gallup poll finding that 76 percent of Americans are dissatisfied with the way things are going.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: My State of the Union message to the President", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/13", "date": "2016-01-14T20:23:43Z"}