{"vcmId": "8ee4aeff-e7ba-44fb-b731-6f9fbb312489", "url": "http://www.foxnews.com/transcript/2015/06/25/gross-dishonesty-in-media.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 24, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> In the \"Impact Segment\" tonight, gross dishonesty along racial lines.</p>                \n                \r\n\n            \n                <p>On Monday, we had an honest debate about the confederate flag controversy.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You say the confederate flag is a symbol of hate and you believe that.</p>                \n                \r\n\n            \n                <p><b>JUAN WILLIAMS, FOX NEWS ANALYST:</b> That's the way I feel when I see it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. Ok. And absolutely 100 percent legitimate. For some other people who see it in a historical context --</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> What's the historical context?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It represents bravery.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS: </b>Oh, get out of town.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> In war. And in your mind it represents hate. So, and everybody should know what the two sides are.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> That's legit.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Please notice I did not say the confederate flag symbolizes bravery, I didn't say that. I was paraphrasing what some Americans believe in order to present both sides of the story. That's what we do here. Enter the race hustlers who do what they always do.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HAYES:</b> Now almost as soon the backlash against the confederate flag started to gain momentum the backlash got under way. Much of it from some pretty predictable sources -- Rush Limbaugh railed that removing the flag from the state capitol was all about destroying the South. Bill O'Reilly said it represents the bravery of confederates who fought in the civil war.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Complete distortion. Again, I said some believe it represents bravery. And I clearly said the confederate flag represents to me oppression.</p>                \n                \r\n\n            \n                <p>Now, the marketplace has spoken about the guy you just heard. He is the biggest failure in cable news. But the fact that he is allowed to distort day after day after day is troubling.</p>                \n                \r\n\n            \n                <p>Joining us now from North Carolina the purveyor of BernardGoldberg.com, Mr. Goldberg.</p>                \n                \r\n\n            \n                <p>Let's take the \"Talking Points Memo at first. Do you agree with me that America is now being besmirched in an almost unprecedented way?</p>                \n                \r\n\n            \n                <p><b>BERNARD GOLDBERG, FOX NEWS CONTRIBUTOR:</b> Yes, by the hard left. I'm afraid you're absolutely right.</p>                \n                \r\n\n            \n                <p>There is a certain way the liberal elite in this country show how virtuous they are, Bill. And that's by bashing America as a racist country because it makes them feel better about themselves. That way they can say we're for the underdog, we are fighting white oppression or white privilege or now white supremacy. It's what has been called they're showing good racial manners.</p>                \n                \r\n\n            \n                <p>Now, look, as you said, in a country of over 300 million people, are there some racists? Unfortunately, yes. But this is not a racist country or anything like it.</p>                \n                \r\n\n            \n                <p>So, here is my message to the progressives out there. Charleston, South Carolina -- as terrible as that was -- is not Selma, Alabama and this is not 1965. Baltimore is not Selma. And Ferguson, Missouri wasn't Selma.</p>                \n                \r\n\n            \n                <p>Progressives amuse me because they don't progress. They are stuck in the past. This is not the same America as we were in 1965. That was 50 years ago. We have changed for the better and we have changed a whole lot.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, that's what the stats say. We go with the crime stats and we have reported them in a vivid way that shows there isn't an epidemic of white against black violence. There isn't an epidemic of ill will toward blacks from whites. I mean it's -- that's just a fact.</p>                \n                \r\n\n            \n                <p>But, some believe, and now I'm using the confederate flag, some believe, all right, that the progressive movement to diminish America and label it a racist nation is political because then they can mobilize blacks and other minorities to vote for the left and tie in Republican white guys or Ben Carson gets the nomination as a Republican black guy with the supremacist, you know. And some believe it's a political play here. Do you see it that way.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> If it's a political play, I think it's a bad, bad move because -- well, let's first take why it might be a political play. Liberals see the answer to almost everything in government. So, if they can say this is a racist country, well, what's the solution? More government. More money. More trillions spent on programs that very often don't work.</p>                \n                \r\n\n            \n                <p>But the reason I say I don't think it's a good political move is because, yes, the far left is going to believe we are racist. And conservatives -- by the way, that's who they are calling racist. Let's not pretend it's just some vague charge.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But that's -- anybody that's associated with the Republican Party even if you are a moderate they will call you a racist.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>That's right. But, so one side the conservatives aren't buying it. And the hard left, you are not going to change their mind. But I think there is a reasonable middle in this country. And I don't think they are going to buy this because in the last few years since President Obama got elected, if you are against immigration reform, you are a racist. If you are against Obamacare, you are a racist. If you are against higher taxes on the wealthy, you are a racist. If, as you and I have discussed frequently, if you are against dysfunctional behavior as a cause of poverty, regardless of race, you are a racist. Well, I don't think reasonable people are going to buy that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Just depends on how many reasonable people there are. I mean that's -- you know, the far left is hoping that they can just overwhelm with propaganda the truth. Just overwhelm the truth and that's what they're hoping.</p>                \n                \r\n\n            \n                <p>Last word.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> I don't think it's going to work. And the real pity in all of this is that liberals who are at the forefront of civil rights have turned the word \"racist\" into a meaningless word. Once upon a time, it was a serious indictment, \"racist\". Now it's mush thanks to the left.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right, Bernie Goldberg, everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Gross dishonesty in the media", "description": "Bernie Goldberg weighs in on the reporting the Confederate flag debate", "date": "2015-06-25T12:37:22Z"}