{"vcmId": "8f89c04a-b5f3-4c22-8f29-0fdb3708055e", "url": "http://www.foxnews.com/transcript/2016/08/31/kellyanne-conway-on-trump-upcoming-immigration-speech.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 30, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BRET BAIER, FOX NEWS HOST</b>: Good evening, welcome to Washington. I'm Bret Baier in for Bill O'Reilly. Thanks for watching us tonight.</p>                \n                \r\n\n            \n                <p>Let's get right to our top story. Donald Trump's make or break immigration speech in Arizona tomorrow night. And the state of the presidential race right now. Speculation is rampant over whether Trump will announce a major policy shift on how to deal with illegal immigration following more than a week of hints that his stance or his tone is shifting.</p>                \n                \r\n\n            \n                <p>Joining us now from New York with a preview of those remarks, Trump Campaign Manager Kellyanne Conway. Kellyanne, thanks for being here.</p>                \n                \r\n\n            \n                <p><b>KELLYANNE CONWAY, TRUMP CAMPAIGN MANAGER: </b>Hi, Bret. Thanks for having me.</p>                \n                \r\n\n            \n                <p><b>BAIER</b>: I want to start with where this race is right now. Where do you see it? You know, I hear from a lot of Trump supporters who don't buy the polls. They're not -- they don't think that he is trailing. Even though it has gotten tighter nationally, where do you see the race now in those important battleground states?</p>                \n                \r\n\n            \n                <p><b>CONWAY:</b> Sure. So, Bret, like three weeks ago all the pundits and reporters were saying, look at the polls, race over. He can't recover. And now that the polls are tightening particularly in states like North Carolina, Pennsylvania, Ohio, Michigan, we see these tightening of these races in these swing states that they don't want to talk about the polls. They sort of want to talk about the weather and the back-to-school sales. And I think that tells you something. What we see in the polls, Emerson College released several battleground polls over the last day or so.</p>                \n                \r\n\n            \n                <p>And we see within the margin of error in each of those states, Michigan, Ohio and Pennsylvania. And in those states which I think is incredibly important is that we are leading Hillary Clinton among Independents in each of those three states. And according to the Emerson College poll in Ohio, we are leading Hillary Clinton by 17 points among Independents in the make or break state of Ohio. So, we are really thrilled with our message. Mr. Trump is still seen as the outsider, the disrupter. He is going to shake up Washington.</p>                \n                \r\n\n            \n                <p>And we like our strategy which is to take the case directly to the people. People can actually listen to his policy proposals now. They don't need to wait for these 90 minute or two hour presidential debates to know what he would do as president. He has given major speeches just in the last two weeks on law enforcement, on defeating radical Islamic terrorism, on how to help the communities of color. He has given a speech tomorrow on immigration. So, people can at least examine, I mean too often politicians do the sound bites now, specifics to be named at a date in the future.</p>                \n                \r\n\n            \n                <p>And, Bret, we really like our strategy compared to Hillary Clinton's strategy which is she gave one speech last week and it was about Donald Trump. He gives speeches about the issues. So when you look at these polls, the number that I think we should all watch is Hillary Clinton's number sort of flat lines at 43, 45, 48, 46. She is really at 50 percent in none of these new swing state polls and in the morning consult poll that was released on Sunday, Bret, it showed her lead nationally cut from six points to three points and most startingly in the Morning Consult Poll released on Sunday, she had 44 percent of the female votes. Forty four percent of American women saying they are going to vote for the first female president, I think Hillary has a Hillary problem.</p>                \n                \r\n\n            \n                <p><b>BAIER</b>: Right. So, you're a pollster, do you buy this hidden Trump voter that is not being picked up by the polls? You pointed to battleground states that are within the margin of error. But is there a battleground state where Donald Trump is leading currently?</p>                \n                \r\n\n            \n                <p><b>CONWAY:</b> So he is such an unconventional candidate that I think conventional polling may not capture the depth and breadth of the enthusiasm for his support. So there has been data revealed. There have been projects done under cover Trump voters. And even those who admit that there may be a hidden Trump voter that people just aren't admitting they're voting for him or folks that usually don't Democratic frankly but don't vote at all. Or have them lapse voters and then missed quite a few cycles that feel inspired about his outsider candidacy and his message.</p>                \n                \r\n\n            \n                <p>They would not be on a normal list of voters. And if you are only using a list of actual voters from past elections, you are missing a swath of electorate particularly in some of these swing states who may be either first-time voters or had been long-time none voters who want to come back into the fold. And let's be frank, I don't think you will going to find a single hidden Hillary Clinton voter in this entire country. If anything, oh, Bill Clinton's wife. Barack Obama's successor. First woman. You know, she seems to get quite a list in the polls from those unique characteristics. And yet --</p>                \n                \r\n\n            \n                <p><b>BAIER:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>CONWAY</b>: -- she just can't put him away. I think that the scarce city that is her strategy is a mistake. She should be out there campaigning and giving policy speeches. Because what do voters tell the FOX News pollsters and all pollsters? I want to hear about jobs and the economy. I want to hear about terrorism and healthcare and energy and infrastructure and immigration. We are the ones taking the case right to the voters.</p>                \n                \r\n\n            \n                <p><b>BAIER:</b> And I want to talk about that immigration speech coming up tomorrow. But in a sense, would you say that he is trailing closing the gap? On the move? In a sentence where you put this race right now.</p>                \n                \r\n\n            \n                <p><b>CONWAY</b>: Closing the gap and on the move and recognizing that some of Hillary Clinton's fundamental character flaws as reflected in the polls are not changing at all. You had the same numbers in some polls worse than even two months ago on terms of her likability and her trustworthiness. And, Bret, it's been so long that 66 percent or so of Americans have said, they don't trust her, 60-something say they don't much like her. That I think, we are all becoming newer to that.</p>                \n                \r\n\n            \n                <p>Oh, sure. People don't thrust her, don't like her. But who is to say that voters saying, but, after they say, I don't like you and I don't trust you. They may be saying and, and I can't see myself voting for you and I just can't bring myself to go for another typical politician insider. So, one thing I feel really good about are those fundamental character numbers for Hillary Clinton that aren't bunging.</p>                \n                \r\n\n            \n                <p><b>BAIER:</b> Will there be a shift Kellyanne in immigration policy from Donald Trump? We have heard him talk about it different ways and you have to concede that. Will there be a shift tomorrow in actual policy in what he has talked about?</p>                \n                \r\n\n            \n                <p><b>CONWAY</b>: You will hear a consistent Donald Trump in this way. No amnesty, no legalization. No sanctuary cities. So these parents, these angel moms and dads that we have seen up on the stage with him and let me give you names, Laura and Michelle and Jamiel and Agnes and Julie. These are real people whose children were killed by illegal immigrants who should not have been here. Kate Steinle. No more sanctuary cities.</p>                \n                \r\n\n            \n                <p>Also, we want to be fair to the American worker. A lot of folks feel they are competing with illegal immigrants as well as people abroad for these jobs now. And we also want to be, as he has said, when dealing with the 11 million or so, he wants to abide the law, enforce the law, which is a novel concept in Washington. Usually we layer laws on top of each other rather than enforcing the ones that we have. The Clinton people have committed a crime are gone. And then he wants to see what we are left with, is it five million? Is it 11 million? Is it 30 million?</p>                \n                \r\n\n            \n                <p>And he would like to -- he will address that tomorrow and I think you will see one of the toughest speeches on illegal immigration in modern political history and give him credit where it's due, please, Bret, and your viewers. Which is he is actually putting these policies out now long before election day so that people can at least examine them and see how they match up with their own concerns.</p>                \n                \r\n\n            \n                <p><b>BAIER</b>: And I have heard you say listen to the speech. You are not going to go into whether the 11 million and how it's going to happen. And I've also heard you say that he -- he didn't talk about deportation force on the RNC speech. I want to ask you quickly about debate prep. Is he prepping in a policy way to go up against Hillary Clinton and all that you are hearing that she is doing to prep for debates?</p>                \n                \r\n\n            \n                <p><b>CONWAY</b>: Absolutely, Bret. I can assure you that every day he is talking about policy, reading on policy, discussing policy with other experts. And that -- I mean, we feel like one piece of our debate prep is going out there and giving these speeches. These are his speeches. He helps to -- these are his final words. This is his campaign. He is the face of the campaign. And so when you are actually laying out your plan, you are ready for the debate. Look, I understand, I can simply sympathize why team Clinton is cramming her head with binders and of facts and getting the Hollywood folks, and now somebody wrote a book about Donald Trump a thousand years ago to consult with her.</p>                \n                \r\n\n            \n                <p>But why is she so afraid of? Why not just going to debate Donald Trump on the issues? I will tell you why, the issues that favors Donald Trump, Americans are dissatisfied with ObamaCare. They are worried about economic security. They don't like the fact that she refers to ISIS as our, quote, \"determined enemies\" rather than savage murderers. They really want to talk about energy and infrastructure and education.</p>                \n                \r\n\n            \n                <p>And so, we are out there doing that and we'll continue to do that. That's part of the prep. And then there is a lot of other things that I don't discuss publicly. But we feel very comfortable and really excited about the debate season.</p>                \n                \r\n\n            \n                <p><b>BAIER</b>: Kellyanne, thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Kellyanne Conway on Trump's upcoming immigration speech", "description": "Republican candidate's campaign manager joins 'The O'Reilly Factor' to discuss the state of the 2016 presidential race", "date": "2016-08-31T12:17:34Z"}