{"vcmId": "8ffd24f3-0514-430f-ac9e-e79b05c2f10b", "url": "http://www.foxnews.com/transcript/2016/08/01/was-hillary-dnc-speech-effective.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" July 29, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>ERIC BOLLING, FOX NEWS ANCHOR: </b>Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching us tonight. Let's get right to our top story. The aftermath of the Democratic convention. Hillary Clinton gave voters the hard sell last night unleashing everything she has got against Donald Trump.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON (D), PRESIDENTIAL NOMINEE</b>: Donald Trump can't even handle the rough and tumble of a presidential campaign.</p>                \n                \r\n\n            \n                <p><b>(CROWD BOOING)</b></p>                \n                \r\n\n            \n                <p>He loses his cool at the slightest provocation. When he has gotten a tough question from a reporter, when he is challenged in a debate. When he sees a protester at a rally. Imagine, if you dare imagine, imagine him in the Oval Office facing a real crisis. A man you can bait with a tweet is not a man we can trust with nuclear weapons.</p>                \n                \r\n\n            \n                <p><b>(CHEERS AND APPLAUSE)</b></p>                \n                \r\n\n            \n                <p>And in the end, it comes down to what Donald Trump doesn't get, America is great because America is good.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Trump was on the receiving end of a blistering attack by Democrats all week and seems to have had enough.</p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL NOMINEE</b>: The things that were said about me. I mean, should guy through some of the names? You know what? I wanted to. I want to do hit a couple of those speakers so hard. I would have hit them, no, no.</p>                \n                \r\n\n            \n                <p><b>(CHEERS)</b></p>                \n                \r\n\n            \n                <p>I was going to hit -- I was all set and then I got a call from a highly respected governor, how's it going, Donald? I said well, it's going good but they are really saying bad things about me. I'm going to hit them so hard. I was going to hit one in particular. A very little guy. I was going to hit this guy so hard his head would spin he wouldn't know what the hell happened. And he came out of nowhere.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Wow!</p>                \n                \r\n\n            \n                <p>Joining us now with reaction from Dallas, Trump campaign national spokeswoman Katrina Pierson. Now, Katrina, the very little guy Mr. Trump was referring to in the speech I'm guessing and tweeted today about little Michael Bloomberg. Is that who he was talking about?</p>                \n                \r\n\n            \n                <p><b>KATRINA PIERSON, DONALD TRUMP SPOKESWOMAN: </b>Well, Mr. Trump didn't say so I won't say. But I think your inference could be spot on. Mr. Trump was definitely defending himself. And, you know, I think the quote from Hillary Clinton you just played are really indicative on why Mr. Trump is beating her in the polls right now. Because people are tired of this make believe fantasy land that everything is okay and there is nothing to see here, move along. We finally have a candidate that's willing to stand up for himself and fight back for a change.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Um-huh. Yes, that Michael Bloomberg speech. It seemed that it was very, very, it's very attackish and kind of shocked me a little bit, too. But listen, this is what politics are all about. Let's talk about what you just mentioned, Mrs. Clinton's comments last night. She was hitting Mr. Trump or Donald Trump very hard on this tweeting issue. Now, Donald Trump has done very well with Twitter. He gets his message out there. But she says that because you can instigate a twitter fight with him, he may not be the guy that has access to the nuclear, to the button.</p>                \n                \r\n\n            \n                <p><b>PIERSON:</b> Well, I mean, this is another reason why Mrs. Clinton struggles with younger people. I mean, this is a medium of choice and it's been one of the ways that Mr. Trump has been able to fight back against the liberal media that has tried to paint his policies for him. And Twitter has been a great resource for Mr. Trump. And there are millions of millennials who are on Twitter and who are getting his message.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> The word is that he and Mrs. Clinton will be receiving national security briefings coming very soon. What will Donald do with those?</p>                \n                \r\n\n            \n                <p><b>PIERSON</b>: Well, he is going to take them very seriously. You know, one of the things Mr. Trump has always said that he wants to take in the information and lead the generals make the decisions and what we know with Hillary Clinton, particularly throughout this week is there really was no mention of what was going to be changed and we hear a lot of talk about her resume and her qualifications but what's really important are the decisions that she has made while she had those titles like when she was secretary of state and we have had an influx of refugees coming into this country.</p>                \n                \r\n\n            \n                <p>We see what's happening in other countries and she wants to do more of that. Her plan, Eric, is to have more intelligence but why didn't she do that while she was secretary of state because now we know after the email investigation that she had intelligence and she misused that intelligence as well as when people died under her watch. She lied about it and that's the case that's going to be made moving forward.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> The Trump campaign is suggesting that maybe Hillary Clinton shouldn't have these National Security briefings because of what happened with the email, with the FBI being under investigation with the FBI. Hillary Clinton camp says, Donald shouldn't have it because of his comments about Russia looking for the 33,000 emails. First of all, where -- did he mean -- was he serious about that he said, his tongue in cheek, where is he?</p>                \n                \r\n\n            \n                <p><b>PIERSON:</b> Oh, it's absolutely tongue in cheek which is exactly why he included the press will be thankful in that comment. But Mr. Trump is absolutely right. I mean, now you have the Department of Justice who have reopened the investigation into Hillary emails simply because there needs to be consequences as the FBI Director Comey has even said. That if that person had worked for him they would probably lose their security clearance. Mr. Trump is not investigated by the FBI.</p>                \n                \r\n\n            \n                <p>He hasn't done anything that could thwart national security. Hillary Clinton has, that's the problem and that's the difference and that's why you have seen it this last convention where people are still wondering, is she even going to address the email situation? Is she going to talk about Benghazi? Because that's what people want to know about her is why her poll numbers have tanked in honesty and I think it's really important moving forward.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Katrina, last night, one of the -- probably the most compelling speaker for me clearly was not Hillary Clinton. I think one of the most compelling was, because you're kind, he's the father of the Muslim U.S. soldier from Virginia who was killed in action and he said, you haven't sacrificed anything. How do you respond to something like that? It was an emotional moment.</p>                \n                \r\n\n            \n                <p><b>PIERSON</b>: It was absolutely an emotional moment. And, you know, everyone sympathizes with any parent that's lost a child under any circumstances. But if we go back to day one of the DNC Convention, where there was not a single American flag in the arena and, in fact, Eric, there was a Palestinian flag and on the outside of the arena, they were burning American flags as well as Israeli flags in their protest. So we have a situation where we have to put American citizens first.</p>                \n                \r\n\n            \n                <p>We cannot delay this any longer. I mean, it is truly unfortunate that we have lost so many lives because of terrorism. But, we have hundreds of millions of people in this country that we cannot succumb to people's feelings. It's about national security and the best interest of the people who are here. And the policies under even Bill Clinton letting Osama Bin Laden go, moving forward 15 years. We have been in a war and Hillary Clinton says we need to work with our allies. Well, where has that been this whole time?</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: All right. Katrina, before we go, as a woman, do you feel any sense of history being made here with Hillary being the first female presidential candidate of a major party in America?</p>                \n                \r\n\n            \n                <p><b>PIERSON:</b> I don't. It was actually a little anti-climactic for myself simply because it's unfortunate that, you know, all women really want to see a woman as president but not under these circumstances. Not someone that's been investigated by the FBI, who left Americans in Libya to die, who has lied and cheated. Over the last three years collected $22 million in special interest and trade and from global corporations and is now out there lying to the American public. It is exactly what Barack Obama said in 2008. Hillary Clinton will say anything and change nothing and most Americans realize that.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: All right. Katrina, thank you very much.</p>                \n                \r\n\n            \n                <p><b>PIERSON:</b> Thank you, Eric.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Now, let's bring in Democratic strategist Bernard Whitman, author of the new book \"52 Reasons to Vote for Hillary.\" Bernard, you listened to Katrina Pierson. There is some compelling push back on Hillary Clinton's speech last night by the Trump camp.</p>                \n                \r\n\n            \n                <p><b>BERNARD WHITMAN, AUTHOR, \"52 REASONS TO VOTE FOR HILLARY\"</b>: Here is the thing that Katrina and more importantly Donald Trump does not get. And it was summed up in three words by Hillary Clinton last night. E pluribus unum. We are all in this together. It was the most profound moment for me in the entire convention. It's something that the Trump campaign certainly doesn't get. And I think that Hillary Clinton needed to do three things last night. Number one, she need to do try sharp contrast with Donald Trump's vision for America and policies. I think she nailed that.</p>                \n                \r\n\n            \n                <p>Number two, I think she needed to be real. I think she needs to be authentic. I think she needed to acknowledge --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> You know, to be transparent. To be heartfelt. What I heard was, yes, beginning of the speech was like that but then the basis, the meat of that speech was attacking Donald Trump.</p>                \n                \r\n\n            \n                <p><b>WHITMAN:</b> But, Eric, but Eric, she drew a contrast to Donald Trump. Donald Trump believes in division, divisive negativity.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Means we're together, Democrats or the country?</p>                \n                \r\n\n            \n                <p><b>WHITMAN</b>: Democrats, Republicans and the Independents.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>She called the shots to Republicans, Donald Trump.</p>                \n                \r\n\n            \n                <p><b>WHITMAN:</b> No, she made a great effort to draw clear distinctions about how we have two different world views. One in which we are stronger through our diversity. We are inclusive, we are forward looking, we are optimistic, we believe this country is the greatest country on earth. In Cleveland all you heard was negativity. Talking down the economy. Talking down our military, talking down our veterans, complaining, I mean, Donald Trump literally.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: She painted a picture of a wonderful -- everything is good, did she not?</p>                \n                \r\n\n            \n                <p><b>WHITMAN</b>: She said things are great.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Are they though?</p>                \n                \r\n\n            \n                <p><b>WHITMAN</b>: So much better.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Look in that camera right now and tell America that things are great. Now, they may be great for Wall Street and they may be great for people on the two coasts. But flyover countries are saying, our wages aren't up. Our unemployment is still too high. Growth, we got a number today, growth, GDP is subpar.</p>                \n                \r\n\n            \n                <p><b>WHITMAN:</b> She said, that's exactly why she said you know what? Thank you Bernie Sanders for bringing issues of social justice and income inequality to the fore. We've created 15 million jobs. The longest and biggest recovery ever in history. Has it been enough? Absolutely not. Which is why her first days in office are going to be spent putting together the biggest single job creation program since World War II.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Yes. Before I let you go, it felt like this is the third term of President Obama. She delivered what President Obama would have been delivering, had he been on that stage, where am I wrong?</p>                \n                \r\n\n            \n                <p><b>WHITMAN:</b> No, I don't think it's either the third term of President Obama or the third term of Bill Clinton. I think this is going to be the first term and hopefully the second term of Hillary Rodham Clinton.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Why? What's different?</p>                \n                \r\n\n            \n                <p><b>WHITMAN:</b> Because she is committed to bringing people together working along party lines.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Barack Obama wasn't.</p>                \n                \r\n\n            \n                <p><b>WHITMAN</b>: Look, President Obama I think deserves huge credit but one thing he was challenged with was working with the other side.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Where is she different than President Obama? It sounded like she was up because --</p>                \n                \r\n\n            \n                <p><b>WHITMAN:</b> Because Hillary Clinton --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> -- almost the exact same thing.</p>                \n                \r\n\n            \n                <p><b>WHITMAN</b>: I think it's a great question, Eric, and I think that moderate Republicans and conservative leaning Independents need to understand Hillary Clinton has a record of three decades of working across the aisle to do things like provide healthcare to children. Eight million children. She did that with Republicans.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Experience doesn't equal being qualified. And that is why I think a lot of people --</p>                \n                \r\n\n            \n                <p><b>WHITMAN:</b> There is no question she more qualified than Donald Trump.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Was Hillary's DNC speech effective?", "description": "'The O'Reilly Factor' examines whether the Democratic candidate will gain votes from the convention", "date": "2016-08-01T11:57:48Z"}