{"vcmId": "902cdd83-5e21-41f5-85a8-02a0cefa5d15", "url": "http://www.foxnews.com/transcript/2016/03/25/reporting-president-obamas-cuban-baseball-game-attendance.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 24, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thanks for staying with us, I'm Bill O'Reilly. In the \"Weekdays with Bernie\" segment tonight, we did not make very much of President Obama going to a baseball game in Cuba directly after the terror attacks in Belgium. As stated, I believe Mr. Obama simply accept the fact that there will be terror deaths around the world thus his reaction to them is muted. But what about the national media? How did they cover it? How did they process the President's game day decision?</p>                \n                \r\n\n            \n                <p>Joining us now from Miami, the purveyor of BernardGoldberg.com. Mr. Goldberg. So what did you find out for us?</p>                \n                \r\n\n            \n                <p><b>BERNARD GOLDBERG, FOX NEWS CONTRIBUTOR: </b>The hard news media, Bill, generally was fair and reasonable. They reported that he was at the game despite Brussels and they reported his reason for staying there. Which was basically that he wasn't going to let terrorists disrupt his life or our lives. You could either accept that or not accept it. Reasonable people may disagree. I'm not getting involved in that. As far as the media is concerned. What was interesting is that more than a few Liberals on television, who normally support Barack Obama said, this didn't look good. This was not a good idea. This and the dancing in Buenos Aires were not serious.</p>                \n                \r\n\n            \n                <p>And I thought Chris Matthews, reliably liberal Chris Matthews was very good on this. He was talking to a liberal opinion writer for \"The Washington Post,\" a fellow named Jonathan Capehart. And Capehart said, Republicans constantly kick the President for not doing something they think he should do. And Matthews responded by saying there might be another scene involved. To defend the President on every front. Good for Chris. Because what he was saying is too often liberals in the media defend Barack Obama no matter what and I will add from the other side that too often conservatives on radio and television wouldn't give Barack Obama credit if he found a cure for cancer. Look, we need honest analysis. And too often what we're getting is not honest opinion journalism.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. It's policy-driven and that's a --</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Hyper partisan --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Hyper partisan ideology. And that's not good.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. On this program, we had Rudy Giuliani who was outraged that President Obama went to the game. And then we had me, who wasn't so outraged because I understand -- I understand Barack Obama. And I keep telling everybody, look, the man, he has accepted ISIS. He has accepted it. All right. He is not outraged by it. And I knew that back when Folly was beheaded on the internet and the President went golfing --</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>He went to golf.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He went to golfing.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That I thought, was a thousand times worse than the Cuba situation.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> So did I.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. That was -- you can't justify that. And the liberal media tried to justify it. They did.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Right. Well, two things. First, whatever one thinks about Barack Obama, he is a smart guy. He really is and he understands optics and the power of symbols. So he made a conscious decision that that symbol that we're looking at right now, that picture the symbol was much more important that he be seen casually watching a ballgame and talking to a reporter than the symbol of him leaving the ball park and getting on air force one.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. So these ISIS punks are not going to affect the way the president does business. That was the message.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>That was a conscious decision. But on your other point about how -- you see, here's the part that bothers me the most. You talk about how liberals would defend certain things that frankly were indefensible. I did a little checking into history here. In 1983, the Russians shot down a 747 commercial airline, Korean Airlines Flight 007. It left New York City. It made a stop in Anchorage, Alaska it had a lot of Americans on board. And then the Russians shot it down. It was an accident supposedly but they shot it down. President Ronald Reagan was on vacation in California riding horses and all that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, he didn't do much.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> He wasn't on a state trip to Cuba or any place else.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>It took him four days and only after prodding by his advisors to go back to Washington --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Good history --</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>-- and make a speech about what happened. And my point here, Bill, is that the very same conservatives who are bashing Barack Obama for not leaving a baseball game are the ones who would be defending Ronald Reagan, the sainted, the sainted Ronald Reagan.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. I don't know if that's true but it did happen.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>Yes. Well, it is.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All Right.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>It is true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Thank you, Bernie.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Reporting President Obamas Cuban baseball game attendance", "description": "Bernie Goldberg analyzes how the media covered the President's controversial decision in Cuba on 'The O'Reilly Factor'", "date": "2016-03-25T12:16:23Z"}