{"vcmId": "92baf9f9-ca5d-4c46-9dbd-127f57d1ec72", "url": "http://www.foxnews.com/transcript/2015/03/12/bill-oreilly-aftermath-e-mail-gate.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Quite a press conference yesterday: Hillary Clinton attempting to explain why she deleted thousands of e-mails during her tenure as secretary of state. As you may know, Mrs. Clinton is refusing to give access to her home server where those deleted e-mails are stored. Reaction fairly predictable with the Democrats trying to save Mrs. Clinton.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. BARBARA BOXER (D), CALIFORNIA: </b>Hillary Clinton followed the letter of the law and the spirit of the law and all the rest is total politics.</p>                \n                \r\n\n            \n                <p><b>ED RENDELL (D), FORMER GOVERNOR OF PENNSYLVANIA:</b> But look, this country's infrastructure has fallen apart. We have 47 senators who for the first time in the history of this country sent a letter to a foreign country undermining the President and we're talking about e-mails?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, Governor Rendell, we are talking about e-mails because national security is at stake. Also it's very unusual for an American secretary of state to be so secretive. By the way, Governor Rendell is a smart guy, he knows it's a big story. He is just toeing the government line.</p>                \n                \r\n\n            \n                <p>In addition we had some madness yesterday.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>KAHRAMAN HALISCELIK, TURKISH TV REPORTER: </b>Madam Secretary, why did you opt out not using two devices at the time and my second follow-up question is if you were a man today, would all this fuss being made be made? Thank you.</p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> I will leave that to others to answer but, as I said, I saw it as a matter of convenience and it was allowed.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, I truly hope this bogus sexism business is not going to be part of Hillary Clinton's campaign. I mean, that would just be awful.</p>                \n                \r\n\n            \n                <p>And that's what the e-mail stuff is all about -- whether or not Hillary Clinton will be elected president in 2016.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MARK HALPERIN, BLOOMBERG TV HOST:</b> I will tell you now, I believe this performance today probably calms the Democrats and I think this for the time being she is satisfied enough that it's partisan issue and that works to her benefit.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I disagree. It does not work to Mrs. Clinton's benefit at all. Yes, partisans on the left will vote for her no matter what, but there are millions of Americans in the middle. The perception now is that Hillary Clinton is not a standup person. She does not put forth the whole truth and nothing but the truth.</p>                \n                \r\n\n            \n                <p>It is true that Mrs. Clinton has at times been treated unfairly. But overall she has been the beneficiary of soft treatment by the media. However, that's beginning to change. The e-mail situation has embarrassed the press which largely supported her in the past.</p>                \n                \r\n\n            \n                <p>So it's safe to assume that Mrs. Clinton will not get the same treatment as Barack Obama whom the press continues to idolize. Therefore, her road to the White House will be more difficult.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The aftermath of e-mail gate", "description": "Talking Points 3/11", "date": "2015-03-12T12:17:38Z"}