{"vcmId": "93c5e7b8-994c-46c4-951d-6479a157adf1", "url": "http://www.foxnews.com/transcript/2015/05/06/bill-oreilly-defeating-jihad-by-not-being-dumb.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The Garland, Texas Police Department is keeping secret the name of the hero cop who shot two jihadists dead on Sunday -- that, of course, for his own protection as radical Muslims are a dire threat. We all know that.</p>                \n                \r\n\n            \n                <p>Now there's controversy over whether the anti-Muslim group who ignited the situation did a foolish or a noble thing.</p>                \n                \r\n\n            \n                <p>Donald Trump weighed in on the group's leader, Pamela Geller.</p>                \n                \r\n\n            \n                <p><b>(BEGIN AUDIO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> It looks like she is just taunting everybody. What is had she doing with drawing Mohammed. It looks like she's actually taunting people. You know, I'm one that believes in free speech probably more than she does. But what is the purpose of this?</p>                \n                \r\n\n            \n                <p><b>(END AUDIO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Mr. Trump is correct. By setting up a contest and awarding $10,000 for a depiction of the Prophet Mohammed, the American Freedom Defense Initiative spurred a violent incident. That wasn't smart, even though the group has its supporters.</p>                \n                \r\n\n            \n                <p>Mike -- I'm withholding his last name in Fairbanks, Alaska wrote, \"Megyn Kelly was completely right and you are completely wrong, O'Reilly. An event like this should be held daily. The Moslem world doesn't like it -- tough.\"</p>                \n                \r\n\n            \n                <p>Insulting the entire Muslim world is stupid -- Mike. It does not advance the cause of liberty or get us any closer to defeating the savage jihad. You may not have noticed but some Muslim countries are now fighting ISIS and al Qaeda themselves.</p>                \n                \r\n\n            \n                <p>Jordan and Egypt, two of the most powerful. So Mike, do you think it's a smart strategy, to insult the Muslim countries of Jordan and Egypt by besmirching their religious icon? Do you?</p>                \n                \r\n\n            \n                <p>Now the group that did the insulting says it's entitled to profane Mohammed because in the Islamic religion any kind of depiction of him is a sin. They say they can do that in America because of freedom of speech. Well that's true. They have the right to do it here. But again, it's stupid. It accomplishes nothing.</p>                \n                \r\n\n            \n                <p>There has been no program stronger than The Factor in speaking out against the jihad. We have severely criticized the Obama administration for being too timid and for allowing atrocities to go unpunished. So don't give me I'm soft on the jihad. I'm not. They deserve to be neutralized and removed from the planet. If President Obama was serious about fighting these fanatics, he would actually mobilize the 60 nations that have allegedly signed on to fighting ISIS. But it's dead. It's a big fraud. We all know that. The world conditions to do nothing.</p>                \n                \r\n\n            \n                <p>But insulting a religion with more than a billion followers world wide does not advance the cost of defeating the fanatical jihadists. It hurts the cause, does it not?</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Defeating the jihad by not being dumb", "description": "Bill O'Reilly's Talking Points 5/5", "date": "2015-05-06T12:08:50Z"}