{"vcmId": "9427f88c-6199-48de-aea5-e8f8ec926e7e", "url": "http://www.foxnews.com/transcript/2016/09/12/bill-oreilly-what-would-like-to-know-about-hillary-clinton.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Rosemary Browning who lives in Murfreesboro, Tennessee asked, \"What is Hillary Clinton's stand on Black Lives Matter?\"</p>                \n                \r\n\n            \n                <p>Mostly supportive, Rosemary even though her husband scolded the group for interrupting his speech. No Democratic candidate would dare call out Black Lives Matter and Mrs. Clinton is no exception.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON (D), PRESIDENTIAL NOMINEE:</b> Young people have taken to the streets, dignified and determined, urging us to affirm the basic fact that Black Lives Matter.</p>                \n                \r\n\n            \n                <p><b>(APPLAUSE)</b></p>                \n                \r\n\n            \n                <p>I will never stop working on issues of equality and opportunity, race and justice.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Second question from Cynthia and John Mesher who live in Ocean View, Delaware. \"There has been some speculation about Hillary Clinton's health. When did she last release her medical records?\"</p>                \n                \r\n\n            \n                <p>Secretary Clinton's doctor Lisa Bardack released a summary of Mrs. Clinton's health in July of 2015. She has seasonal allergies and hypothyroidism. But generally, said the doctor, she is in good health.</p>                \n                \r\n\n            \n                <p>Hillary Rooney who lives in Stuart, Florida wants to know, \"How did Hillary Clinton get a concussion that occurred just before she was about to testify on the Benghazi situation?\"</p>                \n                \r\n\n            \n                <p>In December 2012, Secretary Clinton fainted, while sick with a stomach virus. She fell and sustained a concussion. During treatment, a blood clot was discovered in her skull and was neutralized with blood thinners. Mrs. Clinton's testimony on Benghazi had to be delayed because of that. Later, she told the FBI she could not recall some of the briefings she received around the time of the concussion.</p>                \n                \r\n\n            \n                <p>Joe Shriver from Costa Rica. \"Why did Hillary Clinton not respond to former Ambassador Christopher Stevens' recommendation to move the U.S. intelligence facility in Benghazi?\"</p>                \n                \r\n\n            \n                <p>We can find no evidence the ambassador ever made such a request. He did, however, ask for increased security for American personnel in Libya. That was denied by undersecretary of state Patrick Kennedy. Secretary Clinton was asked about the security screw up at the House Benghazi hearings.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: You know how many security requests there were in the first quarter of 2012?</p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON (D), PRESIDENTIAL NOMINEE:</b> For everyone or for Benghazi?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: I'm sorry, yes ma'am. Related to Benghazi in Libya. Do you know how many there were?</p>                \n                \r\n\n            \n                <p><b>CLINTON</b>: No, I do not know.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: There were just over 100 plus. On the second quarter, do you know how many there were?</p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> No, I do not.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Ma'am, there were 172ish. Had been 171 or 173. How many were there in July and August and then in that week and a few days before the attacks, do you know?</p>                \n                \r\n\n            \n                <p><b>CLINTON</b>: There were a number of them, I know that.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Yes, ma'am, 83 by our counted.</p>                \n                \r\n\n            \n                <p><b>CLINTON</b>: Uh-hm.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> That's over 600 requests. You have testified here this morning that you had none of those reach your desk, is that correct, also?</p>                \n                \r\n\n            \n                <p><b>CLINTON</b>: Yes. That's correct.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Bottom-line, former secretary of state maintains she was unaware of any security requests from Libya.</p>                \n                \r\n\n            \n                <p>Sue Boyd writes from Las Vegas. \"What was the flesh colored device in Hillary Clinton's ear when she was talking to Matt Lauer earlier this week.\"</p>                \n                \r\n\n            \n                <p>The Clinton campaign denies any device was in Mrs. Clinton's ear. They say it was a lighting reflection that gave rise to the assertion. Now, tonight, I have to confess I do have a -- right here. So they -- the director can yell at me, his name is Chet. I will give you his home address at the end of the program.</p>                \n                \r\n\n            \n                <p>All right. Ronald Angeles (ph) who lives in Stanford, Connecticut, wants to know what Hillary Clinton's association with the radical writer Saul Alinsky was. Hillary Clinton did her college thesis on Wellesley on Mr. Alinsky, a very far left guy. She interviewed him and said nice things about him. He offered her a job which she turned down to attend Yale Law School. Ironically in high school, Hillary Clinton was a big Barry Goldwater supporter. About as far as away from Sal Alinsky as one can possibly get.</p>                \n                \r\n\n            \n                <p>Next question from Tony Ford who lives in Las Vegas as well. \"What are the facts in Hillary Clinton's leaving the Watergate investigation?\"</p>                \n                \r\n\n            \n                <p>She left because President Nixon resigned. As an attorney working for the House Judiciary Committee, her work was over when Nixon took off in that helicopter and departed for California. Now, there were reports she was fired from her job. Those are not true.</p>                \n                \r\n\n            \n                <p>John Chevette who lives in Maine wants to know if an American citizen can sue Hillary Clinton or any other official if they don't like their conduct in office. In 1985 the Supreme Court decision makes it almost impossible to win a legal judgment against a government official over job performance. A lot of mumbo jumbo in a ruling but that's the end game.</p>                \n                \r\n\n            \n                <p>And finally Dr. Corrine Michaels from Manhasset, New York wants to know where Brian Pagliano is. Mr. Pagliano, a long-time aide to Hillary Clinton worked at the State Department and handled her private server at her Chappaqua, New York home. The FBI granted Pagliano immunity in the email case. But what he told the bureau remains a mystery. And where he is right now, also a mystery. Very good questions.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: What you would like to know about Hillary Clinton", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 9/9", "date": "2016-09-12T12:00:32Z"}