{"vcmId": "945bcc04-588c-4a8f-9246-99f9f2655e14", "url": "http://www.foxnews.com/transcript/2017/04/04/bill-oreilly-civil-war-in-congress.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It is really all about hating Trump not partisan politics. There's no doubt that Judge Neil Gorsuch is qualified so sit on the Supreme Court and he will. A confirmation coming on Friday one way or another. Republicans in the Senate must prevail on the judge or the entire party and the President will be greatly damaged. And that's exactly what the Democratic Party wants.</p>                \n                \r\n\n            \n                <p> The strategy is simple, oppose every change the President wants to make everything he wants to do. Create as much mayhem as possible and then tell the American people Mr. Trump doesn't know how to govern. Meanwhile, the American people get hammered because worthy people like Judge Neil Gorsuch are (audio gap) policies are sabotaged. (audio gap) Gorsuch hearings. I don't want to compare the judge to Jesus but it was exactly the same thing.</p>                \n                \r\n\n            \n                <p> Democratic senators acting like -- trying to trap the judge into saying something controversial. Trying to paint the man as someone not worthy of being on the court. Now, fair-minded folks respect sincerely held political differences, I know I do, but political hit jobs are obvious. And that's what those hearings featured. They have questions designed to demean the judge.</p>                \n                \r\n\n            \n                <p> So, we now have an opposition agenda primarily based on hatred not what's best for the country. Just listen to the rhetoric on the left. It is as vitriolic in the extreme. The Trump haters justify their behavior by saying the President is destroying the country, the issues of illegal immigration, global warming, National Security have created fury on the Left and as Talking Points stated last week, moderate Democrats are under heavy pressure to support the hate Trump strategy.</p>                \n                \r\n\n            \n                <p> Very interesting to watch Missouri Senator Claire McCaskill declared Judge Gorsuch as being cold against the regular folks. Missouri is trending Republican these days so the Senator may come to regret her stance. Finally, many Republicans oppose President Obama's agenda. There was little common ground there but five GOP senators voted to confirm the very liberal Elena Kagan to the Supreme Court.</p>                \n                \r\n\n            \n                <p> President Obama got his trade authority and debt limits were raised. The system was strained under Mr. Obama but it functioned. Now political hatred is directly threatening our Republic and we the people will pay a huge price if things don't change. That is \"The Memo\".<br> </p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: A civil war in Congress", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 4/3", "date": "2017-04-04T13:10:00Z"}