{"vcmId": "963ac92a-3fe7-4815-a10c-5a9657fa58a3", "url": "http://www.foxnews.com/transcript/2015/06/24/bill-oreilly-is-american-compact-falling-apart.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>There was heavy concern among the founding fathers about whether we the people would be able to govern ourselves after breaking away from England. Some early leaders like John Adams and Alexander Hamilton did not really believe the folks could come together to form a vibrant democracy. Adams and Hamilton favoring a strong central authority to dictate behavior. They were wrong. The individual states prospered and America became the most powerful country the world has ever seen.</p>                \n                \r\n\n            \n                <p>But we are not a perfect country. Blacks have been treated horribly, and that fact still resonates today. Also Native Americans were exploited and brutalized, so were many whites as the nation forged a civilization.</p>                \n                \r\n\n            \n                <p>But now some who hate this country are trying to tear down the social fabric. They're doing so by dividing Americans along racial and economic lines.</p>                \n                \r\n\n            \n                <p>Listen to this exchange on CNN International.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>Is racism built into this country? Is it in the hearts of many Americans?</p>                \n                \r\n\n            \n                <p><b>LESSANE:</b> Oh, I definitely think that's the case. We see it playing out in the narratives that we see in the media, the way that our president is described and stereotyped and caricatured, the way that black children are considered thugs and when their white counterparts do the same sorts of things they are said to have had mental illness. There is definitely a narrative where black people are consistently and historically being, you know, described as violent, savage, wild, and that -- this isn't anything new.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That goes all over the world CNN International and that kind of stuff sends a hateful message to younger Americans in particular and others around the world who don't understand America.</p>                \n                \r\n\n            \n                <p>As usual, the stats tell the true story. According to the FBI, there were 1,163,000 violent crimes in 2013 -- last stats available. Only 3,500 were classified as race-based hate crimes. So you can see that a nation of 320 million people, we are not awash in racial warfare. In fact legal protections make it almost impossible to be outwardly hostile to a minority in the workplace.</p>                \n                \r\n\n            \n                <p>I have traveled to 80 countries, I can tell you there is more racial harmony in the U.S.A. than in 90 percent of the places that I visited. Yet, the America haters are trying to brand this country as racist. And they are succeeding to some extent.</p>                \n                \r\n\n            \n                <p>Now back to the social contract. The men who designed American well understood that each of us have responsibilities as citizens. We must obey the law. We must work for our daily bread. We should pay enough attention to elect honest leadership. But how many of us are fulfilling our part of the bargain? With more than a million violent crimes every year in the U.S.A. there is a problem.</p>                \n                \r\n\n            \n                <p>And now with nearly half the country, willing to vote for a socialist for president, another huge problem is brewing. By the way that stat is from a recent Gallup poll.</p>                \n                \r\n\n            \n                <p>The truth is America is changing. And those that dislike the country are taking advantage of all the chaos. They're selling rank propaganda that white supremacy drives the government. That the working man and woman cannot get ahead. That all authority is corrupt. White privilege.</p>                \n                \r\n\n            \n                <p>That's corrosive, hateful and dishonest in the extreme. Yet, if you defend America as we do here on The Factor, you will be viciously attacked. And few defenders will come to your aid. That's why the haters are making so much progress.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Is the American compact falling apart?", "description": "Bill O'Reilly's Talking Points 6/23", "date": "2015-06-24T12:19:24Z"}