{"vcmId": "9651170c-6484-4850-b526-922c5b48a0bf", "url": "http://www.foxnews.com/transcript/2017/01/25/analyzing-president-trump-job-approval-rating.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 24, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Thanks for staying with us, I am Bill O'Reilly in the FACTOR Follow-Up segment tonight. Baseline for Donald Trump's jobs approval rating in the White House. Gallup is first up. The polling outfit has 45 percent approving, 45 percent disapproving, 10 percent, no opinion. You may be wondering why a job approval poll is taking almost before Donald Trump is on the job. Here now to explain that, from Austin, Texas, Karl Rove. So, he is in the office 12 seconds, they got a job approval rating. Why?</p>                \n                \r\n\n            \n                <p><b>KARL ROVE, FORMER PRESIDENT GEORGE W. BUSH SENIOR ADVISOR</b>: Well, you used the right word in your introduction to the piece. Baseline. You want to get a number that is there are the very beginning. What is interesting is, if you look at recent presidents, that number, this baseline number that is received in literally the days after the President is sworn in, is pretty close, generally, to what the President elects favorability rating is going into the inaugural.</p>                \n                \r\n\n            \n                <p>Here are the last four presidents. Right after the election, Donald Trump had a 42 percent favorable. After the election, he was the President. Just before the inaugural on Gallup, it was a 40 percent. And the post- inaugural, how do you think he is doing? Forty five. For Obama, 68, right after the election, 78, just before his inaugural. And 68 right after inaugural.</p>                \n                \r\n\n            \n                <p>Probably, he had the difference between those two numbers is, there are ten or 12 points of people saying, well, I like them, but I'm a Republican or I'm a conservative and I don't like what he is doing in office. George W. Bush, controversial election, 53 percent favorability after the election, 62 just before his inauguration, 64 right after. Bill Clinton, 58 at the time after the election, 66 upon his inaugural up, 65 for his baseline.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, Trump got the biggest bounce from the inauguration of any of the four that you have on your little white card. That is interesting. But you know, when I saw the number this morning for the first time, I was surprised that it was so high. I thought Trump would be down in the 30s because he is a bomb thrower and he comes in and he is not like any other politician, that we have ever seen elected to the presidency. He has sworn to blow up the system. He offends everybody at one time or another. And I said, wow, he is at 45, that is not bad.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Well, if what you are saying is 45 is good compared to where you thought he would be, you are probably right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Compared to who he is. Compared to who he is, you know?</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: Yes. But 45 is not a great number. He is going to be in unusual position. He ran an unusual campaign. He is going to have to be an unusual president because the only way that he is going to be able to build political credit to get things done now is to get things done. That is why the last couple of days have been important to be -- it will be interesting to see five or six years the --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But we've got the Republican -- he's finally has a Republican machine behind him. One more question, Jeff Sessions, Attorney General, designated, they put him off for a week for the vote. Anything going on behind the scenes there?</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: No, Democrat senators have the power to withhold a vote for a week, to delay it for a week. But this is really irresponsible. I have known Jeff Sessions literally since college. It is appalling to me that this man, this good and decent man, is being attacked for being a bigot. People don't seem to understand that in the 1960s, if you are a Republican in Alabama, you were a racial moderate because all of the bigots were over there supporting Democrat George Corley Wallace. This is a guy who desegregated the Alabama schools, who prosecuted for murder the leader of the clan and the Democrats, for political purposes --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: -- for sheer political joy --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Demonizing him.</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: -- are holding this man up. Yes. Demonizing him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's bad.</p>                \n                \r\n\n            \n                <p>All right, Mr. Rove, we appreciate it as always.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Analyzing President Trump's job approval rating", "description": "Karl Rove joins 'The O'Reilly Factor' to examine the new Gallup poll", "date": "2017-01-25T13:10:12Z"}