{"vcmId": "96c2eec6-a8b0-47f6-bcf8-2839700a2ac8", "url": "http://www.foxnews.com/transcript/2016/04/06/tavis-smiley-reacts-to-2016-presidential-politics.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 5, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thanks for staying with us. I'm Bill O'Reilly in The Factor \"Follow-Up\" segment tonight, the minority vote, 2012 Mitt Romney captured six percent of the Black vote. President Obama 93 percent. That's a huge advantage for the Democrats, obviously. Writing in the \"U.S.A. Today\" on March 3rd, Tavis Smiley said, quote, \"If Donald Trump is indeed the Republican nominee it might be a miscalculation for Democrats to take for granted that black voters are a lock for their nominee, unquote.</p>                \n                \r\n\n            \n                <p>Mr. Smiley the author of a brand new book called, \"50 For Your Future: Lessons From Down The Road.\" He joins us now. So, I was surprised when I read your \"U.S.A. Today\" column. I know you are no fan of Mr. Trump.</p>                \n                \r\n\n            \n                <p><b>TAVIS SMILEY, HOST, TAVIS SMILEY SHOW ON PBS</b>: Nope.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But why do you think that Blacks would give Mr. Trump or Ted Cruz or John Kasich a look?</p>                \n                \r\n\n            \n                <p><b>SMILEY: </b>Couple of things. One, I'm tired of Black vote being taken for granted by one party being ignored by the other party. Number one. Number two, I did write that in fairness before Donald Trump can completely lost his mind and became the sort of the racial arsonist and setting fire everywhere he goes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Let me stop you there. You called him a racial arsonist on your show and just repeated that.</p>                \n                \r\n\n            \n                <p><b>SMILEY: </b>Uh-hm.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What comment set you off? What did he say?</p>                \n                \r\n\n            \n                <p><b>SMILEY</b>: You are off the air at 8:50, you haven't got enough time for me to run --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Just give me one.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> Oh, come on! You are wasting good television time, Bill. His anti-immigrant stance. His anti-Muslim stance. His mall-treating and that of his supporters the mall treating of African-Americans in the audiences at these rallies. Don't ask a silly question. You know better than this.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It is not silly though. If you look at the context and I'm not defending Donald Trump's policies. The folks can decide that. But if you look at the context of protecting Americans from a flood of immigrants that come in here illegally. And also Muslim refugees who are not vetted very well as the FBI director said he couldn't do, it's not an attack on a race that he is doing. It's a policy, it's hard, it's harsh, but it's policy.</p>                \n                \r\n\n            \n                <p><b>SMILEY</b>: It's not just harsh, Bill. But he is painting with a broad brush and it has the tone of xenophobia with it when he does that. If I were going to take Dylan Rood, the unrepentant Dylan Roof who walked in that black church in South Carolina and use that example to paint every white male in America, you wouldn't like and what is what Donald Trump does to Muslims and with Hispanics.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But there wouldn't be any policy around Dylan Roof. What I'm disturbed at when you say his --</p>                \n                \r\n\n            \n                <p><b>SMILEY</b>: A hate crime that is against the law. That is a policy, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. But there isn't a policy that connects to the nation. When you use the word racial arsonist, okay, that conjures up to me David Duke and these kinds of people who their soul reason for being is to run down blacks or Hispanics or Muslims or whatever.</p>                \n                \r\n\n            \n                <p><b>SMILEY: </b>And it took Mr. Trump too long.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He is not that way.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> It took Mr. Trump too long to -- denouncing one David Duke and others with the robocalls.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But Travis, you make mistakes and so do I. That doesn't mean --</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> That's not a mistake. That's not a mistake.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I have known the man for a long time. I have never seen him do anything racial.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> You live your life by a certain set of immutable principles. I live my life by a certain set of principles. And when you live your life by a certain set of principles, there are some mistakes you just don't make. It's fundamentally who you are. And this election is fundamentally about what kind of nation that will be.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All I can tell you is that, I have known the man a long time and I have never seen him cast aspersions at any group at all.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> You might not have seen it but the rest of the country has all during this campaign.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. I have been around him much more.</p>                \n                \r\n\n            \n                <p><b>SMILEY: </b>But here's the problem. We are watching one Donald Trump on the news every day. We watch him live on network television every day. And everybody who knows Donald Trump keeps saying to me and all your viewers that ain't the Donald I know. Who is the real Donald? Will the real Donald stand up?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I can't answer the question. I just can tell you what I know.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> Should we elect someone who we think we know but really don't know.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That is what they asked about Barack Obama. And exact question.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> The difference was this. The difference was, that Barack Obama campaigned to all of America. I think that any person who does not campaign to all of America ought to be automatically dismissed and disqualified.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But that's your opinion.</p>                \n                \r\n\n            \n                <p><b>SMILEY</b>: No, it's not my opinion.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Sure, it is.</p>                \n                \r\n\n            \n                <p><b>SMILEY</b>: Okay. It is my opinion.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> It ought to be yours. Here's my point.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>If you want to be president of the entire country --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm not involved -- I don't like the divisiveness either.</p>                \n                \r\n\n            \n                <p><b>SMILEY: </b>Yes. Campaign to the entire country. And I challenged everybody on that. Not one slice of it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. But you know, if you want to have that standard of behavior, Hillary Clinton and Bernie Sanders are divisive as well. They are not campaigning for pro-life people. They don't respect pro-life people. That's just one example. Can I give you a thousand?</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> Trump has his opinions. They have their opinions. I'm not talking about opinions.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. But you're talking about --</p>                \n                \r\n\n            \n                <p><b>SMILEY: </b>No, no, no, no.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You don't want to be divisive.</p>                \n                \r\n\n            \n                <p><b>SMILEY</b>: I'm talking about running a segregated campaign. If you want to be president of the entire country, then you could campaign to everybody.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Trump would tell you, he wants Hispanic votes and he wants Black votes.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> They will say that but has Ted Cruz campaigned in Black America? Has he campaigned in Hispanic America?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He is Hispanic.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> Exactly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: He's a Cuban.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> But has he gone after the Hispanic vote with a real policy program? Of course not.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You know what? Again, I'm not on campaign teams but when I see them saying we want a good economy that's everybody.</p>                \n                \r\n\n            \n                <p><b>SMILEY</b>: Come on. That's talk. That's talk.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We are running out of time and I don't want to because you have a good book. All right? It's \"50 For Your Future.\" It's lessons. In this book, you say that and we only -- a short answer and I will -- if you want to come back because we spent a lot of time on this.</p>                \n                \r\n\n            \n                <p><b>SMILEY</b>: Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You say to people, look, if you have a certain philosophy in life and somebody is intruding you on that, making you feel bad, walk away, right? That's one of your lessons here in this book.</p>                \n                \r\n\n            \n                <p><b>SMILEY</b>: I'm not sure I would put it quite like that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, that's the essence of it. If somebody is really taking you away from your life experience.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> What I'm arguing is you have got to be your authentic self and live your life on your own terms. You can't transcend where you are for the sake of pleasing other people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay.</p>                \n                \r\n\n            \n                <p><b>SMILEY: </b>Yes. So, this book is basically a philosophy. And again, I owe you a segment on it a philosophy about how to be happy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How to live a better life. Okay.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right, Tavis. Always a pleasure to have you. Thank you.</p>                \n                \r\n\n            \n                <p><b>SMILEY:</b> I appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Tavis Smiley reacts to 2016 presidential politics", "description": "Talk show host and author analyzes the White House hopefuls on 'The O'Reilly Factor'", "date": "2016-04-06T12:16:31Z"}