{"vcmId": "97f78e9e-e9d8-4878-9926-2393c31a623e", "url": "http://www.foxnews.com/transcript/2016/08/05/new-battleground-polls-shakeup-presidential-race.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 4, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>ERIC BOLLING, FOX NEWS HOST</b>: Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching us tonight.</p>                \n                \r\n\n            \n                <p>Let's get straight to our top story, the topsy-turvy presidential election. A new FOX poll of registered voters shows Hillary Clinton increasing her lead against Donald Trump. In a head to head matchup, Clinton was up by 10 percentage points, 49 to 39, compared to a six-point lead a month ago. Also to new battleground polls, have solid news for a Clinton's campaign.</p>                \n                \r\n\n            \n                <p>In New Hampshire, a WBUR poll has Hillary with a 17-point lead over Trump, 51 percent to 34 percent. And in Pennsylvania, a Franklin Marshall College poll shows Hillary with an 11 point lead of 49 percent to Trump's 38 percent. Now despite the poll numbers and the criticisms he's endured, even from some of his biggest supporters, Trump says, things are still on track with his campaign.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL NOMINEE:</b> So, I just want to tell you the campaign is doing really well. It's never been so well-united. We started on June 16th. I would say right now it's the best in terms of being united that it's been since we began.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Joining us now with reaction from Washington, Chris Wilson, former director of Research and analytics for Ted Cruz's presidential campaign. And from Little Rock, Arkansas, Trump campaign senior adviser Sarah Huckabee. Sarah, Mr. Trump finds himself in a very unusual position, second place.</p>                \n                \r\n\n            \n                <p><b>SARAH HUCKABEE, TRUMP CAMPAIGN SENIOR ADVISOR</b>: Look, Trump got a bump out of his convention. Hillary got a bump out of hers. This is going to be a very close election. And as we move closer to it, Americans are going to get to decide on one big thing. Do they want to keep our country safe or do we want to keep it free or do we want to lose it? And I think when the time comes to cast a ballot, the choice is going to be very clear, and they'll going to pick Donald Trump over Hillary Clinton and he's going to become the next president.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Sarah, but they both had their conventions, and the Hillary Clinton lead about a month ago was six and now it's up to ten in the FOX News poll. So she got a bigger bump out of hers.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> Well, Donald Trump was up seven right after his. So, I mean, there's a 13-point shift, that's much bigger than the lead that Hillary Clinton has right now. She just came off of her convention. Again, I think the biggest things we have to look at in this race or what are the big issues that people are voting on. The economy and national security. And who does better on both of those issues? Donald Trump, on both of the two biggest issues that actually are going to decide this election. And that's why I think hands down he's going to beat Hillary Clinton.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Now, Chris, the talk of the week is been that there may be some sort of GOP intervention going on. What do you hear of this? What do you think of this? And by the way, is this a good idea if you want unity to the party?</p>                \n                \r\n\n            \n                <p><b>CHRIS WILSON, REPUBLICAN POLLSTER:</b> Well, I think when there's smoke, there's fire. And the fact is, when you hear Trump saying that there's no problems on his campaign, yet he's fired at least two people that I'm aware of this week, it makes me believe that it's probably not true that there's no problems, because you don't fire people if there are no problems. And the challenges I think that exists --</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Who did he fire?</p>                \n                \r\n\n            \n                <p><b>WILSON</b>: Well, there's been a couple of people from the Carson campaign that were like let go, his North Carolina state director was let go. So, there continues to be turnover there on the campaign trail. And we're moving into the fall, coming into the conventions, you really should have your core group around you. But back to your original point about the polls, I think the challenge that exists for the Trump campaign, Sarah is right, usually there's a sugar high polling effect after conventions.</p>                \n                \r\n\n            \n                <p>But the challenge is Hillary got a bump off of hers and now she's continuing to see it grow as you just pointed out. And it's not just national numbers. It's the state numbers. And when you're looking at the sort of deficits that he's now facing in New Hampshire, in Pennsylvania, in Ohio, and Pennsylvania and Ohio are states demographically that his past victories, he's got to win.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>WILSON: </b>And he's trailing those, I think it's a big problem.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Yes. There's no doubt. But I'll throw some shade on the fact -- this idea that it's all over for the Trump campaign. Sarah, $82 million last month raised.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE: </b>Absolutely, that's a huge number. A lot of that is from small dollar donors which means he can go back and raise from them again. Also another poll that people aren't talking about is that 70 percent of Americans say they want a change in this election. Donald Trump, this is the year of the outsider. And there's no bigger outsider. And I don't care who you are, nobody can argue that Donald Trump isn't the ultimate outsider. Hillary Clinton is the corrupt, Washington Insider. You contrast that, as we get closer to Election Day, again, that's another point in Donald Trump's set, another hand up. And this is a fundamental place where Donald Trump wins.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Does he pivot though? Does he pivot? There are some high profile people who've been in his camp who said, hey, Mr. Trump, you need to get back on focus, notably Newt Gingrich for one of them. And Rudy Giuliani, another one, saying hey, let's focus on the attack of Hillary Clinton rather than these satellite issues. He seems to be in agreement with that. But will he?</p>                \n                \r\n\n            \n                <p><b>WILSON</b>: Well, I think it's a good question. Sarah is talking about, he's an outsider is exactly right. If he can make it back about him being an outsider, that's going to put him back in a position that needs to be to win. But right now he's not making about Hillary Clinton being an insider. He's not making about being Obama's third term. Unfortunately right now, he's getting into fights with the Khan family where 70 percent of Americans disagree with them, say he was out of bounds.</p>                \n                \r\n\n            \n                <p>He's throwing babies out at his rallies. And he's got to get back on the message he had that won him in the primary quite frankly. And it got him the lead coming out of the Republican convention. And if he didn't get back on that message, I think that you'll see these numbers start to change. And let's face it. Romney trailed by a big margin until he went into that first debate, if you get Romney won that debate, first debate against Obama and those numbers flipped overnight.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Sure. Debates change the landscape completely. Sarah, I'll let you answer the same question. Should he listen to Newt Gingrich, Giuliani, and some of the others and refocus the message on I guess attacking Hillary Clinton?</p>                \n                \r\n\n            \n                <p><b>HUCKABEE</b>: Absolutely. Any time you're attacking Hillary Clinton in this election, you're winning. She's probably one of the most flawed candidates we've ever seen run for president. She shouldn't be running for president. She should be probably in prison for breaking the law and putting national security at risk. And so any time he can focus on that, and I think we're already seeing him do that at his rally today, aggressive contrast between he and Hillary Clinton. I think we're going to continue seeing that over the next 97 days until the election.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Chris, so we're making all this hay, the media is making this bill issue over these poll numbers. I get it, polls are important. But maybe it's a little too early. But then you go see these rallies, that Sarah pointed out today, the rally in Daytona Beach yesterday, thousands upon thousands of people come out and they are very energized.</p>                \n                \r\n\n            \n                <p><b>WILSON</b>: They are. But Romney had the same effect. I mean, Romney tells a great story about when he got off the airplane for the last time, they didn't even announce when he was landing and thousands of people turn out to greet him. And he really believe coming off that he's going to win.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>WILSON:</b> Rallies don't necessarily have the overall impact. And if this election is about Hillary Clinton, I think Donald Trump has a chance to win. But if it's about Donald Trump, he doesn't. And that's really the challenge he's got. I mean, I'll give you one of the number I think is important to come out of these polls is he's only getting 17 percent of Republicans to vote for him. That's the problem.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Guys, I have to go. I ran out of time. Thank you very much. Chris and Sarah, thank you.</p>                \n                \r\n\n            \n                <p><b>WILSON:</b> Thank you.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "New battleground polls shakeup presidential race", "description": "Analyzing the state of the Trump and Clinton campaigns on 'The O'Reilly Factor'", "date": "2016-08-05T12:21:51Z"}