{"vcmId": "9835d0a7-fb51-4cdd-8923-ab403c8d499a", "url": "http://www.foxnews.com/transcript/2016/02/23/bill-oreilly-south-carolina-vote-and-other-stuff.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Realistically, now, down to Trump, Rubio and Cruz on the republican side, it would take a miracle for Carson and Kasich to rise up.</p>                \n                \r\n\n            \n                <p>On the democrat front, Hillary Clinton won the Nevada caucus because minority voters supported her. Very good news for the secretary. Talking points predicted Trump would win South Carolina and that nonwhite voters would secure the nomination for Mrs. Clinton.</p>                \n                \r\n\n            \n                <p>And, while she is a lock, unless the FBI presents damning email evidence, the G.O.P. race is still in play. Donald Trump's support is loyal and about a third of republican voters will back him. However, 48 percent of G.O.P. voters, according to a new Fox News Poll, do not believe Mr. Trump has the temperament to be President. He must overcome that.</p>                \n                \r\n\n            \n                <p>Ted Cruz and Marco Rubio remained competitive although they have the high negative numbers in some areas as well. While I was away last week, a few things happened that voters should think about. First, there is no valid excuse for President Obama not attending the funeral for Justice Scalia. No excuse.</p>                \n                \r\n\n            \n                <p>The no-show was disrespectful to Scalia's family and to the Supreme Court and demonstrates just how ideological Mr. Obama has become. I believe the President would have attended the funeral had the deceased judge been a liberal? So, if you are going to vote for someone based purely on ideology, expect divisive behavior as President Obama has demonstrated.</p>                \n                \r\n\n            \n                <p>Now, on to the Apple controversy. It is really simple. A terrorist was directly involved in the murders of 14 Americans. FEDs want to dissect his Apple iPhone in order to protect the folks goings forward. But, they do not have the password. Apple should, in this specific case, assist investigators. Theory walks when terror violence occurs.</p>                \n                \r\n\n            \n                <p>I say that with the caveat that the privacy of Americans is under assault, and that is wrong and dangerous. This country needs new laws to blunt high tech intrusions in many places bad people can tape you, copy your texts and even listen to your conversations using machines without legal consequence. Congress should stop that. But when violent terrorism strikes, Apple and everybody else must cooperate when directed by a judge. Period.</p>                \n                \r\n\n            \n                <p>Finally, the Pope. I would very much like to speak with him. And, if I can arrange that, I would like to bring the family of Kate Steinle with me. I would explain to Francis the facts about the murder of the 32-year-old Kate.</p>                \n                \r\n\n            \n                <p>I would tell him that because the U.S. Government will not, will not secure the southern border of the United States, a Mexican career criminal was able to illegally enter America six times after being deported five times.</p>                \n                \r\n\n            \n                <p>For decades, this man sold narcotics on the streets. And, was ultimately protected by the corrupt city and county of San Francisco, which allowed the illegal alien criminal freedom. Result? He shot and killed Kate.</p>                \n                \r\n\n            \n                <p>Then, after all of that, I would point out to the pope that the U.S. Congress was incapable of passing Kate's law, giving authorities more power to control illegal aliens who commit aggravated felonies in this country.</p>                \n                \r\n\n            \n                <p>Finally, I would suggest to Pope Francis, that millions of Americans have been harmed economically by our immigration system, which desperately needs reform. I think I could persuade the Pope that providing protection and enforcing settled law is certainly not unchristian.</p>                \n                \r\n\n            \n                <p>What is against the tenets of Jesus is to allow chaos that harms innocent people like Kate Steinle and her family. What I believe might infuriate Jesus is politicians who are sworn to uphold laws, ignoring their oaths in pursuit of power and votes. When human beings are being harmed, Christians have a sacred duty to try to stop that harm.</p>                \n                \r\n\n            \n                <p>Yes, there must be compassion for the poor and oppressed. And, no one is better in promoting that than Pope Francis. But social order and justice must be incorporated in to compassionate public policy. If not, harm will follow which, in America, it has. And, that is &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The South Carolina vote and other stuff", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/22", "date": "2016-02-23T13:06:37Z"}