{"vcmId": "99702ec9-b324-41e5-a6ac-834503ba4577", "url": "http://www.foxnews.com/transcript/2015/10/09/roseburg-residents-react-to-president-upcoming-visit.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 8, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Personal Story Segment\" tonight, as you may know President Obama will visit Roseburg, Oregon tomorrow to comfort the families of the nine dead and nine wounded after the terrible massacre there last week.</p>                \n                \r\n\n            \n                <p>The visit's controversial because Douglas County, where Roseburg is located, is gun country. President Obama is pushing for strict gun control.</p>                \n                \r\n\n            \n                <p>Joining us now from Roseburg, Bonnie Schaan whose daughter, 16-year- old Cheyeanne was shot in the back by the crazed gunman who committed suicide. Also with us Jessy Atkison, Cheyeanne's brother. How is your daughter -- how is she doing today?</p>                \n                \r\n\n            \n                <p><b>JESSY ATKISON, VICTIM'S BROTHER</b>: She is moving forward, making progress. I don't know how you expect anybody to cope with something that she saw. I have no clue -- she doesn't talk about it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Tell me a little bit about that -- Jessy. She is 16 years old. She's studying to be a nurse. All of a sudden she is in a life-threatening situation. Have you spoken with your sister? What has she said to you about it?</p>                \n                \r\n\n            \n                <p><b>ATKISON</b>: Sir, we don't talk about it. We talk about regular life stuff. We are not trying to dramatize or talk about what happened in there. I don't even know how to bring it up to her.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, the doctors, Bonnie, they are optimistic. I think she is in fair condition now but she is going to recover. That is what they tell us anyway. Is that what they're telling you?</p>                \n                \r\n\n            \n                <p><b>BONNIE SCHAAN, VICTIM'S MOTHER</b>: Yes, they are. And yes she will.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And everybody is praying for her. And I understand the community has been fantastic to you, is that correct?</p>                \n                \r\n\n            \n                <p><b>SCHAAN</b>: Yes, they have. We thank the hospital and all the responders that came here immediately. And yes, they are -- our community is pulling together as one. And we want to be left alone and just let us be, and take care of our people here.</p>                \n                \r\n\n            \n                <p><b>ATKISON</b>: Yes, we understand that the President is coming here Friday. And we understand the President has to be here, but we just ask him, please, God, please, media take off with Obama. Like, leave us alone, let us heal.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And I think that will happen. I think that will happen. I think once the President leaves, and he is not going to be there for a short time. Have you been told -- will the President visit your daughter in the hospital?</p>                \n                \r\n\n            \n                <p><b>ATKISON:</b> Nobody has told us anything about anything like that.</p>                \n                \r\n\n            \n                <p><b>SCHAAN</b>: We're just trying to be there for Cheyeanne.</p>                \n                \r\n\n            \n                <p><b>ATKISON:</b> The press and speculations -- they're the only place we've heard anything about this. We don't know who is getting visited.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Nobody -- you haven't been alerted or anything like that. That is interesting because everybody is kind of on edge as you know out there in Douglas County because it is a conservative area that doesn't appreciate this tragedy being politicized and I'm sure you two feel the same way.</p>                \n                \r\n\n            \n                <p>I sympathize with you -- you just want to get your daughter and your sister well and let the media take off and let the President do what he does. I sympathize with that 100 percent.</p>                \n                \r\n\n            \n                <p><b>SCHAAN</b>: And let our sheriff --</p>                \n                \r\n\n            \n                <p><b>ATKISON:</b> Leave our sheriff alone. Support him for standing up for his people.</p>                \n                \r\n\n            \n                <p><b>SCHAAN:</b> The way we do what is right for us in the way we need our community and how we do the way we do our thing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok.</p>                \n                \r\n\n            \n                <p><b>ATKISON: </b>Our county can take care of itself.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is there anything that you nee need, that Cheyeanne may need, or is everything in your estimation being done to the best of its ability?</p>                \n                \r\n\n            \n                <p><b>ATKISON</b>: Everybody is great as far as that goes. Everything is being -- is just that we're shielding her from everything, all the negatives like this.</p>                \n                \r\n\n            \n                <p><b>SCHAAN: </b>We don't want her to have to go through anymore and see us talking about it. And whatnot, right now.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok, so the point that you both are making if I can encapsulate is that after the President's visit tomorrow, you want the media to go. You just want to be able to have your daughter and your sister recover. And you are very happy with your community.</p>                \n                \r\n\n            \n                <p><b>SCHAAN:</b> And that is all.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And the way that it has responded. Is that right? Do I have it?</p>                \n                \r\n\n            \n                <p><b>SCHAAN:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>ATKISON:</b> Yes, sir.</p>                \n                \r\n\n            \n                <p><b>SCHAAN: </b>Yes, everybody come together, yes, that is what I'm saying -- we're saying in Douglas County.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I think that will happen.</p>                \n                \r\n\n            \n                <p><b>SCHAAN: </b>Thank you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And we appreciate you guys. I know it's a very, very hard time for you. We appreciate you guys talking to us tonight.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Roseburg residents react to the President's upcoming visit", "description": "Family of Oregon shooting victim respond to the controversial trip on 'The O'Reilly Factor'", "date": "2015-10-09T12:31:12Z"}