{"vcmId": "997a2be0-4d87-482b-975a-2728214a931d", "url": "http://www.foxnews.com/transcript/2014/11/26/bill-oreilly-reaction-to-michael-brown-grand-jury-decision.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Let's look at the facts first. Grand jury comprised of 12 American citizens heard 70 hours of testimony from about 60 witnesses. They also examined forensic reports, medical documents and police radio logs.</p>                \n                \r\n\n            \n                <p>The conclusion, that Police Officer Darren Wilson was not guilty of a crime when he shot Michael Brown to death on August 9th. In a moment, is it legal? We'll examine the evidence.</p>                \n                \r\n\n            \n                <p>But in nutshell, Mr. Brown close to 300 pounds became involved in physical altercation with the officer and was shot six times by Mr. Wilson who fired 12 shots in all. On the face of it, it seems to be a lot of shots.</p>                \n                \r\n\n            \n                <p>But again, the grand jury is our system and these folks decided no crime was committed. After the decision, there was looting and destruction, watched by millions all over the world, more than 80 people arrested, hundreds of thousands in damage.</p>                \n                \r\n\n            \n                <p>At least 16 people were treated for injuries. My question is where was the National Guard? Why were they not protecting the businesses in Ferguson? It's a small town. Where was the guard?</p>                \n                \r\n\n            \n                <p>And the lieutenant governor of Missouri wants to know the same thing.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>PETER KINDER (R), LT. GOV. OF MISSOURI:</b> Here's my question that the governor must answer. Is the reason that the National Guard was not in there because the Obama administration and the Holder Justice Department leaned on you to keep them out?</p>                \n                \r\n\n            \n                <p>I cannot imagine any other reason why the governor who mobilized the National Guard would not have them in there to stop this before it started.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, Mr. Kinder's opinion is speculation, but certainly Governor Nixon who held a press conference today must explain why the businesses were left unprotected and explain not only in words but we must see what his policy was because, by not putting the guard in Ferguson last night, the looters ran wild.</p>                \n                \r\n\n            \n                <p>This afternoon, the mayor of Ferguson blamed Nixon for not deploying the guard and if that is found to be true, Nixon should resign his office. The lack of proper protection by the National Guard put responders, firefighters, and police officers in physical jeopardy.</p>                \n                \r\n\n            \n                <p>The property loss was inexcusable if it could have been prevented. Most Americans despise these looters, who have dishonored the Brown family. Then again, Michael Brown's own stepfather was captured on tape soon after the decision was announced doing this.</p>                \n                \r\n\n            \n                <p><b>(VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Extremely disturbing. Again, people who loot and burn after an 18-year-old American has been killed dishonored the man's legacy. If you want to protest peacefully, fine. If you sincerely believe there is injustice in our system, let your feelings be known.</p>                \n                \r\n\n            \n                <p>But these looters could not care less about Michael Brown. They are criminals. That was obvious last night. And then there are the pundits, the usual group of charlatans who will say anything to get a paycheck and attention.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>LOUIS BUTLER, FORMER FEDERAL PROSECUTOR:</b> It really does seem like the fix was in. There is a tradition here. There is a tragic tradition with this prosecutor. He is now 0 for 5 in cases in which he has taken to the grand jury, cop who shot unarmed people.</p>                \n                \r\n\n            \n                <p><b>MARK GERAGOS, CRIMINAL DEFENSE ATTORNEY: </b>I will make the statement right now. I will bet you his two assistants did not ask for an indictment. He showed exact what his predisposition was. This was a forgone conclusion. This was a rigged game.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> By saying the grand jury process was rigged, Mark Geragos is calling the jurors themselves liars and worse. You can say you disagree with the grand jurors, but to call them corrupt is an outrageous smear.</p>                \n                \r\n\n            \n                <p>The whole case makes America look bad. There is nothing good about it last night's exposition in Missouri was flat out disgraceful. Period. That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Reaction to the Michael Brown grand jury decision", "description": "Talking Points 11/25", "date": "2014-11-26T13:35:17Z"}