{"vcmId": "997c962b-f879-4183-ab5a-687608bb1244", "url": "http://www.foxnews.com/transcript/2017/02/28/is-hatred-on-rise-in-us.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 27, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> In the \"Impact Segment\" tonight, over the week in Philadelphia, another Jewish cemetery was vandalized. As many as 100 headstones at the Mount Carmel Cemetery knocked over and desecrated. In addition, a number of Jewish community centers have received bomb threats around the country, leaving some say, hates on the rise in America.</p>                \n                \r\n\n            \n                <p>Joining us from Washington, Charles Krauthammer. You think hate is on the rise?</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, SYNDICATED COLUMNIST</b>: Well, the only way to know that would be in retrospect, from say, a year or two. We have often had spasms of incidents, many times, much of them being copycats, a lot of these today in Washington, a couple of Jewish community centers, a couple of schools were shot down or at least evacuated because of bomb threats. But I think the real story is here, that they are highlighting, or at least, we are seeing are highlighted in the press, anti-Jewish incidents. Now, why is that?</p>                \n                \r\n\n            \n                <p>The story for the last 15 years, at least the one that is presented by the press, has been Islamophobia. All the incidents targeting Muslims. Of course, trying to portray Americans as reacting to Islamic terrorism in a beastly way. But during those 15 years, and certainly, for the last five or so, the number of anti-Jewish incidents has been far greater and almost totally underreported. There are about four times as many anti-Semitic incidents over most of these years.</p>                \n                \r\n\n            \n                <p>In the last year, there was a slight changing of that ratio to about still more than two to one. And the hypothesis I would propose to you is, the story line during the Bush years and to a lesser extent, the Obama years, had to be the beastliness of Americans toward the Muslims. Of course, now, reinforced with the Trump actions. But now, we get this attention to these anti-Semitic incidents. True, there seems to be somewhat of an increase.</p>                \n                \r\n\n            \n                <p>But again, it is only a couple of months. We don't know if it is going to last. And I think the press, or at least, the implication is, there is of course, somehow, connected to the Trump ascendancy. He is encouraging it in subliminal ways. He hasn't been strong enough and denouncing it, et cetera. So, I am not yet impressed that there has been a great rise of anti-Semitism in the country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: It could be true but I am not sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't know what would drive that. There isn't a driver apparent. But I do believe it is copycat stuff, and some not see this, and then they go loud and do this same thing, this usually subsides.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Now, let me just say one thing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Go ahead.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: It is real in the lives of the people --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Oh, absolutely.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: Who work in the communities, who work in the schools, the parents of the kids. So, you know --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Nobody wants to be terrorized by bomb threats or have their cemeteries desecrated. It is outrage. And Attorney General Sessions said that today. He said it is not going to be tolerated, and let's hope that the federal government is on it. And these people are prosecuted to do this stuff.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: What I want to caution against this is the instinct among many to link this with Trump. We don't know if it is a real increase yet. We will see. That is number one. And number two, show me the connection.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. But they don't care about showing you anything. If they can link it to Trump, they will link it to Trump. That is the age we live in.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER</b>: If there is an earthquake --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know, look, we just did that with the press, we know the press hates him. I don't think that Trump is going to pull back from the press. He is going to continue to confront them and the war is going to go on. Hey, Charles, always good to have you on. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Is hatred on the rise in the US?", "description": "More vandalism at Jewish cemeteries; Charles Krauthammer weighs in on 'The O'Reilly Factor'", "date": "2017-02-28T13:17:11Z"}