{"vcmId": "9aac265c-c594-4a47-9138-613c28719cae", "url": "http://www.foxnews.com/transcript/2015/03/13/bill-oreilly-killing-cops.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As we saw here in New York City, inflammatory rhetoric can get police officers killed. And remember back on December 20th, two New York City officers, Wenjian Liu, Rafael Ramos, shot dead in their car by a deranged man apparently set off by antipolice rhetoric.</p>                \n                \r\n\n            \n                <p>Last night, a similar situation occurred in Ferguson, Missouri, but the officers have survived. At 2:45 Central Time yesterday afternoon, Ferguson Police Chief Thomas Jackson resigned. That's what the protesters wanted. He and the city manager are now out thereof and a new power structure for Ferguson will emerge.</p>                \n                \r\n\n            \n                <p>However by 8:00 p.m. last night, an estimated 150 protesters had gathered outside the Ferguson police station. About 70 cops there to keep order. At 9:00 p.m.a protester was arrested for blocking a public street. 10:30 another protester also arrested for that. 45 minutes later a third protester taken into custody.</p>                \n                \r\n\n            \n                <p>All the while, there was some physical altercations. You can see them there within the crowd, but nothing dramatic. At 11:45 p.m. police say there were about 75 protesters left. But 15 minutes later, three or four shots rang out.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>(GUNSHOTS)</b></p>                \n                \r\n\n            \n                <p><b>(SHOUTING)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> There was just gunfire and now cops have guns drawn.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Two police officers shot and wounded. They have now been released from the hospital.</p>                \n                \r\n\n            \n                <p>Now, I believe the protesters did not -- did not -- shoot the officers. This was a calculated ambush by an anarchists, people who want to create violent situations inside the USA. The total population of Ferguson is just over 21,000 people, so less than 1 percent of residents were protesting last night. Why the low number? Because there was nothing to protest. The city's changing, trying to put the Michael Brown shooting behind it.</p>                \n                \r\n\n            \n                <p>But anarchism is growing in America. Whenever controversial situations arise, these people show up looking for trouble. And they are not always condemned. Listen to rapper Method Man going unchallenged on MSNBC.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>METHOD MAN, RAPPER:</b> This thing that happened I guess in Ferguson just now with the two officers -- sad, very sad. I hate to say that FBI report kind of played into this and these things shouldn't be happening, but you reap what you sow, in a sense.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, according to Mr. Method Man, because the FBI did an honest investigation, supervised by Attorney General Eric Holder, the two police officers reaped what they sowed? That kind of colossal ignorance drives violence and the NBC anchor sits there and says nothing? Good grief.</p>                \n                \r\n\n            \n                <p>Talking Points does not believe the police shootings last night were racial in any way. Again, they're an anti-American play. And it is the job of the press to expose the haters, not lump them in with legitimate protesters. Right now, that job not being done. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Killing the cops", "description": "Talking Points 3/12", "date": "2015-03-13T12:59:40Z"}