{"vcmId": "9b5ec945-22fb-4b50-b20d-18968940f9e5", "url": "http://www.foxnews.com/transcript/2016/06/14/donald-trump-sounds-off-on-president-obama-and-isis.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 13, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Campaign 2016\" segment tonight, the Orlando terror attack will have a direct bearing on the presidential vote. So we invited both Hillary Clinton and Donald Trump on the program this evening.</p>                \n                \r\n\n            \n                <p>Mrs. Clinton could not make it but Donald Trump joins us now from Manchester, New Hampshire. Why do you think President Obama is not fighting ISIS as aggressively as, perhaps, he could?</p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESUMPTIVE PRESIDENTIAL NOMINEE:</b> I think nobody knows, Bill. I have absolutely no idea. All I know is that he should be. Why he doesn't fight it and why he doesn't fight it with strength and with vigor, nobody knows. That's certainly a topic of conversation for plenty of people. But he is not doing a good job. That is for sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, if you don't know, and I don't know either, although I think that he believes that his outreach to the Muslim world that the President's personal outreach, he believes that intensifies terrorism directed at the U.S.A. I think he believes that. But you said this morning on \"FOX &amp; FRIENDS\" or you implied there may be a sinister reason for him not engaging ISIS more aggressively. Do you want to define that further?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I can't define it. I mean, nobody knows what's going on. Nobody knows why he doesn't have more anger. Why he doesn't have more competitive zeal. He is a competitive person. Why doesn't he have more competitive zeal to knock them out, Bill. I mean, look at what's going on. Look at what's happening? This Orlando attack was just absolutely horrendous and, yet, he still doesn't even use the word of radical Islamic terror.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. Listen, I hammered --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: He won't use the words.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I hammered him in the Talking Points for continuing that ridiculous thing. Now, Hillary Clinton has backtracked on that. We're getting in the second segment with Mr. Trump. We are going to deal with Hillary Clinton. I just want to keep it on the Orlando terror attack now. In your speech today in New Hampshire, you made a lot of reference to your policy of not allowing Muslims in here, okay, on a temporary basis.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Temporary until we find out what's going on.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Who they are?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: And what they have in mind.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. Okay. But there really isn't any linkage that I can find or the FBI can find between refugees, so-called refugees, all right, women and children, primarily, coming here and violence.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: So what are you asking?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Why do you think this is a centerpiece in anti-terror fighting if there really isn't any linkage in those kinds of folks coming over?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, I don't think you know that linkage yet? What's going to happen two years from now? What's going to happen 10 years from now? What's going to happen five years from now? Look at the Boston bombers. I mean, they were already here. Their family came here and they weren't radical when they were six, seven years old and all of a sudden they blew people up, I mean, during the Boston marathon. You just don't know what's going on here. You know, they listen to the internet and they fall in love with ISIS. Bad things are happening, Bill. And we have to get down to it, otherwise, we're not going to have a country at all. We're going to have this happening every weekend.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I mean, what happened to -- what happened in Orlando is so disgraceful and so shocking on so many levels, and we just can't have a country like this anymore, Bill. And we have to have a -- we need a president that's going to show passion to solve the problem. He sit there, he talks, it's almost like he is falling -- Bill, it's almost like he is falling asleep.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> There is an urgency. Now, in the Orlando situation, the FBI had the guy under surveillance, knew he was a bad guy, didn't have enough to charge him with anything, so they say, Director Comey spoke today. Do you believe the FBI botched that case?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Look, I'm a big fan of the FBI. There is no bigger fan than me. But look, they have had better days. Let's face it. You know, they had him twice and supposedly even a third time they were looking or thinking about it. And he was a bad dude. He was a bad guy. A lot of bad things said about him. And that was a big part of my speech. The Muslims have to turn people. The Muslims, you will find out, now all sorts of things will be said about this guy and people will say oh gee, why didn't we get him? They have to turn people in.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. All right. Now, that being said, that being said, he didn't commit any crimes. He was totally free record up until the attack on the nightclub. His father is a provocateur. His father is a pro-Taliban guy.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Would you do anything to this man and what could you do to him because we do have freedom of speech here.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: The father shouldn't have been allowed in the country years ago when he came here, alright? He was trouble then and he is obviously something is going on right now. Even the way he did that interview. I said what's going on? This is a guy, you know, I don't know, you call him a professional or you call him something. But the father shouldn't have been allowed to come into our country in the first place. That's why, your first question, you talk about coming into our country. We haven't found anything. They have only been here for a short period of time. What's going to happen in two years and five years?</p>                \n                \r\n\n            \n                <p>What's going to happen in 15 and 20 years? A lot of times the children, there seems to be no very good assimilation. A lot of times the children of people that come into the country become a big problem. I mean, you, again, look at the Boston bombers, I mean these two horrible beasts, they came in, I mean, the parents were here and they brought these kids in and they became radicalized. I think later on, I think when they were in the country. So, you know, bad things are happening, Bill. And we have a president who looks like he is falling asleep when he talks about the subject.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump sounds off on President Obama and ISIS", "description": "Presumptive Republican nominee joins 'The O'Reilly Factor' to react to the terror attack in Orlando", "date": "2016-06-14T12:26:11Z"}