{"vcmId": "9c73e885-34a9-48bf-b88c-950afa97e656", "url": "http://www.foxnews.com/transcript/2016/09/09/bill-oreilly-two-blunders-in-wednesday-night-defense-forum.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As you may know, both presidential candidates appeared on NBC last night to answer questions about national security. And they both made fairly significant mistakes. Now, as you know, we don't nitpick here, the candidate misspeaks or makes some minor error, we overlook it. But there were two moments last night that American voters need to think about. But first one was Donald Trump addressing a question about the Russian Dictator Putin.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> The man has very strong control over our country. Now it's a very different system and I don't happen to like the system. But certainly in that system, he has been a leader far more than our president has been a leader. We have a divided country.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, the reason that description of Putin was a mistake is that it legitimized the Russian leader who doesn't deserve the courtesy. Vladimir Putin is a killer who has corrupted his own country and who routinely violates international law. The reason Donald Trump is doing this is because he believes he can partner up with Putin and convince him to stop being a villain. If elected president, Trump will try to make Russia an ally, especially in the fight against ISIS. That strategy is not wrong. But praising Putin is. Let the tyrant earn friendly descriptions by doing something positive. Now, on to Hillary Clinton. Her blunder dealt with ISIS.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> We are not putting ground troops into Iraq ever again and we're not putting ground troops into Syria. We're going to defeat ISIS without committing American ground troops. So, those are the kinds of decisions we have to make on a case-by-case basis.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, I'm sure the ISIS savages were happy to hear that. Taking ground troops off the table. That means Secretary Clinton will essentially follow the Obama plan. Which is the doctrine of acceptable losses, allowing the ISIS savages to retain strongholds in Iraq and Syria while at the same time trying to limit their destruction all over the world. You as a voter can decide how effective that strategy has been since ISIS became a menace after the U.S. pulled out of Iraq.</p>                \n                \r\n\n            \n                <p>This talking points was stated before. The solution to the ISIS problem is to mobilize NATO and bring the fight to the terrorists both on the ground and in the air. And at the same time setting up safe zones for refugees so they don't have to flood into Europe. That policy would work and the U.S.A. would not -- would not have to do with the heavy lifting. Surely Hillary Clinton knows the NATO alliance is just sitting there doing very little to contain the jihadi. Why not mobilize the alliance?</p>                \n                \r\n\n            \n                <p>Again, big mistake telling ISIS what you will or will not do to them. Summing up, both candidates have to sharpen their international focus and with the 15th anniversary of 9/11 on Sunday, this is the perfect time to do it. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Two blunders in Wednesday night's defense forum", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 9/8", "date": "2016-09-09T12:28:41Z"}