{"vcmId": "9e1a56e1-2e5a-4acf-abc7-9e1185b90f86", "url": "http://www.foxnews.com/transcript/2016/02/09/bill-oreilly-how-american-media-is-covering-presidential-race.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Donald Trump and Bernie Sanders actually have a lot in common. They are both running renegade campaigns calling for a complete overhaul of the political establishment yet the two candidates are being treated very differently by the press.</p>                \n                \r\n\n            \n                <p>Let's take Mr. Trump first. I think it's safe to say most of the establishment media despises him. Mr. Trump's populist approach, straight talk about stopping illegal immigration and punishing those he believes are hurting America -- unsettling to many liberal folks. Thus when Trump is interviewed there is usually a question designed to put him on the defensive.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TAPPER: </b>Is Tuesday a must-win after the loss in Iowa?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> There wasn't a loss. I came in second and I only came in second because of the fact that Cruz took a lot of votes away from Carson that should not have been taken away. I mean he's apologized but I don't know what comes of that.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We'll get to the Cruz situation in a moment. But you can see Mr. Tapper defined the Iowa vote as a loss for Mr. Trump when overall that may not be the case.</p>                \n                \r\n\n            \n                <p>Again the Trump insurgency, and that's what it is, is a threat to liberal America and the media doesn't like it very much.</p>                \n                \r\n\n            \n                <p>On the Bernie Sanders' front things are friendlier. Sanders rarely attacked by the press even though some of his proposals are so far out there they would be impossible to achieve. Sanders saying things like college students are entitled to free education. Well, that's swell, but impossible due to the cost.</p>                \n                \r\n\n            \n                <p>The back and forth between Sanders and Hillary Clinton does get some coverage but because Sanders often gets the upper hand, it's played down. Yesterday, Sanders was asked about the verbal assassin David Brock who despite being a smear merchant is very close to Hillary Clinton.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BERNIE SANDERS (I-VT), DEMOCRATIC PRESIDENTIAL CANDIDATE: </b>Let's remember who David Brock is. He is a political attack dog. And I happen to like Hillary Clinton. But I am astounded by some of the people that she has hired including David Brock. This is the guy that Hillary Clinton is making the head of her Super PAC. I just don't understand.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sanders raises an excellent point but you will not hear much about that point because the left wing media often covers for Secretary Clinton. In fact, it was almost stunning that a moderator who works for NBC News actually hugged Sanders and Clinton after the Democratic debate last week. She hugged them.</p>                \n                \r\n\n            \n                <p>Could you imagine if Megyn Kelly had hugged the candidates? Can you imagine? The media would have run wild with it and it would have taken two weeks -- there are so many of them. And by the way, Megyn's questions to the Republicans were a thousand times tougher than what we saw at the recent NBC-run Democratic debate.</p>                \n                \r\n\n            \n                <p>Finally, we have established beyond any doubt that CNN's reportage of Ben Carson's Iowa situation last week hurt Dr. Carson in the voting. There's no doubt about it. We also told you that the Cruz campaign took advantage of the CNN misinformation and that may have skewed the results in Iowa.</p>                \n                \r\n\n            \n                <p>But the left-wing media didn't come down on CNN. They ripped Cruz. Does that sound fair to you? Both are at fault.</p>                \n                \r\n\n            \n                <p>Summing up all Republicans should understand they're not going to get a fair shake in the presidential election of 2016.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: How the American media is covering the Presidential race", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/8", "date": "2016-02-09T13:06:02Z"}