{"vcmId": "9f70ad1e-18a0-4ea1-997d-eac60a325d47", "url": "http://www.foxnews.com/transcript/2016/12/05/how-will-congressional-democrats-deal-with-trump-admin.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 2, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>WALLACE:</b> In the \"Impact\" segment tonight, how will congressional Democrats deal with President Trump? Congressman like Luis Gutierrez of Illinois maybe giving a hostile preview.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>REPRESENTATIVE LUIS GUTIERREZ (D), ILLINOIS</b>: I'm not going to this inauguration. I can't go to this inauguration because he continues to spew hatred, bigotry and prejudice even after he said he was going to bring us all together. He was going to unify us, but he is not. He continues to spew this kind of just hatred.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>WALLACE: </b>Joining us now with reaction, Delaware Democratic Senator Chris Coons. Let's start with those comments from Congressman Gutierrez. First of all, do you think that's appropriate? Do you think many Democrats will boycott Trump's inauguration and will you?</p>                \n                \r\n\n            \n                <p><b>CHRIS COONS (D), DELAWARE SENATOR:</b> Chris, I'm planning to go to the inauguration. I think regardless of how you feel about the election or who won, we owe it to our nation and to the world to show that we're going to participate in the orderly peaceful regular transition of power that has happened every four years throughout the entire history of our republic.</p>                \n                \r\n\n            \n                <p>I think this is an important moment for us to show our country and the world that democracy works that we embrace the outcome of the election and the chance to work together across the aisle.</p>                \n                \r\n\n            \n                <p>I choose to follow what I think has been the example of both President- elect Trump in his victory speech on the night of the election and then President Obama and Secretary Clinton in saying we all look for President- elect Trump to be successful.</p>                \n                \r\n\n            \n                <p><b>WALLACE:</b> I applaud you for your consistency, but not all of your fellow Democrats are being so consistent and, you know, I remember I was the moderator of the third debate and I asked Mr. Trump whether he would recognize the results of the election and he said I'm going to keep you in suspense.</p>                \n                \r\n\n            \n                <p>Hillary Clinton said that was horrifying. People, Democrats, liberals, said they were horrified about citing the peaceful transfer of power. Now though that it is Trump who is the president, not all of them are sticking to that principle.</p>                \n                \r\n\n            \n                <p><b>COONS</b>: Well, I think what concerned folks in that debate with that I will keep you in suspense was the possibility that Trump if he were unsuccessful in the election would contest it not through legal orderly means but would refuse to accept it.</p>                \n                \r\n\n            \n                <p><b>WALLACE</b>: But now you have got the Green Party calling for recounts in three states. The Clinton campaign saying they are going to participate. Isn't this hypocrisy?</p>                \n                \r\n\n            \n                <p><b>COONS</b>: I think what's different there what's distinguishable is that Jill Stein, who is the presidential candidate of the Green Party, let's be clear --</p>                \n                \r\n\n            \n                <p><b>WALLACE:</b> Right.</p>                \n                \r\n\n            \n                <p><b>COONS:</b> -- is following a legal process to file contest against those three states, elections, and asking for a recount. That's quite different from saying you refuse to accept the outcome. Speaking from myself, I accept the outcome of the election. I think it's clear that Secretary Clinton won the popular vote and that Donald Trump won the Electoral College and he is going to be our next president. And I think we need to move forward past this election.</p>                \n                \r\n\n            \n                <p><b>WALLACE</b>: What do you think of moving forward? What do you think of the Trump agenda as he has laid it out so far especially the Carrier event yesterday in Indiana on this issue of really being tough on companies leaving the United States?</p>                \n                \r\n\n            \n                <p><b>COONS</b>: Well, there has been some criticism of that. I think the editorial board of the \"Wall Street Journal\" said from a sort of conservative economic policy perspective that they don't want the president job owning specific companies.</p>                \n                \r\n\n            \n                <p>But I will tell if I had family that were working at that Carrier plant I would be pleased that their jobs were for now saved. What I would like to see is us coming up with a concrete bipartisan agenda for strengthening manufacturing in the United States.</p>                \n                \r\n\n            \n                <p>And if we focus on improving infrastructure and improving the skills of our workforce and making our country more attractive place for investment, I think there is a place we can grow manufacturing employment.</p>                \n                \r\n\n            \n                <p><b>WALLACE:</b> One more issue, what do you think of the choice of Retired General James Mattis for secretary of defense. Will you vote to give him the waiver because he has not been out of the military for seven years? Will you vote to confirm?</p>                \n                \r\n\n            \n                <p><b>COONS</b>: I was very encouraged by his nomination. I have talked to a number of friends Marine Corps veterans who know him from service and said very positive things about him someone who reads a great deal, who served more than four decades in the Marine Corps and has personal experience both as a combat commander in Afghanistan and in Iraq and is knowledgeable about the challenges that we face.</p>                \n                \r\n\n            \n                <p><b>WALLACE</b>: Real quick, do you have a problem giving him the waiver?</p>                \n                \r\n\n            \n                <p><b>COONS:</b> I understand some of my colleagues are raising a question about civilian control of the military. It's been more than 50 years since we have given such a waiver. I'll consider it. But I think it's important that President-elect Trump surround himself with a national security team with the kind of experience and character and success in the battlefield that General Mattis has demonstrated.</p>                \n                \r\n\n            \n                <p><b>WALLACE</b>: Senator Coons, thank you, always good to talk with you.</p>                \n                \r\n\n            \n                <p><b>COONS:</b> Good to be with you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "How will congressional Democrats deal with the Trump admin?", "description": "Sen. Chris Coons joins 'The O'Reilly Factor' to discuss party resistance and the president-elect", "date": "2016-12-05T13:24:47Z"}