{"vcmId": "a03dbdeb-e333-43f5-a07b-db8702db6ee6", "url": "http://www.foxnews.com/transcript/2015/03/03/bill-oreilly-danger-overseas-getting-closer.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Tomorrow Israeli Prime Minister Benjamin Netanyahu will address Congress, talking about the Iranian nuke situation. This will be the third time Mr. Netanyahu has spoken to Congress. The only other man to do that - - Winston Churchill.</p>                \n                \r\n\n            \n                <p>Now the Iranian deal is very complicated. The Obama administration wants a settlement that would stop Iran from immediately developing a nuclear weapon. But critics say the deal is too soft, that Iran would continue its weaponization and could convert it to nuclear very quickly if it decides to break its agreement.</p>                \n                \r\n\n            \n                <p>Right now, it's impossible to know just how close the Iranians are to having a nuke. The Israelis believe they're very close and the State of Israel say that's unacceptable because the Iranian Mullahs want to wipe Israel off the planet.</p>                \n                \r\n\n            \n                <p>But President Obama has to negotiate on behalf of Americans, not the Israelis. And if the President walks away from the Iranian nuke deal, war might follow. It's certainly possible, so the stakes could not get any higher.</p>                \n                \r\n\n            \n                <p>One of the problems with all the discord abroad is a perception of President Obama himself.</p>                \n                \r\n\n            \n                <p><b>RILEY:</b> This is a president who thinks America is the greatest threat to world stability. And I think our allies and our enemies have picked up on this, they see witness or they're concerned, Assad sees weakness, Putin sees weakness. Netanyahu is concerned, so concerned that he's coming to this country because he feels that we're going to cut a deal with Iran that is going to jeopardize the very existence of Israel, an ally of ours.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But again, it's hard to know exactly what treaty terms would prevent Iran from going nuclear. Therefore commentators like myself have to be careful. Nobody wants world war iii and nobody wants Iran to get a nuke. But definitive statements about the treaty negotiations are hard to back up.</p>                \n                \r\n\n            \n                <p>On the other matter, ISIS expansion, it's easier. Simply put, President Obama is not leading the fight, King Abdullah of Jordan is.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>KING ABDULLAH: </b>This has to be unified. I mean I have said this to leaders both in the Islamic and Arab world and to the world in general. This is a third world war by other means, this brings Muslims, Christians, other religions together in this generational fight that all of us have to be together.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But with all due respect to the king who's a courageous man, it will take America to galvanize the world against ISIS and obviously that's not happening.</p>                \n                \r\n\n            \n                <p>All in all the danger overseas growing, no question.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Danger overseas getting closer", "description": "Talking Points 3/2", "date": "2015-03-03T13:20:00Z"}