{"vcmId": "a23cf18e-b162-40e0-a695-159df0a0f47a", "url": "http://www.foxnews.com/transcript/2016/04/21/will-donald-trump-secure-nomination.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 20, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Now for the top story tonight. Let's bring in Donald Trump who joins us from Indianapolis. So, am I making any mistakes in my Talking Points, Mr. Trump?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, I don't know why you are so surprised. I mean, you know, we have been doing well. I have done well my whole life. I have had victories my whole life. So, we are going to have another victory. We have thousands of people -- we are in Indiana. We have thousands of people behind me. You probably hear. It's been amazing. And last night was so incredible in New York.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. But you have got to step back and you have to -- and I know you are. I mean, you know. This is -- what have you accomplished here has never really been done before in this country. I mean, you, a political outsider, with no legislative experience, wipe out 17 experienced, most of them politicians, Ben Carson the exception, wipe them out. And you are saying that I shouldn't be surprised and the folks shouldn't be surprised? Come on, you're surprised.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, I wouldn't say I'm surprised, Bill. You know, it's about jobs. It's about the economy. It's about a strong military. It's about the border.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You aren't surprised that you are going to be the nominee? When you started out, I know you are a confident guy. I know that. But you must have said, you know, this is kind of a long shot but I'm going to do it anyway because I believe in myself?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, you know, my message is make America great again. I think it's been a great message from the beginning. From the moment I announced on June 16th, it was, you know, pretty well accepted. And right after that shortly a few weeks after that we went to number one and I've stayed there for that entire period of time up until now. We have been center stage on every debate as you know.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: You know, meaning like number one in every debate.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: And I don't know. But I love the process. I love the people. I have seen so many people. So many millions of people. And this country is great. We have such potential, Bill. And we're not using it. With that being said, you know, my opponents. As you know because you reported it. I have had 55,000 negative ads. Fifty five thousand negative ads. And I won Florida after --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They don't care. Your supporters don't care. They don't care.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What you have managed to do is inoculate -- inoculate yourself to all of that negativity by being a unique presence in the political arena. I mean, look, whether you like Trump or not, I'm talking to the audience, not you, just don't have to listen to, this Donald, you don't have to listen. I'm going to talk to the audience directly. Whether you like this guy or not. Whether you like him or not, what he has done is unique. It's never been done before. He spoke directly to the people. He went around the establishment. He went around the press, he didn't take money from the fat cats and he won. It's never been done.</p>                \n                \r\n\n            \n                <p>All right. Now I'm back to you. That being said, you've got more work. You are at 56 percent of Americans, you know, they are not in your wheel house. What are you going to do?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, I do understand that and I think now, you know, it's been a very tough battle. As you said 17 people. And I was being hit from every angle on every side. And I had to be very tough coming back. I mean, there is no question about that. I had to be very, very tough. And in some cases I had to be very nasty. And now it looks like we are in very good shape to go, you know, right to the end and then I will take on as I say crooked Hillary. Hillary is crooked. I call it crooked Hillary. But I will take on Hillary Clinton and I think we are going to win. I think we are going to win.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. Now, last night you shocked the world by calling Ted Cruz senator rather than the usual lying Ted. Was that a signal that you are the kinder, gentler Trump now?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Look, I don't think so necessarily. I thought it would be very undignified for me to get up at that particular moment with all of the people and, you know, pretty much the world watching last night because everybody wanted to see what was going to happen in the great State of New York. A state where I think I will beat Hillary Clinton by the way. But what was going to happen, and even I didn't know it was going to be that, you know, it's close to 62 percent. And even I didn't know it was going to be to that level. We got almost all of the delegates, almost 100 percent of the delegates. It's going to be very --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. I think you lost three to Kasich. I think that's the final tally.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I think, yes, we have a lot of them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But you were not bombastic last night. You were happy. Very complementary to your home state.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: True.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And it was a little bit of a different thing. And now, as I said, they can't stop you, they being Mitch McConnell and the Republican establishment they can't. They can't. In my opinion, and I have looked at every scenario is nothing -- unless you get whacked in California and the field poll says that you are running okay there unless you get wiped out there, you are in. You are the guy.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Yes. We are doing very well in California. We have a tremendous lead and I have a tremendous relationship with that state. I employ many people there and, you know, I really have a great relationship with California. And we're going out there in a few weeks. And I think, you know, we will do very well there. But I have to say that I don't know why the Republican Party in terms of its leaders, I like Mitch and I like Paul Ryan and I don't know why turn away the millions and millions of voters that came -- you know, they call it the Trump train. I don't call it the Trump train because it's, you know --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I will tell you why. Do you want to know why? Do you want to know?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Go ahead.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They don't think that you are going to beat her, Hillary Clinton. And they think they are going to lose the Senate and the House in the process. They think it's going to be a Goldwater 1964 run. That's what they think. Now, what they base that on, I don't know. I mean, that's what they think.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Yes. Yes. A lot of people think I will beat her. A lot of people think I will put states into play that will never be in play like I will win Michigan. No other Republican is going to even compete in Michigan, I'll win Pennsylvania. I will win states that nobody else and guess what, I am going to win New York.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> If you win New York, you're going to be president. If you win New York, you're going to be president.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: But I will win New York.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That is what I'm saying.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Because I'm going to produce -- Bill, I'm going to producer jobs. I look at New York State. It's a disaster. The jobs are all gone. I mean, they are moving to Mexico. They are moving all over the world.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Certainly Upstate --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> New York state is just -- no -- and I will tell you, I think I will win New York.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>And that would be a --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, can hang on for just a couple minutes? I want to talk to you about Hillary Clinton and I'm sure you are thinking about, this how you are going to go and compete one-on-one with her. And we appreciate your time. We know you are running around the country today.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Sure.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Will Donald Trump secure the nomination?", "description": "GOP frontrunner joins 'The O'Reilly Factor' to discuss his New York victory and fight for the Republican nomination", "date": "2016-04-21T12:31:27Z"}