{"vcmId": "a2e7a05b-885e-4a6f-8282-99cfa74bf220", "url": "http://www.foxnews.com/transcript/2015/11/05/fbi-investigation-into-hillary-clinton-email-server.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 4, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And in the \"Impact Segment\" tonight all the polls say Hillary Clinton is pretty much a lock for the Democratic presidential nomination. But one thing -- one thing may stand in the way: an FBI investigation into alleged misuse of e-mails during her tenure as secretary of state.</p>                \n                \r\n\n            \n                <p>With us now: Ebony Williams and Monica Crowley.</p>                \n                \r\n\n            \n                <p>Monica has some new information in the case. Now, I'm giving you some rope here. I usually don't do this. I want to tell the audience. We usually don't use anonymous sources. We don't. We don't like to do it. I don't do it on the show. I don't do it in my books.</p>                \n                \r\n\n            \n                <p>But Monica has two sources she cannot name that have told her things about the investigation. I'm going to let you go tonight -- go.</p>                \n                \r\n\n            \n                <p><b>MONICA CROWLEY, FOX NEWS ANALYST:</b> Ok, as of now at least 671 e-mails that Mrs. Clinton sent or received through her private server contained classified material. Of those, at least four documents are extremely problematic here in this investigation. Of those, two reached the highest classified designation which is top secret.</p>                \n                \r\n\n            \n                <p>One of those documents, which has been publicly disclosed, contains satellite data about North Korea's nuclear weapons program. I am told that that particular document is an open and shut violation. I'm also told that the FBI director James Comey is personally overseeing and directing this investigation.</p>                \n                \r\n\n            \n                <p>And as of now they do have enough to build a case against her if they so choose on two issues. One -- gross negligence of the mishandling of classified data; and two -- obstruction, multiple counts.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> She says and her campaign says this stuff was not classified top secret when she received it or transmitted it. Is that enough to prevent any kind of an indictment?</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> No. Because as I just mentioned to you, at least four documents are extremely problematic in that they contained highly sensitive material --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's her defense --</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> -- that was designated classified at the time.</p>                \n                \r\n\n            \n                <p>Also Bill, you are talking about classified material that may or may not have been stamped classified at the time but that material was in intelligence circles known as born classified meaning that the information contained therein was so sensitive that it was assumed to be classified. And as secretary of state she must have known that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Many viewers believe that this investigation, like the IRS investigation will go nowhere because the attorney general and the President will tell Comey and the FBI to back off.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Well, from what I know about the FBI director, he is a serious man and a rule of law man. Now, whether or not he takes this and recommends a prosecution to the Attorney General Loretta Lynch I don't know. If he does then it's her decision whether or not she is going to proceed.</p>                \n                \r\n\n            \n                <p>I happen to think based on your question there is only one person who really matters in all of this. That's the President of the United States.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, he's not going to go ahead with that.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: Everything with him is political not legal. So whether or not he wants her sidelined so they can bring Joe Biden back as the knight in shining armor is an issue.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, we don't want to hear speculation about that.</p>                \n                \r\n\n            \n                <p>All right. If they don't indict her and the evidence is there that they could, that will become public though.</p>                \n                \r\n\n            \n                <p><b>CROWLEY</b>: And that will be devastating.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Eboni.</p>                \n                \r\n\n            \n                <p><b>EBONI WILLIAMS, FOX NEWS CONTRIBUTOR</b>: I actually will take everything Monica just said at face value for the sake of this argument. You are correct, Bill and Monica, she is making an argument that it wasn't classified originally. It became so later. It's actually a losing argument. It doesn't matter when it was classified. That is the wrong argument that Hillary Clinton is making.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And you are saying that as an attorney.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: I'm saying that as an attorney, a practicing law attorney.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Ok.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> What the issue is, this issue of gross negligence. Monica is again right. It's going to be up to James Comey to make a recommendation around whether this moves forward but ultimately this is up to Loretta Lynch as to whether she moves forward with an actual prosecution.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: She doesn't have to take Comey's recommendation.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: She does not have to.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But if she doesn't the public will know.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> But here is the thing -- Bill. Loretta Lynch is not Eric Holder. And I believe you will agree with me because she is not cronies with Barack Obama. She's not in a bro-mance with him. She's a woman of law and order when she was a prosecutor in Brooklyn.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: We respected her there, yes.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Yes. She put away Dems and Republicans.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But she didn't do the IRS deal.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> She didn't. And here is the thing. As a prosecutor she is ethically-obligated to only move forward with a trial that she feels she can prosecute successfully. That's based on what evidence?</p>                \n                \r\n\n            \n                <p>So going back to the gross negligence issue for one second, you are right, Monica, the e-mails to me look like a violation. She has to reach the standard of what we call gross negligence -- ok? That's different than ordinary negligence.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But isn't that for a jury to decide?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> But ultimately that is an issue of facts, Bill and you are right. But if Loretta Lynch looks at these facts, she has got to feel as a prosecutor she has got at least enough evidence to get past --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> She's going to have to. If she doesn't bring --</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: If she doesn't she has to explain it. She can't take it to trial for headlines and she can't take it to trial for sport, Bill. She has got to do it based off of evidence in front of her. I think that she should. I think Hillary Clinton should be prosecuted. I do not think legally there is enough there to get that standard and I think she won't.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So you think she should be prosecuted.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS: </b>I think the violations are clear.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But you don't think she will. Do you think she will be prosecuted?</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> I think Barack Obama will have his say on this and I think given the long history of bad blood here, politically ideologically and everything else, I think chances are there might, in fact, be a prosecution.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p>We don't like speculation. We don't like anonymous sources but we felt that the information tonight was worthy enough to present it to you.</p>                \n                \r\n\n            \n                <p>Thank you ladies -- very much. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "FBI investigation into Hillary Clinton's email server", "description": "Monica Crowley and Eboni Williams join 'The O'Reilly Factor' to discuss the email scandal latest  ", "date": "2015-11-05T13:38:44Z"}