{"vcmId": "a4dfae22-9406-4843-8bfb-96029ab361aa", "url": "http://www.foxnews.com/transcript/2016/06/06/mark-cuban-for-vice-president.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 3, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: In the \"Impact\" segment tonight, who will be the Vice Presidential pick for Donald Trump and Hillary Clinton? Mark Cuban, the provocative billionaire investor has been mentioned as a possible option for either candidate.</p>                \n                \r\n\n            \n                <p>And joining us now from Dallas is the man himself, Mr. Mark Cuban. Mark, we will start with you. Hillary Clinton? Donald Trump? Both? Neither? They tap you? Where are you on that?</p>                \n                \r\n\n            \n                <p><b>MARK CUBAN, ENTREPRENEUR</b>: I'm hoping to both. I have talked more now recently to Hillary's camp. I'm not here to tell you that they are ready to offer me the job, but I think there is a role for somebody who isn't just a get along and go along guy, who can bring a different perspective, particularly as an independent. So, I'm happy to listen to both.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: How is it possible that with this growing divide, that's what this special is about, it's a growing divide, widening between the right -- the political right and left in America, one guy could possibly be named in either side? What do you bring that no one else does?</p>                \n                \r\n\n            \n                <p><b>CUBAN</b>: Well, first of all, I have a tech background and neither the candidate has any technique logical expertise whatsoever. You know, Donald doesn't really use email, obviously Hillary doesn't use it well. And, you know, the future of this country is really going to be built on technology. The biggest questions we have to answer are driven by technology. Robotics, artificial intelligence, the impacts on the job market, the impact on the economy. And so, those are elements that are critically important and neither of the candidates has that strength. I do.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Okay. Let me put you on the spot here a little bit, Cuban. Pro and con both. Let's start with Trump. The pros and cons -- the pros of Donald Trump.</p>                \n                \r\n\n            \n                <p><b>CUBAN</b>: I mean, his primary pro is that he is not a politician. He thinks for himself. He is an independent thinker. The cons are the things he thinks of, his ideas, his plans, he doesn't really have depth behind them. If Donald came under sharp tank and came up with some of his ideas, I might like some of them. But the next question I would ask before I give him any money is, how are you going to implement then? How are you going to follow through? What's the substance? And Donald hasn't done a good job there -- on the Clinton side.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Yes. Hillary, pro?</p>                \n                \r\n\n            \n                <p><b>CUBAN</b>: On the Clinton side she is not a great communicator. She has got no charisma. She is not really somebody that her presence doesn't really inspire people, particularly from television. And in the media that's a real problem. Her track record is a strength and it's a negative. You know, a lot of people aren't happy with what she did as secretary of state. Aren't happy what she did as senators. Some are. But I think her experience and really her temperament really acts to her benefit with people who believe in her.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: All right. What's the top issue facing America going forward?</p>                \n                \r\n\n            \n                <p><b>CUBAN</b>: I would say the economy but it's too simple to say just the economy. Because there are so many factors that are part of that. You know, we are in a global economic community. And so the central banks and, you know, the ECB, our Federal Reserve and their equivalence throughout the world, they all have to work together. They all have to trust each other. They are all taking chances and they are all in new territory. And I think they really drive our economy and the world economy more than what a president does. And so whoever is coming in has got to understand the dynamics between all the banks and what the impact is going to be. You can't just send the Federal Reserve.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Wouldn't Trump be more -- does he have a better background? He is doing banking around the world globally with his golf courses and other real estate deals.</p>                \n                \r\n\n            \n                <p><b>CUBAN:</b> No. I mean, understanding the debt markets and how they apply and being a smart borrower really is not relevant to what's happening with currencies and understanding when to raise interest rates. The dynamics between different economies and their banks. You know, we see it right now is there's kind of a race to the bottom to devalue our currency from different nations or, you know, or Europe.</p>                \n                \r\n\n            \n                <p>And then on the flip side we see here, you know, the Federal Reserve trying to determine when they should raise rates. The ability to borrow really isn't a reflection of how well you understand that. And Donald hasn't come out and neither has Hillary to come out and say, look, here is my position on the Federal Reserve and here is why. It's one thing to create a headline. It's more important to say why and what you are going to do.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Mark, we are seeing a lot of protests going on at these Trump rallies. My biggest concern is what happens in Philadelphia at the Republican National Committee Convention. It's all about immigration. Where are you on immigration?</p>                \n                \r\n\n            \n                <p><b>CUBAN:</b> You know, it's obviously not a simple subject. But when you look at immigration, there is two elements. One, there is the fear of terrorism, which, obviously is scary for all of us. You know, you are in a public place and you never know what can happen next. And that's terrifying for -- particularly for a parent. But I think at the heart of it is jobs. And, you know, if we were in a perfect world and there were plenty of jobs, and everybody was getting paid what they were worth, then we wouldn't argue so much about immigration.</p>                \n                \r\n\n            \n                <p>So, I look at immigration as being secondary to the economy because if we can solve the issues of the economy. If we can put people in a better position with jobs and earnings, then I don't think they are going to be as concerned with immigration and with people taking their jobs. Now as it applies to terrorism, that's a foreign, you know, that is not an easy issue to solve. I don't like when Donald comes out and just makes all these proclamations that he knows more about ISIS than the military. I mean, that's a problem, right?</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: I'm going to have to go. First of all, I think I misspoke. The RNC Convention is in Cleveland. The Democrats are in Philadelphia.</p>                \n                \r\n\n            \n                <p><b>CUBAN</b>: Right.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Mark, who is better for America? Which is a better president for America? Donald Trump president? Hillary Clinton?</p>                \n                \r\n\n            \n                <p><b>CUBAN</b>: We don't know yet. There is still a lot more substance and there is no reason to jump to a conclusion right now. Look, I am hoping, I have been critical of Donald recently. But I'm open to him once I get the substance of his plans. Like, any good business person, any good investor, I want to know what's behind the idea. I want to know what's behind the concept. And I want to plan, you know, I want you to tell me how you are going to get there. And the same applies to Hillary. You know, I think she has got to come more center. She has got to be a lot more business- friendly. And I will look at that as well. But it's too early to tell and there is no reason to jump to a conclusion yet.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: All right, Mark. I'm going to leave you right there. Thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Mark Cuban for vice president?", "description": "Billionaire investor joins 'The O'Reilly Factor' to discuss possibility of being running mate for both candidates", "date": "2016-06-06T11:47:31Z"}