{"vcmId": "a602d46c-34a4-416a-91c7-4c1572f2807e", "url": "http://www.foxnews.com/transcript/2016/03/18/bill-oreilly-covering-donald-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It is becoming clear that many, perhaps most in the media believe that journalists are not acting responsibly unless they are condemning Trump. Labeling the man a bigot or worse.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> There was a moment in the debate when Clinton and Sanders were asked if Donald Trump was a racist. And they both gave answers that basically said yes but did not say the word Donald Trump is a racist. You tweeted this. I didn't realize this is a question. He is like a racist, speaks like a racist of course real Donald Trump is a racist. Should they had just said that?</p>                \n                \r\n\n            \n                <p><b>MAYOR BILL DE BLASIO, NEW YORK CITY: </b>I said the way is he using his racial appeal is extraordinarily cynical. Yes. We've talked a lot lately about dog whistles and coded language. He has gone way past that to overt language and I think, therefore, we have to use overt language and call him the racist he is.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Mayor de Blasio echoing the far left view which is what he always does. Now, not since the pre-civil rights south has the vicious head of bigotry been raise so prominently in political circles. No question the racist tag will be front and center in the upcoming presidential campaign should Donald Trump get the Republican nomination. That will be the centerpiece of attacks against him. Trump himself doesn't seem fazed or do his supporters. But in order to become president Donald Trump will need about 65 million of Americans to vote for him. And his opposition believes the racist tag will drive minority and on the fence voters away.</p>                \n                \r\n\n            \n                <p>The question then becomes how do responsible and fair-minded press people cover the Trump campaign when the race card is being used as an ax. Last night on The Factor, we talked with Jorge Ramos, lead anchor for Univision. The topic was a question how can that network, Univision possibly cover Mr. Trump fairly when they have already branded him anti-Hispanic? The segment is posted on BillO'Reilly.com in case you missed it. During our debate, Mr. Ramos said this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JORGE RAMOS, JOURNALIST:</b> I think you have to be tougher on Donald Trump. You haven't been tough on him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I have been, listen, I have confronted Donald Trump in ways --</p>                \n                \r\n\n            \n                <p><b>RAMOS</b>: How many times you have confronted him?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He has told me that I'm unfair, okay? So, I'm not going to get into me. I want to bring it back to you.</p>                \n                \r\n\n            \n                <p><b>RAMOS:</b> You talk to him so many times and you --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes, tonight before you.</p>                \n                \r\n\n            \n                <p><b>RAMOS: </b>You let him get away with anything.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, no, no, no, no. I don't let him get away with anything. I confront him.</p>                \n                \r\n\n            \n                <p><b>RAMOS:</b> With almost everything.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's not true.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, Talking Points is used that kind of stuff. Overnight we received about 3,000 emails as usual the reaction to the Trump interview was all over the place. I'm too kind to him. I'm condescending. I'm unfair to the candidate. I'm in the tank. Same interview. On and on. We'll read some of your letters later. But, that reaction is mostly based on how the viewer feels about Donald Trump, not what actually took place in my interview with him. As far as Mr. Ramos is concerned, he seems to be on another planet.</p>                \n                \r\n\n            \n                <p>Here's the Factor record and you can look it up. Everything is online. In the beginning of his campaign, I directly told Donald Trump that Mexico would not, would not pay for the border wall. Even if economic reprisals were taken against that country. Simply put, no Mexican politician could survive in office if he or she agreed to that. I suggested to Donald Trump that a mass deportation of illegal aliens would be tied up in federal courts for years, effectively shutting down the policy. Same thing with temporarily barring Muslims from entering the U.S.A. Courts would block that. And the hearings would take forever.</p>                \n                \r\n\n            \n                <p>We also investigated Donald Trump's statement about thousands of Muslims in New Jersey celebrating after the 9/11 attack. And found the statement to be exaggerated. In addition, I suggested to Mr. Trump that Muslim nations are needed to do defeat the jihadist and America would be wise not to alienate them. Also, I told Donald Trump that John McCain is a hero, Carly Fiorina's appearance was no issue. That Megyn Kelly's question about women was legit and just last night I said that rhetorical mudslinging will not make America great again. I said all this to Mr. Trump's face. I can list dozens of other issues where I have challenged Donald Trump.</p>                \n                \r\n\n            \n                <p>Sometimes to his great annoyance. But I also allow him his say. And to his credit, he comes in to this tough forum. He is not afraid as many other politicians are. Trump is accessible to the voters. A very good thing. The press does not intimidate him and he curries no favor with it. Now, I like Jorge Ramos, he is no phony, but is he absolutely blind on the Trump issue. And he has no bleeping clue about what we do here, obviously. Maybe Jorge objects because I will not brand Donald Trump a racist. He is not. He doesn't care what color or race somebody is. It is not racist to want to shut down illegal immigration or brand Islamic terrorism a deep threat. That's not racist.</p>                \n                \r\n\n            \n                <p>It is not a mark of fascism to hold other countries accountable for treating America unfairly. In addition, I'm not in the nitpicking business. Trump and every other politician misspeak at times. The got you game is cheap and boring. For example, if you really believe Donald Trump is courting the KKK, you need to get some fresh air. It is my job to give you the American voter insights into those seeking power. I do that in a variety of ways, and you will learn more from the Factor than most other news programs. You don't stay number one for 16 years by spinning, shilling or selling out. Donald Trump is the most important political story in decades. We will cover him fairly on the Factor, allowing to you decide whether or not he has the right stuff to be president.</p>                \n                \r\n\n            \n                <p>For that, we will be demonized and attacked by those who despised Trump. To quote President Bush the elder, read my lips, I don't care. Trump deserves fair coverage as do all of the other candidates, including Hillary Clinton. Sadly few media outlets will provide fair coverage in this election cycle. Trump has changed all the rules because he has broken many of them. Jorge Ramos and other press folks are out to get Trump. We are not. We are out to cover him. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Covering Donald Trump", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/17", "date": "2016-03-18T12:34:36Z"}