{"vcmId": "a63fd521-4026-4b9d-bbd9-1f5e9d3020b6", "url": "http://www.foxnews.com/transcript/2015/01/20/bill-oreilly-president-obama-and-real-state-union.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As you may know, the President gives his annual State of the Union address tomorrow evening and is expected to ask for higher taxes on businesses and the affluent. He may also ask Republicans and some Democrats to back off on Iran, which is evolving into a very dangerous situation.</p>                \n                \r\n\n            \n                <p>A new poll by ABC News says the President's job approval rating is improving. But a poll by Fox News disagrees with that. \"Talking Points\" believes the President's approval rating is going up a bit due to the perception of an improving economy and lower gas prices.</p>                \n                \r\n\n            \n                <p>Now, Mr. Obama well knows Republicans will not accept a tax hike believing it would be bad for the economy. The President doesn't really care. He continues to play Robin Hood trying to take from the rich and appropriate the money to the poor and working class. With no hope, no hope of getting more tax increases, Barack Obama is simply setting up Hillary Clinton's run for the presidency in 2016.</p>                \n                \r\n\n            \n                <p>The President is wrong on the tax issue. His income redistribution policies have stifled the economy. He needs to just stop. Finally the situation is improving slightly. Please don't muck it up with the social justice stuff.</p>                \n                \r\n\n            \n                <p>With about 35 percent of American homes getting some kind of government welfare apart from Social Security and Medicare, critical mass has been reached. A culture of dependency is making America weaker -- there's no question. But again Obama doesn't really care. He wants the symbolic kudos for looking out for the folks.</p>                \n                \r\n\n            \n                <p>Now, on the Iran front, the President is correct. Republicans and some Democrats want to re-impose economic sanctions against Iran. They would be dormant until June 30th and kick in if Iran doesn't make a new weapons deal. Sounds logical, right? But it's not necessary right now and might give Iran a bad faith argument. The mullahs could say they don't respond to threats.</p>                \n                \r\n\n            \n                <p>If America has to take drastic action against Iran, the world must know we did everything we could to be reasonable with these people. We bent over backwards. Giving the Iranians an excuse to walk away from the nuclear negotiations now isn't a smart move. Let it play out.</p>                \n                \r\n\n            \n                <p>If a nuke deal does not get done in June, drastic sanctions are back big time. Everybody knows that. No need to poke the mullahs now as satisfying as that might be. Again the world must know that America is the reasonable country here. It's very important.</p>                \n                \r\n\n            \n                <p>The State of the Union address is and always has been an evening of propaganda. Truth is the President's economic policies haven't really worked. America's stature overseas has fallen and there's no effective plan to counter the jihad. That's the State of the Union -- the \"Talking Points\" edition.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: President Obama and the real State of the Union", "description": "Talking Points 1/19", "date": "2015-01-20T13:17:53Z"}