{"vcmId": "a74619aa-71eb-4678-95c6-b74796d245d6", "url": "http://www.foxnews.com/transcript/2015/08/21/bill-oreilly-trumpians-versus-democrats.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As I mentioned earlier this week, Donald Trump really isn't a Republican. He's a Trumpian. He has absolutely no interest in what the Grand Ole Party says. He's a man on a mission, marching to his own beat.</p>                \n                \r\n\n            \n                <p>And Trump's timing is good because this presidential cycle should spell doom for the Democratic Party. It is so far left most Americans are appalled.</p>                \n                \r\n\n            \n                <p>Some facts. Despite spending trillions trying to redistribute wealth the poverty rate for women, blacks and other groups has gone up since President Obama took office. By making it more difficult for private enterprise to make money, high taxes, constricting regulation, the Democrats have actually harmed the poor and stifled the middle class. The economy is anything but vibrant.</p>                \n                \r\n\n            \n                <p>Overseas, most Americans believe the Iranian nuke deal is bad. ISIS continues to run wild, committing atrocities all over the place. Iraq has collapsed, Afghanistan may follow. Ukraine has been battered by Putin. The Middle East one giant mess. All on President Obama's watch.</p>                \n                \r\n\n            \n                <p>Here at home, Democrats oppose keeping illegal immigrants out of the U.S.A. by building an effective wall. They support American taxpayers funding federal and state entitlements for undocumented folks. Even as the national debt approaches $20 trillion. Democrats oppose holding foreign nationals who defy deportation and commit violent crimes responsible. That's the Kate's Law deal. Dems even oppose investigating Planned Parenthood for alleged illegal activities by selling the organs of babies. Democrats support leniency for dangerous drug dealers calling them nonviolent.</p>                \n                \r\n\n            \n                <p>The list of craziness goes on and on. All of those things should make it easy for the Republicans to win the presidency in 2016. But that is not how things are shaking down.</p>                \n                \r\n\n            \n                <p>Donald Trump has bludgeoned the GOP establishment by seizing on a number of emotional issues that conservatives are furious about. His brand of straight talk blows traditional politicians away making them seem small and dull.</p>                \n                \r\n\n            \n                <p>But that may be good news for the Democrats. Because the GOP may have a very hard time coming together when the nominee is selected. Also, there is an over-the-top element to Trump's rhetoric and support.</p>                \n                \r\n\n            \n                <p>As we have reported, there is no question the Supreme Court decisions have upheld that portion of the 14th amendment that says any person, any person born in the U.S.A. is entitled to citizenship. The cases U.S. versus Wong Kim Ark and I&amp;S versus Rios Pineda -- both gave the Supremes a chance to refute the 14th amendment which says all persons born of naturalized or naturalized in the United States and subject to the jurisdiction thereof are citizens of the United States. The Supreme Court clearly upheld the wording in both cases.</p>                \n                \r\n\n            \n                <p>And even though some are trying to parse the amendment, they will fail and it's a waste of time. It also gives the left ammunition.</p>                \n                \r\n\n            \n                <p>A \"New York Times\" editorial today demonizes the Republican Party over Trump's immigration plan which the \"Times\" calls despicable. The left hoping to turn defeat into victory by playing the race card and portraying Trump and the entire Republican Party as racist brutalizers.</p>                \n                \r\n\n            \n                <p>Now, there is a way to legally revoke the anchor baby law and it should be done as that law is undermining federal immigration. But you there is also a way for Republicans to lose the upcoming election if they out extreme their far left counterparts.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Trumpians versus Democrats", "description": "Bill O'Reilly's Talking Points 8/20", "date": "2015-08-21T12:17:12Z"}