{"vcmId": "a77efe94-60aa-45f4-8fc7-330c3a7e8140", "url": "http://www.foxnews.com/transcript/2015/07/28/bill-oreilly-is-senate-looking-out-for-us.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>When the Republicans took over the senate, many Americans were relieved. That's because the former Senate Majority Leader Harry Reid blocked a lot of legislation that could have greatly improved the country. In some quarters, Reid is perceived to be a villain. Now there are charges that the Republican Senate Leader Mitch McConnell is doing the same thing that Reid did.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CRUZ: </b>He blocked my amendment to defund Planned Parenthood in the wake of these gruesome videos where they appear to admit to multiple felonies. We should be defunding them and we should defund them this week.</p>                \n                \r\n\n            \n                <p>He blocked amendments to end sanctuary cities, to cut off funding. He blocked my amendment for Kate's Law.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, the reason McConnell blocked those things is that he did not want the bills attached to highway legislation which would provide $350 billion to rebuild the nation's roadways. McConnell wants that passed and doesn't want any controversy attached to it in the form of extra amendments.</p>                \n                \r\n\n            \n                <p>Talking Points believes the three bills Senator Cruz is talking about -- defunding Planned Parenthood, punishing sanctuary cities and passing Kate's Law which would mandate five-year prison terms to deported criminal aliens who'd come back should all be stand-alone legislation.</p>                \n                \r\n\n            \n                <p>Yes, there is a chance those bills would be filibustered in the senate. And would not get the 60 senate votes needed to put them up for a full vote. There is a chance that would happen. But, let the American people see who is opposing putting felonious aliens in prison when they defy deportation. Let the folks see who is voting against that. Same thing with Planned Parenthood and same thing with sanctuary cities.</p>                \n                \r\n\n            \n                <p>If those bills are voted down in the senate. They are filibustered, the American people will have some serious issues with the Democratic Party, I believe. If they pass Congress, and President Obama vetoes them, again, Americans can better ascertain who is looking out for people like Kate Steinle and unborn babies. The House will certainly pass all three bills.</p>                \n                \r\n\n            \n                <p>If Senate Majority Leader McConnell does not put those bills up for a vote, then he becomes just like Harry Reid and Senator Cruz's withering criticism becomes valid.</p>                \n                \r\n\n            \n                <p>Now, we contacted McConnell's office today. They told us the senator will not -- will not block stand-alone votes on Kate's Law, sanctuary cities and Planned Parenthood. Good, good. But I would encourage Mr. McConnell to read Hank Adler's piece on townhall.com about Kate's Law.</p>                \n                \r\n\n            \n                <p>America needs leadership, Senator. And you, you are the most powerful Republican right now. So let's lead. Let's actively promote doing the right thing. Lives are at stake in all three votes. And it's time to see in vivid terms whether our elected leaders will protect Americans from harm, including the unborn. It is time.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Is the Senate looking out for us?", "description": "Talking Points 7/27", "date": "2015-07-28T12:12:24Z"}