{"vcmId": "a8e1eaee-a643-4295-b817-9c9dd25b10d8", "url": "http://www.foxnews.com/transcript/2015/08/05/bill-oreilly-very-hot-presidential-debate.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>In just about 48 hours from now, 10 Republican contenders for president will debate each other in prime time from Cleveland, Ohio. But this debate has one very unusual component a red hot Donald Trump. Mr. Trump is averaging more than 23 percent support in the polls among Republicans. Next is Jeb Bush 12.8 percent, followed by Scott Walker 10.6 percent. All the rest of the contenders are far back.</p>                \n                \r\n\n            \n                <p>So the upcoming debate is all about Donald Trump and how he will handle his frontrunner status. It is likely many will tune in simply to see the drama. Will Trump go after his competitors or will he become a statesman trying to demonstrate that he has the political finesse to run the country? Talking Points does not know how the debate will play out which makes it exciting.</p>                \n                \r\n\n            \n                <p>Now, some of you have asked why I'm not one of the interrogators. The reason is my role is that of a watchdog. I watch all powerful people. I am now a debater on television, rather than an inquisitor. That does not play in a debate format. There are simply too many people and too many questions to be asked.</p>                \n                \r\n\n            \n                <p>If the contender doesn't answer the question, we can expect follow-ups but if he still doesn't answer there is nothing the Fox News moderators can do. It's not like they can call the evaders pinheads like some people I know. So it's better for me to be like you to watch what happens in the debate and then analyze after the fact.</p>                \n                \r\n\n            \n                <p>Megyn Kelly, Bret Baier, Chris Wallace all seasoned journalists and they will do a great job. Coming up -- very important debate for the Republican contenders. All of them, with the exception of Donald Trump, need to gain recognition among the voters. And that will not be easy.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Very hot presidential debate", "description": "Bill O'Reilly's Talking Points 8/4 #GOPDebate", "date": "2015-08-05T12:02:05Z"}