{"vcmId": "a91250e4-772b-478a-ad35-983d0856480b", "url": "http://www.foxnews.com/transcript/2016/12/13/bill-oreilly-evaluating-president-elect-trump-so-far.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>A few months ago, we suggested that President Obama might want to take action against Russia for waging cyber warfare against the U.S.A. Russia has been hacking into the American system for years. Mr. Obama has done absolutely nothing about it. Now, the situation has reached critical mass because Hillary Clinton lost the presidential election. And as we all know, WikiLeaks embarrassed the Clinton campaign by making public hacked emails that showed some members of the press secretly helping Mrs. Clinton and other embarrassing facts.</p>                \n                \r\n\n            \n                <p>Before that, Democrats really didn't care much about Russian hacking. Now they do. CIA and the FBI both agree that Russia is involved with breaching U.S. cyber security. The CIA says it is because they wanted it influence the election. The FBI says it doesn't know the motive. But it really doesn't matter, does it? If Russian officials are hacking into American systems, that's cyber warfare. Enter Donald Trump who says, he does not believe Russians did anything to influence the presidential vote.</p>                \n                \r\n\n            \n                <p>He says the Democrats are just trying to trot out another excuse for losing. Okay. His opinion. He's entitled to it. But it might be better if the President-Elect avoids this issue altogether. Mr. Trump has nothing to gain here. Nothing. Again this happened on President Obama's watch. He is responsible for holding the Russians responsible. Going forward, President Trump will have to deal with cyber warfare. But right now he should sit the whole thing out.</p>                \n                \r\n\n            \n                <p>On another serious note, President-Elect Trump is engaged in a war of words with China. Mr. Trump telling Chris Wallace the one China policy whereby the U.S.A. recognizes the Beijing government as a sole authority where Taiwan is involved might not be a good thing. China doesn't like that. Again, it might be better if Mr. Trump postpones this confrontation until he is in office and fully briefed on the consequences of a war of words with the Chinese. Plenty of time to make deals with China. Why T them off now?</p>                \n                \r\n\n            \n                <p>Finally, Donald Trump's appointments to me, they looked fine. It's not like any of these cabinet members have tremendous power. They don't. They do what they're told to do. And all the people appointed so far have skill and experience. FOX News is now reporting that CEO of Exxon Rex Tillerson is Trump's pick for Secretary of State. I have never met Mr. Tillerson. I know little about him. Although reports are he has a good relationship with Vladimir Putin.</p>                \n                \r\n\n            \n                <p>Maybe Tillerson can neutralize Putin's bad behavior. That would be a good thing. I expect Mr. Tillerson to be confirmed in the Senate despite all the whining. Summing up, Russian hacking happened. President Obama should have to deal with it, he did not. If it continues, President Trump will have to. On China, let's all take it easy. On Trump's appointment they look good to Americans with no ideological acts. And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Evaluating President-elect Trump so far", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 12/12", "date": "2016-12-13T13:57:01Z"}