{"vcmId": "a9265ced-36ac-4015-a6c8-c9a63c0313c4", "url": "http://www.foxnews.com/transcript/2016/07/13/donald-trump-on-racial-tensions-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" July 12, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Now for the top story tonight. How would Donald Trump deal with the racial divide in America? I spoke with him earlier today in Chicago. So, first question for you. Do you believe there is a problem between Black and Whites in America, generally speaking?</p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESUMPTIVE PRESIDENTIAL NOMINEE:</b> Sadly, there would seem to be. And it's getting more and more obvious and it's very sad, it's very sad. When somebody called to a moment of silence to this maniac that shot the five police, and you know, you just see what's going on. It's a very, very sad situation. And hopefully it could be healed. We have a divider as a president. He is the great divider and I have said it for a long time. And it's probably not been much worse at any time. So it's very sad situation, actually.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. So if you are elected president, do you have a plan to lessen racial tensions and, if so, what is it?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, one thing is spirit. I mean, we don't have spirit. The country doesn't have any spirit, Bill. And, you know, we can see oh gee, well, that's just a general statement. But it's not a general statement. I mean, the country has no spirit. We need a cheer leader not a divider. We have a divider. We need a cheerleader.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: There is still some Black Americans who believe that the system is biased against them. The American system because they're black, they don't get the same kind of shot, they don't get the same kind of fairness that whites do. What do you say to them?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, I have been saying even against me the system is rigged when I ran as a, you know, for president, I mean, I could see what was going on with the system and the system is rigged.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, but that's not going to lift anybody's spirits.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: We have to fight.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> If you go out and say the system is rigged, that's not going to lift their spirits.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No, what I'm saying is they are not necessarily wrong. I mean, there are certain people where unfortunately that comes into play. I'm not saying that. And I can relate it really very much to myself.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I have to refocus you though on the African-American experience. All right? Do you think you understand the African-American experience? Do you think you understand it?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, I would like to say yes, but you really can't unless you are African-American. You can't truly understand what's going on unless you are African-American. I would like to say yes, however.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. If that's true, I agree with you. And then how do you persuade African-Americans who believe America is a bad place built upon grievances in the past to put that aside and lift their spirits? How are you going to do that?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Because I do understand what goes on in life. And I do understand that the economics of our country are not the same. That people are making less money today in real wages than they made 18 years ago, that our jobs are leaving the country. That our educational system stinks. It's absolutely horrible. Our educational system. And they are not part of that educational system to a large extent so I fully understand.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, you are going to go with an economic based program to try to get more assets to African-Americans. Okay. What about the police? Now, when you see something that happened in Louisiana, what happened in Minnesota, where blacks are killed by police and there is videotape and this kind of thing, what goes through your mind?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I thought they were terrible. I thought it was a terrible, disgusting performance that I saw. Now, whether that's training, whether they choked or they got scared or nervous. I mean, the one man who was being stepped on and then shot in particular, I looked at that and I said wow, that's bad. That's bad. The other one in the car, really bad but I guess they could say he was going for his license or identification and maybe thought it was a gun, so. But it was bad. Both of them were very, very sad. So maybe that's lack of training. Maybe it's bad people. I don't know. It's such a sad thing to see those two sites.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is there anything that the President --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No question about it and then you have to go a step further.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Go ahead.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: A step further when you saw the policemen shot, I mean, how bad was that? And we can't allow that to happen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's domestic terrorism, sure.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: We can't allow any of that to happen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But as far as the police are concerned, you say, okay, these two individual things are bad. But are they symptomatic in your opinion of a larger problem with American police? That they fear blacks or that they act differently around African-Americans? Do you believe that's in play?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Look, it could be. You have to see it. I mean, there are so many individual cases. There are certain cases where this takes place and it's horrible. I mean, somebody will meet. They will have a commission meet and the commission may have an answer, but I almost don't care what the commission says because I -- you know, I see it with my eyes. I hate what I saw, those two instances. I hate what I saw when somebody guns down all of these policemen and kills five policemen. I hate it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Do you believe that there is a problem in American policing whereby Blacks are treated differently than Whites? Do you believe that?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: It could be.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It's possible.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> It could be.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> As president, is there anything you can do about that?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I think it's training. It's training of the police. And by the way, I have to say, I think the police 99.9 percent, I mean, I think the police do an incredible job in this country. And you know, the problem with two instances like this which I think were terrible but they get broadcast on television.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Sure. But --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> And they don't show all of the good works that the police does. There are hundreds and hundreds and thousands of cases where the police do phenomenal work. I'm a big fan of the police of this country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. Black Lives Matter. I have said it's a hate group. Built upon opinion by their leadership of white supremacy keeping blacks down. How do you define Black Lives Matter?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, first of all, I think the term is very divisive. The first time I heard it, I said you have to be kidding. They can't use that but they just can't. I think it's a very, very, very divisive term. There is no question about it. I have heard what you have to say. I think it's a very divisive term.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The group itself, are they helping America or hurting America?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, I would say they are dividing America. I think that, you know, statements that I have seen, I saw what they said about the police in various marches and rallies. I have seen, you know, moments of silence called for for this horrible human being who shot the policeman. And I, you know, I have seen it and I think it's certainly -- it's very divisive and I think they are hurting themselves.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Finally, you said President Obama is a divider. Do you believe he does that on purpose? Do you believe that the President says, I want to divide the nation? I want to have strife between the races?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I don't know, Bill. I really don't know what his reasoning is. But I can tell you that I'm sitting in Chicago where we have had almost 5,000 killings deaths, from the time he became president and you don't hear too much about it. And you know, you see what's going on now, and by the way getting worse and worse and worse. I don't know. I can't speak for the President. I wouldn't want to speak for the president. I'm sure he wouldn't want me to speak for him. But, things are not going well. And I think they are going to be getting worse before they get better.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. We will have more with Donald Trump in a moment. We will going to talk about the convention, Jeb Bush not attending. He says why.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump on racial tensions in America", "description": "Presumptive Republican nominee joins 'The O'Reilly Factor' to discuss police relations in the US", "date": "2016-07-13T12:11:47Z"}