{"vcmId": "ab4e0a79-2494-4400-979c-5195912550b9", "url": "http://www.foxnews.com/transcript/2015/12/15/bill-oreilly-age-anger.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>A new Gallup poll says 16 percent of Americans now believe terrorism is the most important problem facing the country today; 13 percent say dissatisfaction with the government; the economy stands at 9 percent.</p>                \n                \r\n\n            \n                <p>So you can see that anger and fear are presently driving American politics. That has led to the rise of one Donald Trump. And to some extent also fuels the candidacy of Bernie Sanders.</p>                \n                \r\n\n            \n                <p>On the right, President Obama is making many folks furious. They feel that he is a weak leader who has imposed economic hardship on the nation by stifling the private marketplace in order to redistribute wealth in the pursuit of social justice. Thus, millions of voters simply want to elect someone who will smash Mr. Obama's domestic policies and reimpose America as a strong force in the world.</p>                \n                \r\n\n            \n                <p>According to all the polls, President Obama is perceived to be ineffective in fighting the jihadists. The more terror attacks there are, the lower the President's poll numbers will go. It is not a stretch to say that Barack Obama has polarized the U.S.A. as much as Richard Nixon did.</p>                \n                \r\n\n            \n                <p>But, it's not all about Mr. Obama. Many on the right believe the Republican Party is cowardly and also ineffective. They want an avenger representing the party. They want Trump or someone like him.</p>                \n                \r\n\n            \n                <p>Add to that the PC madness that is running rampant in the U.S.A. That is driven by the far left.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BELTRAN: </b>The one possibly useful thing here is perhaps we can expand the logic of terrorism and talk about white racial terrorism. And talk about the way white fear has garnered racial violence historically from anti-immigrant riots to anti-black riots to lynch mobs.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So forget about Muslim extremism, it is now white racial terrorism that the far left believes is a threat. Again, this kind of insane stuff makes people angry.</p>                \n                \r\n\n            \n                <p>Now, on the other side, the Bernie Sanders, Black Lives Matter crew is furious as well. They believe America is and always has been an oppressive place. The far left wants reparations for slavery, social justice payments and a destruction of the so-called white privilege, capitalistic system.</p>                \n                \r\n\n            \n                <p>These Americans see Hillary Clinton is far too moderate. They want to blow up the whole system and impose a strident view of the world that does not tolerate dissent. The numbers on the far left are far less than on the traditional right. But the anger is equal.</p>                \n                \r\n\n            \n                <p>So, we are living in turbulent times. The U.S.A. is embracing political figures like Trump and Sanders which just a few years ago would have been unthinkable. And even if those guys do not prevail, America is now a deeply divided and politically unhappy place where anything can happen.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The age of anger", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 12/14", "date": "2015-12-15T20:23:08Z"}