{"vcmId": "abd261a6-cf8f-4477-8422-60703d72a9ba", "url": "http://www.foxnews.com/transcript/2015/07/15/deal-reached-with-iran-over-nuclear-weapons.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" July 14, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Factor Follow up Segment\" tonight a deal has been reached with Iran over nuclear weapons. This morning President Obama said this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>PRES. BARACK OBAMA (D), UNITED STATES: </b>Today, because America negotiated from a position of strength and principle, we have stopped the spread of nuclear weapons in this region. Because of this deal, the international community will be able to verify that the Islamic republic of Iran will not develop a nuclear weapon.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But almost immediately there was criticism.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOHN BOLTON, FORMER U.S. AMBASSADOR TO THE U.N.</b>: The way this deal is worded, it allows enumerable opportunities for Iran to delay, obstruct and basically prevent the International Atomic Energy Agency and others from getting to sites that they deem important.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, my frame of reference on nuclear inspections is scant but I do believe this, the deal was the best the U.S.A. could do. Iran would not move any further at this point. We could have continued sanctions and maybe they would have been more accommodating down the road. However, they might have stepped up their nuke weapon production and also increased their terror activity. It's all speculation. The one thing everybody should do is keep an open mind on the situation. Thus, we now present both sides of the Iranian nuke deal.</p>                \n                \r\n\n            \n                <p>Joining us from Washington, Matthew Duss, president of the foundation for Middle East Peace. Here in New York City, Max Boot, senior fellow at the Council on Foreign Relations. You oppose the bill, why?</p>                \n                \r\n\n            \n                <p><b>MAX BOOT, COUNCIL ON FOREIGN RELATIONS SENIOR FELLOW:</b> I do, Bill. And I oppose it for a very simple reason. I was well enunciated by George Schultz and Henry Kissinger who pointed out that negotiations with Iran began with the goal ending the Iranian nuclear program and they are winding up by legitimating that program.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Down the road?</p>                \n                \r\n\n            \n                <p><b>BOOT:</b> They are legitimating the program right now. What they are doing down the road is they're delaying slightly by a few years, assuming that Iran complies, which is by no means a sure thing. But if Iran complies the agreement will delay the time line for Iran to get an actual nuclear weapon.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>BOOT:</b> But, in the meantime, we are going to pay a very heavy price for that. Because we are delivering tens of billions of dollars into the coffers of Iran which is the number one state's sponsor of terrorism. We are lifting the arms embargo on both conventional weaponry and ballistic missiles. We are taking people like General Qassem Suleimani, one the worst terrorists in the world off the sanctions list. And so, what we are essentially doing is we are creating the predicate for an arms race in the region both conventional and nuclear.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So, you are saying we are strengthening Iran by lifting the sanctions on the weapons and, of course, the money and then because the deal does not banish nuclear weapons from that country, the others in the gulf will start to get nuclear weapons as well. Mr. Duss, how do you see it?</p>                \n                \r\n\n            \n                <p><b>MATTHEW DUSS, THE FOUNDATION FOR MIDDLE EAST PEACE:</b> Well, I think this deal and I think you are quite right to say that we need to keep an open mind and look very closely at the details of the deal. But I think the deal, it succeeds in that it satisfies the United States and its partner's main goal is that it block's Iran's path to a nuclear weapon both the uranium path and the plutonium path. It puts Iran's nuclear program under the deepest inspections regime in history. It will have eyes on not just individual, physical inspections but cameras and seals on its nuclear equipment. It will have visibility on all levels of Iran's nuclear program from when they are pulling the uranium out of the ground all the way through when they are transferring it into uranium hexafluoride. So, there are various ways for Iran to be caught. This deal is --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. But here is the one thing that disturbed me in my first reading of the deal. It takes 24 days for the Iranians to open up for the inspectors from the United Nations, 24 days. Anybody can sanitize anything in 24 days, Mr. Duss, you know that.</p>                \n                \r\n\n            \n                <p><b>DUSS:</b> But that's just actually not true. I mean, let's look at the Parchin Military Facility, they have paved Parchin multiple times, precisely because you cannot hide nuclear research.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. But, wait, wait, wait, wait. If the President said he has 24/7 access to see if Iran is cheating and he doesn't, he has 24 days access --</p>                \n                \r\n\n            \n                <p><b>DUSS: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>-- isn't he falsely misleading the public?</p>                \n                \r\n\n            \n                <p><b>DUSS: </b>I don't think that's right. I mean, I think there is various ways in which the U.S. and its partners can.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It says 24 days.</p>                \n                \r\n\n            \n                <p><b>DUSS: </b>Um-huh. As I've said. Let's look at Parchin, they paved Parchin repeatedly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right.</p>                \n                \r\n\n            \n                <p><b>DUSS: </b>Precisely because --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't know anything about Parchin, all I know is 24 days seems to be a long period of time to me.</p>                \n                \r\n\n            \n                <p><b>BOOT: </b>You are absolutely right, Bill. It's incredible that this anytime, anywhere inspections turn out to be on closer inspection as you say 24-day notice --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>BOOT: </b>-- before you inspect the site. So, there is no credibility about the inspections regime but we do know that the sanctions are coming off in a massive way. That will be flooding Iran with tens of billions of dollars that they will use for nefarious purposes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. But there are some people who would -- like Netanyahu no deal with Iran, unless you just give us all the nuclear materials you have and you have open inspections any time we want, we are not going to make a deal. That would lead to war. You see, that's the problem with Iran. As I said, they weren't going to give anymore.</p>                \n                \r\n\n            \n                <p><b>BOOT:</b> No, I think --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>As I said, they weren't going to give anymore. They might down the road, but they weren't going to give anymore.</p>                \n                \r\n\n            \n                <p><b>BOOT: </b>No, I think, Bill, we have to recognize --</p>                \n                \r\n\n            \n                <p><b>(CROOSTALK)</b></p>                \n                \r\n\n            \n                <p>With all due respect, I don't they were going to give anymore to President Obama who has very little credibility left after having a lot of red lines to be crossed to impunity. But can you imagine if we had somebody like John McCain as president? Somebody that they were actually scared of. Somebody --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Maybe. It's speculation.</p>                \n                \r\n\n            \n                <p><b>BOOT: </b>No, it's not speculation. Because in 2003, when we invaded Iraq they actually stopped their nuclear weapons program for the first time.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>DUSS: </b>We actually do have evidence.</p>                \n                \r\n\n            \n                <p><b>BOOT:</b> They are not afraid of us at the moment. That's the issue.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. Mr. Duss gets the last word. Go ahead/</p>                \n                \r\n\n            \n                <p><b>DUSS</b>: Again, I think that's completely discredited by the actual evidence. You had a very hawkish government under George W. Bush previously which made very stringent demands of Iran and that was the period in which Iran's nuclear program simply exploded. President Obama has brought forward a very different vision how American power is used working with our partners, working with multi-lateral institutions like the U.N. And we have advanced American security very, very significantly using this way.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Good debate but it's a moot debate because it's going to go through. The President is going to veto any opposition in Congress. They won't get two thirds to override so this deal is now in stone.</p>                \n                \r\n\n            \n                <p>Gentlemen, thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Deal reached with Iran over nuclear weapons", "description": "How will the agreement impact the United States?", "date": "2015-07-15T12:18:20Z"}