{"vcmId": "ad35b8eb-3ef6-4de1-ab37-ba0d83fe832b", "url": "http://www.foxnews.com/transcript/2015/11/02/battle-for-gop-nomination.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 30, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>ERIC BOLLING, FOX NEWS HOST:</b> Hi I'm Eric Bolling in for Bill O'Reilly. Thanks for watching this special edition of The Factor: Election 2016.</p>                \n                \r\n\n            \n                <p>Ohio Governor John Kasich came out swinging in this week's Republican debate saying those on top of the GOP polls don't have what it takes to be president.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>GOV. JOHN KASICH (R-OH), PRESIDENTIAL CANDIDATE:</b> My great concern is that we are on the verge, perhaps, of picking someone who cannot do this job. I have watched to see people say that we should dismantle Medicare and Medicaid and leave our senior citizens out in the cold. I have heard them talk about deporting 10 or 11 people here from this country out of this country, splitting families. I have heard about tax schemes that don't add up that put our kids in a deeper hole than they are today. We need somebody who can lead.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Donald Trump took that as an attack on his own candidacy and responded with some thoughts about his own -- about Governor Kasich.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL CANDIDATE: </b>He was very unsuccessful and every commentator, even the haters and losers that I read all the time, they said that he was put down so strongly that for the rest of the debate he was just sort of limping along.</p>                \n                \r\n\n            \n                <p>He hit me at the beginning of the debate. I hit him much harder than he ever thought possible including the fact that he worked for Lehman Brothers, which took down the world. I mean this guy was working for Lehman Brothers when it collapsed.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Joining us now from Los Angeles is John Kasich himself. Governor, do you stand by that statement that Republicans are on the verge of nominating someone incapable of being an effective president?</p>                \n                \r\n\n            \n                <p><b>KASICH</b>: Well, look, Eric, the problem is I'm worried about my party and being able to win the White House and also having good policy. When you say that you may do away with Medicare or Medicaid or make it an option, that is just a ridiculous kind of proposal -- it won't work.</p>                \n                \r\n\n            \n                <p>And I just looked at the tax scheme of the person that just was speaking and I found out that even under a model that requires dynamic scoring he is $10 trillion in the hole. Now, I mean I'm not going to add $10 trillion to my 16-year-old's bill. And then to say we're going to ship 10 or 11 million people out of this country leaving families divided, that's not how we're -- that first of all is not good policy and it's not how we're going to win.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: But Governor, it's resonating with the voters. I mean you see in the poll numbers and everyone says, you know, it's the summer of Trump. It's going to be the fall of Trump and then the real fall of Trump is not really happening yet.</p>                \n                \r\n\n            \n                <p><b>KASICH</b>: Hey -- Eric. Everything is not about polls. It's about leading this country. I have a program that will create jobs that will cut taxes, that will provide common sense regulations and shift a lot of power, money and influence back to people.</p>                \n                \r\n\n            \n                <p>And listen, Eric, there is another issue here. And that is the issue of rebuilding neighborhoods and strengthening our families. And if we don't have a leader that can articulate all of that and show people that really understands their problems, then I think it's hard for us to win and I want conservatism to prevail but wild schemes do not get it done.</p>                \n                \r\n\n            \n                <p>And you know what I hear from people? Thank goodness somebody stood up and they are providing leadership on the stage.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Well, you know you stood up, Governor, and Donald Trump went right at you. He hit you hard and frankly, after that, no one else on that stage is willing to take a shot at Trump. In fact Huckabee said he was wearing a Trump tie.</p>                \n                \r\n\n            \n                <p><b>KASICH</b>: Well, first of all I kept that. And secondly -- let me just give you an example. He said I was on the board of Lehman Brothers. That's wrong. I wasn't on the board of Lehman Brothers. I ran a two-man office in Columbus, Ohio. If I bankrupted Lehman Brothers from a two-man office I should be pope not president.</p>                \n                \r\n\n            \n                <p>Secondly -- you know that he actually -- I signed the deal with Ford in -- Eric listen to this. I signed a deal in 2011 to bring jobs back from Mexico. He is trying to take credit for it, you know. But look, my fight is not with Donald. He can do what he wants to do. I just want us to have a solid program to lift America, to make sure people who live in the shadows are not left behind and we can renew the spirit of this country through our families and our neighborhood. That's what I want to see happen.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Governor -- I wanted to hear that. I wanted to hear that from you and the other candidates at the CNBC debate. They promised us we were going to hear about the money, the economy, the jobs. We didn't hear any of that.</p>                \n                \r\n\n            \n                <p>We heard fantasy football and, you know, you are a comic book character. But you say that you were appreciative of the CNBC moderators and how they handled the debate. How can you be appreciative and the rest had a horrible time with them?</p>                \n                \r\n\n            \n                <p><b>KASICH: </b>You know what? Look, I have always been a Republican that's willing to step on toes. For me in the debate I got to speak more than I was able to in the second debate. And frankly I thought the first debate was good they didn't ask me any questions that were beneath me or I felt were below the belt.</p>                \n                \r\n\n            \n                <p>But let me tell you this. I told Sean Hannity and I'll tell you. I would rather come on with you and spend 15 minutes with you asking me any tough question you want to and then people can find out who I am. I mean Harry Truman could not be election president with a 30-second response.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: All right. Fair enough. Fair enough.</p>                \n                \r\n\n            \n                <p>Here were the CNBC questions to you. What's your biggest weakness? Which other candidate is crazy? One about the import/export bank, student loans and marijuana -- those aren't tough questions.</p>                \n                \r\n\n            \n                <p>I have a tough question to you. How do you explain to the voters, the GOP, the Republicans who say we are against everything Obamacare yet you took money from Obamacare and how you handle your Obamacare subsidy in Ohio? How do you respond to that?</p>                \n                \r\n\n            \n                <p><b>KASICH:</b> Well, first -- yes, first of all Medicaid is a program for the poor -- ok. And I took the growth of it from 10 percent down to 2.5 percent and we didn't cut one benefit nor did we take anybody off the rolls. And what we have learned in that is about healthcare reform which is providing quality not quantity healthcare.</p>                \n                \r\n\n            \n                <p>In addition to that I'm not for Obamacare. And I actually have a plan to replace it so that people don't lose health insurance. You know, you can't just say you are going to get rid of Obamacare without having a viable alternative so that we can begin to reduce the cost of healthcare but make sure that people don't lose their health coverage.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Governor -- I'm here to tell you to do this -- I interview a lot of candidates. I talk to at lot of people and the perception is, Kasich, we love him but he is more of an establishment candidate. How are you going to find -- get that voter that is not an anti-establishment? They are flocking to the anti-establishment right now.</p>                \n                \r\n\n            \n                <p><b>KASICH: </b>Well, Eric -- you know, I'm both an inside and outside player. I have been a reformer all my life. Look, I'm stepping on Republican toes right now. People are like why is he saying this?</p>                \n                \r\n\n            \n                <p>Look, when you balance the federal budget you step on a lot of toes. When you turn Ohio around you step on a lot of toes. And I know how to get the country moving and shift the power back so people can raise up and begin to solve things in their neighborhoods. That's what I want.</p>                \n                \r\n\n            \n                <p>And Eric in order to do it, it takes reform but you need to know how to do it. You just can't make promises that will not come through. It will create more cynicism in the mind of the voters.</p>                \n                \r\n\n            \n                <p>And I will tell you what I'm afraid of. With plans that don't add up Hillary Clinton would be president. And to me that is not good for America. I'm doing this because I want us to win.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Governor -- Governor, we're going to say thank you very much for joining us tonight.</p>                \n                \r\n\n            \n                <p>The Republicans --</p>                \n                \r\n\n            \n                <p><b>KASICH: </b>Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Battle for the GOP nomination", "description": "Governor John Kasich discusses the 2016 election campaign trail on 'The O'Reilly Factor'", "date": "2015-11-02T13:09:52Z"}