{"vcmId": "ad60c017-785d-403e-86bc-da69bc989928", "url": "http://www.foxnews.com/transcript/2015/01/26/american-sniper-controversy-rages-on.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 23, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Back of the \"Book\" segment tonight the \"American Sniper\" controversy rages on. Michael Moore disparaged the film, so did actor Seth Rogen comparing it to Nazi propaganda. Mr. Rogen has since recanted or something. But actor Dean Cain called out Moore and Rogen in a tweet causing Alec Baldwin to attack Mr. Cain. I spoke to the guy who played Superman last night about his relationship with the late Chris Kyle.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, Mr. Cain, you knew Chris Kyle personally, right?</p>                \n                \r\n\n            \n                <p><b>DEAN CAIN, ACTOR:</b> Yes, Chris and I were on a television show on ABC called Stars Earn Stripes. And we paired it up and so we strained together for about six weeks on all sorts of weapons and jumping out of helicopters and doing all sorts of things and became very very good friends.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And so, when you heard Seth Rogen and Michael Moore say bad things about Mr. Kyle it was personal to you?</p>                \n                \r\n\n            \n                <p><b>CAIN:</b> Yes. There is a bunch of us who stay in touch, all the operatives in touch and someone sent me a text that got my attention and show me the tweet and I was just angry at that, my first reaction was anger. Just like if you insulted my brother. And almost like we were standing in a playground I sent back a tweet very quickly and surprised, I'll say surprised at the reaction it's gotten. But I was defending a friend of mine who wasn't there. And I was a little ticked off.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, I mean, sure. But I mean when celebrities get involved with back and forth, tweeting stuff. You know, you say you want to whack Rogen and, you know, whatever, I mean, he didn't really reply back to you Alec Baldwin did and Baldwin unfortunately using the third grade argument that, you know, if you haven't served in the military, you have no right to comment on it. Just about as sophomoric as you can possibly get. But I'm interested in your take on why you think the left -- and these guys are all coming from the left. All right. Why they're so offended by a movie like \"American Sniper?\" I mean, I really don't understand why they're so upset about it.</p>                \n                \r\n\n            \n                <p><b>CAIN:</b> To me it defies explanation. Because in my opinion Chris was the epitome of an American hero. And this movie is not a pro-war movie. They're not making a big, you know, anti-war stance or something. They're picking on someone's real story, they're real life. And it shows the grittiness and ugliness of war. And I just -- it defies any sort of logic to me. And I just feel like I had to say something at that time to defend a friend.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And I'm glad you did. I think more Hollywood stars have got to start to speak out because all we get is the left wing point of view out there. We don't get a lot of other people countering that. Now, you went to Iraq when it was hot. I was over there as well. Tell me about that experience for you.</p>                \n                \r\n\n            \n                <p><b>CAIN:</b> Well, I was in Iraq in 2005. I was with a very small group so we were able to go to a lot of forward operating bases and places that people don't visit. There was a lot going on. I was in Fallujah just after we took it. And I saw a lot of casualties. So I've seen war. I didn't serve. I didn't pick up a weapon and fight. I don't like it. War's ugly. But the things that I saw there touched me and changed me as a person. And my son said after we watched the film he just turned to me and said I don't want to go to war.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How old is your son?</p>                \n                \r\n\n            \n                <p><b>CAIN:</b> My son is 14 years old.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Uh-mm. That's about the age. I don't think I'd take any kids younger than that. The final question is that do you know Rogen or Moore or Baldwin? Do you know these guys?</p>                \n                \r\n\n            \n                <p><b>CAIN: </b>I don't know Moore, I don't know Seth. I enjoy Seth's movies. I do know Alec and he's been known to say some things in the past. I don't take offense to it. I just, listen, everybody has a right to their opinion.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Absolutely. It's a robust debate. And you say what you say. They say what they say. But you're standing up, I guarantee you we're not going to get Rogen or Moore, maybe Baldwin. He came in once. But you stand up, you make your case. That's all we ask. None of this cheap shot twitter business and then you run and hide.</p>                \n                \r\n\n            \n                <p>But anyway -- the late Chris Kyle would have appreciated you, Mr. Cain, you know, for taking a stance. You're in the Hollywood community which is largely left. But you spoke out. And I think he would have admired you for doing so.</p>                \n                \r\n\n            \n                <p><b>CAIN: </b>I sure hope so. And he has my respect -- 100 percent of my respect. He had it then. He'll always have it. And I'm just hurt to hear someone disparage him. And maybe I'll try to keep my mouth shut too.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, I wouldn't do that. Look at me --</p>                \n                \r\n\n            \n                <p><b>CAIN: </b>I said maybe. I promise you it's not going to happen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. It's turned out okay for me. You know, so, you keep talking. You say what you want to say. All right, Mr. Cain, we appreciate you coming on in.</p>                \n                \r\n\n            \n                <p><b>CAIN:</b> Thank you, sir.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "American Sniper controversy rages on", "description": "Actor Dean Cain sounds off on vicious internet attacks against the provocative new film", "date": "2015-01-26T13:30:04Z"}