{"vcmId": "adfdd356-8b1f-43ef-a02b-651d5b662e4b", "url": "http://www.foxnews.com/transcript/2015/04/03/nuclear-talks-with-iran-and-indiana-religious-freedom-law.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 2, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story Segment\" tonight, the two most important stories of the week according to Dana Perino. Here she is co-host of \"THE FIVE\".</p>                \n                \r\n\n            \n                <p>Today they announced some Iranian nuke thing. I don't really understand it, but you know I'm not that quick on the uptake. Can you explain what they announced to me?</p>                \n                \r\n\n            \n                <p><b>DANA PERINO, FOX NEWS HOST:</b> Well, I think the devil is going to be in the details and I don't think we will actually know what is actually in the agreement for many months because they have been discussing and negotiating for 15 months. What they were able to produce today --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>-- is a vague outline.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>A vague outline of what?</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> Some sort of a deal that the administration is going to hail as significant progress, in particular that Iran has agreed to curtail some of its nuclear enrichment and to have it shipped out of the country but not all.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Some of it will be shipped out?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Some.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But we don't know how much?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Correct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We don't know where it's going?</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> We don't know.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Maybe it will go to North Korea?</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> It could. It could go to Syria.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Look -- so 15 months, we have a vague outline of what might happen. And then they go back in and they try to make it less vague by June? Is that what it is?</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> That is the hope. And I think there is another hope here -- two hopes. One is that Congress does move forward to at least have some sort of say in the deal --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Oversight -- sure.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>-- when the State Department gets back and John Kerry can go up and brief the Hill they will know more.</p>                \n                \r\n\n            \n                <p>But the second thing is that we hope that the Iranians continue to do what they have done in the past which is do something outrageous, say something outrageous that saves us from our own bad ideas.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Why do you hope that though? I want peace in the world. I hope that they give up the nukes, don't you?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Well, I think that the administration's line that it is either this bad deal or war is wrong. The reason Iran came to the table in the first place was because of sanctions.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>We're going to slap the sanctions.</p>                \n                \r\n\n            \n                <p>But right now, to be fair to everybody, and I do want to do that on The Factor, we just don't know what's going on. So you have got to do this and they'll be standing in front of the flags until June, right?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Right. And there are going to be people like the Saudis, the Pakistanis, they are going to be very much against this. No matter what, the United States has given away our upper hand and we have strengthened Iran in the region.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> That's a consequence.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Second biggest story of the week is, what?</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> It happened in Indiana. So, Iran and Indiana.</p>                \n                \r\n\n            \n                <p>Indiana, where the governor of Indiana, very popular governor, Governor Pence moved forward with legislation to restore religious freedoms. The problem is they were completely unprepared for the backlash. And I think it was an unnecessary law. It was a completely unforced error and then they didn't even handle the aftermath of it well.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So you don't want to see any law about religious freedom in Indiana, right?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>No. I think -- well, first of all, there is a law about religious freedom that is already a national law. There is federal law. What Indiana -- in my opinion, what they were trying to do was to legalize something that would protect them against a hypothetical. I don't think that's a good way, necessarily to govern.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What was the hypothetical?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>The hypothetical is that maybe there would be some discrimination against people who were against gay marriage in case they didn't want to cater a wedding, for example.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So say you are in Indiana and they didn't do anything and the gay couple came in and said look I want a wedding cake and say with all due respect I don't want to participate in this ceremony. But here is another bakery down the street and they will do it. All right. And you are in Indiana.</p>                \n                \r\n\n            \n                <p>And then that gay couple says we are going to sue you for discrimination. We are going to bring a civil lawsuit against you and it costs money to defend. All right? Isn't the couple that doesn't want to make the cake, shouldn't they be protected in some way?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>You are protected under the federal law in that regard.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You still have to go in civil court. You still have to go through the process in civil court.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Well the thing is -- ok, if Indiana thought that they needed that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> -- but then why would they walk all of it back later on to say that's not what we meant.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Because as you said they didn't handle it properly.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Correct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They didn't build in the -- look, in Indiana you can't discriminate against anybody on the basis of color, creed, lifestyle, whatever. However, if you have a religious objection, conscientious objector, ok, you can in our court system, bring it in and make your case. So that's all they had to do. I think that's what they did in the end.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> It is what they did in the end.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> But it spent a week with boycotts, international --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's craziness. Pizza.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> And it takes away from the fact that the Republicans are actually likely to have additional progress. Gay marriage will not be a wedge issue in 2016 in the presidential election for the first time in decades. That's progress.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's true. I don't think gay marriage is going to be a big issue. But as I told Karl Rove here yesterday, if the Republican nominee for president doesn't stand up for people of faith, for being smeared as bigots and homophobes and everything else, anti-women -- if that person doesn't do it, he'll lose.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Well, think about --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Progressively have to do it.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>This week our administration groveled in front of Iran, a country that is anti-Semitic, anti-women and anti-gay and we nearly lost our minds over a hypothetical situation of a gay couple looking for a possible cake baker in Indiana.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I think Republicans better nominate a strong person who's going to lay it out there. Dana Perino, everybody.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Nuclear talks with Iran and Indiana's religious freedom law", "description": "Dana Perino weighs in on the top stories of the week", "date": "2015-04-03T12:16:13Z"}