{"vcmId": "ae984bf1-5e63-4cce-ba91-310dac7edbf8", "url": "http://www.foxnews.com/transcript/2015/07/09/bill-oreilly-will-feds-finally-hold-san-francisco-accountable.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>For the past 30 years, Americans have not been protected from criminals coming to the U.S.A. illegally. We still do not have a secure border or a fair immigration plan after 30 years.</p>                \n                \r\n\n            \n                <p>The murder of 32-year-old Kate Steinle in San Francisco has outraged the nation. So far about 150,000 of you have signed a petition on BillOReilly.com demanding the federal government incarcerate criminal aliens who return to the U.S.A. after being deported. That will be known as Kate's Law if it gets passed.</p>                \n                \r\n\n            \n                <p>But other things must be done as well. Starting with punishing the city of San Francisco. The sanctuary policies there allowed a Mexican national who had had been deported five times and convicted of seven felonies in the U.S.A. to be released from prison to walk free.</p>                \n                \r\n\n            \n                <p>San Francisco did this despite ICE, Homeland Security, asking them to hold the criminal alien. In the face of that, Mayor Ed Lee and the 11 supervisors apparently aren't sorry at all. Jesse Watters confronted them yesterday.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> Good afternoon, supervisors. My name is Jesse Watters with The O&#8217;Reilly Factor at Fox News Channel. I would like to address your dangerous sanctuary city policies.</p>                \n                \r\n\n            \n                <p>I would like to show you a picture here. It's Kate Steinle. She was murdered by an illegal alien who had been deported five times and over six felony convictions. But for some reason the city of San Francisco let this guy out.</p>                \n                \r\n\n            \n                <p>You guys aren't even looking. Look at the picture. Are you afraid? You guys don't have anything to say?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>Thank you very much. Next speaker, please.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Had nothing to say. In just a few moments Watters will report on reaction from residents in San Francisco.</p>                \n                \r\n\n            \n                <p>California politicians have already weighed in. Senator Dianne Feinstein said, quote, \"The tragic death of Miss Steinle could have been avoided if the sheriff's department had notified ICE prior to the release of Mr. Sanchez which would have allowed ICE to remove him from the country. We should focus on deporting criminal convicts, not setting them loose on our streets.\"</p>                \n                \r\n\n            \n                <p>Senator Barbara Boxer, quote, \"For decades I have supported deporting violent criminals and have always believed that sanctuary should not be given to felons.\" The problem is Miss Boxer has not supported tough border policies that would keep people like Mr. Sanchez out. You just can't be deporting thugs time after time after time after time and that's what they're doing. Although that policy is apparently what Hillary Clinton wants.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>Clinton: Here is a case where we have deported, we have deported, we have deported. He ends back up in our country, and I think the city made a mistake. The city made a mistake, not to deport someone that the federal government strongly felt should be deported.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Secretary Clinton is a bit confused. No city can deport anyone. That's the job of the feds. The Democratic Party has been very soft on border security, also holding sanctuary cities accountable.</p>                \n                \r\n\n            \n                <p>Will the Democrats change? Probably not. They want Latino votes.</p>                \n                \r\n\n            \n                <p>Now, the open border crowd and liberal pundits in general have been very quiet after the death of Miss Steinle. We asked former San Francisco mayor Gavin Newsom to appear, he declined. We asked Jorge Ramos, very outspoken advocate of immigration to appear. So far he has not consented to do so.</p>                \n                \r\n\n            \n                <p>And we asked the entire board of supervisors in San Francisco, who you just saw, to explain themselves. They're all cowards.</p>                \n                \r\n\n            \n                <p>There comes a time when the American people have to rise up and demand the government do the right thing. Now is that time. We must demand accountability to stop illegal immigration madness. We must confront politicians unwilling to protect us, and we must stop the criminal element from coming in here.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Will the feds finally hold San Francisco accountable?", "description": "Bill O'Reilly's Talking Points 7/8", "date": "2015-07-09T12:23:01Z"}