{"vcmId": "af466cff-d436-4787-9bae-5f997796962c", "url": "http://www.foxnews.com/transcript/2015/10/26/bill-oreilly-democratic-party-moving-far-left.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>In the early 1860s, twin 16-year-old boys were put on a boat by their parents in Ireland and sent to America. The boys arrived in Brooklyn, New York without adult supervision as their family back in Ireland couldn't support them. They made their way by doing hard labor and building new lives.</p>                \n                \r\n\n            \n                <p>Those boys were the first of my ancestors on my father's side to come to this country. Over the years, their families became Democrats -- the reason, economics. Working men and women in the northeast had to struggle to gain decent wages and Democrats were sympathetic to that struggle.</p>                \n                \r\n\n            \n                <p>Back then many Democrats were traditional people, people of faith and family. And their party reflected that through the decades, John F. Kennedy was a traditional guy. So was Tarry Truman and Lyndon Johnson.</p>                \n                \r\n\n            \n                <p>But today the Democratic Party has turned far left. President Obama has led that march and his acolytes in Congress are currently violating federal immigration law, embracing a quasi-socialistic economic theory. And as we reported last night even embracing radical anti-police groups like Black Lives Matter.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>What do we want?</p>                \n                \r\n\n            \n                <p><b>CROWD</b>: Dead cops.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>When do we want them?</p>                \n                \r\n\n            \n                <p><b>CROWD:</b> Now.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> What do we want?</p>                \n                \r\n\n            \n                <p><b>CROWD: </b>Dead cops.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>When do we want them?</p>                \n                \r\n\n            \n                <p><b>CROWD:</b> Now.</p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES:</b> I think the reason that the organizers used the phrase Black Lives Matters was not because they were suggesting nobody else's lives matter, rather what they were suggesting was there is a specific problem that is happening in the African-American community that's not happening in other communities.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, it's hard to believe that a sitting president is sympathetic to a group that's calling for violence against American police officers. Remember, the Black Lives Matter leadership has never disavowed the violent anti-cop rhetoric we hear all the time.</p>                \n                \r\n\n            \n                <p>In addition, the Democrats continue to enable sanctuary cities. Do not openly support Kate's Law, designed to protect Americans from illegal alien felons. And a Democrat senator this week Blumenthal of Connecticut even blocked legislation designed to hold the V.A. employees accountable for misconduct and corruption.</p>                \n                \r\n\n            \n                <p>Stuart Varney will deal with that later.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" submits that the Democratic Party right now has been hijacked and is trying to undermine federal law, undermine law enforcement in general and upend our capitalistic system. How many Americans even know that is happening?</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The Democratic Party moving far left", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/23", "date": "2015-10-26T12:12:53Z"}