{"vcmId": "af843d82-8c8c-413f-878e-f5e60a696fab", "url": "http://www.foxnews.com/transcript/2015/12/11/bill-oreilly-explaining-trump-surge.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Brand new CBS poll says Donald Trump is dominating the Republican field right now. He has 35 percent, Ted Cruz 16, Ben Carson 13, Marco Rubio 9, Jeb Bush 3.</p>                \n                \r\n\n            \n                <p>\"USA Today\" poll out this week: Trump 27, Cruz 17, Rubio 16, Carson 10, Bush 4.</p>                \n                \r\n\n            \n                <p>So there's no question Trump could win the nomination and this Christmas he should send Barack Obama a very nice gift for making that possible -- maybe some golf clubs. He should also send cards to many members of the liberal media because it is the Obama media one-two punch that has propelled Donald Trump to the top of the Republican field.</p>                \n                \r\n\n            \n                <p>First the President: there's no question many Americans, perhaps most, are angry with Mr. Obama. He simply will not fight the war on terror in an effective way and many folks feel unsafe. Also he continues to allow people to illegally enter America with impunity.</p>                \n                \r\n\n            \n                <p>From October 1st to November 30th, illegal entries for foreign family units have risen 173 percent over the same time last year. There is no border security and everybody knows it. Just this week another illegal alien criminal, 33-year-old Giomar Diaz allegedly tried to murder a police officer in New Jersey. Like the Kate Steinle case in San Francisco, Diaz had been deported. He went back to the Dominican Republic and then he defies deportation and comes back here. Yet President Obama and the Democratic Party will not get behind Kate's Law which would mandate a five- year federal prison term for any criminal who defies deportation.</p>                \n                \r\n\n            \n                <p>I can't believe the President will not support Kate's Law and millions of Americans feel the way I do. Mr. Obama does not seem to care about justice or public safety.</p>                \n                \r\n\n            \n                <p>Then we have economic insecurity because of the soft economy. You add it all up and there is a fury in America.</p>                \n                \r\n\n            \n                <p>On the media front, they largely support Obama's administration. I mean it's a joke seeing the media demonize Trump while the same people who do that support porous borders and a very soft policy toward the jihadist killers so the media pundits have lost a huge amount of credibility. And the more they attack Trump, the more popular he gets.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>EVAN KOHLMAN, NBC NEWS ANALYST:</b> As a son of holocaust survivor, every time I hear him say something about Muslims I hear the word Jews.</p>                \n                \r\n\n            \n                <p><b>WHITMAN</b>: Frankly, if you go and look at your history and read your history in the lead up of the Second World War this is the kind of rhetoric that allowed Hitler to move forward because you have people who are scared.</p>                \n                \r\n\n            \n                <p><b>WHOOPI GOLDBERG, TV HOST</b>: Because Donald Trump seems to be recruiting, you know, a large group with the views that are against basic American values. He seems to be doing a very good job for ISIS. And I think maybe he should be on the watch list.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, many of you have seen my interviews with Donald Trump and you know we challenge him here. But we treat him fairly. Trump has enough guts to come in here and take the fire something Hillary Clinton and Bernie Sanders apparently will not do. That's a plus for Mr. Trump.</p>                \n                \r\n\n            \n                <p>He is perceived as being a stand-up guy. He is not afraid of the media or the politically correct Pooh-Bahs.</p>                \n                \r\n\n            \n                <p>Right now, it's impossible to say whether Donald Trump will get the Republican nomination. Clearly the G.O.P. establishment does not believe he can defeat Hillary Clinton and, therefore, doesn't want him as a standard bearer.</p>                \n                \r\n\n            \n                <p>However, Mr. Trump has millions of Americans on his side as the polls demonstrate. Again, he can thank Barack Obama and the left-wing media largely for that.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Explaining the Trump surge", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 12/10", "date": "2015-12-11T13:48:28Z"}