{"vcmId": "b00db60b-be6c-46ac-b750-ff1777d8d0c8", "url": "http://www.foxnews.com/transcript/2015/01/07/can-athletes-and-entertainers-calm-racial-tensions.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 6, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Personal Story Segment\" tonight, most African-American sports stars and entertainers who have spoken out about the racial tension in America have sided with the protesters, not the police. There are exceptions like Charles Barkley and Stacy Dash but they are very, very few.</p>                \n                \r\n\n            \n                <p>Joining us now from Los Angeles: former NBA star Jalen Rose who is now an analyst on ESPN. You were raised in a very tough town, Detroit. How do you see the police in America, generally speaking?</p>                \n                \r\n\n            \n                <p><b>JALEN ROSE, ESPN SPORTS ANALYST:</b> I respect the police. I respect all public officials. If I could stop the world on its axis right now -- military, firemen, the police department, teachers, they should all be paid double. That's how much I respect what they do for our great country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So when you see protesters out there saying, listen, police are generally racist and they give black Americans a harder time than white Americans, how do you, Jalen Rose, react to that?</p>                \n                \r\n\n            \n                <p><b>ROSE:</b> I don't think the police start their day by getting in a car looking at one another as two white cops saying hey we are going to go hazard as many blacks as we can today or shoot them down in cold blood. What ends up happening is when you have these unfortunate situations that have taken place, that have caused a national uproar or this Trayvon Martin or Michael Brown killing or Eric Garner killing, the statistics now have people saying wow, it happens to be a white cop versus a black individual.</p>                \n                \r\n\n            \n                <p>Let's further investigate and when you don't indict all of a sudden the hoodie, all of a sudden \"I can't breathe\" now becomes a rally cry not against the police but against a system that a lot of people sometimes feel like continues to let them down.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. But, the statistics say very clearly that most police activity interchanges with all Americans, not just black Americans -- very few violent episodes, very few. The statistics also say that young black men commit far more crimes than any other group, including police killings. So, therefore, you would expect the police to be more wary around young black men, particularly in the inner city situations in which you grew up.</p>                \n                \r\n\n            \n                <p>So, what I'm trying to get across is that and I understand the anger about black people feeling that they're not getting a fair shake from the justice system. And I think that at times that's true. But, generally speaking, I don't think it's true. It's a false narrative. Would I be wrong?</p>                \n                \r\n\n            \n                <p><b>ROSE:</b> I think the goal for everyone, the police officers and the civilians is to get home safely that evening. So, when these encounters happen, as you look deeper into each case, you see armed police officer, unarmed individual who just so happens to be black you would think that interaction wouldn't result into someone's death. When that continues to happen, and it's happening in the country that we did, unfortunately, have slavery, we had segregation. So, these relationships take time to repair with the police department.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. But remember it doesn't happen very much. It happens in proportionally. It doesn't happen very much.</p>                \n                \r\n\n            \n                <p>Now, when Lebron James and other athletes go out with T-shirts that say \"hands up, don't shoot\", or \"I can't breathe\" they are sending a message and the message is that they're sympathetic with the protesters. What do you think about that when you see that?</p>                \n                \r\n\n            \n                <p><b>ROSE:</b> I think they are sympathetic to the dead individuals and to their families. And a lot of times these protesters while I do not agree in any way, shape or form with violent protests, that's what our great country is all about -- freedom of expression to whether you protest in labor law, whether you are a dog lover, whether it's gay or lesbian rights or in this case \"I can't breathe\", I want my favorite athlete to pick up the newspaper and not just read the sports page to actually be a part of their communities.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But should they know what they're talking about though? You see, I would like to talk to Lebron James and some of the other basketball players, very sincerely like I'm talking to you now. And see how much they really know about what they are protesting. I think that would be very instructive but you don't see that very often. They do it but then they don't talk about it and that bothers me.</p>                \n                \r\n\n            \n                <p>Before I let you go, I want to tell everybody that you, in addition to your commentary, put your money where your mouth is that you are trying to repair relations between the police and young black people in the city of Detroit. Just tell us about that.</p>                \n                \r\n\n            \n                <p><b>ROSE:</b> When I started the Jalen Rose Leadership Academy, a tuition- free charter public charter high school in my hometown, one of my goals was to put a police mini station in our school because a lot of times when that interaction happens, there is tension involved and you don't get to see the chance to see that interaction happen when it's friendly.</p>                \n                \r\n\n            \n                <p>So, unfortunately, Detroit doesn't have the funding for police mini stations anymore so the idea didn't come to fruition, it's very important for us to have that interaction when there's not hostility involved.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. And your academy is funded by private donations?</p>                \n                \r\n\n            \n                <p><b>ROSE:</b> Yes. We're tuition free, public charter. We are state funded but our goal is to bridge the education gap through funding, through opportunity, which in turn leads to achievement.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Good for you, Mr. Rose. We appreciate you talking with us tonight.</p>                \n                \r\n\n            \n                <p><b>ROSE:</b> You are welcome.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Can athletes and entertainers calm racial tensions?", "description": "Former NBA star Jalen Rose on the relationship between the police and the African American community", "date": "2015-01-07T13:11:50Z"}