{"vcmId": "b03c3d93-ecc9-4d17-8450-dc809d493e36", "url": "http://www.foxnews.com/transcript/2015/01/07/bill-oreilly-anarchy-in-new-york-city-police-department.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Last night in the Bronx, two New York City detectives were shot by robbers. Both men are expected to survive. But this crime has further angered members of the New York City Police Department. As Talking Points reported last night &#160;The cops using their discretion in enforcing the law on minor infractions and traffic violations.</p>                \n                \r\n\n            \n                <p>For the seven-day period ending January 4th, compared to last year, New York City had a 92 percent drop in criminal summonses issued -- 92 percent. That means traffic tickets, moving violations involving vehicles, low level beefs like drinking in public are being ignored. It's estimated New York City took in $550 million in parking fines alone last year. So the cops are hitting Mayor de Blasio right in the pocketbook.</p>                \n                \r\n\n            \n                <p>Now, many believe the police are wrong in conducting a slowdown. Others say not all cops are involved. But that's not true. A 92 percent drop indicates the entire department is on board. Cops on the street see this as a life/death issue. Much like the anti-police protesters see the Ferguson and Staten Island cases as life/death.</p>                \n                \r\n\n            \n                <p>The police believe Mayor de Blasio is putting their lives in danger by embracing the likes of Al Sharpton, an anti-police provocateur and always has been. But the cops say if the mayor and the city council of New York are going to put us in danger we're going to retaliate. It's a clear protest against the mayor who has alienated the 35,000-member department.</p>                \n                \r\n\n            \n                <p>Police Commissioner William Bratton caught in the middle of this. He's a good cop, an honest man who has improved policing in Los Angeles and here in New York City. But Bratton could be fired at any time if he defies de Blasio so he is walking a tight rope.</p>                \n                \r\n\n            \n                <p>However it's clear the commissioner does not have the ear of his own department. Police officers are sending Bratton a message as well and that message is we are not going to tolerate politicians who put our lives in danger. Unfortunately, civilian lives will be lost in the process. Street criminals now know they can carry weapons without being frisked. They can commit low level crimes with impunity. And they can behave in a menacing way without consequence.</p>                \n                \r\n\n            \n                <p>That's exactly what happened in 1990 when more than 2,000 people -- 2,000 were murdered in this city. Last year the murder count 328. The uber-liberal Bill de Blasio almost in record time has alienated and endangered the largest police department in the nation. It is a stunning display of incompetence.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Anarchy in the New York City Police Department ", "description": "Talking Points 1/6", "date": "2015-01-07T13:05:29Z"}