{"vcmId": "b0544bec-557a-4001-a8f0-868acfcad7ee", "url": "http://www.foxnews.com/transcript/2015/01/09/bill-oreilly-where-is-us-policy-to-fight-jihad.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As we reported last night, President Obama has been very quiet in reacting to the Muslim killers murdering 12 more people in Paris, France. The President's only statement was that we cannot let a few people inhibit freedom. As \"Talking Points\" pointed out last night, we're not dealing with a few people here -- maybe a few million, but most likely many more.</p>                \n                \r\n\n            \n                <p>The Islamic jihad is very active in the following places. Syria, Iraq, Iran, Turkey, Egypt, Libya, Algeria, most nations in Western Europe, Afghanistan, Pakistan, Yemen, Somalia, the Philippines, Indonesia and on and on. In Africa the continent's largest economy Nigeria is being directly threatened by the jihad. And here we have the most powerful man in the world Barack Obama saying the problem is being caused by a few? Very troubling.</p>                \n                \r\n\n            \n                <p>The truth is that extreme Islam has taken deep root in the world and is at the source of ultra violence all around the globe. That's the truth. But in the \"New York Times\", the \"Huffington Post\" and other left wing media you will not hear that.</p>                \n                \r\n\n            \n                <p>After the murders in Paris what we heard and read was the following: \"all Muslims are not bad\", \"freedom of speech is good\" and \"we must not demean Muslims or create Islamophobia\".</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>EVAN KOHLMANN, NBC NEWS TERRORISM ANALYST:</b> Look we have to also respect Islam and we should not deliberately go out and poke our fingers in other people's eyes, you know. Everyone should have the right to critique Islam but at least we should do it with some sense of respect.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Nowhere on the left did you hear a solution about how to combat the jihad. Ever since he was elected in 2008, President Obama's rhetoric has been soft on the Muslim threat.</p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>The future must not belong to those who slander the prophet of Islam. It's time to heed the words of Gandhi, \"Intolerance is itself a form of violence\".</p>                \n                \r\n\n            \n                <p>ISIL is not Islamic. No religion condones the killing of innocents and the vast majority of ISIL's victims have been Muslim.</p>                \n                \r\n\n            \n                <p><b>ANDERSON COOPER, CNN HOST:</b> I've noticed you don't use the term \"war on terror\". I think I read an article that you've only used it once since inauguration. Is that conscious? Is there something about that term you find objectionable or not useful?</p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>You know, I -- I think it is very important for us to recognize that we have a battle or a war against some terrorist organizations. But, that those organizations aren't representative of a broader Arab community, Muslim community.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So let's take a hard look at the broader Muslim community. There are about 1.6 billion Muslims on the planet. Most of them are good people. But a substantial minority are evil and the Islamic faith in general can easily be used to condone violence. Like the Old Testament, there are a number of passages in the Koran that say hurting other people is acceptable.</p>                \n                \r\n\n            \n                <p>Here's an example. \"We will cast terror into the hearts of those who disbelieve for what they have associated with Allah of which he had not sent down any authority and their refuge will be the fire and wretched is in the residence of the wrong doers.\"</p>                \n                \r\n\n            \n                <p>Now, all scripture, the Bible, the Koran, can be interpreted in many ways. So this is not a defining passage for Islam. But it does reflect the thinking of millions of fanatical Muslims that if you are a disbeliever, you deserve to be punished or killed. That is at the heart of the jihad. And that is what the West is avoiding.</p>                \n                \r\n\n            \n                <p>You can't keep saying most Muslims are good and then do nothing to neutralize the bad Muslims. The world continues to turn away from the threat. And the threat continues to grow. This is the same thing that happened in the 1930s, most Germans were not Nazis but they looked the other way as Hitler and his homicidal crew committed atrocities. Most Japanese did not endorse mass murder against civilians, but they continued to support their militarized government, which did that all over Asia. The result, about 6 million German civilians were killed. And about 3 million Japanese died in World War II.</p>                \n                \r\n\n            \n                <p>At this point the majority of Muslims should have joined with America and other nations to fight the jihad. But, they have not joined. Pakistan, Iran, many other Muslim nations actually help terrorists, that's got to stop and the way to make it stop is to slap economic embargoes on Pakistan, Iran, and other offenders. Nobody trades with them.</p>                \n                \r\n\n            \n                <p>But the world will not do that until there is a catastrophe that makes 9/11 look like a school dance. And if things keep going the way they are going. That catastrophe will occur. Iran is close to getting nuclear weapons. Biological warfare is a real possibility with viruses all over the place. There is no question the jihadists will commit mass murder if they can.</p>                \n                \r\n\n            \n                <p>So where on earth is America's policy to fight the jihad? Where is it? Why are we still dealing with Pakistan when that country imprisoned the doctor who led us to Osama bin Laden? It is long past time that President Obama and all the other Western leaders stop talking nonsense and begin formulating a coordinated plan. It's time to stop making excuses for Muslim nations who don't fight the jihad. We are either going to live in a civilized world or we are going to be destroyed. It's as simple as that.</p>                \n                \r\n\n            \n                <p>And one more thing you may remember more than four years ago that I was in the forefront of stopping a proposed mosque on the site of the World Trade Center here in New York City. I said there was not a construction crew in the area that would build that mosque because the location was inappropriate. That was not an anti-Muslim play just logical. You don't build a Benny Hanna at Pearl Harbor.</p>                \n                \r\n\n            \n                <p>The mosque was not built. But my position angered the left. I was vilified in those precincts. So tonight I want to bring you back to the confrontation I had on \"The View\".</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Let me give you an example. The mosque, the mosque down here on 9/11, that's inappropriate. It's -- sure, they have a right to do it and the constitution but it's inappropriate because a lot of the 9/11 families who I know say look, we don't want that. That shouldn't be there.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> There's the President going well, they have a right to do it.</p>                \n                \r\n\n            \n                <p><b>JOY BEHAR, TV HOST:</b> Yes. This is America.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Hold it. Hold it.</p>                \n                \r\n\n            \n                <p><b>ELISABETH HASSELBECK, TV HOST:</b> We're Americans, too. We agree with him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You agree with him.</p>                \n                \r\n\n            \n                <p><b>BEHAR: </b>We're Americans. I'm an American.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Let me break this to you, 70 percent of Americans don't want that mosque down there. So don't give me the \"we\" business.</p>                \n                \r\n\n            \n                <p><b>BEHAR:</b> I don't want to sit here now, I don't.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Go.</p>                \n                \r\n\n            \n                <p>You are outraged about Muslims killing us on 9/11?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now I submit Miss Behar and Miss Goldberg feel the same way today as they did back then. After all this time, all the deaths, all the beheadings, all the mindless violence, the left in America still will not get it. There is a problem in the Muslim world. And sadly among those who will not get it is President Obama.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Where is US Policy to fight the jihad?", "description": "Talking Points 1/8", "date": "2015-01-09T13:48:38Z"}