{"vcmId": "b0b8c0fd-da7a-430a-ad89-bac4d86e5fc3", "url": "http://www.foxnews.com/transcript/2015/06/29/president-obama-crumbling-foreign-policy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 26, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> In the \"Impact Segment\" tonight President Obama's crumbling foreign policy. Today's attacks in France, Tunisia and Kuwait have delivered a fresh blow to the White House's strategy and a new Fox News poll may give the White House additional reasons to worry. Asking if the President is being too soft on Islamic extremists: 58 percent of registered voters said yes; 36 say no.</p>                \n                \r\n\n            \n                <p>Joining us now with reaction from Palm Springs, California former U.S. spokesman at the United Nations Rick Grenell.</p>                \n                \r\n\n            \n                <p>Rick -- I would assume you would agree with this poll. 58 percent say we're being too soft on Islamic -- we can't even call them Islamic extremists, right.</p>                \n                \r\n\n            \n                <p><b>RICK GRENELL, FOX NEWS CONTRIBUTOR:</b> Right. I mean I think that's a really low number actually. I think the evidence is out there that this president is not only a disaster when it comes to having a strategy to fight Islamic terrorists but we don't even have a diplomatic strategy.</p>                \n                \r\n\n            \n                <p>I mean you look across the globe, Eric. You look at the South China Sea and what's happening with the Chinese. The Chinese hacking us.</p>                \n                \r\n\n            \n                <p>You look in Africa where Sudan is really starting to be a really terrible problem, yet again. The South Africans were trying to hold the Sudanese president. And the South Africans had no support from the Americans or from the world to hold this killer.</p>                \n                \r\n\n            \n                <p>And what we are seeing is the diplomatic strategy as well as the military strategy from the White House just non-existent. It's very political in nature. From the very beginning, this president has said that he was going to bring all of our troops home. He wasn't going to start any wars. And that's a commitment that he has made even in the face of radical Islam.</p>                \n                \r\n\n            \n                <p>And what we're doing is we are messaging to our enemies that no matter what you do, the political promise that President Obama made in 2007, in the cornfields of Iowa, regardless of what these Islamist terrorists do, the President of the United States is going to keep his political promise to not start a war. That is really taking the threat of military action off the table and it's dangerous, dangerous --</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>He's evolved on so many other issues. Why can't he I mean literally evolve on whether or not ISIS is JV or not?</p>                \n                \r\n\n            \n                <p>Rick, talk to me a little bit about what's going on. In a few days this nuclear agreement with Iran, the deadline will hit, the end of the month, Tuesday I believe it is. Are we making -- shouldn't we be walking away from this deal right now? Isn't Iran a major, major threat that we are kind of down playing right now?</p>                \n                \r\n\n            \n                <p><b>GRENELL: </b>Yes. And we are not facing the evidence that Iran continues to sponsor terrorists. They continue to finance terrorism around the world. They continue to be the number one state sponsor of terrorism and yet we have a president that's trying to cut a deal.</p>                \n                \r\n\n            \n                <p>Look, I think we have got to stop just complaining about, this Eric. We have to start demanding that the senate and the house -- our elected officials do something. And they need to do something radical. They need to actually stand up and say we are going to stop the White House on this Iran deal by holding other issues back. We can absolutely affect the President's plan going forward on a whole host of other issues.</p>                \n                \r\n\n            \n                <p>I think it's that serious I think that what we need to do is have the senate leaders and house leaders stand up and say we are going to stop certain programs from going forward unrelated to the State Department unless the President and John Kerry pull back this terrible negotiation.</p>                \n                \r\n\n            \n                <p>I mean we've even seen people on the President's team this week, people who are appointed by President Obama have now come forward to say this deal is a disaster. This deal is weaker than what the U.N. negotiated. When you are weaker than the U.N., you know you have problems.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> So, the only way a deal could be struck, the only way it should be struck is if there was -- I don't even think we should strike a deal. However, if you are going to go ahead and do a deal because you are getting pressure from the other five nations negotiating this deal. They want the deal because they want to buy Iranian oil. I understand why they are pushing for it.</p>                \n                \r\n\n            \n                <p>But the only way it could go forward if there was anywhere, anytime inspection agreement. Iran has already said huh-uh, that one is off the table. We should be walking because of that.</p>                \n                \r\n\n            \n                <p><b>GRENELL: </b>You know, Eric, what's so frustrating is from the beginning of this negotiation in 2005 when the Security Council put forward their first resolution against the Iranian regime, we didn't have unfettered access then. The U.N. inspectors, the IAEA have been frustrated since the beginning that there have been no unfettered inspections.</p>                \n                \r\n\n            \n                <p>Why is the Obama team only now, all these years later, throwing up their hands and saying oh, you know, we are still working on this anywhere, anytime inspection regime. We have known from the beginning that the Iranians were not going to come clean. I have to say that this is, again, where the Senate needs to stand up and demand in every way possible that this stop.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Iranians are going to say here, go ahead, you have unfettered inspection access to these four or five sites or 10 sites, whatever it may be, 100 sites, who cares? They are just going to build whatever they want to build somewhere else. You have to get anywhere anytime.</p>                \n                \r\n\n            \n                <p>Let me ask you this Rick. What positive outcome could possibly come for the Obama administration by striking a deal? What are they thinking this deal can bring to them?</p>                \n                \r\n\n            \n                <p><b>GRENELL: </b>Well, look I think President's language has changed Iran will not get a nuclear weapon to Iran will not get a nuclear weapon under my watch. I think that the calculation is again -- going back to the political nature of Susan Rice and Barack Obama. They want to keep their political promises. This is all about looking consistent to the liberal base. This is not about stopping Iran from getting a nuclear weapon.</p>                \n                \r\n\n            \n                <p>I think that there are --</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Does the liberal base, Rick -- does the liberal base want to deal with Iran? Does the liberal base not see the dangers of Iran?</p>                \n                \r\n\n            \n                <p><b>GRENELL:</b> No. I think they do see the dangers but there is an agreement inside the Democratic Party and all of the liberal foreign policy types that this is inevitable. There has been a movement over the last couple of years that Iran will absolutely get a nuclear weapon.</p>                \n                \r\n\n            \n                <p>And so if that's going to happen, it's more about how we manage this process. There is no longer a belief that we can stop this. And I think that's where we have a political difference in that many Republicans and conservatives think that if you can hold fast, if you can have diplomacy, you can have really serious oil sanctions.</p>                \n                \r\n\n            \n                <p>If you have no --</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>That worked. It worked.</p>                \n                \r\n\n            \n                <p><b>GRENELL:</b> No waivers like the President has given. If you can hold everyone together, you can bring them to their knees, the Iranians. And then go in with unfettered access.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>We had that.</p>                \n                \r\n\n            \n                <p><b>GRENELL:</b> And try to bring this down.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>We had that. We had them almost to their knees. They had one knee down and the other one was on its way down and we took our hand off their shoulder. It's crazy.</p>                \n                \r\n\n            \n                <p>All right. Rick, we want to say thank you very much.</p>                \n                \r\n\n            \n                <p><b>GRENELL:</b> Thanks, Eric.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "President Obama's crumbling foreign policy", "description": "Are his overseas stumbles leaving us vulnerable at home?", "date": "2015-06-29T12:22:57Z"}