{"vcmId": "b1027858-5096-41b8-862e-7ef9f3a3e97c", "url": "http://www.foxnews.com/transcript/2016/05/05/trump-on-potential-vp-picks-have-lot-candidates.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" May 4, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Now for the top story, tonight, after defeating Ted Cruz in Indiana yesterday, Mr. Trump said this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I want to congratulate Ted and I know how tough it is. It's tough. It's tough. I have had some moments where it was not looking so good, and it's not a great feeling. And so I understand how Ted feels and Heidi and their whole beautiful family.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Joining us now from his New York City Headquarters is Donald Trump. So I'm a bit confused. For months it was lying Ted, now he is a smart, tough guy. What happened?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, I want to be gracious and he was. He was a good competitor. He was very strong competitor and it worked out we had an amazing day as you know in Indiana. We had a tremendous victory. And won all of the delegates in every county. We won everything. And he really competed hard and tough. So I respect Ted.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. There is no hard feelings, even though he really gave it to you yesterday. You know what he said about you, I wouldn't run it because it was so nasty. So you forgive him?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No. He said some things and he made up some things and he took things that were said out of context. But, you know, I understand it it's not easy. It's not easy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So, you won the battle and you're releasing the prisoners. Would you consider Ted Cruz in your administration? Would you consider him for that?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, he is certainly a capable guy. So, it's something we can think about. A little bit soon to think about too much. It's just happened less than 24 hours ago. But it's something certainly we would think about.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Have you talked to him?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: No, I have not.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Have you talked to Kasich? Kasich dropped out today. Did you talk to John?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: No, I have not. He just dropped out a little while ago. No, I have not. Also, we have had a good relationship with him. We will see how that turns out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, you know, he would be a good VP because you are going to win Ohio. If you don't win Ohio, you're not going to win the presidency. Would you consider him for that?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Well, I would certainly consider him. I mean, he is somebody that I have gotten along with during the debates, during intermission I always seemed to be talking to John.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Oh, yes?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: So, we will see what happens. But I have a good relationship with him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. That's interesting. Marco Rubio is saying nice things about you and we thought he might be out in the sun a little bit too much because he is in Miami and, you know, it's hot. But, you need Florida. You got to win Florida. Would you consider Rubio as V.P.?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, again, I don't want to talk too much about it, Bill, because I am considering a number of people and I think we are going to have a great choice. In the end I haven't made up my mind but we do have a really good -- I would certainly consider him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You would? Okay.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> We do have a lot of candidates that I think would be very, very good. Marco and I have gotten along very well.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Would the campaign slogan be vote for big Don and little Marco? No. That wouldn't work.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No. I think it would be vote to make America great again. Maybe we'll go that way.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. You put Ben Carson in charge of your search committee for V.P., I understand. Do you know what happened when Bush put Cheney in charge of search committee, Cheney got to be V.P. Is that possible here?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I don't think Ben is looking for that. Ben is a terrific guy. He is a friend of mine. He gave me a very warm endorsement very early on.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> And he has been so helpful. He was making calls and doing everything he could, making speeches, doing a lot of television. He is a terrific guy. Dr. Ben Carson a terrific guy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, you know how presumptuous I am and obnoxious I am. You know that. You know me a long time.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> That's true. I do. Absolutely true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And I said last night, yes, and this isn't going to surprise you what I'm about to say to you. I said last night that I believe before you get to Cleveland you are going to try to consolidate the Republican establishment support by doing the following, appointing Rudy Giuliani the Homeland Security chief. Appointing Governor Christie the Attorney General, and Ben Carson in charge of Health and Human Services. I said I think that Trump's going to do that. Would I be wrong?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Well, I have not made that decision but certainly they would be three very wise choices. I think they would be popular but more importantly I think they would do a phenomenal job all three of them. No, I haven't, you know, thought about that. But I will tell you all three would be very good choices and very good positions for themselves. I think it would be good.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But it's the timing of it, would you do it before you went into Cleveland so you would have like a squad you're coming in with?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I like the idea of doing some of this before we go into Cleveland, yes. I could do that and I think it would be well received.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Now, tone, tone, if history is any barometer, the Clinton campaign will go after you through surrogates. Move On, these sleazy left wing websites are going to tear you up. Are you going to respond to that if Hillary Clinton takes the high road and doesn't do any of that?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, I'm going to be able to figure it out. I mean, we have had 17 people just now and I figured that out and I will be able to figure it out with Hillary. It depends on where she is coming from. If she wants to go the low road, I'm fine with that. And if she wants to go the high road, which probably I would prefer, I would be fine with that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Wait, wait, wait, but, wait, you're fine with the low road? Most people don't want to go on the low road?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: No, I can handle the low road if I have to do it. I mean, we've had some low roads over the last few months.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Really?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I'm fine with it if we have to go that direction.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Trump on potential VP picks: We have a lot of candidates", "description": "Republican candidate on his campaign after victory in Indiana on 'The O'Reilly Factor'", "date": "2016-05-05T12:26:35Z"}