{"vcmId": "b2f5bcc2-b8c0-4025-95a6-50ff2426b840", "url": "http://www.foxnews.com/transcript/2015/02/04/bill-oreilly-presidential-race-off-and-running.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Presidential vote about 21 months away, but the campaign is on and that is not a good thing. American voters can get easily overwhelmed with all the B.S.</p>                \n                \r\n\n            \n                <p>However, with the Republican nomination being wide open, and a polarizing Hillary Clinton likely to represent the Democrats, this will be a very high profile election. Obviously the media will play a huge role and unfortunately the press has been corrupted in America by money, the Internet, and ideology.</p>                \n                \r\n\n            \n                <p>Speaking on News Max TV yesterday, CNN commentator Ruben Navarrette is very blunt about Univision which reaches millions of Hispanic voters.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>RUBEN NAVARRETTE, CNN COMMENTATOR: </b>Univision has again showed itself to be a partisan network in favor of Democrats -- making Democrats look good, making Republicans look bad.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> What about NBC, CBS? I mean a lot of people including me would say they are totally biased against Republicans?</p>                \n                \r\n\n            \n                <p><b>NAVARRETTE:</b> I agree. I would agree with that as well. And CNN also fits that category at times. CNN is probably a bigger problem and it affects a lot of the networks as well. They cover the wrong stories.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Pretty bold statement from Mr. Navarrette who is an honest man. Full disclosure, Ruben did say Fox News is biased in favor of Republicans.</p>                \n                \r\n\n            \n                <p>So the political landscape seems to be already tainted. And here's why that matters. Informed voters like you guys will not be swayed by media coverage. But millions of Americans are simply uninformed. They don't know anything about current events. We call them \"Watters World\" voters.</p>                \n                \r\n\n            \n                <p>As I have stated before, the rise of the net allows people to totally escape the real world and they are doing so in vast numbers. Those folks can be swayed by propaganda and misinformation. They don't really watch the news or read newspapers but they pick things up from their friends and, of course, in cyberspace. When you hear about political ground machines getting out the vote, those are the people being targeted.</p>                \n                \r\n\n            \n                <p>Now, it's very likely that most of the American media will line up in favor of Hillary Clinton. She received very generous coverage as secretary of state. There is nostalgia on the left for the good times under President Bill Clinton.</p>                \n                \r\n\n            \n                <p>That will be a huge advantage to Mrs. Clinton. As we saw with Barack Obama the media helped him dramatically.</p>                \n                \r\n\n            \n                <p>As far as The Factor is concerned, we are going to cover the Presidential race in a surgical way. We're not going to allow the candidates to come on and bloviate -- that's not going to happen. Rather, we are going to develop story lines about those who would seek the presidency.</p>                \n                \r\n\n            \n                <p>The two core issues right now are how to increase take home pay for working Americans and how to confront and defeat the jihad.</p>                \n                \r\n\n            \n                <p>Today ISIS put on another disgusting homicidal event, posted it on the net, burning to death that Jordanian pilot, 26 years old, who was captured on Christmas Eve. Put him in a cage and set him on fire. Once again, the White House has no answer, no plan to stop the gross terrorism. Just a few moments to take a look at Senator Rand Paul who himself has trouble with the jihad.</p>                \n                \r\n\n            \n                <p>In the end there is a huge amount at stake in the upcoming election so let the political games begin.</p>                \n                \r\n\n            \n                <p>That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The Presidential race off and running", "description": "Talking Points 2/3", "date": "2015-02-04T13:15:12Z"}