{"vcmId": "b34bf262-08c1-4148-ad27-3ac31e6c1d79", "url": "http://www.foxnews.com/transcript/2016/06/16/bill-oreilly-do-something.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Today in Georgia, Donald Trump made a speech where he once again criticized President Obama for not using the words radical Islamic terrorism. There is also a new insinuation against the President that he is protecting Hillary Clinton in the email investigation.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: She will basically do whatever Obama wants her to do, you understand why, because that whole thing is just ridiculous what's going on there. That's just ridiculous. How that can happen in our country today is absolutely one of the great insults to law enforcement and let's see what happens. But she is being totally protected. I think if something was going to happen on the crimes that have been committed, I would have assumed it would have happened already. Don't you think?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, whatever else is said about Donald Trump, he is the most provocative presidential candidate perhaps in American history. There is no question that President Obama not winning the hearts and minds on the terror front. That's because his methodical approach to neutralizing ISIS has not worked as we pointed out last night. The savages may be losing individual fights, but their jihadi is alive and well. And after watching 49 innocent Americans murdered in Orlando, most of us want action. Do something.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>RICK SCOTT (R), FLORIDA GOVERNOR</b>: When are we going to say enough is enough and say we are absolutely going to destroy ISIS.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Right.</p>                \n                \r\n\n            \n                <p><b>SCOTT</b>: We're going to stop the evil of radical Islam. We have got at some point say is 49 enough? How many more can there be?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The governor is correct. But if President Obama and by extension Hillary Clinton continue to hold power there will not be, not be drastic action taken by the U.S.A. against ISIS or anybody else. It's just the way it is. Donald Trump has capitalized on that. His two big issues are the economy and terrorism. He says the U.S.A. must ban Muslims, at least in the short-term from coming to America if they live in areas that have terrorism. Talking Points does not believe that kind of ban would make us safer. We need the Jordanians. We need the Gulf States. We need Morocco to help us fight the savages, especially in the intelligence area.</p>                \n                \r\n\n            \n                <p>However, as I told Mr. Trump earlier this week, every refugee seeking asylum in this country has to be vetted extensively. No one from a terror area can just take up residence here without ICE knowing exactly what they have done in their lives. By the way, even with extensive vetting, doesn't mean terrorists will not get in. They will, they have. They're here. And in European countries some of the refugees have already committed terrorist acts.</p>                \n                \r\n\n            \n                <p>So this is one big mess. And there are no easy solutions as everybody knows. But with President Obama hesitating to use the words radical Islamic terrorism, the perception in some quarters is. He is not as tough as he could be on the jihadi. And that gives a big advantage to Donald Trump and his quest to become president. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Do something", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 6/15", "date": "2016-06-16T12:25:19Z"}