{"vcmId": "b4ae64b8-0c65-4f79-b72e-446bba282a5c", "url": "http://www.foxnews.com/transcript/2016/01/29/bill-oreilly-big-republican-debate-and-reaction-to-donald-trump-on-factor.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Well, we received about 7,000 e-mails from you guys commenting on Mr. Trump's decision not to attend the Republican debate in Iowa this evening and, of course, about his chat with me.</p>                \n                \r\n\n            \n                <p>There was massive press coverage on that and I will run it down for you real quickly. \"CBS This Morning\" news, fair; ABC's \"Good Morning America\", fair; \"Today\" show used a reporter named Peter Alexander who said I all but begged Trump to do the debate; MSNBC we don't even monitor anybody.</p>                \n                \r\n\n            \n                <p>CNN was strange they used their usual hatchet men to attack Fox News but Anderson Cooper was fair. The worst: old Bob Beckel.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOB BECKEL, CNN CONTRIBUTOR:</b> O'Reilly is scared to death of Megyn Kelly because Megyn Kelly has been beating him in ratings. The first time that's happened since it's been -- Fox News Channel has been on the air.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Of course that is absolutely false. False, not true. And that's why Beckel doesn't work here at Fox anymore. He could not care less about facts.</p>                \n                \r\n\n            \n                <p>On the newspaper side, you know there wasn't anything horrendous. Papers like the \"New York Times\", \"L.A. Times\", \"Washington Post\" -- they don't really care for FNC or Donald Trump. But in this case there weren't any distortions or fabrications, the kind of stuff we see on the left wing Internet sites.</p>                \n                \r\n\n            \n                <p>Perhaps the most interesting analysis was done by Chris Cillizza in the \"Washington Post\". He puts forth that Trump is so far out and ahead that he doesn't need any more debates. So that's why he passed on Iowa. The excuses he made were all smoke. Now, it's impossible to say whether that's true but it's certainly a provocative theory.</p>                \n                \r\n\n            \n                <p>On the viewer front about 70 percent of the folks thought the interview was worthy; 30 percent hated it.</p>                \n                \r\n\n            \n                <p>Sarah Skelton, Yukon, Canada, \"O'Reilly I'm not sure what type of car you drive but I'm guessing there is a Donald Trump bumper sticker on the back.\"</p>                \n                \r\n\n            \n                <p>Frank Richards in Newport News, Virginia, \"Bill thanks for pressing Trump. Based on his tirade against FNC I will have a very difficult time supporting him.\"</p>                \n                \r\n\n            \n                <p>Anna Smith, Appleton, Wisconsin, \"O'Reilly, you claim America wants to get to know Trump. Since when is that your job?\" Well, I believe it's my job to give my opinion, Ann. And that's my opinion.</p>                \n                \r\n\n            \n                <p>Jack Faulkner, Climate Falls, Oregon, \"O'Reilly you exposed Trump for what he really is a vindictive person who is not presidential.\"</p>                \n                \r\n\n            \n                <p>Nancy Smith, Tucson, Arizona, \"Bill, it is not your job to tell Trump how to run his campaign. He is at least as smart as you think you are.\"</p>                \n                \r\n\n            \n                <p>Pam Atkinson, Fluorescent, Colorado, \"Gallant effort, Bill, but Trump cannot be rehabilitated. Narcissists only see their point of view.\"</p>                \n                \r\n\n            \n                <p>Pat Hofstether, Elburn Illinois. \"Bill, don't be a pinhead, Trump is right in changing the status quo and not allowing ridiculous questions by debate moderators.\"</p>                \n                \r\n\n            \n                <p>Ray Schenk, Rosewell, Georgia, \"Bill, I must compliment you on the Trump interview. You schooled him and he lost his powerful persona as a result of his running away from the debate.\"</p>                \n                \r\n\n            \n                <p>And finally Don Newsham, Happy Jack, Arizona. \"Bill, you are a wimp.\"</p>                \n                \r\n\n            \n                <p>So you can see the Trump interview sparked a tremendous amount of debate across the country. And that's a good thing for America because this man may indeed get the Republican nomination. As I said to him last night, the more folks know about the Trump candidacy the better for the country.</p>                \n                \r\n\n            \n                <p>Talking Points submits to you that most Americans did not know much about Barack Obama. Yes, he was reelected and that is to his credit. His skill campaigning allowed him two terms but did voters really understand really Mr. Obama's governing philosophy? I don't think so.</p>                \n                \r\n\n            \n                <p>So if Donald Trump, a private businessman his entire career trying to gain enormous power, we the people, have to pay attention. That was the theme of last night's interview.</p>                \n                \r\n\n            \n                <p>By the way, even if you are calling me names, I appreciate you watching The Factor and taking the time to write in. What I don't appreciate is dishonesty in the media but in truth, I thought I'd see a lot more of it after last night's interview.</p>                \n                \r\n\n            \n                <p>Everyone should understand that many consider FNC the most powerful news agency in the world right now. That leads to an enormous amount of envy.</p>                \n                \r\n\n            \n                <p>Finally for all you one-issue folks, and you know who you are, I have to confess I throw your mail in the garbage not because of your opinion but because fanaticism is boring. I get mail from fanatical feminists, socialists, other extreme folks, presto, it vanishes. Maybe that's wrong, but I simply do not have time for it.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The big Republican debate and reaction to Donald Trump on 'The Factor'", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/28 #GOPDebate", "date": "2016-01-29T13:22:25Z"}