{"vcmId": "b533fca8-2ea3-4833-be54-6eeb2c4760d3", "url": "http://www.foxnews.com/transcript/2015/07/07/sanctuary-cities-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" July 6, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Thanks for staying with us, I'm Bill O'Reilly in the \"Personal Story\" segment tonight, we wanted to get Charles Krauthammer's opinion of my assertion that the federal government should crack down on sanctuary cities. In the Talking Points memo, I said San Francisco Mayor Ed Lee is partially responsible for the murder of a young woman by a five times deported felon. Also Greece wanting the world to pay its bills.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington is Charles Krauthammer. First, sanctuary cities. What would you do?</p>                \n                \r\n\n            \n                <p><b>CHARLES KRAUTHAMMER, SYNDICATED COLUMNIST:</b> Well, you know, this isn't new, the first one I think was declared in 1979, L.A. And you would have thought that we got over this notion of states and localities proclaiming their own laws in defiance of the federal law with the civil rights era, 50, 60 years ago when people would stand in the schoolhouse door and deny integration because of state's rights. You know, and if you were, you know, last week, when we had the decision by the Supreme Court on gay rights, there would all these -- and people became very upset.</p>                \n                \r\n\n            \n                <p>That if few states were thinking of holding out on their own. You are not supposed to do that and you certainly aren't supposed to do it on sanctuary cities. I think it's a disgrace, it's clear, very clear that immigration law is in the hands of the federal government. This administration when Arizona tried to strengthen immigration laws went after them and sued them. But when you have dozens of localities around the country not only weakening but essentially abandoning the immigration laws, they don't say a word. I think the only thing you can do is withhold money.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You can do that, but you can have the mayor of San Francisco arrested. You could. Because he openly has said, look, we are not going to hand over the criminal aliens. As I said and it's worth repeating. This man, who killed the 32-year-old woman was held -- he was in custody and the Feds says specifically, you hold him, don't let him go. They let him go. That's a criminal offense because the federal law, as you know, overrides the state law, the city law. They have to obey. But because the Obama administration won't enforce the 1996 law signed by Bill Clinton, these cities, it's anarchy. It's total anarchy.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>And this is not the only issue on which the Obama administration unilaterally stops enforcing the law. It's done so with low level drug crime where they basically told their prosecutors supposed to be discretion but it's really overriding the law unconstitutionally that certain crimes with minimum sentences are simply not to it be prosecuted and even evidence to be withheld so it doesn't trigger the automatic sentence. They have done it, of course, on immigration where they essentially unilaterally passed the Dream Act.</p>                \n                \r\n\n            \n                <p>You can argue that the Dream Act is a good idea. But that's for Congress to go. It's not for the administration to do. And the whole thing, the executive order Obama signed last year that is now being held up by a Texas judge because it is unconstitutional is a way of simply unilaterally saying, we are not going to enforce the immigration laws that are on the books passed by Congress for five million illegal immigrants. So, if you give that message, of course people around the country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. Of course, I need a quick yes or no because I want to get to Greece, Mayor Lee in San Francisco partially responsible for this young woman's death in your opinion.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Look, a lot of people are partially responsible. I would rather arrest the guy who did the shooting.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, he is already arrested.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> And I would rather other guys who are now on, you know, who have been let out against the wishes of the federal government.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> But also responsible is the federal government and an administration --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Like I said. Absolutely.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> That sends a signal that there are no rules, there are no laws.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You don't have to obey the law.</p>                \n                \r\n\n            \n                <p>All right. Greece, they want everybody to pay their bills. They go to the polls. And they are all happy that they voted against any kind of austerity, economic austerity. They want their big pensions but they want the European Union to pay for them. I wouldn't. I would say hey, have a good time down there, I will see you in Santorini. I am not paying you anymore. We are not lending you anymore. Bye-bye. That's what I would do? You would do what?</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>I would do the same and I think Europe is going to do the same. They won't do it quite as bluntly but, you know, the Greeks want to live off.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Everybody else.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER:</b> Hard working Northern Europeans and you can do that for a while. You could do that through two bailouts but in the end, if you don't reform your system, the Europeans are not going to go along. The Greeks are celebrating today --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>KRAUTHAMMER: </b>That's going to be a very short lived celebration.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know, some ways the Greek is saying, no, I don't want you dancing like I do over this. I want responsibility. Charles Krauthammer, everybody</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "'Sanctuary cities' in America ", "description": "Charles Krauthammer on cities that protect illegal immigrants and the financial chaos in Greece", "date": "2015-07-07T12:23:25Z"}