{"vcmId": "b5446549-6dcc-46e5-a0ad-682c4cbd32b7", "url": "http://www.foxnews.com/transcript/2017/02/27/president-trump-chides-media-in-cpac-address.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 24, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>CHRIS WALLACE, FOX NEWS HOST</b>: Hi, I'm Chris Wallace in tonight for Bill O'Reilly. Thanks for watching. Our top story, President Trump wows the crowd at CPAC today with a rousing speech that hit on a number of familiar themes. Immigration, the wall, ISIS, the economy, and ObamaCare. But it was his blistering attack on the media that really got the crowd going. The President doubled down on his condemnation of unnamed sources and so- called fake news.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>PRES. DONALD TRUMP (R), UNITED STATES</b>: A few days ago I called the fake news the enemy of the people and they are. They are the enemy of the people.</p>                \n                \r\n\n            \n                <p><b>(CHEERS)</b></p>                \n                \r\n\n            \n                <p>In fact, in covering my comments, the dishonest media did not explain that I called the fake news the enemy of the people, the fake news. They dropped off the word \"fake\" and all of a sudden the story became the media is the enemy. They take the word fake out. I'm against the people that make up stories and make up sources. They shouldn't be allowed to use sources unless they use somebody's name. Somebody said a poll came out. And I say what network is it? And they will say a certain -- let's not even mention names, right? Should we? Well, you have a lot of them. Look, the Clinton News network is one.</p>                \n                \r\n\n            \n                <p><b>(CHEERS AND APPLAUSE)</b></p>                \n                \r\n\n            \n                <p>But as you saw throughout the entire campaign and even now the fake news doesn't tell the truth.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>WALLACE:</b> But one of the targets of Mr. Trump's fire the editor of the \"New York Times\" makes no apology for his paper's coverage of the Trump administration.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DEAN BAQUET, NEW YORK TIMES EXECUTIVE EDITOR</b>: I think the coverage of Donald Trump has been sensational. I mean sensational in a good way but not sensationalistic. I think it's been tough and aggressive. I think he is not used to it.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>WALLACE:</b> Joining us now from Miami with reaction, FOX News analyst Bernie Goldberg, purveyor of BernardGoldberg.com. Bernie, what do you make of President Trump's continued general attack on, quote, \"Fake news media\" and his specific attack now on the use of unnamed sources?</p>                \n                \r\n\n            \n                <p><b>BERNIE GOLDBERG, FOX NEWS CONTRIBUTOR</b>: This isn't Donald Trump shooting from the lip as he so often does. This is a coordinated, calculated, war on the media and the goal is simple. Try to bring them down, try to delegitimize them. Try to take away what credibility they may still have left, eviscerate that credibility so that when they -- and they will, report something Donald Trump doesn't like, and I don't mean just doesn't like I mean really doesn't like, people won't believe them. It comes down to a sentence. Steve Bannon and Donald Trump want to bring the mainstream fake media as they put it down before the media bring them down. But --</p>                \n                \r\n\n            \n                <p><b>WALLACE</b>: Let me pick up on that because the President complained in his diatribe about unnamed sources. He complained specifically about \"The Washington Post\" story that had nine unnamed sources. And he said well, that's bull. They didn't have any sources. But, in fact, the story he is referring to was \"The Washington Post story that revealed the fact that when General Michael Flynn spoke to the Russian ambassador, despite his earlier denials, that he had actually talked about sanctions with the Russian ambassador and fake news or not, it was on the basis of that information, not necessarily the story but the warning from the Justice Department that Trump fired Michael Flynn.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Exactly. Exactly. Look, let's talk about sources and about one of the sound bites that you played leading up to this segment. Donald Trump says and this is Donald Trump saying today at CPAC that reporters shouldn't be able to use any sources without attaching a name to it. Okay. If that were the case, we wouldn't know what was going on in the Nixon White House during Watergate because deep throat was an anonymous throat.</p>                \n                \r\n\n            \n                <p><b>WALLACE</b>: Listen, we wouldn't know what's going on in the Trump White House. We have unnamed sources in the Trump White House all the time.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Exactly. Exactly. And let's just go today at CPAC. A couple of hours before Donald Trump made that statement, there was a press briefing at the White House held by two top officials of the Trump administration, but there was a condition, Chris. And the condition was that they be anonymous sources. Okay? I mean, come on. How could Donald Trump go up there and say there should be no anonymous sources, you should attach a name to it. Two hours after his own people want to remain anonymous sources. It's crazy.</p>                \n                \r\n\n            \n                <p><b>WALLACE</b>: Bernie, let me ask you about another dust-up today at the White House. And Sean Spicer after the President's CPAC speech invited a bunch of reporters, there was more than a dozen reporters invited into his office for a briefing but he specifically excluded reporters from the \"New York Times\" and CNN. What do you make of that?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Well, let me make sure I understand this. When Barack Obama's White House tried to marginalize and delegitimize FOX News, conservatives rightly were angry. When the Obama White House wouldn't let people come on your Sunday show, we were angry at that, too. Again, rightly. But now the Trump White House is saying we don't like these news organizations because they are unfair to us, so we'll keep them out. We're supposed to accept that?</p>                \n                \r\n\n            \n                <p><b>WALLACE</b>: Well, let me just say, I should pointed out that the White House Correspondence Association, including FOX News, has formally filed a protest with Sean Spicer about that, the idea of marginalizing and saying some news organizations will be allowed into a briefing but others won't.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Right. But there are two parts of this that are hypocritical. The Trump White House part and the people who are the most avid supporters of Donald Trump. According to a CBS poll, that's only 22 percent who say they support him, period. That is the words in the poll, period. We support him under any circumstances. They don't care about this. Their position is, you did it to us, now we are doing it to you. And that's why I have said before and I will say it again to you tonight, Chris, in the world of political dialogue, principles are either dead or on their death bed. This is not.</p>                \n                \r\n\n            \n                <p><b>WALLACE</b>: Okay. Let me ask you. I got just a little bit of time left and I want to get into one more thing with you because there is another controversy at the White House today. One reason that the White House may be mad at CNN is that they reported a story that Reince Priebus tried to put pressure on the FBI to knock down a story that had gotten wide circulation that there was lots of association during the campaign between Trump associates and Russian intelligence. What do you make of that story?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Well, first of all, I don't know what is true and what isn't true. I don't necessarily believe a mainstream media's version of it but I don't necessarily believe Donald Trump's version of it, either. Look, a lot of this the press brings on itself. Some reporters -- the animosity level against Donald Trump in some quarters is in the unhealthy range. Some reporters would like to see him destroyed. But, but, bias as bad as it is, isn't fake news. There is a big difference and I think Donald Trump, sooner or later, is going to have to realize that news he doesn't like isn't fake, it's biased, which shouldn't be.</p>                \n                \r\n\n            \n                <p>Fake news is Hillary Clinton's running a sex ring for children out of a pizzeria in Washington. That's fake. Reporters -- I worked at CBS News for 28 years. They have biases, they have faults, but they don't go into a room and say let's make up sources and let's make up stuff to hurt Reagan, Bush, or Donald Trump. It doesn't happen that way.</p>                \n                \r\n\n            \n                <p><b>WALLACE</b>: Bernie Goldberg, everyone. Bernie, thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "President Trump chides media in CPAC address", "description": "'The O'Reilly Factor' examines reporting on Trump administration", "date": "2017-02-27T12:50:12Z"}