{"vcmId": "b6d80d4b-767e-4506-baa2-36dde4e54127", "url": "http://www.foxnews.com/transcript/2014/10/14/reporter-faces-possible-jail-time.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 13, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story\" segment tonight. Both the Obama administration and the Bush administration before believed \"New York Times\" journalist, James Risen, violated national security by publishing secrets about NSA surveillance.</p>                \n                \r\n\n            \n                <p>That came about because of the 2006 book, \"State of War,\" in which Mr. Risen said an anonymous government sources which the feds want him reveal. Hears what I said back then.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Risen flat-out states President Bush broke the law by allowing the National Security Agency to listen to calls made by Americans. Risen, however, downplays the nature of the calls -- that they were reportedly made to overseas people. And al-Qaeda surveillance was the primary reason.</p>                \n                \r\n\n            \n                <p>Again, this NSA deal is largely undefined. There are good arguments on both sides.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, Mr. Risen has a new book called, \"Pay Any Price -- Greed, Power and Endless War,\" which comes out tomorrow. He joins us now.</p>                \n                \r\n\n            \n                <p>Now, here's what I don't understand about the bigger picture in what you're writing about.</p>                \n                \r\n\n            \n                <p><b>JAMES RISEN, NEW YORK TIMES INVESTIGATIVE REPORTER: </b>Uh-huh.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Why doesn't the Obama administration and the Bush administration before -- why don't they get the warrants to listen. Because they're easy to get from the FISA Court, are they not.</p>                \n                \r\n\n            \n                <p><b>RISEN: </b>Well, what happened was the Bush administration went around that court because they argued that they wanted to listen in on so many people so fast, that they needed to use new technology to do -- in a way that the courts, the secret FISA Court couldn't keep up with.</p>                \n                \r\n\n            \n                <p>That was their argument. But since then, there's been new laws after our stories came out that allowed basically -- legislation that allowed them to basically do what they were already doing.</p>                \n                \r\n\n            \n                <p>Now, the Obama administration has expanded it exponentially with all the social media, Facebook and Twitter. They grabbed all of that. And so, now, the NSA has much more digital information --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Do they have to pass a new law to keep up with this.</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Yes, now, there's --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, the technology is outrunning --</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- the law.</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK, now all of this is centered around one thing. And correct me if I'm wrong because I haven't read your new book. I just got it, OK.</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> OK.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's centered around both administrations, saying, \"We need to monitor what the terrorists are doing. That's why we're doing this with all of our Intelligence agencies.</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's it, right</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> That's their argument. But I think you -- if you look at the details of the way in which we fought the war on terror, we've given the government way too much power over the last 13 years.</p>                \n                \r\n\n            \n                <p>We've poured hundreds of billions of dollars into this. At the same time, we got rid of a lot of the regulations and rules governing the way we handle Intelligence.</p>                \n                \r\n\n            \n                <p>And so, that led to a lot of unintended consequences in the way in which we fought the war on terror. And we have -- if you look at all of the countries in which we've had combat operations since 9/11, I think it would be difficult to say that any one of those countries is doing better than they were before we got involved.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> OK. Let's put that aside though. It's intent that I want to know about --</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>-- tonight. Intent.</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Uh-huh.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Do you believe there's evil intent on the part of either administration or both to listen and spy on civilian conversations.</p>                \n                \r\n\n            \n                <p><b>RISEN: </b>I don't think that was the intent. I think the intent was --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So, there's no intent to do wrong. It's just misguided in the way they carry out national security, in your opinion.</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Yes. And I think that the problem was where there was little oversight --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> -- when they try to do it in secret. And so, when you have a secret -- a lot secrecy, you're going to lead to abuses.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Parents can't even -- can't even oversee their own children --</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>-- with this technology anymore.</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Right, right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, let's get to you. So, they want you -- they, the Obama administration now, to tell them who gave you all this inside stuff. That's the crux of the matter, right.</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Where is that legal case now.</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> It's kind of -- it's going to a trial in January. And they've indicated that they're going to subpoena me again shortly, so --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right, so the Supreme Court said it can go ahead, right.</p>                \n                \r\n\n            \n                <p><b>RISEN: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It's a big deal.</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Where is the trial -- in Washington?</p>                \n                \r\n\n            \n                <p><b>RISEN: </b>Virginia.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> In Virginia. All right, so they're going to subpoena you and ask you again --</p>                \n                \r\n\n            \n                <p><b>RISEN: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- and you're going to say, \"I'm not telling you,\" --</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>-- just like James Rosen for us, \"I'm not going to tell you.\"</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> He's, by the way -- I really respect what he's done on this, so --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, don't pump him up too much.</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p>He's already a problem with us. So, you're going to go on trial and you're going to say, \"I'm not telling you,\" all right.</p>                \n                \r\n\n            \n                <p><b>RISEN: </b>Right, right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And they're likely to do what.</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> I don't know.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> What are your attorneys telling you.</p>                \n                \r\n\n            \n                <p><b>RISEN: </b>Well, we don't know. We don't know. The government --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Could they order you to jail right then.</p>                \n                \r\n\n            \n                <p><b>RISEN: </b>They could, yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>In hearing contempt of what.</p>                \n                \r\n\n            \n                <p><b>RISEN: </b>Contempt of court, at that point, yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> If the judge goes along, he could order you into jail.</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Because this is all centered around like the WikiLeaks stuff and Assange -- you know, it's almost the same thing, is that leaks from the National Security Agencies, to journalists and the sciences, that's what he was.</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And then the government says, \"Look, you're putting people's lives in danger.\"</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's the Assange argument. And some of them level those charges at you.</p>                \n                \r\n\n            \n                <p><b>RISEN: </b>Sure. That's always the argument they used.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And does it have any credibility to you at all.</p>                \n                \r\n\n            \n                <p><b>RISEN: </b>I don't believe so. I don't think you can point to anything that's been done, written in the press in the last 10 years that's really affected national security.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Do you -- if you go to jail, then you'd be free to write another book, you know --</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Yes, yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- \"Babe Dropped on Me in the Cell\" or something like that.</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p>But we don't want you to go to jail. I have to say that. I mean, you know, Rosen is OK.</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p>They can send him to jail anytime they want. But you're doing you're job. And if I were you, I probably would have done the same, I have to say, as a --</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> You know what I -- everybody who says nice things about me, I always say, \"I think every other reporter that I know would do the same.\"</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, not. There's a lot of corruption in the press right now.</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p>But any reporter who's honest, you have to protect your sources.</p>                \n                \r\n\n            \n                <p><b>RISEN:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right, good luck with the book, Mr. Risen. We appreciate you coming on in.</p>                \n                \r\n\n            \n                <p><b>RISEN: </b>Thanks very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Reporter faces possible jail time", "description": "Journalist James Risen under fire for publishing secrets about NSA surveillance", "date": "2014-10-14T12:21:35Z"}