{"vcmId": "b7fe154b-ba82-4980-8842-b5f0f90f756a", "url": "http://www.foxnews.com/transcript/2015/03/25/glenn-beck-leaving-republican-party.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 24, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Factor Follow up Segment\" tonight. Last week we talked about Glenn Beck saying he's going to leave the Republican Party. Fox News analyst Karl Rove basically saying, that's not a good thing for the Party but it will survive.</p>                \n                \r\n\n            \n                <p>Joining us now from the (inaudible) the legendary Glenn Beck --</p>                \n                \r\n\n            \n                <p><b>BECK:</b> Hold your applause. Hold your applause.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Beck, you know, I was talking to you before we went on and I said, you know, the hair is getting a little white there, do you know what I'm talking about?</p>                \n                \r\n\n            \n                <p><b>BECK: </b>At least some of us have hair.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, well, that's true. You are looking a little like Fred McMurray at the end of the line for him.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>Good to see you too, Bill. It's always a delight to be on the show.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. I don't believe you are leaving the Republican Party because you like Ted Cruz, you are going to vote for Ted Cruz if he gets the nomination.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> Oh my gosh, I would vote for Ted Cruz but that's different than the party. I think that's what Karl Rove --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I think he is running as a Republican, Beck. Did anybody break that to you?</p>                \n                \r\n\n            \n                <p><b>BECK:</b> I know. But he's running as a principled Republican, so I would give my money to him. I'm not just giving my money to the party anymore because the party right now is attacking people like Ted Cruz. There are more slings and arrows coming from the Republican Party against Ted Cruz than there is outside of the Republican Party.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But that always happens. When Bush announced he got slings and arrows. You know what the game is. Tear down.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>But that's the problem. Bill -- that's the problem. People are tired of playing the game. You know, I made a little list as I was watching you last week. I made a little list. They surrendered on the abortion bill, surrendered on executive orders on illegal immigration, common core. They helped push through $3.5 trillion in deficits this last year. They won't fight Obamacare. They voted to confirm Katz Unstein (ph). They thwarted the bill on the NSA data collection. They're still not doing anything on Benghazi. They haven't done anything on the targeting of conservatives with the IRS. They haven't done anything on the VA. They also threw an election against Chris McDaniels to Thad Cochran. They actually went to the Democrats and played the race card. I mean, I can get that from Hillary Clinton's people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Al right. Look, I'm not going to stick up for the Republican Party. I'm not a Republican. I don't know what they are doing. I don't care what they are doing. And all of the things that you are saying --</p>                \n                \r\n\n            \n                <p><b>BECK:</b> I do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>-- may be right. But I will tell you one thing, the strategy now is and I know this to be true. We have to win, we have to beat Hillary Clinton. Right. We have to win.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>Oh my gosh -- Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's the strategy. Win.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> They were always -- listen to me. We're always saying that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But now they have the House and the Senate, Beck.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>We had to have the house. Then we had to the House. Then we had to have the House and the Senate. Now we have to have the White House. And then when they get the White House, the House, and the Senate then it becomes the Bush administration where it's just as bad on deficits and everything else. They don't have any intention of doing anything.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Bush cut taxes and the economy was pretty good.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> Oh my gosh.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> After 9/11 we got hit but it came back pretty strong and then that mortgage thing fell off the roof.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> We'll agree on this. Bill, we will agree on this. It's a slower route to the same disastrous legislation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I can't agree with that but, look, what I'm trying to tell you is I understand your fervor for change. I understand it. And I want it, too. I don't like a lot of these policies. I would like them to be torn asunder. But you have to deal with what reality is and how many votes you can garner to get these things done.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> Bill, we know.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's not like they're afraid to do them.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> Do you know who is going to win in a matchup between Hillary Clinton and Jeb Bush? Hillary Clinton.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm not sure about that.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>Yes, she would.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Look, I'm not rooting for Jeb Bush.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>Jeb Bush is Hillary Clinton light.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I think Americans --</p>                \n                \r\n\n            \n                <p><b>BECK:</b> Look here is the thing. You want a real matchup? Let's give America a choice. Elizabeth Warren on the left, let's have -- she will step up and she'll actually say what she means and means what she says. Put Elizabeth Warren and Ted Cruz and let America decide -- a real choice.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I would love that. That would be great.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>I would too.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's would be great. But that's not going to happen.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> America's going to love that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So we can't -- I know you live in fantasy land. That's where you like --</p>                \n                \r\n\n            \n                <p><b>BECK: </b>No, I don't.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You know Peter Pan personally. I know you do. I have seen you with him.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> I think you and Karl Rove live in --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How do you frame me with Karl Rove? I have nothing in common with Karl Rove. I don't do that kind of stuff.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>I know. I know that. No, no, no. I know you don't. But you are agreeing with him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm not agreeing with him. I'm telling you what the strategy is. I'm not agreeing with it.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>I know what the strategy is I'm telling you that it's the same strategy that gets us nowhere.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. So you are going to throw your weight and I can't see your tummy but you are throwing your weight behind Ted Cruz. Is that correct? You're with him? You are his guy for now?</p>                \n                \r\n\n            \n                <p><b>BECK: </b>I love Ted Cruz but I also am open to Rand Paul. I'm also open to Scott Walker. Right now my guy is Ted Cruz but I want to learn more from the other two.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's open-minded of you. That is open-minded, Beck.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> I know.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So you are not leaving the Republican Party. You just want to know a little bit more about it.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> No. Here is the thing. Don't vote for parties. Don't blindly support the party.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's correct. Now I agree.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>Support the people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's right.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>Support the people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's right.</p>                \n                \r\n\n            \n                <p><b>BECK: </b>In the meantime, you know, you know, what kills me is for a year I had this on my desk for radio. We were covered on radio. This has bee in pictures.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Defund the GOP?</p>                \n                \r\n\n            \n                <p><b>BECK:</b> I sell T-shirts for over a year. This is not a new stand for me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Where does your money go Beck for the -- in the dopey T- shirt? Where does that money go?</p>                \n                \r\n\n            \n                <p><b>BECK:</b> To me.</p>                \n                \r\n\n            \n                <p>This is the difference. This is why you are going to hell and I'm going to heaven. My money that I sell on BillOReilly.com went to charity.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> Can I tell you something? I'm going to hell in a nice car.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I will wave at you, Beck.</p>                \n                \r\n\n            \n                <p><b>BECK:</b> I will wave at you from the other side of the gate, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I don't know if you will have a hand.</p>                \n                \r\n\n            \n                <p>Glenn Beck, everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Glenn Beck leaving the Republican Party", "description": "Political commentator disenchanted with the GOP", "date": "2015-03-25T12:24:46Z"}