{"vcmId": "b982d21e-fcb0-4041-85a5-6ac2d3a20ab8", "url": "http://www.foxnews.com/transcript/2015/02/27/bill-oreilly-christians-in-danger.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>According to the British based Syrian Observatory for Human Rights group, 220 Christians have recently been abducted by the ISIS savages. Of course, there is a good chance they will all be brutally executed. Simply put, the Christian minority in the Middle East is under siege by the jihadists who believe they are mandated by their God to kill infidels.</p>                \n                \r\n\n            \n                <p>The statistics are grim. A report by Open Doors International says the following. 80 percent of nations where Christians are persecuted the most are Muslim. The top five countries that persecute Christians are North Korea, Somalia, Iraq, Syria and Afghanistan.</p>                \n                \r\n\n            \n                <p>Some examples of repression: the Muslim Brotherhood in Egypt has attacked churches and Christian-owned homes looting and torching the properties; Saudi Arabia any religion other than Islam -- against the law; in Iran authorities routinely arrest members of Christian communities.</p>                \n                \r\n\n            \n                <p>But the Christian world is largely silent in the face of the atrocities. Yes, Pope Francis did speak out after 21 Coptic Christians were beheaded in Libya by the jihadists but there isn't an organized effort to protect Christians in the Middle East -- very disturbing. Here in the U.S.A. the Obama administration continues to downplay the threat from the jihad.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOHN KERRY, U.S. SECRETARY OF STATE: </b>Despite ISIL, despite the visible killings that you see and how horrific they are, we are actually living in a period of less daily threat to Americans and people in the world than normally -- less deaths, less violent deaths today than through the last century.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>With all due respect to Secretary of State Kerry, he would be better served by developing a strategy to neutralize the Islamic terrorists rather than an attempt to provide dubious perspective.</p>                \n                \r\n\n            \n                <p>Once again, Talking Points will state that the ISIS savages are running wild because the world is a cowardly place. The jihadis know they can pretty much do thinking anything they want and the world will not unite against them. Shouldn't be all America; President Obama should lead but other countries should encourage him to do that. Instead we have a 60- nation coalition that refuses to attack ISIS where it lives -- in Syria.</p>                \n                \r\n\n            \n                <p>Meantime thousands of Christians are being slaughtered. Young children are being raped and forced into military situations. Women are being sold into slavery. And any Muslim not Sunni is a death target as well. History will record that is an unbelievable situation.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Christians in danger", "description": "Talking Points 2/26", "date": "2015-02-27T13:47:39Z"}