{"vcmId": "ba1e6973-21fb-4e8b-89d3-9c5bd573c31d", "url": "http://www.foxnews.com/transcript/2016/01/25/republican-primary-outlook.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 22, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>ERIC BOLLING, FOX NEWS HOST:</b> Hi. I'm Eric Bolling in for Bill O'Reilly. Thanks for watching this special 2016 election edition of The Factor, the Republican primary outlook.</p>                \n                \r\n\n            \n                <p>Let's get right to the top story: the political war brewing in the GOP. The conservative wing of the party is setting itself apart from other Republicans and Independents as it launches a major offensive against Donald Trump.</p>                \n                \r\n\n            \n                <p>When Trump entered the 2016 race last June, many saw him as a joke. But he shot straight to the top of the polls. And now those same people see him as a threat. To the dismay of some Republicans Trump's calls to arrest and deport all 12 million illegal immigrants in the U.S. and to temporarily ban all Muslims from entering the country have only strengthened his grip on first place.</p>                \n                \r\n\n            \n                <p>So, today, the \"National Review\", a conservative bible, published a special issue focused solely on taking down Trump. 22 pundits wrote poison pen essays on why they think Trump is a danger to their cause. Naturally, Trump immediately fired back.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL CANDIDATE:</b> The \"National Review\" is a dying paper. Its circulation is way down. Not very many people read it anymore. I mean people don't even think about the \"National Review\".</p>                \n                \r\n\n            \n                <p>So I guess they want to get a little publicity. That's a dying paper. Really, I mean it's pretty much, I got to tell you that it's pretty much of a dead paper.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: And some political observers are saying this attack will actually help the Donald.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOHN HEILEMANN, BLOOMBER POLITICS:</b> There is nothing the \"National Review\" could do more to help Donald Trump than to put out an issue like this. I mean it's like an in-kind campaign contribution for the establishment to attack Trump. It helps him with his people. If it's where Trump wants to be, it reinforces his message.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Joining us now with reaction from Nashville, Trump supporter Scottie Nell Hughes from the Tea Party News Network and from Washington Matt Schlapp a Republican strategist who worked with President George W. Bush.</p>                \n                \r\n\n            \n                <p>Scottie Nell, was this a smart thing for \"National Review\" to do?</p>                \n                \r\n\n            \n                <p><b>SCOTTIE NELL HUGHES, TEA PARTY NEWS NETWORK</b>: Absolutely not. But this is a part of their track record of going against honest conservatives. In 2012 they went out against Newt Gingrich and declared Mitt Romney their poster boy. And then actually back when Reagan was running they actually attacked Reagan saying that he just didn't really have what appeared to be a presidential persona.</p>                \n                \r\n\n            \n                <p>This is exactly why the Republican Party continues to lose -- Eric. There is no strategy. They sit there and try to throw missiles and then they don't follow up. And where were all of these folks when we were trying to fight for conservative principles within Congress, like fighting Obamacare, when Ted Cruz stood up there.</p>                \n                \r\n\n            \n                <p>I didn't remember all of these folks uniting together to push the PR message. It died the next day. In fact, some of these might have even criticized him. So, you know what, I'm all for unification. This was just a bad idea. And it's going to back fire and unfortunately it's going to affect the whole entire conservative movement not just the 22 people that put their name on this.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> You know Matt, and I'm scratching my head a little bit. We are 10 days out from Iowa. What is the purpose of this? Is this a Hail Mary pass or do they believe that this is a well-timed takedown of Trump?</p>                \n                \r\n\n            \n                <p><b>MATT SCHLAPP, REPUBLICAN STRATEGIST:</b> Well, first of all, these are conservative luminaries. These are a group of people who collectively have fought every bit of the Obama agenda. So let's give them their due.</p>                \n                \r\n\n            \n                <p>The fact is this -- a lot of them are also Cruz supporters or they support other candidates. So yes, they are taking Trump on ideologically on the questions that people have on his conservative policy bona fides.</p>                \n                \r\n\n            \n                <p>But let's face it. A lot of these folks have already signed up with other candidates.</p>                \n                \r\n\n            \n                <p>I was actually asked to sign on to this manifesto too as chairman of the American Conservative Union. I didn't do it. Why didn't I do it? Because I would rather get Donald Trump in a better place on the issues that I'm concerned about.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>So you were asked to write a piece or to join the 22 pundits that wrote with the \"National Review\"?</p>                \n                \r\n\n            \n                <p><b>SCHLAPP</b>: That's right.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>You turned them down because, why? It would be too divisive?</p>                \n                \r\n\n            \n                <p><b>SCHLAPP</b>: I turned them down because I think -- look, I think Donald Trump is saying a lot of things that need to be said and I think he is going to take on a lot of these people. And I don't see why that's a bad thing. There are areas where people have questions about what he will do.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: So do you think it was a mistake for the \"National Review\" to do this then?</p>                \n                \r\n\n            \n                <p><b>SCHLAPP:</b> Yes. Obviously if I endorsed it I would have signed on to it. I didn't sign on to it because I worry exactly what was just said that I worry that this will just be a cause for division. At the end of this process, if we don't unite every single voter on the center right, we will not win. And it's imperative that we would be able to pull together again.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>So I will bring in Scottie now and I'll let you respond after that Matt. Is this actually going to end up helping Donald Trump then?</p>                \n                \r\n\n            \n                <p><b>HUGHES:</b> I think this is absolutely. We are seeing it already help Donald Trump. People are identifying the folks who they perceive to be the wolves in sheep's clothing.</p>                \n                \r\n\n            \n                <p>Now, I agree with you. There are a lot of great patriots. There are a lot of good friends on this list. That's why I'm scratching my head. Why would you go up against the number one person? Instead of celebrating that we have two conservatives leading these polls. This silent majority has awakened. What these folks have done is sit there and isolated the people that follow Donald Trump and the majority of them are good conservatives.</p>                \n                \r\n\n            \n                <p><b>SCHLAPP:</b> And it's also --</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Can I add this Matt though? I'm trying to dissect this a little bit. So you look at the \"National Review\", look at some of the names on that list -- very prominent conservatives. But they're not like the typical let's call it establishment type on the right. There is a mix.</p>                \n                \r\n\n            \n                <p>There is Glenn Beck. There is Dana Loesch and then there is also Rich Lowry -- et cetera. And the list goes on and on. It's almost like, you know, Donald Trump has really made a case for himself being an outsider. This further puts him outside, you know, the D.C. corridor. Maybe that will end up helping him.</p>                \n                \r\n\n            \n                <p><b>SCHLAPP: </b>Maybe. But I think look, also for Donald Trump, and for his supporters, I think it's very fair that prominent conservatives like Ed Meese are saying we want to know more about where you are on a whole range of issues. Now, I think gives Donald Trump yet another opportunity to listen to these critiques and to continue to make it really clear where he is on core issues.</p>                \n                \r\n\n            \n                <p>He has done a great job on ISIS. He has been very clear on immigration. He has been very clear on how he wants to take on Washington. If prominent people like Ed Meese want to have more questions answered. He simply ought to answer them. So far he is doing a pretty good job of answering them.</p>                \n                \r\n\n            \n                <p><b>HUGHES: </b>But he's actually obviously done a good enough job for people like (inaudible), Ann Coulter and now Sarah Palin, three wonderful conservatives to endorse him.</p>                \n                \r\n\n            \n                <p><b>SCHLAPP:</b> That's right.</p>                \n                \r\n\n            \n                <p><b>HUGHES: </b>So you have to wonder is there maybe something else going on? Maybe these types of journalists and I will agree a lot of the online journalists have been coddled by a lot of our D.C. politicians before.</p>                \n                \r\n\n            \n                <p>Mr. Trump does not do that. He says, you know what, I'm actually more interested in the grass roots and the people and talking to them than talking to you, journalists. You guys just come along for the ride and actually report. Maybe that's kind of more of what we are seeing here.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Now here's an important question Matt. If Donald Trump happens to be the nominee going forward, are these people on this list obligated to defend conservatism and will they have to push away from the GOP nominee then?</p>                \n                \r\n\n            \n                <p><b>SCHLAPP:</b> That's the fear I have, which is I haven't read this edition yet but I will. But any language that says somehow -- and I have read it from other conservative journalists that they would never support Donald Trump. What they are saying -- and everybody ought to hear my words -- what they are saying is they would support Hillary Clinton or Bernie Sanders to be the next president of the United States.</p>                \n                \r\n\n            \n                <p>And if they say that I think they lose all credibility. We have to get behind the nominee of the Republican Party if we are to stop this onslaught of socialism and collectivism and the destruction of our constitutional order that we have seen under an Obama presidency. It must stop. And I'm going to support the Republican nominee no matter who he or she is.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Very good. Scottie, last thought, one of the issues that Rich Lowry brought up was that he thought that there was a potential for Donald Trump to be bought by special interests -- to be bought off by special interests. That's been one of the pillars of his campaign so far that he can't be bought. Your thoughts -- final thoughts?</p>                \n                \r\n\n            \n                <p><b>HUGHES: </b>That's completely a joke considering he's been the one that has been writing the checks while all these politicians have been accepting them. Who would you rather have in leadership -- the one leading this country, the one that wrote it and cannot be controlled or the one that is controlled by the guy writing the checks?</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> All right. We're going to leave it right there, Scottie and Matt. Very good debate -- thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The Republican primary outlook", "description": "'The O'Reilly Factor' examines the political war brewing in the GOP", "date": "2016-01-25T13:24:54Z"}