{"vcmId": "be7bb393-62e4-451d-87dd-bc387252c738", "url": "http://www.foxnews.com/transcript/2017/01/16/president-elect-trump-vs-intelligence-community.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 13, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>ERIC BOLLING, FOX NEWS HOST:</b> Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching us tonight.</p>                \n                \r\n\n            \n                <p>We're going to get right into our top story. The ongoing feud between President-elect Donald Trump and the intelligence community intensified again this morning and the fallout from that dubious report about Donald Trump's ties to Russia. Trump lashed out on Twitter writing, quote, \"It now turns out that the phony allegations against me were put together by my political opponents and a failed spy afraid of being sued. Totally made up facts by sleazebag political operatives, both Democrats and Republicans -- fake news! Russia says nothing exists. Probably released by 'intelligence even knowing there is no proof, and never will be. My people will have a full report on hacking within 90 days!\"</p>                \n                \r\n\n            \n                <p>Later on, ABC's The View, Vice President Biden hit back at Trump's charges against the Intel community this way.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>VICE PRES. JOE BIDEN (D), UNITED STATES</b>: The crown jewel of American security is our intelligence community. And everything we do, we rely upon those 16 different agencies. And to diss them and dismiss them, it really plays into Russia's hand.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Joining us now with reaction, Anthony Scaramucci who just today was named adviser to the President and incoming White House director, Office of Public Liaison.</p>                \n                \r\n\n            \n                <p>Anthony, first of all, congratulations.</p>                \n                \r\n\n            \n                <p><b>ANTHONY SCARAMUCCI, TRUMP TRANSITION TEAM EXECUTIVE COMMITTEE MEMBER</b>: Eric, thank you. I appreciate it.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: There you go. Talk to me a little bit about what's going back- and-forth with the intelligence community. I sit on this very show that I think it's been politicized. The intelligence community has been politicized.</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Does Donald Trump think that this is all about politics?</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI:</b> Well, I think I would probably say that their aspects or slices of it that may be politically charged or maybe some people that are doing things that are politically motivated. I think the President-elect has an enormous amounts of respect for the intelligence community. In his daily briefing, I think he is getting a plethora of information that he finds very, very useful in terms of diagramming out what our national security policies will be, what our diplomatic policies will be and so forth, but I do think that there are issues here Eric that we need to look at as Americans.</p>                \n                \r\n\n            \n                <p>Where if we are going to politicize the justice system which we know that Jeff Sessions will never do that, or politicized aspects of the Intelligence Community, we know the President-elect will not do that. Director Pompeo will not do that or General Flynn. And so, I'm just here to say to you that we're looking forward to the new administration, we're looking forward to working with all of those people, you and I played a lot of sports teams, we are very team oriented, we need to pass the ball, open ourselves up to each other, and do what's right for the American people.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Let's talk a little bit about James Comey. The lead editorial, \"The Wall Street Journal\" today suggested that James Comey should resign. If he doesn't resign, incoming AG Jeff Sessions should ask for his resignation. If he won't further, then Mr. Trump should fire him. Allow me just to do this. It's been a political football going back and forth. The Democrats are saying, get rid of him, all of a sudden Josh Earnest today in the briefing room said, no, we have full confidence in James Comey. Where is Donald Trump on the FBI and Comey?</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI:</b> First I want to speak personally that James Comey had an enormous amount of respect for me personally. I do think he's a man of integrity. I think it relates to the situation. I think the President- elect is probably going to look at it very carefully. I think they've interacted a few times. One of the things we both know that President Donald J. Trump is that he can take measure of a person pretty quickly. And what I also love about him, he's going to make his own decision.</p>                \n                \r\n\n            \n                <p>He's not going to let \"The Wall Street Journal\" editorial board make that decision or the partisan politics in Washington make that decision. He's going to take measures to the man himself and going to come to a conclusion on that. Here's something that James Comey and I'm pretty confident of. If someone would ask him to resign, he would do it because he is a great American. Should it come to pass. My guess is, I honestly don't know. This is up to the President-elect to make that decision and to do that analysis.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Another intelligence community figurehead, James -- DNI -- Clapper, he's been in news, he's making the news lately.</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI:</b> Uh-hm.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Does President-elect Donald Trump, President Donald Trump have confidence in Clapper to be the director of the DNI?</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI</b>: Well, we're talking to Senator Coats, I think he should know. And so, I would say to you that he probably has confidence in him. Let's put it this way, a new administration is going to be in town. You know and I know that when you get new leadership, good things can really happen if you set the culture right. I had a phenomenal experience inside of Trump Tower over the last 60 or 70 days or so. This man is a phenomenal leader, and even people that are not operating at full efficiency when they have a phenomenal leader, can pick it up a notch. We both know that from the businesses that we've run. So I'm hopeful that with the new administration you're going to see and uplift and a lot of facets from the government.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: One big question that people have right now is Mr. Trump's relationship with the media going forward.</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI</b>: Uh-hm.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: You know, there's been some contention going back and forth over the last couple of days, weeks, we've talked about it. BuzzFeed publishing that full 35 page unconfirmed, not fact-checked, never double sourced dossier that they call it. Your thoughts, what will that relationship, the Trump administration be with the media?</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI:</b> Yes. I think, you know, some of these news organizations having a hard time grabbing eyeballs. They're not THE O'REILLY FACTOR or Bill O'Reilly, and so what they do is they say nonsense in order to get some intention. But I love that the President-elect is going to call them out on it. He's also willing to go directly to the American people right over the top of the main screen media, Eric, to let the American people know what is going on. And the American people I think have lost patience with his aspect of the news. I think they've grown tired of people that are speaking and falsehoods. And so, I really admire him for doing that. I think it's very important because as a part of his brand to be that honest and that authentic.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> But do you hold them even further accountable? In other words, Ben Smith, the editor-in-chief of BuzzFeed literally wrote a note, a memo to his staff saying, hey, these are unsubstantiated allegations by the way. And then he went ahead and publish them anyway. Is there a lawsuit coming? The BuzzFeed's way?</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI</b>: I don't know. I would have to leave that up to the President- elect to decide. I can tell you my personal experience with Ben has not been favorable. There's a level of dishonesty about the BuzzFeed process. They seem to think that they're more important than the facts and the objective standards of journalism. And so, for BuzzFeed, they're losing a lot of credit.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> NBC dropped 200 million bucks into BuzzFeed in two years in a row. Four hundred million dollar investment.</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: The time that NBC apologizes, clarifies the relationship?</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI</b>: I find it hard to believe that they're not embarrassed by that investment at this time. I'm hoping that this sort of stuff is the bottom. You and I have traded markets for 30 plus years, I'm hoping fake news has hitting a low at very high volume, Eric, and hopefully we'll start to see it clear up in the coming months. But it is really not fair to the President of the United States and it's not fair to the American people.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Fake news. Let's talk about that. How do you put that down? How does the Trump administration put down the fake news? Obviously the fake news is exploded in the last few months. How do you end that?</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI:</b> There are lots of reliable news organizations, yourself included. And so what we have to do is we have to get our message out. We have a terrific communications team, Sean Spicer, I know you know very well. I think Reince Priebus is working on the strategy and taxes alongside of Steve Bannon. The President-elect is the tweeter in chief, the communicator in chief, he is the commander-in-chief and we will going to get our message out there in a way that the American people are going to enjoy.</p>                \n                \r\n\n            \n                <p>One of the things I love about the President, he knows how to unbundle things, Eric, and explain things to the common person. I find it sometimes, all of us, myself included, we get into that Washingtonian speak which makes people's eyes glaze over. I've never seen that from the President-elect.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Before I lose you, we'll have about a minute or so. Your new title, advisor, director, advisor, counselor --</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI</b>: A lot of titles in there but yes --</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: So, I'll throw it out here. It was thrown around this morning, Valerie Jarrett.</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Similar to the Valerie Jarrett role with President Obama.</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI:</b> Well, listen, I said this morning that I think I was sort of overstated. We have to remember Valerie Jarrett is super closed to President Obama. I feel close to the President but there are many people close to him. He's been phenomenal to me. I've had a great relationship with him and I said this morning and I'll say to your viewers, I want the American people to see the President-elect the way I see him and the way the staff sees him. He's a kindhearted, generous guy, somebody who really has the interest of the American people at heart, and I am hoping that we can deliver that message.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Will he still tweet from the potus account?</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI:</b> I think so. Yes. It's going to be up to him.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> All right, we're going to leave it right there. Anthony, thank you very much.</p>                \n                \r\n\n            \n                <p><b>SCARAMUCCI: </b>Yes.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "President-elect Trump vs. the intelligence community", "description": "Fallout from dubious Russia report; 'The O'Reilly Factor' examines the intensifying feud", "date": "2017-01-16T12:50:11Z"}