{"vcmId": "be9db79b-a7b9-499f-bd8a-5022db66d7ab", "url": "http://www.foxnews.com/transcript/2016/01/08/analyzing-election-cycle-coverage.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 7, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thanks for staying with us, I'm Bill O'Reilly in the \"Weekdays with Bernie\" segment tonight. \"The Washington Post\" article that appeared online says in part, quote. \"FOX News and analysis carries tremendous weight with the conservative audience most interested in the Republican primary. Right now the network is doing a pretty good job of throwing that weight around. FOX has gotten under Trump's skin more often than most with tough questions and reasonable critiques,\" unquote.</p>                \n                \r\n\n            \n                <p>Joining us now from Miami, the purveyor BernardGoldberg.com, Mr. Goldberg. So, the Post didn't run that article in the paper possibly because it's too complimentary to FNC. What did you think of it?</p>                \n                \r\n\n            \n                <p><b>BERNARD GOLDBERG, FOX NEWS CONTRIBUTOR</b>: Well, I think there is some truth in it. I think there are some interviews on this channel that hold Donald Trump accountable. I have no problem with that. But, there is the rest of the story that's not in the column. I will give you three quick points. Number one. Trump gets more air time on FOX than some of the anchors. And that in and of itself is a plus because if Christie or Fiorina or Kasich or Huckabee or Rubio got as much air time, I think their poll numbers would be higher. So, that's a plus and that wasn't in the column. Number two, Trump has more than a few friends on FOX and some of them interview him as if they were interviewing a friend. And my rule of thumb is, don't interview your friends. Especially if they are running for president of the United States.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But you are not referring to me, are you? You can't be referring to me.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: No. That's why I said some. Not all.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Because I mean I'm not a close friend of his but I know him for a lot of years. And what's your third point?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: My third point is the most important one, at least from my point of view. I want to make very clear that many, many, many, many Trump supporters are good, honorable, decent people who support Trump because they are so fed up with politics as usual and they believe that Donald Trump will make America great again. I want to emphasize, no problem whatsoever with those people. But Trump also has other supporters. And more than any other politician whose currently running or more than any other politician in recent memory, Donald Trump and I'm going to use the words of a headline in the \"The Washington Post\" over a column, Donald Trump brings bigots out of hiding and he does.</p>                \n                \r\n\n            \n                <p>It's true. There are people and I get emails from these people and so do you, I'm sure, Bill. They hate Muslims. And they hate all Muslims. Not just the ones who are terrorists. They hate Mexicans. Not just the ones who are smuggling drugs. They hate gays, that's for damn sure. And if you are Jewish and you write about Donald Trump's excesses, they let you know how they feel about Jews. So I would suggest that somebody on this channel, you preferably, say to Mr. Trump, look, you can't be held responsible for all your supporters, that would be unfair and unreasonable but you do attract people who go way beyond simply being angry. You attract some people think are bigots.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. Look, I will -- let me refute -- I want to get to this Trump video but I want to refute the points. Number one air time. CNN gives Trump more air time than FOX. And the reason that all cable news networks want to put Trump on is because he generates ratings and this is a business.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Of course. Of course. But it helps him and that was not in the article.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The other candidates was provocative as Trump, their air time would go up as well. Nobody wants to hear rehearsed speeches and a lot of the candidates that's all they give you. OK. Number two.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Yes. And Trump doesn't give you answers --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Barack Obama when he was running for president in 2008, I will contend to you attracted just as many bigots on his side who voted for him simply because of skin color. All right? Because they didn't like whites or they wanted a black and they didn't know what he was talking about. And that had been proved in a number of reports. So it's not fair and wouldn't be fair to Barack Obama to confront him with that. It wouldn't be fair to him.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> No, no, the media should have confronted him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's not fair. The candidate has no control over it. Candidate has controlled what he or she says on that note. Let's go to the Trump. This is an internet video that was just released. Go.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON (D), PRESIDENTIAL CANDIDATE:</b> Women's rights are human rights and human rights are women's rights. Once and for all. Let's keep fighting for opportunity and dignity.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Wow, we got Cosby in there. We got Weiner in there, we got Lewinski in there. I mean, where is Charles Manson? Go.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Right. OK. I wrote a column on my website. It's still up there defending Donald Trump saying that if Hillary Clinton is going to, A, bring Bill Clinton on the campaign trail to help her get elected. And B, say that Donald Trump has a penchant for sexism, then she has opened the door and he has every right to go right in through that door and do this. But she has backed off of that. He apparently hasn't. I think this is going to hurt him one bit.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No. This is going to help him. It's going to help him.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Right. Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Oh, man.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: But elections are about the future. Elections are about the future, not the past. While this is going to help him, certainly not hurt him among his supporters, I don't see how this is going to help him in the broader, general electorate.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It maybe not. But he's got to get there. And this sucks all the air out of the room. Everybody is going to be talking about it this week and all the people who don't like Hillary are going to be yes, and you know it. Bernie Goldberg, everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Analyzing election cycle coverage", "description": "Bernie Goldberg joins 'The O'Reilly Factor' to discuss the reporting on campaign 2016", "date": "2016-01-08T13:30:22Z"}