{"vcmId": "c0794a0e-06af-4e41-ac40-a06faa9ed5a2", "url": "http://www.foxnews.com/transcript/2015/06/10/bill-oreilly-war-on-cops.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It was inevitable whenever you have a media frenzy, things are going to get dicey for those under scrutiny. Racially-charged shootings all over America have received enormous coverage on television with certain liberal cable news programs hammering American police agencies over and over again. Rioting and looting are big stories and all the carnage is now filtering down to young Americans influencing how some of them interact with police.</p>                \n                \r\n\n            \n                <p>Case in point. Last Friday evening a troubling event took place in a suburb of Dallas. About 130 teenagers, most of them black, showed up to a pool party overwhelming the security which was in place at that party.</p>                \n                \r\n\n            \n                <p>About 7:00 p.m. the McKinney police department was called citing a disturbance. Additional calls rolled in saying there was fighting, general chaos. Police officers quickly arrived and began trying to impose order on the scene. But, that did not turn out very well.</p>                \n                \r\n\n            \n                <p>After the fracas, one McKinney police officer, Corporal David Casebolt was suspended. He was the man who drew his gun and threw the young girl to the ground. One adult male was arrested on charges of interfering with the police. Nobody was seriously hurt.</p>                \n                \r\n\n            \n                <p>But video of the incident has now gone worldwide -- again casting a giant shadow over American policing. Some people believe that cops in general are oppressors, especially towards people of color. The 15-year- old who took this video you are watching right now seems to be one of them.</p>                \n                \r\n\n            \n                <p><b>BRANDON BROOKS, WITNESS TO MCKINNEY POOL PARTY INCIDENT:</b> I was scared that someone was going to get shot and possibly killed. I was like one of the few Caucasian people at the party, so I think it might have had something to do with racism.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But other witnesses see it differently and are criticizing those who are condemning the police.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BRAD TAYLOR, WITNESS TO MCKINNEY POOL PARTY INCIDENT: </b>They didn't see the kids running all over the place, not complying with the officers. They didn't see them cussing the police officers, becoming unruly to them.</p>                \n                \r\n\n            \n                <p><b>BENET EMBRY, WITNESS TO MCKINNEY POOL PARTY INCIDENT: </b>What did I see before the cameras or the video store going is that teens jumping over the fence, after security was telling them they can't come in to swim, not because they were black, it's because they didn't live in this community itself.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The truth is that some of the kids involved in the pool party, obviously didn't comply with police commands. They did not hit the ground. They did not stop arguing with the officers.</p>                \n                \r\n\n            \n                <p>Now, that doesn't justify brutal behavior and Talking Points is not going to try the case on TV. But it's clear that there is a growing disrespect for police officers in some American neighborhoods and that attitude is going to lead to violence. If citizens don't obey the police then law and order completely breaks down.</p>                \n                \r\n\n            \n                <p>The authorities have the power to compel us, the private citizens, to act in a certain manner. If the cops are wrong, that should be taken up later. But with TV news demonizing police officers, the law enforcement contract we all have is starting to break down.</p>                \n                \r\n\n            \n                <p>Talking Points sees big trouble on the horizon. Trouble that is being fueled by hysterical media. Anti-police zealots are given wide latitude to spew their hatred and irresponsible raving. That kind of rhetoric sinks in.</p>                \n                \r\n\n            \n                <p>Finally and this is only my opinion, the McKinney police officer who was suspended should not, should not have drawn his firearm. He was not in any danger and neither was any civilian. He simply overreacted. And in doing so, made this an international story.</p>                \n                \r\n\n            \n                <p>But cops are human, too. And in the heat of conflict, bad things are going to happen. Every decent person should understand that.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The war on cops", "description": "Bill O'Reilly's Talking Points 6/9", "date": "2015-06-10T12:19:20Z"}