{"vcmId": "c0850409-075c-4349-941e-396a5d5ed9b0", "url": "http://www.foxnews.com/transcript/2015/11/18/bill-oreilly-president-obama-continues-to-divide-country-over-terrorism.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>At this point at least 31 governors have told the President they oppose allowing Syrian refugees into the country. Eight governors say they support the action: California, Colorado, Connecticut, Delaware, Hawaii, Pennsylvania, Vermont and Washington.</p>                \n                \r\n\n            \n                <p>Talking Points believes the argument should be moot. As we put forth last night NATO should declare war on ISIS and in doing so that alliance could then move into Syria, set up safe zones for refugees and the huge problem might begin to be solved.</p>                \n                \r\n\n            \n                <p>If Syrians in danger are protected by NATO forces on the ground there is no reason for them to go to Turkey, Europe, or America. So in addition to confronting ISIS militarily, the 28 NATO nations would be providing safe zones for civilians at risk. Does that make sense? Of course it does.</p>                \n                \r\n\n            \n                <p>So why won't President Obama take the lead in mobilizing NATO against ISIS? We discussed a myriad of reasons last night. But here's one that makes the most sense. Mr. Obama does not have the will to lead in the war on terror.</p>                \n                \r\n\n            \n                <p>We have seen this before in the White House. President James Buchanan who served from 1857 to 1861 absolutely sat on his hands when the nation was dividing over the issues of slavery and economic policy. Buchanan, perhaps the worst president in U.S. history, allowed the situation to get out of control and so the civil war began.</p>                \n                \r\n\n            \n                <p>Right now President Obama is in a similar situation continuing his passive posture as the terror problem grows worse. His policy is one of disengagement. That has led to mass chaos in the Middle East, Africa and Europe. Listen to this analysis of the President on CNN, usually sympathetic to Mr. Obama.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>AMANPOUR: </b>He said something that was pretty incredible, according to many of the military experts here and around the world who I have spoken to, that our strategy is working. People do not believe that to be the case. The only strategy that's working is the strategy that he tends to dismiss and that's the ground troops strategy.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Wow, now, next week president -- French President Hollande will visit the White House and we assume some new strategy will be announced, something. Because at this point in history it is Barack Obama who is setting himself up for an amazing defeat should the ISIS terrorists strike America or continue their mass killings overseas.</p>                \n                \r\n\n            \n                <p>If Mr. Obama values his legacy at all, he will think long and hard about leading the NATO alliance against the ISIS savages. And in his deliberation, he should gaze up at the picture of James Buchanan hanging on the White House wall.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: President Obama continues to divide the country over terrorism", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/17", "date": "2015-11-18T13:10:25Z"}