{"vcmId": "c0d8cc9c-03d1-407e-8a56-e7d0aa9c2906", "url": "http://www.foxnews.com/transcript/2014/10/23/terror-in-canada.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 22, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Hi, I'm Bill O'Reilly thanks for watching us tonight. \"Talking Points\" memo on fear and how it pertains to the Obama administration will be in our second segment tonight. But leading The Factor, terror in Canada. Today, 32-year-old Michael Zehef-Bibeau opened fire in Ottawa killing a soldier and wounding at least three other people. The terrorists then ran into the parliament building where he was shot dead.</p>                \n                \r\n\n            \n                <p>Witnesses say at least 30 shots were fired in the altercations. This comes after another Canadian soldier was killed by a Muslim on Monday after the man ran him over with a car. A second soldier was injured in that terror attack. The situation in Canada is fluid Fox News will have hard news updates throughout the evening.</p>                \n                \r\n\n            \n                <p>Joining us now from Ottawa Mark Sutcliffe radio talk show host. So what you can add to the story tonight?</p>                \n                \r\n\n            \n                <p><b>MARK SUTCLIFFE, RADIO TALK HOST:</b> Well, Bill, it's been a shocking day in Ottawa. This is the kind of thing that I think a lot of Canadians feel typically happens in other countries, not here in what we consider to be a peaceful nation. And we've had as you point out in the last three days, two Canadian soldiers who have been killed deliberately on Canadian soil.</p>                \n                \r\n\n            \n                <p>The National War Memorial in downtown Ottawa is a location that's open to the public, very accessible and it appears somebody walked up to one of the two sentries who were standing guard over the tomb of the unknown soldier and shot him in the chest and killed him and then made a short trip over to the parliament buildings which are not as secure as they should be, quite frankly. Walked right up through the front door of the center block of the parliament buildings and fortunately, before he was able to cause any harm, was shot by the sergeant at arms of the Canadian parliament and was killed.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Don't you guys have -- Mr. Sutcliffe, don't you guys have, you know, electronic monitoring? The guy has got a gun. He has got a mask. He is dressed all in black. How can he get into the building?</p>                \n                \r\n\n            \n                <p><b>SUTCLIFFE:</b> Security in Canada is not like it is in other countries. And security in the parliament buildings is unfortunately --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Amazing.</p>                \n                \r\n\n            \n                <p><b>SUTCLIFFE: </b>-- very relaxed.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Amazing.</p>                \n                \r\n\n            \n                <p><b>SUTCLIFFE:</b> There are measures that have been taken since September 11th, but they have not gone far enough. It wasn't so long ago we had a major road that ran underneath our National Defense Headquarters -- our equivalent of your Pentagon. There was a city road that ran underneath that building. Fortunately they closed that more recently.</p>                \n                \r\n\n            \n                <p>But you can -- you can walk up on to the lawn of the parliament buildings, the road in front of Parliament Hill is always open to traffic. There are tour buses parked along there. And I think there has just been a false sense of security that this kind of thing wouldn't happen in Canada.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What was the reaction on Monday when a Muslim killed the soldier and wounded another? Were people outraged? Was there a backlash against Muslim Canadians? What was the reaction?</p>                \n                \r\n\n            \n                <p><b>SUTCLIFFE: </b>There hasn't been any backlash that I'm aware of, Bill but there certainly was outrage. Canada, though we are considered to be a peaceful nation, we are very, very strong supporters of men and women in uniform, the Canadian military. And I think a lot of Canadians were shocked by the fact that a member of the military, two members of the military in this case, one killed, one injured were deliberately targeted by this individual. And for this to happen again now just two days later, I think really has shaken a lot of people in this country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Canada has been a little bit reticent although it did join the coalition to fight ISIS. But it hasn't been in the forefront of being anti-terror warriors. Do you expect this to change now?</p>                \n                \r\n\n            \n                <p><b>SUTCLIFFE: </b>Well, I think there are going to be some people who are going to say that this is in response to the fact that Canada is joining the war against ISIS, that some people are opposing that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Could be. Could be.</p>                \n                \r\n\n            \n                <p><b>SUTCLIFFE:</b> But Canada has fought in Afghanistan. And more than 150 Canadians lost their lives in Afghanistan. It's been -- it's been a big part of our -- of the fabric of our country for the last 12 years and so we feel like we've done our part even though we weren't part of the war in Iraq.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok, now, the Muslim community in Canada -- in Great Britain it's radicalized; there are a lot of trouble over there in Great Britain with crazy imams. Here in the United States, not so much. You know, it's quieter here, more peaceful here. What's it like in Canada?</p>                \n                \r\n\n            \n                <p><b>SUTCLIFFE: </b>I would say it's quieter and more peaceful. Although there have been reports from security officials in Canada very recently over the last couple of weeks that have talked about individuals who have been radicalized, people who are born in Canada and have converted to Islam and have become followers of Web sites and social media outlets that have been promoting hatred against Canadians and Americans. And have been encouraging individuals in Canada to take action and it appears as though we're seeing the first signs of that in this country. People who have --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Canadian authorities knew the guy on Monday who killed the soldiers. They knew that he was a jihadist because they denied him permission this guy to travel to Turkey wanted to get to ISIS. And on the Facebook pages in Canada, there is a lot of hatred, there is a lot of pro- terrorist ISIS stuff. So the government knows and the final thing is that the United States government warned the Canadian government that the terror attack on your country was imminent I understand. Do you know anything about that?</p>                \n                \r\n\n            \n                <p><b>SUTCLIFFE: </b>I'm not aware of that specific warning. It's clear that the police did know the individual who was involved in the attack on Monday.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>SUTCLIFFE: </b>They did arrest him at one point, talked to him, let him go because he hadn't committed any crimes and they didn't feel he was an immediate threat. Obviously that turned out to be wrong. But I think -- I think the Canadian security officials certainly are very vigilant and have spent a lot of time interacting with other countries like the United States and keeping a watchful eye on many individuals but the list is -- the list is not complete if an event like today could still happen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And obviously there would be a lot more coming out about this. The man was 32 years old, the shooter today, 32-year-old man and we'll know a lot about him shortly.</p>                \n                \r\n\n            \n                <p>Mr. Sutcliffe thanks very much. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Terror in Canada", "description": "Canadian soldier, gunman killed in attack on Ottawa capital complex", "date": "2014-10-23T12:20:23Z"}