{"vcmId": "c3024ac8-4ee2-424b-b451-b37f616803bb", "url": "http://www.foxnews.com/transcript/2016/01/05/rubio-cruz-rivalry-heating-up.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 4, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Personal Story Segment\" tonight, it's getting very personal between Senators Marco Rubio and Ted Cruz who are competing for the Republican presidential nomination.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. MARCO RUBIO (R-FL), PRESIDENTIAL CANDIDATE</b>: I know I have a debate but I have got to get this fantasy football thing right. Ok?</p>                \n                \r\n\n            \n                <p>Words and political stunts cannot ensure our security. ISIS cannot be filibustered. While some claim that they would destroy ISIS, that they would make the sands of the Middle East glow in the dark, my question is -- with what?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Senator Rubio referring to Senator Cruz saying he would annihilate ISIS using high-tech weaponry.</p>                \n                \r\n\n            \n                <p>Joining us now from Iowa is Mr. Rubio.</p>                \n                \r\n\n            \n                <p>First of all is it personal between you and Cruz?</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> No, of course not. When it comes to the issue I highlighted today the fundamental problem is that if you are in favor of a budget as Ted Cruz has voted for that undermines defense spending. If you are in favor of a bill that undermines our intelligence-gathering capabilities, you can't destroy ISIS. You don't know where they are because you won't have the intelligence and you won't have the weapons to destroy them with.</p>                \n                \r\n\n            \n                <p>So there is a difference of opinion in our party about how much money we should be spending on the military and that's the battle and the thing for us to debate on.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure. And that's a policy difference. But in Cruz's spot against you with the fantasy football thing, that wasn't policy. That was a shot at you as being a lightweight. Come on, you know that. Isn't that personal?</p>                \n                \r\n\n            \n                <p><b>RUBIO</b>: Well, yes. Well, I haven't seen it. Yes, I haven't seen. And so -- ultimately, you know, people are going to do whatever they want to do in this campaign. I'm pretty confident of that over the last five years --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Did you know Cruz before the campaign? Did you know him as a senator from Texas?</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Sure, I have met him before. I didn't know him well but I knew him before.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> And -- I like Ted Cruz as pattern. This is nothing personal. You have to ask him. I don't think it is on his part either.</p>                \n                \r\n\n            \n                <p>But bottom line is I'm going to focus on policy. This country is living at a key moment in its history. We have seven years of a president that's tried to fundamentally change America. We can't afford to get this election wrong. We deserve campaigns that are serious about what is happening.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> As I said at the top of the broadcast, people are furious in the Republican Party but they are furious at the Republicans because they let Barack Obama bring the country so far down the road of weakness.</p>                \n                \r\n\n            \n                <p>But, I was surprised, outside of Lindsey Graham you have been the most hawkish against ISIS. I mean you are in line with my thinking that you can't contain evil. You have to destroy it. But the way to do it is to take the burden and distribute it among the NATO nations using Article 5. That's the way to do it.</p>                \n                \r\n\n            \n                <p>And you protect refugees at the same time, you bring -- you muster enough force to really wipe them off the face of the earth. But you and no other candidate has brought that forth and I'm surprised.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Well, I have, first of all. You also have to have the cooperation of Sunnis. You need the Sunnis themselves to reject the ideological.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But that comes after. Just as Petraeus proved in Iraq -- all right, it comes after the commitment of the west. Then you will get that.</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>Right. So you need -- and in fact that's absolutely true. You need to show a true commitment on the part of the United States to embed special operators, increase air strikes and then but you also have to have Sunni ground forces as part of the solution.</p>                \n                \r\n\n            \n                <p>You are right in saying it won't happen unless we're committed. But going back to the point you raised at the beginning of the interview you can't do that if you don't have the resources. We are on the verge of having the oldest and the smallest air force in American history. How anyone running as a Republican can be supportive of these defense cuts, the party of Reagan, the party of strong national defense is beyond me.</p>                \n                \r\n\n            \n                <p>My number one priority as president will be to rebuild the military.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And I would support that if you do it in a smart way. Ok. But Americans don't want the United States taking it alone. Why not bring in NATO? Why not lead that way? I just don't get any of you guys not putting that forth. I don't get it.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Well, I don't think I have never said that he we shouldn't. It should most definitely be the part of any effort. But it won't happen without us going first.</p>                \n                \r\n\n            \n                <p>Only America -- America is NATO. When you look at the broad scope of NATO power --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. So we could get it done if --</p>                \n                \r\n\n            \n                <p><b>RUBIO: </b>-- it is the American military.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But that's the solution to it.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> But I have and that is we need to put together -- well, it's not just NATO countries by the way. I think Jordan and Saudi Arabia and Egypt needs to also contribute to this effort especially on the ground.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All the Sunni countries will follow.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> But I do believe that NATO will not take action without American leadership.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But nobody has put forth Article 5. The French President did -- Hollande. But everybody ignored him. I think 00 listen.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Well, actually, Bill I did.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I'm not in the business of telling you guys how to run your campaigns. But I think American have had enough of we do it all.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> No, Bill, but I actually did. And right after Paris, I said that I would support the invocation of Article 5, if France invoked it that I would support it. I absolutely said that in the days right after the Paris attack. In fact, the day after the Paris attack I said this was an act of war, an attack on a NATO member, and if they invoked Article 5 we needed to respond in kind.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And that's the solution. All right Senator -- we appreciate it.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Thank you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm glad you and Cruz aren't mad at each other.</p>                \n                \r\n\n            \n                <p>And you are welcome any time.</p>                \n                \r\n\n            \n                <p><b>RUBIO:</b> Thanks.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Happy New Year to you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "The Rubio, Cruz rivalry heating up", "description": "GOP candidates' challenging each other's domestic and foreign policy strategies; Marco Rubio sounds off on 'The O'Reilly Factor", "date": "2016-01-05T13:14:29Z"}