{"vcmId": "c324cc09-c9df-4240-92b5-65e5250aa5c2", "url": "http://www.foxnews.com/transcript/2017/03/31/oreilly-brawl-over-sanctuary-cities.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>That is the subject of this evening's \"Talking Points\" memo. As you may know, the federal government is threatening cities that do not cooperate with Homeland Security with the loss of federal grant money. And now, the city of Seattle, suing the Feds over that, the first of many lawsuits, I believe.</p>                \n                \r\n\n            \n                <p> The basic problem is that cities like Chicago, Seattle, New York, Los Angeles, San Francisco, do not want to hold illegal aliens they've arrested until I.C.E can pick them up. Those cities want to release the aliens on bail or their own recognizance. Talking Points believe that is dangerous and irresponsible. If there is a federal detainer request on someone who should not be in the country, that request should be honored, it is just common sense.</p>                \n                \r\n\n            \n                <p> This sanctuary city people say they will obey a warrant for an illegal alien. But that is a much more complicated process, immigration agents have to go to a federal judge, present evidence, before a warrant will be signed. It takes much more time than a detainer, which just requires a signature of an I.C.E agent.</p>                \n                \r\n\n            \n                <p> In a moment, Judge Jeanine Pirro will tell us about the backlog of immigration cases, which is astronomical. Now, why is this all happening? In a city like New York, the mayor was a far left individual who was elected by very liberal voters. Mayor de Blasio sees himself as a defender of the poor and downtrodden. He opposes immigration regulations in general and is fine with millions of undocumented people living in and visiting the city. De Blasio has absolutely no problem with that, none.</p>                \n                \r\n\n            \n                <p> So, the mindset of de Blasio, Rahm Emanuel in Chicago, and other far left mayors, is that their constituency wants open borders and amnesty, so, they play to that constituency. And to the federal government, which now wants to enforce immigration law, because President Trump made out a hallmark of his campaign. And so, you have two opposing forces with little chance of reconciliation. It should be noted that the federal appeals courts have never required local governments to comply with detainer requests. It is optional. You can't be arrested if you defy a detainer. An official can be arrested if he or she defies a warrant.</p>                \n                \r\n\n            \n                <p> Finally, to make sanctuary cities comply with federal law, the Trump administration will now withhold money from them in the form of Justice Department grants, that means cities like Seattle, which receives millions of dollars to beef up local law enforcement, and institute safety programs, may no longer get that money. Which is why Seattle is suing. The whole thing is a giant mess and reflects the huge division in this country. Will sanctuary cities be forced to comply? Doubtful. But they will pay a price. And that's \"The Memo\".<br> </p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "O'Reilly: The brawl over sanctuary cities", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 3/30", "date": "2017-03-31T14:11:00Z"}