{"vcmId": "c503cecf-1aa6-4309-bedb-66865cedc247", "url": "http://www.foxnews.com/transcript/2015/05/07/bill-oreilly-assessing-hillary-clinton-status-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>A new poll by the \"New York Times\" surprised me. It says Hillary Clinton's trustworthy numbers have actually risen by six points since the email and Clinton Foundation controversies. They are up.</p>                \n                \r\n\n            \n                <p>March 42 percent of respondents found her honest; in April, 48 percent. 45 percent believe she is not trust worthy. It's a different story in the latest Fox News poll, however. That one says 45 percent believe Secretary Clinton is honest; 51 percent do not. Now the \"Times\" poll was comprised of 41 percent Democrats, 34 percent Republicans, the rest do not define themselves. But, in the Fox News poll, it's even: 38 percent Democrat, same for the Republican respondents.</p>                \n                \r\n\n            \n                <p>So you can see the \"New York Times\" poll is skewed. The paper says it doesn't ask affiliation until after the random sampling but so what? If you want accurate numbers, you can't tilt to a party even if it's not by design.</p>                \n                \r\n\n            \n                <p>That's the problem with the American press. It's methodology is largely a secret, a footnote. While a front page headline in the \"New York Times\" today very helpful to the Clinton campaign. By the way, it's worth noting that the \"Times\" did break some of the Clinton Foundation stuff.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" has been in business for about 19 years. And in that time I have seen a massive shift in how information is delivered to the American people today. Americans get much of their news from dishonest Web sites which are in business to distort the truth not report it. Also, the urban newspapers including \"U.S.A. Today\" are left on the editorial page. Same thing with the network TV news -- far more liberal sentiment than conservative.</p>                \n                \r\n\n            \n                <p>So Hillary Clinton has a huge advantage in the upcoming presidential race. And here's another big plus for her. In the \"Times\" poll, 55 percent of respondents say they don't know enough about the Clinton Foundation story to form a judgment. Again, this goes directly to a distracted public, a country, which is now largely into individual pursuits. Not assessing what's best for the nation.</p>                \n                \r\n\n            \n                <p>Americans who consume news and information have more vehicles available than ever before. We're not Germany in the 30's or Russia under Stalin. We can get to the truth if we put in the effort. But many of us do not do that. These people are called low information voters. And those folks can easily be manipulated by a dishonest media and clever politicians.</p>                \n                \r\n\n            \n                <p>With terrorism all over the place and a shaken economy, the stakes are very high for all of us. Misleading polls, headlines and Internet deception are legion and the threat to our safety and prosperity.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Assessing Hillary Clinton's status in America", "description": "Bill O'Reilly's Talking Points 5/6", "date": "2015-05-07T12:19:41Z"}