{"vcmId": "c53686b8-547f-49b1-9054-f22abf3dc30d", "url": "http://www.foxnews.com/transcript/2015/04/15/bill-oreilly-matter-respect.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The ISIS killers have released an animated video on the net depicting a jihadist beheading President Obama. These thugs obviously taunting the President, trying to humiliate him in the eyes of the world. Now we have a policy at Fox News, I'm not showing ISIS propaganda on the air but the latest atrocity is on the Fox News Web site should you choose to see it/</p>                \n                \r\n\n            \n                <p>In Moscow, Putin has ordered Russian missiles be shipped to Iran, violating the spirit of the arms embargo -- another gross act of disrespect by the tyrant Putin.</p>                \n                \r\n\n            \n                <p>As we discussed last night the Iranian mullahs openly contradicting the American president on the terms of the nuke negotiations -- disrespecting him.</p>                \n                \r\n\n            \n                <p>In addition, you may remember President Obama asked Congress for authorization to conduct military operations against ISIS. Congress will not pass that authorization. Why? Because some Republicans say the President's language could restrict U.S. commanders, while some liberals say the language could lead to open-ended fighting on the ground. So, the commander-in-chief will not get his military goal.</p>                \n                \r\n\n            \n                <p>Now, you would think Barack Obama would be angry and would begin punishing those who are humiliating him. It doesn't have to be anything dramatic. He can just use his power to make their lives uncomfortable.</p>                \n                \r\n\n            \n                <p>Talking Points believes President Obama does not gave fig about being disrespected by enemies oversees. He doesn't care. On the ISIS authorization, the President did very little to convince Congress it was necessary. So again it looks to me it was all a show. He doesn't really care much about the authorization to fight ISIS.</p>                \n                \r\n\n            \n                <p>As always, I could be wrong, I can't read the President's mind but one thing is certain. Not since Jimmy Carter has an American president been so diminished throughout the world. There is little fear of President Obama. The bad guys are running wild and, of course, this situation lessens the perception of American power. And that's always dangerous in an evil world.</p>                \n                \r\n\n            \n                <p>Today, the senate foreign relations committee voted unanimously 19-0 to compel President Obama to bring the Iranian nuke treaty to the full congress for approval. The committee's bill now goes to the full senate where it's expected to pass easily. It will also pass the House. The only drama remaining is whether President Obama will veto that bill and if that veto will be overridden.</p>                \n                \r\n\n            \n                <p>The entire situation is foolish. President Obama should want Congress to approve the treaty. In that way all Americans have a voice in the matter through their representatives. Few of us want war. So if the deal is beneficial, Congress will approve it. But, if it's not, and it empowers the fanatical mullahs, then Congress will set it aside.</p>                \n                \r\n\n            \n                <p>A veto would be a no-win for President Obama. And today he signaled a compromise might happen. Let's hope so.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: A matter of respect", "description": "Bill O'Reilly's Talking Points 4/14", "date": "2015-04-15T12:00:25Z"}