{"vcmId": "c6ef0d1b-c5e4-461c-87ed-f98b39039497", "url": "http://www.foxnews.com/transcript/2016/07/01/loretta-lynch-meets-with-bill-clinton-amid-email-scandal.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 30, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Factor \"Follow-Up\" segment tonight. As we initially reported last night, Attorney General Loretta Lynch met with President Clinton at the Phoenix Airport on Monday. Because of the ongoing federal investigation into Hillary Clinton's emails, that meeting has now become an agent problem.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Was it appropriate for you to meet with former President Clinton while your agency is in the middle of an investigation of his wife's email servers?</p>                \n                \r\n\n            \n                <p><b>LORETTA LYNCH, ATTORNEY GENERAL: </b>Well, I did see the President at the Phoenix Airport the other night as I was landing, he was headed out. He did come over and say hello and speak to my husband and myself and talk about his grandchildren and his travels and things like that. So that was the extent of that and no discussions were held in any cases or anything of that and he didn't raise anything about that either.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And joining us now from Phoenix, KNXV, TV anchor Christopher Sign who he broke the story. So, first of all, they were in a private planes, right? And they were in a hanger, is that what happened?</p>                \n                \r\n\n            \n                <p><b>CHRISTOPHER SIGN, MORNING ANCHOR, ABC 15 ARIZONA</b>: Basically in the tarmac in a private section of Sky Harbor International Airport where a lot of high profile people fly in and out of the airport.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>How did you get on to the fact that they were meeting?</p>                \n                \r\n\n            \n                <p><b>SIGN</b>: I was leaving for the day and got a tip from a trusted source and naturally you could think my jaw dropped. I trust this person. Took the information. Had a private meeting with my management at the studios here in Phoenix. We then went after a second source for that. They both had the exact same information. Neither one of these sources knew each other. We then had the information. We were armed with the information and took that to the news conference and we were already prepared to go with the story even before we asked the Attorney General if, indeed she met with the former president.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. So, from my understanding, the Attorney General was landing or had just landed and Mr. Clinton was already in Phoenix and he knew she was coming in on a private plane. And he wanted to wait to chat with her and then he boarded her plane and they had the conversation. Is that how it went down?</p>                \n                \r\n\n            \n                <p><b>SIGN:</b> That's right. That's right. She, as a matter of fact, landed on time. He and his entourage were running late according to my sources. They then make the decision they meaning the President's team, former President's team. They wait for her to land. She arrives. Some people step off of her plane. The former president steps in to her plane. They then speak for 30 minutes privately. The FBI there on the tarmac instructing everybody around no photos, no pictures, no cell phones, he then gets off the plane, gets on his own plane, he deports, she continues on with her planned visit.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. Why was the President in Phoenix, do we know?</p>                \n                \r\n\n            \n                <p><b>SIGN:</b> To be honest with you, we have no idea. And the Attorney General, as a matter of fact, she said they talked about him playing golf. At this very moment as I'm talking to you, I have reached out to several sources, those with intimate knowledge of his movements because they work with these dignitaries when they come into Phoenix, not one so far has said that he played golf. I'm not saying that he didn't play golf. I'm just saying I have yet to confirm that he played golf.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. We don't know what he was doing. All right. Well, the appearance of impropriety is the story here. And good work, Mr. Sign. Excellent work. You and your station.</p>                \n                \r\n\n            \n                <p><b>SIGN:</b> I appreciate it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Very good. Very good. And we appreciate you. Thank you.</p>                \n                \r\n\n            \n                <p><b>SIGN</b>: Yes, sir.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> With us now here in New York City, Democratic strategist Mark Hannah, author of the book \"The Best Worst President.\" Now, as we discussed last night. Just the appearance of this meeting is disturbing, is it not?</p>                \n                \r\n\n            \n                <p><b>MARK HANNAH, DEMOCRATIC STRATEGIST</b>: A lot of people in the Democratic Party are upset with the optics of it, sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What does that mean?</p>                \n                \r\n\n            \n                <p><b>HANNAH:</b> It means that it doesn't look good. But when you consider what Bill Clinton does. In this -- I reached out to somebody who he works with him closely. And this is a courtesy he extends to members of Congress, foreign dignitaries, all cabinet.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm not so much worried about him.</p>                \n                \r\n\n            \n                <p><b>HANNAH:</b> No. He met with Ted Cruz on the tarmac a couple weeks ago.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Ted Cruz -- investigating his wife.</p>                \n                \r\n\n            \n                <p><b>HANNAH</b>: Common occurrence.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We all know --</p>                \n                \r\n\n            \n                <p><b>HANNAH:</b> Board the plane.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It is on his side. He is a very social man. Gregarious. And, you know, what he does doesn't concern me in this juncture. But the Attorney General has to know.</p>                \n                \r\n\n            \n                <p><b>HANNAH</b>: Well, she knows that there is an investigation going on, for sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And she has to know when the husband, a powerful man of his own right of the subject to the investigation enters a private plane alone.</p>                \n                \r\n\n            \n                <p><b>HANNAH</b>: Right. She also --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And stays with her for 30 minutes, not hi, how are you.</p>                \n                \r\n\n            \n                <p><b>HANNAH</b>: Right. She also is paying a courtesy call to the former president of the United States. It's not an easy thing to wave that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But here is what she should have done in my opinion. You get off your plane. You walk on to the tarmac, you greet him.</p>                \n                \r\n\n            \n                <p><b>HANNAH:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You talk with him in full view of everyone for two or three minutes and then you go on your way.</p>                \n                \r\n\n            \n                <p><b>HANNAH: </b>Both these people have security details. Loretta Lynch has the FBI around her. Bill Clinton still has the secret service.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So what? They're standing on the tarmac with them.</p>                \n                \r\n\n            \n                <p><b>HANNAH</b>: But they both know that the news of this is going to get out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No they didn't.</p>                \n                \r\n\n            \n                <p><b>HANNAH:</b> All sorts of witnesses that know what is happening.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>Secret service agent just wrote a book --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: This reporter broke the story. A local reporter. The National Media had no idea.</p>                \n                \r\n\n            \n                <p><b>HANNAH: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Let's get back just to this. You say that some Democrats are upset about the meeting, correct?</p>                \n                \r\n\n            \n                <p><b>HANNAH</b>: Right. It gives fuel to the fire of all the conspiracy theorists.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. Does it not? Sure it does.</p>                \n                \r\n\n            \n                <p><b>HANNAH</b>: It does.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, what should, in your opinion, Attorney General Loretta Lynch do recuse herself? I don't know how you possibly do that as the prosecuting attorney for the United States.</p>                \n                \r\n\n            \n                <p><b>HANNAH</b>: I think people have kind of a comical sort of understanding of how involved she is in this. This investigation is being led by career FBI agents and investigators.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But she has to bring charges.</p>                \n                \r\n\n            \n                <p><b>HANNAH: </b>You know, many of them are probably Republican but they don't see the world like you and I, Bill through the political lens.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: She has to bring the charges and it has nothing to do with the FBI.</p>                \n                \r\n\n            \n                <p><b>HANNAH:</b> Prove whether something is lawful or not lawful and with a high profile investigation like this. You better be sure if those FBI agents, if they don't take -- if Loretta Lynch doesn't take their recommendation you know you're going to have a couple that go rogue and talk to politics.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: If Loretta Lynch doesn't take their recommendation, the FBI, everybody should know that she will be impeached. Okay? She will be impeached.</p>                \n                \r\n\n            \n                <p><b>HANNAH</b>: I suspect she will take the recommendations.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>She will. She will. But if it comes back and this is bad for Hillary Clinton. Hillary Clinton should be mad about this. If it comes back that Hillary Clinton isn't going to be charged, the FBI says there isn't enough evidence, why does Hillary Clinton want a tainted case? She just wants to say good, I'm glad, so this is bad for her.</p>                \n                \r\n\n            \n                <p><b>HANNAH</b>: It's bad optic, no question.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Bad everything.</p>                \n                \r\n\n            \n                <p><b>HANNAH</b>: It gives fire to the conspiracy theorists.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. I got that.</p>                \n                \r\n\n            \n                <p><b>HANNAH:</b> But you know what? American people from a political standpoint don't care. They care about their bank accounts, they care about their national security --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. They care about us.</p>                \n                \r\n\n            \n                <p><b>HANNAH:</b> -- they don't care about Hillary Clinton's emails anymore, Bill. They just don't.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They do. And they care about who is running for president and they care about their government being honest. Mr. Hannah, thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.<br> </i>&#160;</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Loretta Lynch meets with Bill Clinton amid email scandal", "description": "'The O'Reilly Factor' investigates the controversial discussion", "date": "2016-07-01T12:58:08Z"}