{"vcmId": "c712cd25-f9ce-47d8-bcd5-ecb9e6e3ece2", "url": "http://www.foxnews.com/transcript/2016/09/08/bill-oreilly-hateful-speech.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Donald Trump gave a national security speech in Philadelphia today, concentrating on how he would bolster the military and pay for it by cutting back on civil federal employees among other things. As we reported last night, Mr. Trump is making gains across the country, primarily because Hillary Clinton is getting pounded by scandal. Day after day it's more reporting about the Clinton Foundation and the destroyed emails when she was secretary of state.</p>                \n                \r\n\n            \n                <p>That has taken pressure off Mr. Trump who is now getting more specific about what he would do as president. So, with two months left in the presidential campaign, it is a very close race. Enter the strategy of hate. On the Democratic side, the beat goes on portraying Donald Trump as a bigot and hate inciter. Here is what columnist Timothy Egan recently wrote in the \"New York Times,\" quote, \"In the hate speech that Donald Trump gave on immigration in Phoenix on Wednesday night, he all but deported the Statue of Liberty laying out one of the darkest visions of the American experience at that any major party nominee has ever given,\" unquote.</p>                \n                \r\n\n            \n                <p>Now, this is not boosterism for Donald Trump. But Mr. Egan's analysis is unfair and inaccurate. In Arizona, Mr. Trump restated that he would build a wall on the Mexican border to stem the flow of narcotics and illegal aliens. He also said he would crack down on alien criminals who commit violence in the U.S.A. Is that hate speech? Is that deporting the Statue of Liberty? I mean, think about it. Trump believes the nation is not secure when hard drugs and undocumented people can freely flow into the U.S.A. Is that a hateful position?</p>                \n                \r\n\n            \n                <p>Talking Points believes this demonization by the left of anyone, including me, your humble correspondent, who disagrees with their uber, uber liberal policies will fail. The fact is Donald Trump's Arizona speech helped him as the new polls show. Americans are tired, sick and tired of far left media people accusing others of racism, bigotry, and hatred. That's a cheap tactic and it should be rejected by all fair-minded people. That same thing is true to a much lesser extent on the right. Demonizing Hillary Clinton is foolish, let the facts speak for themselves.</p>                \n                \r\n\n            \n                <p>Secretary Clinton denies any wrongdoing in the email and foundation controversies, but there are plenty of facts in play. So you, the voter, can easily decide whether her denials have credibility. Also, it's quite clear that Secretary Clinton believes Barack Obama has done a heck of a job. Again, facts are clear. Reality staring us in the face. So it's not difficult to make a decision about either candidate. We don't need despicable and hateful branding. We need clarity. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Hateful speech", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 9/7", "date": "2016-09-08T12:09:06Z"}