{"vcmId": "c71d9f58-c6a2-4575-9fe1-a8dfd0512427", "url": "http://www.foxnews.com/transcript/2015/10/29/bill-oreilly-republican-debate.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Here's the headline: The CNBC moderators tried to bait the candidates.</p>                \n                \r\n\n            \n                <p>It was obvious.</p>                \n                \r\n\n            \n                <p><b>JOHN HARWOOD, CNBC ANCHOR</b> (to Trump): &#8220;Let's be honest. (LAUGHTER) Is this a comic book version of a presidential campaign?&#8221;</p>                \n                \r\n\n            \n                <p><b>REBECCA QUICK, CNBC ANCHOR</b> (to Rubio): &#8220;Just last year, you liquidated a $68,000 retirement fund. &#160;That's something that cost you thousands of dollars in taxes and penalties. &#160;In terms of all of that, it raises the question whether you have the maturity and wisdom to lead this $17 trillion economy. &#160;What do you say?&#8221;</p>                \n                \r\n\n            \n                <p><b>CARL QUINTANILLA, CNBC ANCHOR </b>(to Carson): &#8220;Last year, a marketing study called the warehouse retailer the number one gay-friendly brand in America, partly because of its domestic partner benefits. Why would you serve on a company whose policies seem to run counter to your views on homosexuality?&#8221;</p>                \n                \r\n\n            \n                <p>Now you can get away with that kind of stuff once in a while, but not if you make it the dominant theme.</p>                \n                \r\n\n            \n                <p>As for the candidates, nobody screwed up.</p>                \n                \r\n\n            \n                <p>Donald Trump was largely silent.</p>                \n                \r\n\n            \n                <p>Ben Carson was his usual polite self, sticking to his traditional point of view.<br> Marco Rubio was fiery and glib.</p>                \n                \r\n\n            \n                <p>He was hammered by a liberal newspaper in his state for missing votes in the Senate.</p>                \n                \r\n\n            \n                <p>Here's how he handled that:</p>                \n                \r\n\n            \n                <p><b>SEN. MARCO RUBIO</b> (R-FL): &#8220;In 2004 John Kerry ran for president, missing 60% to 70% of his votes. &#160;I don&#8217;t recall the Sun-Sentinel calling for his resignation. &#160;In fact the Sun-Sentinel endorsed him. &#160;In 2008 Barack Obama missed 60 or 70 percent of his votes. &#160;And the same newspaper endorsed him, again. &#160;So this is another example of the double standard that exists between the mainstream media and the conservative movement.&#8221;</p>                \n                \r\n\n            \n                <p>Good for Rubio.</p>                \n                \r\n\n            \n                <p>Jeb Bush was a policy wonk, as was John Kasich.</p>                \n                \r\n\n            \n                <p>Chris Christie, Mike Huckabee and Rand Paul were populists.</p>                \n                \r\n\n            \n                <p>Carly Fiorina handled herself well and actually made fun of herself:</p>                \n                \r\n\n            \n                <p><b>CARLY FIORINA, PRESIDENTIAL CANDIDATE:</b> &#8220;Well gee, after the last debate I was told I didn&#8217;t smile enough&#8230;(smiles) (crowd cheers/applause).&#8221;</p>                \n                \r\n\n            \n                <p>Finally, Ted Cruz was the most conservative of the crew, his usual position.</p>                \n                \r\n\n            \n                <p>The most surprising development was the lack of air time for Trump.</p>                \n                \r\n\n            \n                <p>Tomorrow on the Factor we will ask him about that.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The Republican debate", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/28", "date": "2015-10-29T12:33:16Z"}