{"vcmId": "c7d7d1e0-f664-4574-b20f-cf808c4365d7", "url": "http://www.foxnews.com/transcript/2015/01/08/bill-oreilly-another-terror-attack-by-muslim-killers.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>This morning in Paris, France three gunmen shouting Islamic slogans invaded the offices of a French satiric newspaper with murder on their minds.</p>                \n                \r\n\n            \n                <p>The gunmen killed 12 people, wounding 11 others. There is no question it's another terror attack by Muslim fanatics who are waging war against nearly everybody. Every country on earth is being impacted by the jihad. Yet, we still -- still will not admit the truth about this ongoing war.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES:</b> The one thing that I'm very confident about is the values that we share with French people -- a belief, a universal belief in freedom of expression is something that can't be silenced because of the senseless violence of the few.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But it isn't the few. The Jihadists have strongholds in at least a dozen countries. They have killed thousands of American military people -- tens of thousands of civilians. They are occupying thousands of miles of territory in the Middle East and ISIS fanatics are beheading civilians on camera and kidnapping people all over the place.</p>                \n                \r\n\n            \n                <p>President Obama should know the word \"few\" is absolutely erroneous. These are people are waging a world war and it will be a never ending war unless the entire world comes together to defeat the Islamic jihad. But many people will not even admit this is about fringe Islam.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HOWARD DEAN, FORMER DNC CHAIRMAN:</b> You know, this is a chronic problem. I stopped calling these people Muslim terrorists. They are about as Muslim as I am. I mean, they have no respect for anybody else's life. That's not what the Koran says. And you know, Europe has an enormous radical problem and enormous -- I think ISIS is a cult. Not an Islamic cult, I think it's a cult.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's just dumb -- dumb. ISIS recruits fanatical Muslims -- that's who they recruit. They don't go after flower children from San Francisco. They are not the Moonies.</p>                \n                \r\n\n            \n                <p>Howard Dean does not know what he is talking about. He is in a state of denial. And there are many, many others like him in America. Now, the French newspaper that was attacked by the jihadists had printed cartoons Mohammed, poked fun at Islam. In the jihad world that's a capital crime.</p>                \n                \r\n\n            \n                <p>In 2012 White House spokesman Jay Carney actually warned the publication.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JAY CARNEY, FORMER WHITE HOUSE PRESS SECRETARY:</b> We don't question the right of something like this to be published. We just question the judgment behind the decision to publish it.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, that's a message of weakness. Although I understand Mr. Carney's point of view if you don't have to antagonize fanatical killers, don't.</p>                \n                \r\n\n            \n                <p>But the real issue is confronting the jihad. In Europe, many people are getting fed up. About 18,000 Germans recently demonstrated against Muslims in general, living in their own country. These Germans were not protesting the jihad pro se. They are angry with Islam -- period. And that's a growing trend in Europe.</p>                \n                \r\n\n            \n                <p>But that stuff does little good. What should be happening is a coordinated effort among the nations of the world to fight the jihadists and punish countries that enable them. And if Pakistan, for example, aids a terrorist, then all business should be cut off. Pakistan and other countries like it should be pariahs, isolated. But the world will not do that. Thus, the jihad lives. And 12 more people die in Paris, France.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Another terror attack by Muslim killers", "description": "Talking Points 1/7", "date": "2015-01-08T13:18:19Z"}