{"vcmId": "c825897e-1f1d-4308-9ad9-ac00991e3ce9", "url": "http://www.foxnews.com/transcript/2015/02/16/metta-world-peace-on-racial-division-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 13, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Factor follow up segment tonight: The racial division in America. We all know the problem, blacks, whites, Hispanics all see society differently.</p>                \n                \r\n\n            \n                <p>In Oakland, where they have been many anti-police demonstrations, young girl have the now been enlisted in that cause.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED WOMAN: </b>On a Saturday afternoon in Oakland, a handful of eight to 10-year-old girls are gathered in brown uniforms giggling and eating cupcake. They look like girl scouts. But it's not just fun and games. Take a listen.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED GIRL:</b> White policemen are killing black young folks such as women, men and children.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED GIRL:</b> Mike Brown, he was shot because he didn't do nothing, only the police officers shot him because his skin color.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED WOMAN:</b> These girls are called the radical brownies, and instead of learning sewing. They are learning social justice. Even their uniforms have a message.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED GIRL:</b> The berets? It's a Black Panther brown beret twist.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED WOMAN:</b> I think it's very appropriate. A lot of the work the Black Panthers did was community oriented.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>With us now to react. Metta World Peace, former NBA basketball player who had a hard scrabble upbringing in Queens, New York, he is the author of the new become \"Metta: Let's Meet the Police.\"</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE, ARTEST MANAGEMENT GROUP CEO: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Just out two weeks ago. I know you pay attention to this kind of stuff.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You know, when I saw these 10-year-old girls, I don't think they should be doing that.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> Well, I 100 percent understand. I'm about 60 percent against it about 40 percent for the effort. I think the effort is good. Speaking out, speaking your mind and being involved in politics.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But they can't possibly understand the nuances of the story.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> Absolutely. I think with the Black Panther Party I kind of overheard that. And I think it started out promoting, you know, community, and then it went wrong somewhere.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. It got a little --</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE: </b>Yes. You have four children, right?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> Yes. Four children.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, they must be paying attention to all this racial business.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE: </b>Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What do you tell them?</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> Well, I make sure my kids understand people. Understand that if somebody is racist. It came from somewhere. They didn't just -- they wasn't born racist. Somebody is a gang member. They weren't born a gang member. So, I want to make sure my children understand the environment that they live in.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. So, do you tell them as the mayor of New York City did, to watch out for the police?</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> No, I just tell them not all police are bad. I grew up in environment where police weren't around a lot. And I experienced some profile and I experienced good police. I remember growing up playing basketball. Police actually took off their guns, put it on the ground and played basketball.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right, in Queens?</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> In Queens. Which is like you never do that, right? So, I explained both sides. And I understand, you know, what everybody is going through right now.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, when you wrote this meet the police, what's the message of this book?</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE: </b>The message is you don't want to start racial wars or things like that. You want to have solutions. You want to have prevention, tactics and things like that. And you also want to address issues. You just don't want to just push it under the rug.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's written for children?</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> It's written for children absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> Because you don't want children to grow up hating police or race hating. Hating another race, black hating whites, whites hating blacks. That's why my book is very diverse.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. When you hear someone, you know, look, the Ferguson, Missouri, thing, it was established beyond any reasonable doubt.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE: </b>Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That the initial reporting hands up didn't happen.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. Do you feel it's necessary to correct the record to people who believe it did happen?</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE</b>: I believe -- I do believe that. And I also believe that the blacks make up 70 percent of Ferguson. And we are only five percent law enforcement and nobody is involved in politics. You know? And if you really want to change a community, you have to get involved in politics. You have to get involved in the school system. You have to try to change.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Absolutely. Blacks are a majority in that town, if they wanted, they could have a black mayor or, you know, they could organize and much.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE: </b>Absolutely. Organize.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And I'm more, you know, I have known you for a while because I'm an NBA fan. And your name used to it be Ron Artest.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE: </b>Used to be.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Why is it now Metta World Peace?</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> Well, I feel I continue to evolve, I continue to connect to people, to the earth.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>To the earth?</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE: </b>Everything.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> I'm just evolving as a person. And you know, I wanted my name to evolve. And every day, every month I continue to evolve more and more.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. So you want to kind of new age name, Metta World Peace.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> I just felt like changing it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What do they call you, Metta?</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> People call me Metta, in China they call me panda.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> This year you played basketball in China.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That must have been a trip.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE</b>: It was great.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> It was great. I enjoyed it so much.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Is there any racism in the Chinese society.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> I believe it's racism everywhere. I experienced racism in a Chinese society, in New York City when I used to grow up. You know, and people automatically judged me and assumed that I'd wanted to maybe steal something or things like that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> But, you know what? As I get older, I don't judge. I try to come up with prevention, solutions.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And that's the good thing about you. I mean, and you guys that don't follow the NBA, he was the toughest guys, tough players. But then they go Metta World Peace beat me up.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> You know, very rough on the court.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Thanks a lot for coming on.</p>                \n                \r\n\n            \n                <p><b>METTA WORLD PEACE:</b> Thanks for having me.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Metta World Peace on racial division in America ", "description": "Professional basketball player on a girls youth group being enlisted into anti-police demonstrations", "date": "2015-02-16T13:19:15Z"}