{"vcmId": "c8d51f86-7de6-484f-b638-cd1267109252", "url": "http://www.foxnews.com/transcript/2015/01/23/ferguson-justice-department-decision.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 23, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And in the Impact Segment tonight, we continue now with our lead story, the Justice Department not filing civil rights charges in the Michael Brown case.</p>                \n                \r\n\n            \n                <p>With us, Richard Fowler, a radio talk show host. He is he in Washington, and Reverend Jack Degraff, a Fox News contributor here in New York City.</p>                \n                \r\n\n            \n                <p>Am I making any mistakes here? You heard my talking points memo. I mean, I think that the protesters and the looters and everybody else should apologize.</p>                \n                \r\n\n            \n                <p><b>REVEREND JACQUES DEGRAFF, SOCIAL JUSTICE ACTIVIST</b>: First of all, the protesters and looters are not one in the same.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No, they are not -- the guys out there in the name of protests.</p>                \n                \r\n\n            \n                <p><b>DEGRAFF</b>: The people who responded to the original miscarriage of justice in my view with the grand jury are not the people who were organized and were looting.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Look, there are good protesters and bad protesters, but it's all under the banner of protests.</p>                \n                \r\n\n            \n                <p><b>DEGRAFF</b>: There were looters and protesters.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But the only reason the looters were out there was because of the protests against what happened in Ferguson.</p>                \n                \r\n\n            \n                <p><b>DEGRAFF</b>: That, we agree on.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, you say you still think there is injustice, right?</p>                \n                \r\n\n            \n                <p><b>DEGRAFF</b>: Right. But I accept the decision of the federal government.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You have to. How do you know? You weren't there. And now you have the feds and the state and the folks in the grand jury. But you still feel injustice. How would you know?</p>                \n                \r\n\n            \n                <p><b>DEGRAFF</b>: I know because I'm a black American who has experienced disparities and who is part of a national moment. This country is up in arms because of injustice that didn't just happen in Ferguson. It happened --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I want people to understand where you are coming from. So because you are a black man who has experienced racism in the past, because of that, you transfer that feeling to a criminal case of which you know nothing about.</p>                \n                \r\n\n            \n                <p><b>DEGRAFF</b>: No, that's not true. What I am saying is this, the prosecutor in Ferguson failed to do his job when he presented --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's not what the feds said.</p>                \n                \r\n\n            \n                <p><b>DEGRAFF</b>: No. But the feds didn't judge what the prosecutor --</p>                \n                \r\n\n            \n                <p><b>DEGRAFF</b>: No, no, no. If there had been prosecutorial misconduct the feds would have come -- that's not what the charge.</p>                \n                \r\n\n            \n                <p>The charge of the prosecutor in every instance in 50 states of America is to present charges for the purpose of an indictment. If you don't -- if you are not going for an indictment, you wouldn't present charges.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The reason that Holder went in --</p>                \n                \r\n\n            \n                <p><b>DEGRAFF</b>: Not Holder the prosecutor in Missouri.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But Holder went in to see if there was any misconduct by the state and local people.</p>                \n                \r\n\n            \n                <p><b>DEGRAFF</b>: By the civil rights federal standards.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right, how do you see it, Mr. Fowler? Am I making any mistakes here?</p>                \n                \r\n\n            \n                <p><b>RICHARD FOWLER, RADIO TALK SHOW HOST</b>: I think you are making one mistake that is critical to understanding how this case went down. The federal investigation wasn't about the prosecutor, Bill.</p>                \n                \r\n\n            \n                <p>The federal investigation was about whether or not Darren Wilson violated Michael Brown's civil rights. And clearly, as soon as since the federal government has chosen not to prosecute, they are indicating that his civil rights weren't violated.</p>                \n                \r\n\n            \n                <p>Does that mean that Darren Wilson didn't profile him? Of course, it doesn't because we know Darren Wilson did profile him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I think you both don't understand what the statute says. If any misconduct took place in the investigation, it doesn't -- it can go from the actual shooting to how it was prosecuted.</p>                \n                \r\n\n            \n                <p>Then the federal government could file civil rights charges saying that an American citizen, Michael Brown, rights were violated because the prosecutors didn't do their job or the police didn't do their job or whatever. They have a big tent to go into.</p>                \n                \r\n\n            \n                <p><b>FOWLER</b>: But that wasn't the line of the federal investigation, Bill.</p>                \n                \r\n\n            \n                <p><b>DEGRAFF</b>: It has to be evidence to that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. There had to be evidence.</p>                \n                \r\n\n            \n                <p><b>DEGRAFF</b>: And the prosecutor in Missouri chose to say presenting that which would lead to an indictment that he would present all the facts and let the jury sort it out. No one does that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Under our justice system, wait a minute, the Justice Department ruled that the investigation was on the up and up or they would have filed. Now --</p>                \n                \r\n\n            \n                <p><b>FOWLER</b>: No, no, no. Wait a second, Bill. That's not correct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes, it is. It's absolutely correct.</p>                \n                \r\n\n            \n                <p><b>FOWLER</b>: The Justice Department in their investigation was only investigating Darren Wilson and Darren Wilson's actions --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's not true. It was a civil rights --</p>                \n                \r\n\n            \n                <p><b>FOWLER</b>: -- against Darren Wilson. Not against the prosecution -- the prosecutor.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It was the whole case -- if somebody had bribed the grand jury, Mr. Fowler, if somebody had given them money and the Justice Department found that out, they would have brought charges.</p>                \n                \r\n\n            \n                <p><b>FOWLER</b>: That's a totally different case.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: My God.</p>                \n                \r\n\n            \n                <p><b>FOWLER</b>: Not to mention the fact that the grand jury is suing the prosecutor -- misconduct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The whole case. You guys are wrong, all right? You are wrong.</p>                \n                \r\n\n            \n                <p><b>FOWLER</b>: At the end of the day.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No end of the day.</p>                \n                \r\n\n            \n                <p><b>FOWLER</b>: You cannot look at the Michael Brown case in a vacuum. That's what the reverend is trying to say.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: There is no vacuum. They investigated the whole case.</p>                \n                \r\n\n            \n                <p><b>FOWLER</b>: You look at Mike Brown, Eric Garner, Tamar Rice, the list continues, black men killed innocently by police who are unarmed. That's why people are protesting and that's why they are continuing to fight and say black lives matter.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You simply do not understand --</p>                \n                \r\n\n            \n                <p><b>DEGRAFF</b>: We understand but we may not agree, but we understand.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You don't understand at all so I have to go away now. You don't understand.</p>                \n                \r\n\n            \n                <p><b>DEGRAFF</b>: We don't agree.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: A federal intrusion.</p>                \n                \r\n\n            \n                <p><b>FOWLER</b>: I definitely understand.</p>                \n                \r\n\n            \n                <p><b>DEGRAFF</b>: We don't agree.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All parts of that case were looked at for any taint of corruption or unfairness. And there is no indictment coming down against anyone. And that's the truth. I have got to go.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Ferguson Justice Department decision", "description": "The Justice Department will not file civil rights charges in the Michael Brown case", "date": "2015-01-23T13:28:52Z"}