{"vcmId": "c963524c-0b2a-414e-b26c-f8ea99d65f01", "url": "http://www.foxnews.com/transcript/2017/04/14/president-trump-modifies-position-on-foreign-policy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 13, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p> <b>ERIC BOLLING, FOX NEWS HOST:</b> Hi, I'm Eric Bolling in for Bill O'Reilly who is on vacation. Thanks for watching us.</p>                \n                \r\n\n            \n                <p> Our top story tonight, President Trump with the benefit of 84 days in office has recently modified his positions on NATO, China, Russia and Syria. You'll never believe this, but the mainstream media painting this as a negative.</p>                \n                \r\n\n            \n                <p> <b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> UNIDENTIFIED FEMALE</b>: From President Trump, a flurry of flip-flops.</p>                \n                \r\n\n            \n                <p> <b>PRES. DONALD TRUMP (R), UNITED STATES</b>: I said, here's the problem with NATO. It's obsolete.</p>                \n                \r\n\n            \n                <p> I said it was obsolete. It's no longer obsolete.</p>                \n                \r\n\n            \n                <p> <b>UNIDENTIFIED FEMALE</b>: That rhetorical reversal on NATO just one of several in the past 24 hours.</p>                \n                \r\n\n            \n                <p> <b>UNIDENTIFIED FEMALE</b>: From President Trump, a very different tone about the country he previously called an enemy.</p>                \n                \r\n\n            \n                <p> <b>TRUMP:</b> President Xi wants to do the right thing.</p>                \n                \r\n\n            \n                <p> <b>UNIDENTIFIED FEMALE</b>: What a change from candidate Trump who repeatedly used China as a punching bag.</p>                \n                \r\n\n            \n                <p> <b>TRUMP</b>: We can't continue to allow China to rape our country and that's what they're doing.</p>                \n                \r\n\n            \n                <p> Right now are not getting along with Russia at all. We may be at an all- time low in terms of relationship with Russia.<br> <b><br> UNIDENTIFIED MALE:</b> That is not what candidate Trump thought was meant to be.</p>                \n                \r\n\n            \n                <p> <b>TRUMP:</b> We are going to have a great relationship with Putin and Russia.</p>                \n                \r\n\n            \n                <p> <b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b> BOLLING</b>: Joining us now for reaction, Dr. Sebastian Gorka, a deputy assistant to President Trump. Dr. Gorka, we saw, yes, we see Donald Trump evolving on some of these issues but is it that also what he promised to make deals, the art of the deal to make America great again?</p>                \n                \r\n\n            \n                <p> <b>DR. SEBASTIAN GORKA, DEPUTY ASSISTANT TO PRESIDENT TRUMP:</b> Eric, there is no one better. I really recommend people read his book. It is the art of the deal. What we have seen is eight years of divisiveness of the Obama White House dividing our nation against itself and dividing us against our allies and friends. And in just 84 days, President Trump has replaced divisiveness with the decisiveness, whether it's to do with the border, whether it's to do with manufacturing, whether it's to do with NATO or whether it's to do with our enemies and ISIS or in this case, the mechanical weapons attack last week. We have changed the geopolitical reality in the world in just a matter of weeks.</p>                \n                \r\n\n            \n                <p> <b>BOLLING:</b> Yes. How did they do that? In fact, it's today's big 21,000 bombs dropped on Afghanistan, has that affected the geopolitical balance or at least the way the rest of the world sees Donald Trump?</p>                \n                \r\n\n            \n                <p> <b>GORKA: </b>Well, absolutely because it means that people now understand just how much the President means what he says. When he says unequivocally in front of the Joint Session of Congress at CPAC, when he says I am going to obliterate ISIS literally, when he says I'm going to wipe the Islamic State off the face of the earth, it's not empty rhetoric. Eric, if you read the memoirs of Secretary Gates, of Secretary Panetta, it's stunning. Obama's own principles, their own secretaries talk about NSC meetings that last for three to four hours with nobody taking a decision. That was the last eight years. That was the reality of the red lines. Along comes President Trump, that's gone. We have a threat, we promise to deal with it, and were dealing with it right now.</p>                \n                \r\n\n            \n                <p> <b>BOLLING:</b> Doctor, talk about this in Moab, this big bomb that they drop today. Was that on ISIS? I understand it was on ISIS but was it directed towards ISIS or was that directed towards North Korea or was it directed towards, how about this one, Iran?</p>                \n                \r\n\n            \n                <p> <b>GORKA:</b> Let's look at last week. The cruise missile attack on the airbase in Syria wasn't just about sending message about weapons of mass destruction in Syria. It was a message about weapons of mass destruction anywhere, and it is also a message about nations that sponsor mass murdering regimes. So Eric, you're absolutely right. This president understands that diplomacy without forced behind it is nothing. Its words, it's pieces of paper. Statecraft and leadership are when you use these things to get to reinforce one another.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: I'm sorry to cut you off, but you know, Assad has said this is all at fabrication. He said, these videos are made up by the U.S. government to find a reason to bomb Assad. Will Trump and he says, we're not going into Syria, but if Assad does use chemicals again, will he bomb Syria?</p>                \n                \r\n\n            \n                <p> <b>GORKA</b>: We don't give our playbook away. You're friend of mine Eric, but we don't do it. That's the last eight years. We don't telegraph in advance to the threats out there what we're going to do because that's how you lose. That's a strategic. But do you think Assad is going to use chemical weapons again?</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: I think Assad is crazy and I also think Kim Jong-un is crazy. Will Donald Trump use a preemptive strike? I guess he won't do preempted but what would it take to use a strike from the U.S. as -- in Korea and the waters up North Korea?</p>                \n                \r\n\n            \n                <p> <b>GORKA:</b> Look, again, we're not going to give our playbook away but I'll tell you one thing for sure, the Assad regime as a client state of other nations. Other nations prop this nation up and keep it alive. Those sponsoring nations are sitting down right now, I guarantee you that, and they're going through a very simple calculus in their minds. They're asking themselves where is my redline for how long I'm going to support somebody like this who uses chemical weapons on innocent women and children? That's geopolitics. That's statecraft and the President has sent that message. It is not just about Syria. It's about those nations who have kept Syria alive.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: Okay. And you mentioned these nations now, when President Trump decided to launch his 59 Tomahawks, he did it while President Xi was having dinner with him from Mar-a-Lago. Hold on. We'll get to dessert in a second, I have to drop 59 missiles into Syria. Did President Xi direct his NATO Security Council to vote no contest or no vote as far as sanctioning Syria because of that meeting with Donald Trump at Mar-A-Lago?</p>                \n                \r\n\n            \n                <p> <b>GORKA</b>: You'd have to ask the communist party of China.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: What do you think?</p>                \n                \r\n\n            \n                <p> <b>GORKA</b>: I think those things are not unrelated to each other. Look at the decision with regards to coal purchases. China is not an irrational act. It's very important to understand the Chinese government is not illogical. They are perhaps one of the most strategic nations out there and as a result, they know cost benefit analysis, and they know what national interest means and they understand sometimes supporting somebody to the extent at which they undermine my interest is not a good idea.</p>                \n                \r\n\n            \n                <p> <b>BOLLING:</b> Has China become a better friend of the United States than say Putin in Russia?</p>                \n                \r\n\n            \n                <p> <b>GORKA:</b> I think China understands you can't undermine and subvert America the way you could in the last eight years. There may be things we can cooperate on and there may be lines that we draw in terms of how far we can cooperate, but that's fine. You know, they don't have to be our best buddies but the question is --</p>                \n                \r\n\n            \n                <p> <b>BOLLING:</b> But it seems that the Trump administration has gotten a little bit tougher with Russia because of our relationship getting a little bit stronger with China. Quick thought.<br> <b><br> GORKA:</b> And isn't that interesting? What happened to all the stories about Russia? Yes. This is when you realize just how fake the fake news is. It's about American interest. I can assure you of one thing. President Trump is a patriot and a pragmatist at the same time, and that's why you're seeing the decisiveness you're seeing today.</p>                \n                \r\n\n            \n                <p> <b>BOLLING:</b> Dr. Gorka, we're going to leave you right there. Thank you very much.</p>                \n                \r\n\n            \n                <p> <b>GORKA:</b> Thank you.<br> <b><br> BOLLING</b>: Now, let's turn to Nancy Soderberg, a former U.N. ambassador and Deputy National Security advisor to President Clinton. She joins us from Jacksonville, Florida. Thank you, Ambassador.</p>                \n                \r\n\n            \n                <p> You listen to that back and forth with Dr. Gorka. First of all your thoughts, did anything jump out at you especially the relationship between Putin and Trump and Xi from China and Trump?</p>                \n                \r\n\n            \n                <p> <b>AMBASSADOR NANCY SODERBERG, FORMER CLINTON DEPUTY NATIONAL SECURITY ADVISOR</b>: First, nice to see you and thanks for having me. I think Sebastian's right that I think the President is a patriot trying to do the right thing. But this pivot on all the things that we disagree is the world, the geopolitical world is moving to Donald Trump. It's really Donald Trump of moving towards reality and away from some of the campaign rhetoric that got him elected, but is not related to facts and is frankly not realistic. And so, I think it's a good thing that he is pivoting. I think it is a good thing that he's recognizing that some of these statements were wrong. And I think it's a good thing.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: So, pardon my own interruption, Ambassador, but you're saying, so Donald Trump pivoting to reality comes on the heels of 59 Tomahawks into Syria and 21,000 pound bomb into Afghanistan.<br> <b><br> SODERBERG</b>: Well, and changing his position on NATO, on China, getting away from China, you know, demolished the ObamaCare, health care thing and --</p>                \n                \r\n\n            \n                <p> <b>BOLLING: </b>Because some would say that was the problem with President Obama that he didn't do things like this. So, are you agreeing with President Trump on some of the actions he's taking over the last two years?</p>                \n                \r\n\n            \n                <p> <b>SODERBERG:</b> Yes. I think that the action he took on Syria was exactly right. It was a measured response to a second chemical weapons attack and I think that he is broadly been supported for that, and I applaud that effort. But it's a bigger question than just one bomb. Yes, I think that was the right thing but does that mean he's got a strategy for Syria? What does it mean on Russia? Is he still thinking that Russia is run by someone who can be our friend? What is it mean in terms of trying to lead in the Middle East and have an American plan? You got to have a plan if you are going to use military force. I absolutely agree with Sebastian. Diplomacy does not work if you don't back it up with military force.</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: Well, they call to the USS Vincent the aircraft carrier 100,000 tons of diplomacy headed towards North Korea. Iran. Let's talk -- no one is really talking about Iran. Iran has to see these moves and maneuvers and say, hey, wait a minute, we're not dealing with Obama anymore.</p>                \n                \r\n\n            \n                <p> <b>SODERBERG</b>: Well, I think the Iran deal is working, the nuclear weapons program is halted so that seems to be working. I think the Trump administration has agreed to keep it going. The tougher problems at what we are going to do with North Korea? It's a very difficult thorny problem that president from the first President Bush have tried to deal with. It's a crazy regime. Let's figure out that its nuclear program has its own currency in the world. And it's a very difficult problem.</p>                \n                \r\n\n            \n                <p> I think the President is right to try and get China to be the linchpin there to move it forward. But you need diplomacy in the world and yes you need it backed by force and presidents have figured that out and I think the President needs some strategies that go along with this. He's got to listen to his advisors and come up with how are we going to do this?</p>                \n                \r\n\n            \n                <p> <b>BOLLING:</b> How do you do that? Ambassador, you're the U.N. ambassador. You have, in North Korea, you have three generations, the founder of North Korea was Kim Jong-un's grandfather. So, we've had a 105 years of one family role in North Korea. What would it take to change power in North Korea? You have to break up the whole family structure.</p>                \n                \r\n\n            \n                <p> <b>SODERBERG</b>: You do. I mean, and I think President Trump has asked for broad wide-ranging issues, options on North Korea from toppling the regime to trying to push military and trying to work with China. I think I've been in meetings where people struggle with these decisions and you end up having to take the best of really awkward options, and I think that's what President Trump is rightly trying to grapple with.</p>                \n                \r\n\n            \n                <p> <b>BOLLING:</b> What is that? I mean, is that the United Korean Peninsula, one Korea? Or is it, you know, China taking over?</p>                \n                \r\n\n            \n                <p> <b>SODERBERG</b>: It is eventually one Korea that's united and democratic, but that's a long way off and it's going to require much tougher diplomacy with China. But on the broader picture, look at where President Trump is. He is pivoting towards reality, putting force and diplomacy and that is a good thing. His problem and I'll just put this out there is, he got elected with very extreme statements that did not relate to reality and how is he going to keep this intact while he is --</p>                \n                \r\n\n            \n                <p> <b>BOLLING</b>: A more extreme than dropping 59 Tomahawks in Syria and a 21,000- pound Moab into Afghanistan. I have to leave there Ambassador. Thank you so much.</p>                \n                \r\n\n            \n                <p> <b>SODERBERG</b>: Thanks so much.</p>                \n                \r\n\n            \n                <p> <br> <i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "President Trump modifies position on foreign policy", "description": "'The O'Reilly Factor' examines the White House's stance on NATO, Russia, China and Syria", "date": "2017-04-14T12:00:00Z"}