{"vcmId": "caa53050-eef7-430c-9849-3392ba2a1eb8", "url": "http://www.foxnews.com/transcript/2016/08/03/donald-trump-responds-to-president-obama-criticism.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 2, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Now for the top story tonight. Earlier today I spoke with Mr. Trump.</p>                \n                \r\n\n            \n                <p>So as I said to the audience in the Talking Points, I think it's just fair to give you an opportunity to reply to the president who said this today. Roll it.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>PRES. BARACK OBAMA (D), UNITED STATES:</b> The notion that he would attack a Gold Star family that had made such extraordinary sacrifices on behalf of our country, the fact that he doesn't appear to have basic knowledge around critical issues and -- in Europe in the Middle East, in Asia means that he is woefully unprepared to do this job.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What say you?</p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL NOMINEE</b>: I think he is the worst president maybe in the history of our country. I think he has been a disaster. He has been weak. He has been ineffective. You look at this so-called recovery. It's setting record lows. I guess not since 1949 has there been anything like it. You look at home ownership. Look at what happened as an example. He talks about Ukraine. I believe I know far more about foreign policy than he knows. Look at Ukraine. He talks about Ukraine, well, you know, how tough he is, right? How tough he is with Russia. In the meantime they took over Crimea.</p>                \n                \r\n\n            \n                <p>And I understood that and most papers covered what I said accurately and some didn't because the press is so dishonest. But Crimea, I mean, the Russians took it over under Obama's very powerful leadership. And, you know, he talks about me with Russia. Wouldn't it be a wonderful thing, frankly, if we actually got along with Russia and worked out some kind of a deal where we go and knock the hell out of ISIS along with NATO and along with countries that are in the area? Wouldn't that be wonderful as opposed to fighting?</p>                \n                \r\n\n            \n                <p>But Crimea was taken over and, you know this better than anybody, because you were covering it a couple of years ago. It was taken over during Obama's regime, big tough president. So, look, I think he is one of the worst presidents, maybe the worst that we have ever had in the history of our country. I think that Hillary Clinton may be -- she has the potential to be even worse.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: She will be terrible. Look at the lie. Look at the lies. Look at the lie over the weekend that she told about the FBI director. I mean, such a lie. I was listening to it. I said, how can anybody even say that after what was said about her?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. Let --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: So I think she has the potential to be even worse.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Let me refocus you back on this Khan situation because the press is running wild with it in hindsight, wouldn't it have been smarter for your campaign just to pretty much ignore him?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, you know, I was watching television. I said isn't that nice? Isn't that nice? And all of a sudden I was viciously attacked on the stage of the Democratic National Convention by Mr. Khan. And I responded to that vicious attack. And what happened is the press took it and made it a big deal and that's fine. I speak -- I speak very well obviously. I mean, there is no greater sacrifice than you lose a son or a daughter and, you know, in the way that this happened and I understand that.</p>                \n                \r\n\n            \n                <p>But, regardless, I was viciously attacked. So, I think I have the right. Am I supposed to not have the right to at least say something back and I did --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>And I don't even like talking about it because honestly, Bill, you just brought it up again.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: And it's already sort of falling into the background. This was a press event. The press played it day in day out. CNN which is a totally dishonest. Let me just tell you. CNN which is a totally dishonest group just kept playing it over and over.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. I can identify they did the same thing to me last week because I gave historical facts about how the White House --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I saw that and it didn't stop.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, look, and it will never stop. But look, here is what your supporters want to know and some people are undecided who you need to persuade over to your camp. It wasn't wise to bring the mother in. I understand Khan. And I got that, you know, he is going to come after you and he was obviously hired by the Clinton campaign to do that. It was orchestrated as we just said in the talking points. Everybody knew the script. But the mother is just sitting there. And for you to bring her in, that gives him the opportunity. You just opens the door for them to come in and hammer you as this mean kind of guy.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I understand that, but, you know, part of it is I read a lot and I watched a lot. And many, many people discuss this. Many, many people they said. So, when I said it, it became like a big deal. And that's, you know, the way it is. But I was very viciously attacked and I said not very viciously back. And the press -- especially CNN, I mean, because they are very dishonest. They must be having very bad ratings problems or something which actually I hear they are. But they just kept it going and it never stopped. And, honestly, it's too bad.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. But the \"New York Times.\"</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Tremendously unfair.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Tremendously unfair treatment.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> On page one, your Vietnam, you know draft status. By doing this and I had to learn this the hard way with that despicable Al Franken, all right? If you go after somebody and you're punching down as they say, all right? The left wing press is going to say you are a racist and a bully and sexist.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I agree.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No, I agree.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>But I have to say, you mention the \"New York Times.\" I'm on the cover of the \"New York Times\" like every day. Sometimes two or three stories.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: They are so dishonest. First of all they are losing a fortune.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They're waiting. So, they should have done the Vietnam thing when got into that Kerfuffle with John McCain. They would have been the time. But they held him because he is a Republican. So, they didn't mind you hammering him.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: But just so you understand and so your viewers understand nothing was wrong. I had some academic exemptions. I had -- it was a very minor thing. They didn't even talk about the draft number I got. I got 356, I think it was draft number. It was a lottery. They didn't even mention.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But before the lottery, they said you had -- but it doesn't matter what they said.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> What I'm saying Bill is this.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They are going to give it to you no matter what.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: The \"New York Times\" is unbelievably dishonest. They are failing. It's a failing newspaper. It's losing a fortune. Probably it won't be around for more than two or three years. And, you know, they write and they keep writing. And I believe if they write something wrong, I believe in fighting back a little bit. I don't know if I should. Maybe I shouldn't.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It depends on who you fight against.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> So far it has been working in all fairness.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: If you want to beat me up, remember when you said I need a psychiatrist, that's fine, people like said yes, he does.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Right. Well, I said it kiddingly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. But anyway, you can fight me. You can come at me. But if there is some little Muslim woman who loses a son, you can't. You just can't. No matter what she does. She can get set you on fire and you can say, thank you I hated those trousers.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I know.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You know, you just got to let it go.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I didn't fight her.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: We'll hold you over.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: But please remember, I was viciously attacked and all I did was respond to it and it ends up being a four day story.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump responds to President Obama's criticism", "description": "Republican presidential nominee weighs in on his blunt remarks and campaign strategy on 'The O'Reilly Factor'", "date": "2016-08-03T13:09:50Z"}