{"vcmId": "caeccf51-35d9-4508-98a2-1fc1f0165bbc", "url": "http://www.foxnews.com/transcript/2015/06/03/bill-oreilly-anger-on-left.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As we reported last night 50 percent of Americans, half the country, now disapprove of the job President Obama is doing according to a new Quinnipiac poll. That has angered some of the President's most ardent supporters who are standing by their man believing he is misunderstood.</p>                \n                \r\n\n            \n                <p>But when asked what his accomplishments have been, there is really one thing left can point to, Obamacare. And that might be overturned by the Supreme Court this month. At all other fronts the President's tenure has been mediocre at best.</p>                \n                \r\n\n            \n                <p>The American economy now contracting. And the chaos overseas is clear to everybody except Mr. Obama who continues to put forth that his foreign policy has gained respect for America around the world. By the way, the President bases that statement on a Pew poll taken overseas.</p>                \n                \r\n\n            \n                <p>But remember the more American power declines, the more people abroad like us because they don't want us to be the lone super power. That's what you're seeing there.</p>                \n                \r\n\n            \n                <p>Now, no one likes to think the person they vote for is a failure. When President Bush got into trouble over Iraq and the keen my, many on the right defended him. They were angry about all the criticism.</p>                \n                \r\n\n            \n                <p>Same thing with Barack Obama. His supporters are furious that his administration is now being perceived as kind of a failure.</p>                \n                \r\n\n            \n                <p>And then there is Hillary Clinton. According to a new CNN poll just 42 percent of American adults now believe Mrs. Clinton is trustworthy; 57 percent say she is not. The poll asked another question, does Hillary Clinton care about people like you? 47 percent, yes. 52 percent, no. Finally, Mrs. Clinton support among Democrats and Independents who lean that way has dropped nine points since April. All of that has infuriated Americans who want Mrs. Clinton to be the next president.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JAMES CARVILLE, DEMOCRATIC STRATEGIST:</b> Do you remember Whitewater? Do you remember file gate? Do you remember travel gate? Remember pardon gate? Remember Benghazi? All this is just the same cockamamie stuff that we go through.</p>                \n                \r\n\n            \n                <p><b>JULIAN CASTRO, SECRETARY OF HOUSING AND URBAN DEVELOPMENT: </b>What you have here with these e-mails is basically a witch hunt.</p>                \n                \r\n\n            \n                <p><b>HOWARD DEAN, FORMER VERMONT GOVERNOR:</b> The media really wants to see everything and they have this fundamental belief that they should see everything and I think Hillary decided they probably shouldn't and I think that's her prerogative.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But no amount of spin can deflect the truth. At this point, a year and a half away from the Presidential vote, many Americans are turning away from Secretary Clinton. Of course that might reverse itself.</p>                \n                \r\n\n            \n                <p>When folks get angry they often lash out and Talking Points believes the left will launch vicious attacks on whomever the Republican nominee will be. Liberals are so angry right now, so furious, that things are not going their way and their standard bearers are losing respect, they're going to attack in unprecedented ways.</p>                \n                \r\n\n            \n                <p>The smear Web sites already gearing up. And if the right wing replies in kind, the Presidential race of 2016 will be the ugliest in American history. Get ready.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Anger on the left", "description": "Bill O'Reilly's Talking Points 6/2", "date": "2015-06-03T12:16:47Z"}