{"vcmId": "cb4252e7-8ed7-4dea-ba70-6511e16b7dad", "url": "http://www.foxnews.com/transcript/2016/04/29/donald-trump-on-his-foreign-policy-strategy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 28, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Now for the top story tonight. Donald Trump giving a big foreign policy address yesterday in Washington. He joins us now from Evansville, Indiana.</p>                \n                \r\n\n            \n                <p>First of all, you did not mention Afghanistan in the address. We have got about 10,000 troops there right now. The place is still in chaos after 13 years. What exactly will you do about Afghanistan?</p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL CANDIDATE</b>: I would stay in Afghanistan. It's probably the one place we should have gone in the Middle East because it's adjacent and right next to Pakistan which has nuclear weapons. So I think you have to stay and do the best you can, not that it's ever going to be great but I don't think we have much of a choice. That's one place, frankly, instead of going to Iraq we probably should have gone there first. I would say in Afghanistan and only, again, because of its location next to Pakistan.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So you would keep the 10,000 troops there. And fight a war of attrition against the Taliban? You know, Pakistan --</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>I hate doing it, I hate doing it so much. But, again, you have nuclear weapons in Pakistan so I would do it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. But Pakistan is no friend to the U.S.A. In fact, the guy who helped us, the doctor who helped us the Pakistani get Bin Laden, they put him in prison. Do you think you could get that doctor out?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Yes, I do. I think I would get him out in two minutes. I would tell them let them out and I'm sure they would let them out. Because we give a lot of aid to Pakistan. We give a lot of money to Pakistan. And frankly, they will do -- they don't have any respect for our president. But when you say they take advantage or they are no friend. Nobody is a friend to us. They just take us like a bunch of suckers, Bill. And that's what my speech was about to a certain extent. It was also economic in terms of economic, relative to aid and the military. But Pakistan certainly takes advantage like everybody else. Nobody is different.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Now, we talked about ISIS way back in June when you were just launching your campaign. And you said last night the same thing you told me then that you are not going to tell ISIS how you are going to defeat them. Okay.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, I did say, Bill, I mean, I must be honest, I have been saying for a long time I would rather be unpredictable. You know, we are so predictable.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> We are sending troops.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>Be there tomorrow. But in all fairness, I didn't want to say about the oil. I'm the one that's been saying it, I didn't want to say take the oil. Keep the oil. Bomb the oil. We never did it and we are not doing it in Libya either. They just took over the Libyan oil and this, and they get out, we're not doing a thing about it. They're becoming richer and richer. Because we have people that don't know what they're doing. But, you in know I have been saying the oil. I didn't want to say that either. I would like to get them by surprise. But in our country with the system that we have, eventually you have to start saying what you would do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>The problem is when you say that you are giving them, you're giving them a lot of ideas.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But there is an implication to your policy and if I'm wrong in the implication, you need to tell me. For Libya, example, when you say that I say if you are elected president, then you are going to send in American bombers and bomb those oil fields, so they are useless to ISIS. Would I be wrong in thinking that as a voter?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Maybe a little bit wrong. I try and take the oil fields but I will say I know Exxon Mobile. I know many of the great oil companies. They can get in there. It's amazing how quickly they can get that stuff.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But they can't defeat these ISIS people private companies, so you would have to send in American ground troops which I think you'll going to have to do anyway.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Yes. We will have to bomb and we may have to do something but we'll have to bomb and we will have to get people in the region or we'll have to bomb and just keep the oil. I have been saying keep the oil for years.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: OK. But in order to get the oil, you have to defeat the guys on the ground who are now running the oil fields.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> That is correct.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And that is going to require American Special Forces, paratroopers, airborne, all of that to go in. And beat these guys on the ground. So, again, implication, I'm thinking you are saying you are going to send in ground troops to defeat ISIS in Syria and Libya, no?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Bill, or we are going to use our so-called allies. We don't have such great allies between us, okay?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. I know that.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> And between the rest of the world.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>We're going to have such great allies. In theory, they are always saying, oh, we will use our allies. But our allies, we give them all the equipment, we give them the beautiful Humvees and the new rifles and everything else. And the first shot is fired in the air and they start running. So, that's our allies. But we are going to have to do something. At least with oil we have something tangible. We should have never gone to Iraq. But when we got out we should have kept the oil.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. But again, correct me if I'm wrong --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I have said that for years.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. It sounds to me like a President Trump would use ground troops to some extent to, a, seize oil from ISIS and, B, kill them.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Well, two things. Number one, I want the oil. Number two, I would send as few in as possible. And I would try and use other people if possible --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay, if possible.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> -- except they just don't seem to have the capability. They don't seem to have the capability.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You're going to have say you ask people in with them. You know, there is only 6,000 active fighters.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Yes. We have got to get the oil. We have got to get the oil.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Because that's their source of wealth. Now, they also have a lot of wealth through the banking channels. You have comb the dark banking channels. And they're getting a lot of wealth through them. People don't even know about it but they are. But the oil is the main thing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: We're going to cut off the oil and we have got to keep the oil. Not give it right back to them. We have got to keep the oil.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Now, Putin, you are on record at saying that you believe you can convince him to be a friend of America. But obviously he is expanding --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No, I'm not saying that. I am saying that I think I would possibly have a good relationship. I don't know. I think he said some really nice things. He called me a genius. He said Trump's a genius. Okay. So, you know, that's nice. That's not going to persuade me one way or the other.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>I have people on the debate stage that said, get him to disavow it. Get him. And I said, why would I do that? But no, no, he has been very nice to me. But let me just tell you. I have no idea, Bill. Maybe we will, maybe we won't. If we can make a great deal for our country and get along with Russia, that would be a tremendous thing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So you would try --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I would love to try it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You would try it?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I would certainly try it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Do you have a stick in case Putin is unreasonable which he is known to be? Do you have a stick?</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Well, you know, we always have a stick. We have the economy. We have certain things that are advantages. I mean, we do have this --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. All we have to do is cut off American banking credit cards and he is done.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>And by the way --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. China.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Bill, including with China we have tremendous power with China because they suck our money out. They suck our jobs out. We have rebuilt China. You look at the bridges, the roads, the train systems, the airports they have. It's like we are now a third world country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: They took that and much of it came out of our country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But here's the deal. If you tee the Chinese off by a trade war or slapping tariffs on their products coming in here, they will be less incline to do help with you North Korea and that was one of the things you mentioned in your policy address that you are going to mobilize China.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: They don't help us now.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know. But how are you ever going to get China to help us neutralize North Korea if you saber rattle in the trade area?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: By telling them if you don't help us, it's going to be over. We're just not going to --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, you are going to threaten them?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, we have a trade deficit bill. It's not a threat. It's a fact. Oka? We have a trade deficit of $505 billion a year with China. They are just ripping us, left and right. And on top of it, they won't help us with North Korea because who wants to get into that fight. They won't help us. They can solve that North Korea, believe it or not is concerned with China. Okay. They are truly concerned with China.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure, we know that.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: China has power over North Korea. North Korea could solve that problem in one day, in one meeting. Probably in one phone call. North Korea is -- should behave and China can make them behave. China doesn't do it because they are tweaking us. They have no respect for President Obama and they have no respect for our country. And, yet, we are the ones that really we created China, economically they took our money, they took our jobs. You know, we owe them right now $1.8 trillion.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yep.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>Okay? So they take our jobs.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They are holding our bonds.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>So, they take our jobs, they take our money and we owe them money.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: So we have a lot of power, but we don't know how to use it and we have a president that knows how to deal.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So, we are going to hold you over. I want to talk about Hillary Clinton and the women issue.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump on his foreign policy strategy", "description": "GOP frontrunner breaks down his strategy for dealing with ISIS, Russia and China on 'The O'Reilly Factor'", "date": "2016-04-29T13:21:22Z"}