{"vcmId": "cb5ea637-26d3-4435-80cf-9fe7170f8af5", "url": "http://www.foxnews.com/transcript/2017/03/06/analyzing-president-trump-agenda.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 3, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>JESSE WATTERS, O'REILLY FACTOR CORRESPONDENT</b>: Hi, I am Jesse Watters in for Bill O'Reilly. Thanks for watching a special edition of the O'Reilly Factor. \"The Trump Agenda.\"</p>                \n                \r\n\n            \n                <p>Let's get right to our top story. Democrats attempt to sabotage President Trump's agenda. Attorney General Jeff Sessions is under mounting fire from the left after a disclosure that he met twice with the Russian ambassador to the United States during the presidential campaign last year. Some conservatives are seeing more sinister motivations behind Democrats outrage.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>RUSH LIMBAUGH, RADIO TALK SHOW HOST</b>: This story is not about Jeff Sessions. The story is not about illegal talks between Trump and his campaign people and the Russians. This story is Barack Obama and the Democratic Party attempting to sabotage the Trump presidency and do everything they can to either render it, meaningless and ineffective or to get him impeached or force into resign.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Joining us now with reaction from Austin, Texas, Karl Rove. Former senior advisor to President George W. Bush. So, Karl, gage this for us here, it is either a bunch of low life leakers doing what they usually do leaking stuff to the press or there you have this theory where former President Obama is holed up somewhere and orchestrating this very dubious, you know, counter espionage campaign and laying land mines throughout the administration trying to derail President Trump. How do you see it?</p>                \n                \r\n\n            \n                <p><b>KARL ROVE, FOX NEWS CONTRIBUTOR</b>: Well, look, I think there is a media bias in the selection, their stories. I do think the Democrats are on, you know, they're on high alert, looking for every opportunity to trash a member of the Trump administration. Jeff Sessions, I have known him personally, I have known him for years, he is a man of great integrity, he did the right thing by recusing himself. He would have done that anyway. Because that's the kind of person he is.</p>                \n                \r\n\n            \n                <p>What they are attacking him for is a nothing burger. And does President Obama have a direct role in this? Well, I don't know. Maybe he's busy negotiating that $60 million book deal. But I do know this. He has an organization called organizing for America, used to be called Obama for America. He started it. He organized it. He funded it. He put the people in charge. And I get their truth team e-mails which they send out on a regular basis.</p>                \n                \r\n\n            \n                <p>And it is all designed to stir people up. Here's one. Trump administration sets stage for mass deportations they say. Well, I actually read the story which was from CNN and it doesn't say that but that is what the headline is that they wrote for it. Here's another one. Oh, unhappy with Trump, call your congressman, local delegations fielding record number of calls. I mean, they are systematically attempting. It's a really remarkable. The political organization of the former president never missed a bit on January 21st. They were out there attacking President Obama's successor President Trump.</p>                \n                \r\n\n            \n                <p><b>WATTERS: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> And if continue that, I don't think we have seen this in, in maybe ever in American history that a president having left office as his political apparatus going tooth and nail after his successor.</p>                \n                \r\n\n            \n                <p><b>WATTERS: </b>You could not resist holding up the white piece of paper. Could you?</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: I could. But I mean --</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: You can't do one second without it, I know.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Here's a third one. Here's a third one.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: It is okay, we believe you. Now, I have been reading some information in the \"Guardian\" and the \"National Journal\" which said that the Obama administration actually sought and at one point received wiretap approval to listen to the phone calls of the Trump officials as late as October. And then when you combine that with this New York Times report, that Obama officials are disseminating information about Russia throughout various agencies and the government that will be used during the transition and then uncorked during the first hundred days, it seems like a systemic strategy to takedown President Trump pretty devious. Wouldn't you say?</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: Well, let's divide this. Let's take the second one first. The reports that the Obama administration officials took information about the context between Trump campaign supporters or Trump campaign officials and Russians and disseminated it throughout the government in order that the Trump administration would not be able to suppress this information, strikes me as paranoia.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> -- are bunch of over the top lunatics who are sitting there saying, oh, we so distrust our successor that if he found information that was damaging to America's security interest and that might reflect badly on somebody associated on his campaign, he would bury it. Well, that says something about how they view the current President of the United States.</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> Sure it does.</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: It is inappropriate but paranoid. The first one, let me though say is something different. I have a general sense that the FBI, particularly when they go to get what it's called the FISA. That is to say a National Security warrant to tape conversations and to intercept conversations. I have a sense they are acting on the basis of need and that the judges who grant those FISA requests would not act without some sense that something needed to be listened to. I divorced that entirely. I don't think that was political at all.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Perhaps.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> I don't think so.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Now, let me ask you this. Because this happened with George W. Bush. And you had former Clinton officials going after, you know, they're going after Kellyanne Conway, they're going after Flynn, they're going after Sessions, how should President Trump respond to these attacks on his lieutenants. Because it is happening and I don't know if there is a strategy to counter act it?</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Well, look, I think you have to do it almost on a case by case basis. But I think tone is important. First of all, don't be diverted. This is an attempt to divert the President's energy and effort to get him engage in conversation about Kellyanne Conway on the couch or Jeff Sessions recusing himself. Don't take the bait, keep focused on the big things. Cutting taxes in order to energize the American economy, rolling back on necessary regulations in order to free up the energy of American job creators and prosperity creators.</p>                \n                \r\n\n            \n                <p>And get rid of repeal and replace ObamaCare. These were the big things that people elected. The first and most important thing is, don't take the bait. And second is tone. And the tone ought to be not anger. The tone ought to be disappointment. Because most Americans look at this stuff and say that is petty politics --</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: And the more that the administration says, you know what, we are sorry that some of our political opponents feel obligated to do this, we are focused on the bigger things that America is concerned about.</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> That is the way to get it.</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Well, President Trump showed at the Joint Session that he can rise above party politics. So, we'll see if he can do it with these leaks. Thank you very much Karl, I appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": " Analyzing President Trump's agenda", "description": "Karl Rove joins 'The O'Reilly Factor' to discuss how the left is disrupting policy", "date": "2017-03-06T12:50:01Z"}