{"vcmId": "ccc6f7c7-4bd4-4f67-8483-531bf517f268", "url": "http://www.foxnews.com/transcript/2016/10/06/bill-oreilly-vice-presidential-debate-and-election.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Well it was livelier than I thought it would be. &#160;Governor Pence and Senator Kaine brought a fairly high-energy presentation and some very pointed attacks.</p>                \n                \r\n\n            \n                <p>Mr. Pence won the debate on points largely because he seemed more presidential and was more in control.</p>                \n                \r\n\n            \n                <p>According to ABC News, Senator Kaine interrupted Pence 70 times.</p>                \n                \r\n\n            \n                <p>The governor interrupted the senator 40 times.</p>                \n                \r\n\n            \n                <p>But there is no question that Mr. Kaine's demeanor hurt him.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: \"He's employed tens of thousands of people in this country -\"</p>                \n                \r\n\n            \n                <p><b>KAINE</b>: \"(interrupts) And paid few taxes and lost a billion a year.\"</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>PENCE:</b> \"She had a private server ...\"</p>                \n                \r\n\n            \n                <p><b>KAINE:</b> \"Now, I get to weigh in. &#160;Now, let me just say this...\"</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>PENCE</b>: \"She had a Clinton Foundation accepting contributions from foreign governments and foreign -\"</p>                \n                \r\n\n            \n                <p><b>KAINE:</b> \"You are Donald Trump's apprentice. &#160;Let me talk about this...\"</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: \"Senator, I think I'm still on my time.\"</p>                \n                \r\n\n            \n                <p><b>KAINE</b>: \"Well, I think -- isn't this a discussion?\"</p>                \n                \r\n\n            \n                <p>It was a discussion that got out of control and the moderator -- CBS News woman Elaine Quijano -- had a hard time containing things.</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> \"Senator -\"</p>                \n                \r\n\n            \n                <p><b>QUIJANO</b>: \"Alright gentleman -\"</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: \"He's going to release his tax returns when the audit is over ...\"</p>                \n                \r\n\n            \n                <p><b>QUIJANO</b>: \"... I need to ask you about Social Security ...\"</p>                \n                \r\n\n            \n                <p><b>KAINE:</b> \"Richard Nixon released tax returns when he was under audit.\"</p>                \n                \r\n\n            \n                <p><b>QUIJANO</b>: \"Gentlemen. &#160;Gentleman.\"</p>                \n                \r\n\n            \n                <p><b>KAINE</b>: \"If you can't meet Nixon's standard ...\"</p>                \n                \r\n\n            \n                <p><b>QUIJANO</b>: \"The people at home cannot understand either one of you when you speak over each other.\"</p>                \n                \r\n\n            \n                <p>What Ms. Quijano should have done is call a time out and explain to both candidates that only one speaks at a time.</p>                \n                \r\n\n            \n                <p>She should have done this firmly -- that would have embarrassed the guys and it would have been an appropriate move.</p>                \n                \r\n\n            \n                <p>The problem for both Kaine and Pence was that they had to defend mis-statements by their bosses.</p>                \n                \r\n\n            \n                <p>I say mis-statements because both Secretary Clinton and Donald Trump have had to walk back stuff they've said.</p>                \n                \r\n\n            \n                <p>No surprise when candidates speak as much as these two. &#160;There will be mistakes.</p>                \n                \r\n\n            \n                <p>Also, positions will be clarified.</p>                \n                \r\n\n            \n                <p>But that doesn't seem to matter when politics are involved:</p>                \n                \r\n\n            \n                <p><b>KAINE</b>: \"When Donald Trump says women should be punished or Mexicans are rapists and criminals ...\"</p>                \n                \r\n\n            \n                <p><b>PENCE: </b>\"I'm telling you ...\"</p>                \n                \r\n\n            \n                <p><b>KAINE</b>: \"... or John McCain is not a hero, he is showing you who he is.\"</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> \"Senator, you've whipped out that Mexican thing again. &#160;He - look ...\"</p>                \n                \r\n\n            \n                <p><b>KAINE:</b> \"Can you defend it?\"</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> \"There are criminal aliens in this country, Tim, who have come into this country illegally who are perpetrating violence and taking American lives.\"</p>                \n                \r\n\n            \n                <p><b>KAINE</b>: \"You want to -- you want to use a big broad brush against Mexicans on that?\"</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: \"He also said and many of them are good people. &#160;You keep leaving that out of your quote.\"</p>                \n                \r\n\n            \n                <p>Too much time was spent going back and forth about what Clinton and Trump have said in the past.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: \"If Donald Trump had said all of the things that you've said he said in the way you said he said them, he still wouldn't have a fraction of the insults that Hillary Clinton leveled when she said that half of our supporters were a basket of deplorables.\"</p>                \n                \r\n\n            \n                <p>Those kinds of attacks take away from issues.</p>                \n                \r\n\n            \n                <p>And it is here that Pence made some strong points.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: \"Iraq has been overrun by ISIS, because Hillary Clinton failed to renegotiate ...\"</p>                \n                \r\n\n            \n                <p><b>KAINE:</b> \"Well, if you want to put more American troops in Iraq, you can propose that.\"</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: \"Hillary Clinton -- Hillary Clinton -- Hillary Clinton failed to renegotiate a status of forces agreement...\"</p>                \n                \r\n\n            \n                <p><b>KAINE</b>: \"No, that is incorrect. &#160;That's incorrect.\"</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: \"And so we removed -- we removed all of our ...\"</p>                \n                \r\n\n            \n                <p><b>QUIJANO</b>: \"Gentlemen, we'll get to ...\"</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> \"... troops from Iraq, and ISIS was able to be conjured up in that vacuum.\"</p>                \n                \r\n\n            \n                <p><b>KAINE</b>: \"But I'd like to correct ...\"</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: \"... and overrun vast areas of Iraq.\"</p>                \n                \r\n\n            \n                <p>Despite Kaine's interruptions, what Pence said is true.</p>                \n                \r\n\n            \n                <p>The Obama administration with Hillary Clinton as secretary of state failed to negotiate a deal that would have kept American troops in Iraq.</p>                \n                \r\n\n            \n                <p>So when Mr. Obama pulled the troops out of there, ISIS quickly took advantage, leading to the catastrophe we have today.</p>                \n                \r\n\n            \n                <p>Senator Kaine on the other hand did not seem interested in debating that reality.</p>                \n                \r\n\n            \n                <p>He constantly went back to the personality game.</p>                \n                \r\n\n            \n                <p><b>KAINE:</b> \"These guys have praised Vladimir Putin as a great leader. &#160;How can they defend that? &#160;(EDIT) He loves dictators. &#160;He's got kind of a personal Mount Rushmore -- Vladimir Putin, Kim Jong-un, Muammar Gadhafi and Saddam Hussein.\"</p>                \n                \r\n\n            \n                <p>It was only on the subject of abortion where there was some clarity.</p>                \n                \r\n\n            \n                <p>Governor Pence is against most abortions, he is solidly pro-life.</p>                \n                \r\n\n            \n                <p>Senator Kaine, who is Catholic, says he is personally against abortion but supports changing laws to make the procedure easier and to have all American taxpayers fund abortions.</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> \"I have appreciated the fact that you've supported the Hyde amendment, which bans the use of taxpayer funding for abortion in the past, but that's not Hillary Clinton's view. &#160;People need to understand, we can come together as a nation. &#160;We can create a culture of life. More and more young people today are embracing life because we know we are -- we're better for it.\"</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>KAINE:</b> \"We can encourage people to support life. &#160;Of course we can. &#160;But why don't you trust women? &#160;Why doesn't Donald Trump trust women to make this choice for themselves?\"</p>                \n                \r\n\n            \n                <p>Talking Points would like to make a personal comment to senator Karine. &#160;How can you create a culture of life when you support abortion on demand for any reason at any time?</p>                \n                \r\n\n            \n                <p>That permissive policy would do grave damage to the unborn.</p>                \n                \r\n\n            \n                <p>Now the fact that Governor Pence was credible helped Donald Trump because he selected the governor.</p>                \n                \r\n\n            \n                <p>But there are reports today that some in the Trump camp were disappointed that Governor Pence did not directly refute stuff like this.</p>                \n                \r\n\n            \n                <p><b>KAINE:</b> \"I just want to talk about the tone that's set from the top. &#160;Donald Trump during his campaign has called Mexicans rapists and criminals. &#160;He's called women slobs, pigs, dogs, disgusting. &#160;I don't like saying that in front of my wife and my mother.\"</p>                \n                \r\n\n            \n                <p>Talking Points believes that kind of personal attack made Kaine look bad.</p>                \n                \r\n\n            \n                <p>And Pence was wise to speak in support of Trump's policies and stay away from the swamp.</p>                \n                \r\n\n            \n                <p>Please hear this clearly: Nobody wins in the swamp, nobody.</p>                \n                \r\n\n            \n                <p>And Pence is smart enough to know that.</p>                \n                \r\n\n            \n                <p>Summing up, many Trump supporters are feeling good today. &#160;Their VP candidate came across as smart, responsible and articulate.</p>                \n                \r\n\n            \n                <p>On the Democratic side Tim Kaine proved himself to be an aggressive campaigner but did not show the gravitas that Pence did.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The vice presidential debate and the election", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/5", "date": "2016-10-06T12:17:57Z"}