{"vcmId": "ce513be2-5a08-4997-ae45-4dad919b32b0", "url": "http://www.foxnews.com/transcript/2015/09/23/would-voters-support-muslim-american-president.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" September 22, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Stossel Matters Segment\" tonight, as we analyze last night this whole Muslim controversy regarding Dr. Ben Carson is a trumped-up deal.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: My take is this. If Dr. Carson doesn't want to vote for a president if the guy is Muslim or a woman is Muslim -- that's his opinion. That's his opinion. Under the constitution, any religion can become president.</p>                \n                \r\n\n            \n                <p>But he believes I think that it doesn't line up, a country founded on Judeo-Christian philosophy.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So there.</p>                \n                \r\n\n            \n                <p>We wanted to know what the folks think. So John Stossel took to the streets.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOHN STOSSEL, FBN HOST</b>: Would you be ok if a Muslim were president?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: I think I would be ok with that, yes.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: I think it would cause too much divisiveness across the country.</p>                \n                \r\n\n            \n                <p><b>STOSSEL</b>: Would it be ok with you if a Muslim were president?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE</b>: Yes, I don't see a problem with that everyone is human.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE</b>: I kind of disagree.</p>                \n                \r\n\n            \n                <p><b>STOSSEL</b>: Would you vote for a Muslim for president?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>STOSSEL</b>: No hesitation?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: No hesitation. Just do my country right.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: With our war against Islam at this point because I really unfortunately think that's what it is, I wouldn't. Because I don't think I would trust the integrity in the White House defending a country that's so near and dear to me.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Here now is Stossel. Do you think that Carson saying what he said, that he wouldn't support a Muslim running for president is offensive?</p>                \n                \r\n\n            \n                <p><b>STOSSEL</b>: Well, part of it was offensive to me. But not the part you are thinking about.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What was offensive to you?</p>                \n                \r\n\n            \n                <p><b>STOSSEL</b>: The way he said I would not advocate we put that person in charge of the nation. And politicians should know that the President is not in charge of the nation. He is in charge of the government and we're in charge of the nation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You are parsing just as --</p>                \n                \r\n\n            \n                <p><b>STOSSEL</b>: No, that's important. The President doesn't run the country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Look, I know Carson pretty well.</p>                \n                \r\n\n            \n                <p><b>STOSSEL</b>: His statement was reasonable and especially what he said later. If they follow the constitution -- fine.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: He just objects as an American citizen. He doesn't think that Islam lines up with Judeo-Christian philosophy. And, therefore, if the nation's leader were a follower of the Koran, that a lot of things that he doesn't feel are good for the country might occur. That's a valid opinion. I mean it's the same thing --</p>                \n                \r\n\n            \n                <p><b>STOSSEL</b>: Sure.</p>                \n                \r\n\n            \n                <p>It's the same thing as saying do you want a socialist? Do you want Bernie Sanders?</p>                \n                \r\n\n            \n                <p><b>STOSSEL</b>: No.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. I don't want Bernie. Bernie is a fun guy. I mean I would like to go fishing with him if he would shut up. But I'm not going to vote for a socialist. I'm not voting for a socialist.</p>                \n                \r\n\n            \n                <p><b>STOSSEL</b>: There is a difference. A socialist has certain governing beliefs. Your religion is presumably not about how you would govern the country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But if you look at Islam the politics and the religion are always intertwined. In every single Muslim nation their laws are based on the Koran, you know that -- every one.</p>                \n                \r\n\n            \n                <p><b>STOSSEL: </b>That's true. But you all week have been on a million TV programs saying Judeo-Christian country.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Philosophy.</p>                \n                \r\n\n            \n                <p><b>STOSSEL:</b> Philosophy. What do you mean by that?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I mean that the founders of the constitution, the people who forged the country, all right, believed in the Ten Commandments and that's what they based the law on. Ok.</p>                \n                \r\n\n            \n                <p>There is no doubt about that they say it in their letters -- Madison, Jefferson, Franklin. They may not have been religious men. They may not have been. But they believed in the Ten Commandments as the litmus test of what is right and what is wrong. And they also believed that freedom was a gift from God.</p>                \n                \r\n\n            \n                <p>In the Muslim nations, many of them, there is no freedom s So that you have to put all of that and form your opinion. Now, would I vote for a Muslim president? If the guy was a super problem solver who was a secular Muslim, I might consider it, ok?</p>                \n                \r\n\n            \n                <p><b>STOSSEL: </b>I would.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I might consider it I probably wouldn't but I might consider it. But I don't hold it against Carson for his opinion. The media a bunch of idiots -- he's prejudiced against them.</p>                \n                \r\n\n            \n                <p><b>STOSSEL:</b> The media is looking to pick on any Republican that they can. They hate Republicans.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's right. Questions are loaded and as I said the other night when a Republican contender is asked a loaded question about religion or about anything, do not answer. Just smile and say you know what, our foreign policy is a shambles.</p>                \n                \r\n\n            \n                <p><b>STOSSEL:</b> And Krauthammer, clean your clock because you can't dodge the question like that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure you can. You can absolutely dodge.</p>                \n                \r\n\n            \n                <p><b>STOSSEL:</b> I just wanted to add, I asked 25 people. I thought most would have an objection. And your editor split it 50/50. But almost everyone just said no, no problem, without hesitation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. This is New York City. If you go down to Mobile, Alabama you will find a little bit of a different --</p>                \n                \r\n\n            \n                <p><b>STOSSEL:</b> Probably.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. All right. There is John Stossel.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Would voters support a Muslim-American President?", "description": "John Stossel asks the folks about religion in the White House on 'The O'Reilly Factor'", "date": "2015-09-23T12:14:22Z"}