{"vcmId": "cebffb7f-fa02-4c84-b8f3-dd8d70d9796a", "url": "http://www.foxnews.com/transcript/2016/11/30/bill-oreilly-how-terrorists-are-getting-into-country.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>This man, 18-year-old Abdul Artan injured 11 people yesterday at Ohio State University. Their lives will never be the same. There is no question Artan is a terrorist. Authorities saying his computer has all kinds of rotten stuff on it.</p>                \n                \r\n\n            \n                <p>But how exactly did he get to America and to Ohio State? According to good work by Fox and CBS News, Artan and his family left Somalia in 2007, taking up residence in a refugee camp in Pakistan. It's not unusual.</p>                \n                \r\n\n            \n                <p>Somali is a failed state with terrorism everywhere. The family stayed in Pakistan for seven years before the Obama administration allowed it to immigrate legally to the USA.</p>                \n                \r\n\n            \n                <p>Since 9/11, about 100,000 Somalis have done that. The Artan family was flown to Dallas, Texas where the Fox affiliate picks up the story.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> Catholic charities contracts with the federal government to help refugees get an apartment, enrol in school, and get access to healthcare. Catholic charities does not pick the refugees instead they are vetted by the State Department and its office of Refugee Resettlement determines where they go.</p>                \n                \r\n\n            \n                <p><b>DAVE WOODYARD, CATHOLIC CHARITIES OF DALLAS CEO:</b> We help hundreds of people over the years and thousands throughout America are coming in through all kinds of different agencies to seek comfort and aid. And unfortunately bad things can happen in any walk of life and this is an example of one horrific action.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The Artan family stayed in Texas for less than a month. Eventually moving to Columbus, Ohio, where Artan graduated from community college and was accepted by Ohio State.</p>                \n                \r\n\n            \n                <p>All along the way, there was little supervision of the family or the 18- year-old. Once they got here, they were like every other American, free to move around at will. They also received government financial assistance to help them adjust to America.</p>                \n                \r\n\n            \n                <p>Now, as you know, this was a major campaign issue between Clinton and Trump over Muslim immigration. The Democratic Party angry that the Republican Party wants to limit immigration from terrorist states like Somalia.</p>                \n                \r\n\n            \n                <p>Thus, Donald Trump was branded an anti-Muslim bigot, but step back for a moment. While most refugees who come to the USA are good people, a significant number are not.</p>                \n                \r\n\n            \n                <p>And when you have radicalized countries like Somalia where ISIS and al Qaeda are widely accepted, shouldn't there be extreme vetting as Mr. Trump has proposed?</p>                \n                \r\n\n            \n                <p>Chances are the Artan family would not have been flagged as their records are clean. However, it's obvious Abdul did not assimilate is he a terrorist by his own statements and there are others like him living here right now.</p>                \n                \r\n\n            \n                <p>America is a compassionate country, but there is a worldwide Islamic Jihad underway and preventing harm from that has to be given priority over humanitarian concerns and that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: How terrorists are getting into the country", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/29", "date": "2016-11-30T13:29:25Z"}