{"vcmId": "cec8b6e1-3fcd-4c77-b872-c2b8d5868e75", "url": "http://www.foxnews.com/transcript/2017/02/22/bill-oreilly-president-trump-in-culture-war.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It is becoming quite clear that the Trump administration will succeed or fail based upon its economic programs. If tax cuts lower regulations and create deals, create more well-paying jobs, the President will defeat his enemies. But it seems that Mr. Trump also wants to win the culture war.</p>                \n                \r\n\n            \n                <p>And if he really does, you must change your style. On Saturday in Melbourne, Florida, the President pointed to Sweden as a country that was having trouble with migrants. That's true, as we will show you shortly. But his words were not precise and his enemies hammered him. So, another lesson learned. Facts will win the culture war, not opinion. And the facts are stark. America is divided on many issues including national security. Should we have strict immigration enforcement or the lazy attitude of the past, where you overstayed your visa, authorities wouldn't even look for you, and if you illegally cross the border from Mexico, you were released.</p>                \n                \r\n\n            \n                <p>Last night on The Factor, we told you about a man who had been deported eight times, a convicted drug dealer. And we also reported that not one member of the Democratic Party had criticized that man. Instead, they focused on the son who was taken into custody by I.C.E. along with his father. He's outraged because his son was shielded by President Obama's DACA program. Even though the 23-year-old may have affiliations with the gang. The left wants him immediately released, no consequences. Now that kind of situation is very troubling.</p>                \n                \r\n\n            \n                <p>The same thing happened with Kate Steinle, when she was allegedly murdered by an illegal alien criminal, who had been deported five times. Now, most Americans do not want a country with no standards of behavior. But again stay determined open border crew, you must zero in on the facts very precisely. The reason we have such a cultural divide in America is that for eight years we had a President Barack Obama, who saw the country as flawed. He wanted to institute a vast change from income redistribution, to retreating overseas, to painting a picture of America as a rather troubled nation. That is what President Obama did and he wasn't quiet about it.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA (D), FORMER UNITED STATES PRESIDENT</b>: All of us have more work to do.</p>                \n                \r\n\n            \n                <p>We have work to do.</p>                \n                \r\n\n            \n                <p>We have more work to do.</p>                \n                \r\n\n            \n                <p>Now, here's the thing, we have a lot more work to do.</p>                \n                \r\n\n            \n                <p>Yes, we still have more work to do.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And that kind of negative view of the USA sunk in. But now, we have a president who believes that America is inherently a great country and wants to restore that mantle. But Mr. Trump often veers away from hard facts. That allows the people who despise him to attack sometimes effectively. Look, there is no question that criminal illegal aliens are creating havoc all across the USA. And there is no question the Democratic Party is fine with that. So, that is the culture war battle that should be fought.</p>                \n                \r\n\n            \n                <p>FOX News correspondent Steve Harrigan spotlighted the situation in Florida.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>STEVE HARRIGAN, FOX NEWS CORRESPONDENT</b>: Mug shots tell the stories in brief, first degree murder, aggravated assault, heroin. The bigger story involved a revolving door of undocumented aliens. Mexican national Hector Eduardo Ramirez Gutierrez has been arrested and deported from the U.S. seven times.</p>                \n                \r\n\n            \n                <p><b>GRADY JUDD, POLK COUNTY, FLORIDA SHERIFF</b>: It is not a problem. It is an epidemic.</p>                \n                \r\n\n            \n                <p><b>HARRIGAN:</b> For those in the front line, the frustration is evident.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Our primary mission, our primary goal has got to be to get the illegal alien committing felonies out of this country and keep them out.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Summing up, the Trump administration will rise or fall on economics. But it does have the opportunity to win the culture war. But in order to do that, discipline and facts must dominate the presidential discourse. Facts, not opinion, will Trump propaganda. Pardon the pun.</p>                \n                \r\n\n            \n                <p>And that is \"The Memo.\"</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: President Trump in a culture war", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 2/21", "date": "2017-02-22T13:12:47Z"}