{"vcmId": "cf2aefcb-373f-4358-9186-937c2227f826", "url": "http://www.foxnews.com/transcript/2016/04/07/what-next-after-cruz-sanders-victories-in-wisconsin.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 6, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET</i>!</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight. What now after Cruz and Sanders won big in Wisconsin? With us the deputy editor of the \"Wall Street Journal\" editorial page Bret Stephens. Let's take the Trump campaign first. Damaged?</p>                \n                \r\n\n            \n                <p><b>BRET STEPHENS, WALL STREET JOURNAL COLUMNIST</b>: Damaged but not broken. And we have had supposed inflection points in this election before. Remember when Marco Rubio did well in South Carolina, for instance, he is going to be very strong in New York. It's very clear that even after two really bad weeks for him, he still manages to get about 35 percent of the Republican electorate.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So you don't see the race tightening in New York? You don't see Kasich and Cruz, you know, getting the doubters to come over?</p>                \n                \r\n\n            \n                <p><b>STEPHENS</b>: The race can change in New York. If Kasich comes in second place because the New York rules will allot delegates to second place finish finishers in a great many of the districts. But I see Trump coming out very strong in New York. Cruz continues to be weak places like Pennsylvania. And I don't know if Wisconsin -- what we have learned from this race is that no one state has been indicative of any other.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. So, if Trump does well in New York. And I believe he will, too, Pennsylvania, I don't know. That's narrowing up a little bit. If he does well, it doesn't assure that he will have the 1274 that he needs for the nomination. I mean, almost everybody says he is not going to have that by the convention in Cleveland in July. And, as you know, the party poohbahs don't want him. And as I said in the Talking Points Memo, I believe Cruz is going to make a deal with Kasich.</p>                \n                \r\n\n            \n                <p><b>STEPHENS:</b> Well, that's very likely. And look, it's not just the party poohbahs who don't want him. It's something like 65 percent of the Republican leftist --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But that doesn't matter in the convention. You know, folks really don't matter in the convention. It's the party poohbahs that matter and the manipulations like the ones behind the scenes. We will tell everybody about as we get closer.</p>                \n                \r\n\n            \n                <p>All right. Let's go over to the Democratic side. Hillary Clinton also expected to do well in New York.</p>                \n                \r\n\n            \n                <p><b>STEPHENS</b>: Don't be so sure about that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No?</p>                \n                \r\n\n            \n                <p><b>STEPHENS</b>: Look, the fact of the matter is that Bernie defied huge expectations in Wisconsin. I think the last poll before Wisconsin had him up by 2.6 percent. He won by a much wider margin. This is New York. This is his home state. He speaks Brooklynese.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He speaks New York. Yes.</p>                \n                \r\n\n            \n                <p><b>STEPHENS:</b> He speaks New York. He gets this state. Hillary has been just consistently weaker in all states outside.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It won't happen here because of the minority vote. So, if you look at the minority precincts, they are very -- like Trump's White angry guys are loyal to him. Hillary's --</p>                \n                \r\n\n            \n                <p><b>STEPHENS: </b>What is upstate New York, Bill?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: African-Americans are loyal to her. But it doesn't matter because the overwhelming number of votes are here in New York City, which is 50 percent minority now. I think Hillary is going to win by 15 here in New York.</p>                \n                \r\n\n            \n                <p><b>STEPHENS:</b> I place a small bet that it's very narrow or Bernie could pull it out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>If Bernie pulls it off and I don't like speculative questions, but this is an interesting one. If Sanders were to beat Hillary Clinton, remember, she was a senator from New York. New York, then he might have.</p>                \n                \r\n\n            \n                <p><b>STEPHENS</b>: The carpet bagging senator.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. All right. So was Bobby Kennedy. He might have a chance to really upset her at the convention. No?</p>                \n                \r\n\n            \n                <p><b>STEPHENS</b>: And he might have a chance to effect who the VP choice is if not be the VP choice himself.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes, he's not going to take VP, Bernie.</p>                \n                \r\n\n            \n                <p><b>STEPHENS</b>: Well, a Bernieite might be.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. Either Ben or Jerry, they would be. And that would be good for the country because we would have ice cream for everyone because Bernie would demand it be given out free. What I say is the fix is in for Hillary Clinton. On the super delegates because they are already pledged to her. And they are not going to go to Bernie no matter what happens. Am I wrong?</p>                \n                \r\n\n            \n                <p><b>STEPHENS: </b>No. Because the Democratic Party is the corrupt oligarchy that Bernie Sanders --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Speaks out against.</p>                \n                \r\n\n            \n                <p><b>STEPHENS: </b>Well, right. He thinks it's on Wall Street but it's actually in the Democratic Party. The really interesting story is the Republican Party which remains small d the most Democratic Party. And I think at the convention it's just not going to be party poohbahs. Look, the convention is when you turn to the general election. When you realize you have to nominate a candidate who was going to win. And I'm not sure we have one yet. So, it's not out of --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, Kasich makes the argument that the only reason he is staying in is because he can beat Hillary Clinton and that he is going to stay in because maybe that will be recognized at the convention.</p>                \n                \r\n\n            \n                <p><b>STEPHENS:</b> I think that's true except he has a weak case because he's so far --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He gets his butt kicked every state. Why do you think that is? I mean, John is really well-qualified and did a great job in Ohio. Why do you think he is not getting traction?</p>                \n                \r\n\n            \n                <p><b>STEPHENS</b>: Well, he got traction late. I think people, part of it is tactical voting. I think one of the reasons Cruz won by as large a margin as he did in Wisconsin was the sense that he was the candidate who could stop Trump. It wasn't a pro-Cruz vote. It was anti-</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It was an anti-Trump vote?</p>                \n                \r\n\n            \n                <p><b>STEPHENS</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Mr. Stephens, as always, thank you, we appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "What's next after the Cruz, Sanders victories in Wisconsin?", "description": "Bret Stephens reacts to the state of the candidates' campaigns on 'The O'Reilly factor'", "date": "2016-04-07T12:26:19Z"}