{"vcmId": "d00c057a-0192-4db9-86d5-2169d21c3529", "url": "http://www.foxnews.com/transcript/2014/09/30/bill-oreilly-why-president-obama-and-congress-are-not-protecting-us-effectively.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><em>By Bill O'Reilly</em></p>                \n                \r\n\n            \n                <p>If you are not troubled about how the USA is being run, you are not paying attention. The threat from Islamic killers is growing and our response is disorganized to say the least. Even more dangerous than that, is the fact that our government is caught by surprise. Time after time after time. The murder of America's ambassador in Libya, the Obama administration caught by surprise. Putin's seizure of Crimea, big surprise for the White House. ISIS invading Iraq, again, President Obama says he and his national security team were all surprised.</p>                \n                \r\n\n            \n                <p>Now, that's simply unacceptable. And the one body that could do something about it is Congress. The House and the Senate have oversight on the President on how he conducts himself in office. We have plenty of committees set up to make sure national security is being upheld. But it's not being upheld and everybody knows it. Yet, our Congress people and senators say little.</p>                \n                \r\n\n            \n                <p>A few, like John McCain and Lindsey Graham have been outspoken about the danger to America. And they have been vilified by the left as warmongers. In fact, on the Democratic side we hear gibberish, foolish rationalization or attacks on people like me who are pointing out the danger of the worldwide jihad.</p>                \n                \r\n\n            \n                <p>Last night on \"60 Minutes\", President Obama stuck by his talking points.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>OBAMA: I made it very clear we are not at war against Islam. Islam is a religion that preaches peace and the overwhelming majority of Muslims are peaceful. But, in the Muslim world right now, there is a cancer that has grown for too long that suggests that it is acceptable to kill innocent people who worship a different God. We have to get the international community to recognize this is a problem. We have got to get Arab and Muslim leaders to say very clearly these folks do not represent us. They do not represent Islam and to speak out forcefully against them.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: So let me get this straight. President Obama 13 years after 9/11 believes that he is going to get Muslim leaders to finally speak out against the jihad? He himself has had six years to do that and what do we have -- very little in the way of Muslim nations helping the U.S. against terrorists.</p>                \n                \r\n\n            \n                <p>So there comes a point when saying we have to get Muslim leaders to condemn the jihad is simply a waste of time.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>MAHER: President Obama keeps insisting that ISIS is not Islamic. Well, maybe they don't practice the Muslim faith the same way he does. But, if vast numbers of Muslims across the world believe, and they do, that humans deserve to die for merely holding a different idea or drawing a cartoon or writing a book or eloping with the wrong person, not only does the Muslim world have something in common with ISIS, it has too much in common with ISIS.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: Now, that statement is a bit unfair. Most Muslims are rational, peaceful people, but, Muslims abroad are afraid that if they do speak out they will be killed by the jihadists, therefore they look to leaders in countries like Pakistan, Algeria, Egypt. And what do they see? Chaos and cowardice and that's what. So it's not the individual Muslim that's the problem. It's the Muslim nations who tolerate and sometimes even support the terrorists. However, in his interview last night President Obama remained positive.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>OBAMA: The good news is that you have an unprecedented international coalition that is serious about this. Not only do we have Arab states participating in air strikes for the first time in a very lock time and being very serious about their commitment, but you've got the United Kingdom. You've got France, Belgium.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: You've got them doing what? United Kingdom, France, Belgium and other coalition nations -- there are 62 of them out of all of them four will attack ISIS inside of Syria -- four.</p>                \n                \r\n\n            \n                <p>Let me repeat. President Obama has put together 62 nations that say they don't like ISIS and are willing to help out. Yet only four will bomb ISIS positions in Syria and not Great Britain, France or Belgium. They won't do it.</p>                \n                \r\n\n            \n                <p>So that's a weak coalition -- a bunch of nations that are talking, but not acting. And why won't they bomb inside of Syria? Who knows? What's the downside for them? The sad fact is that the United States is the only nation on earth capable of destroying the jihad. China and Russia could do it but will not because they want to see America damaged. China and Russia's capabilities are directed towards expanding their power and limiting democracy. Not fighting evil.</p>                \n                \r\n\n            \n                <p>The jihadists well understand the West does not have the will to defeat them. That's why they behead people on camera. They are arrogant. These savages don't fear reprisals because the reprisals are so weak. And that brings me to General George Patton. As you may know, I have been promoting my new book \"Killing Patton\" and many interviewers ask what General Patton would think about fighting the jihad.</p>                \n                \r\n\n            \n                <p>Yesterday on ABC News, George Stephanopoulos and I discussed my idea for mercenary army paid for by the coalition which is obviously not willing to fight itself. George Patton's name came up.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>GEORGE STEPHANOPOULOS, ABC NEWS ANCHOR: Would he really believe in outsourcing our national security like that?</p>                \n                \r\n\n            \n                <p>O'REILLY: No. Patton would want to just go in himself and do it. If George Patton were alive today, he would be saying to President Obama, give me the Third, I'll go in to Syria and I will wipe them all out. And he would. That's what he would absolutely do.</p>                \n                \r\n\n            \n                <p>STEPHANOPOULOS: Obama wouldn't approve that one.</p>                \n                \r\n\n            \n                <p>O'REILLY: It's a worldwide war against jihad -- not going to stop. So let's win the war. And that's what George Patton would say. Let's win the damn war.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: Now that's easy to say, difficult to do. The jihadists are all over the world now. And our government is befuddled, to say the least. President Obama and leaders of Congress need to sit down and find out why we are so often taken by surprise when dangerous situations happen. There's something very wrong here and it's just a matter of time until more Americans die because of it.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Why President Obama and Congress are not protecting us effectively", "description": "By Bill O'Reilly If you are not troubled about how the USA is being run, you are not paying attention.", "date": "2014-09-29T04:00:00Z"}