{"vcmId": "d0c02b2d-e63e-4ed5-b10b-3d3d63689d22", "url": "http://www.foxnews.com/transcript/2016/04/20/do-americans-want-to-build-border-wall.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 19, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story\" segment tonight. As we told you in the Talking Points Memo the issue of illegal immigration very intense right now in the USA. New survey out of the Pew organization asks if Americans favor a border wall. Overall 62 percent say no to the wall. Thirty four percent support it. Republicans 63 percent yes to the wall. Thirty three percent oppose. Democrats a whopping 84 percent opposed to the wall. Thirteen percent want it.</p>                \n                \r\n\n            \n                <p>With us now FOX Business anchor Lou Dobbs. These numbers surprise me. Do they surprise you?</p>                \n                \r\n\n            \n                <p><b>LOU DOBBS, FOX BUSINESS ANCHOR:</b> They do. The opposition, if we look beyond these top line numbers as you suggest, the Republicans supporting border security and Democrats favoring wide open borders. Surprise to me is that there is that adamant position. You know, when we see a real public debate about it. I think numbers will shift dramatically.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It depends when the debate is. But right now I think the number is probably lower than 62 percent opposed to the wall. I would say it's probably 55 to 45 percent. Because these organizations the way they word the questions. Here is the bottom-line on the wall. The wall would save thousands of lives. Maybe millions of lives because it would prevent the coyotes, these are the human people smugglers who rape, who beat these people up, sometimes kill them. These are the poor migrants trying to get in here. I mean, it's a harrowing, harrowing business.</p>                \n                \r\n\n            \n                <p><b>DOBBS</b>: With that grand.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. So, it eliminates them to most of the extent. It saves horrors for the migrants themselves and then the drug trafficking.</p>                \n                \r\n\n            \n                <p><b>DOBBS:</b> Which no one wants to talk about?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I do.</p>                \n                \r\n\n            \n                <p><b>DOBBS</b>: And so do I.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Tons of narcotics coming across that border. With the wall, that would stop 80 percent of it. And when people say it wouldn't, you just go to Israel.</p>                \n                \r\n\n            \n                <p><b>DOBBS</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. Israel built the wall between them and the Palestinian authority and it works.</p>                \n                \r\n\n            \n                <p><b>DOBBS:</b> And you can go to saying. The smugglers put up a wall. That wall works. Everything moved. I don't know if that's the test.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you buy into the wall to save millions of lives?</p>                \n                \r\n\n            \n                <p><b>DOBBS: </b>I absolutely do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's hard to sell it?</p>                \n                \r\n\n            \n                <p><b>DOBBS:</b> To me it's irresponsible and it's immoral of us not to stop the drugs you are talking about. Think about this. And I know you know the numbers. But we are talking about the majority of methamphetamines, marijuana, cocaine and heroin come across that border into the United States.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's right.</p>                \n                \r\n\n            \n                <p><b>DOBBS</b>: And destroy those millions of lives.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Controlled by the cartels and they use the profits to corrupt the entire country of Mexico.</p>                \n                \r\n\n            \n                <p><b>DOBBS</b>: Do you find it interesting, Bill that that two former presidents and the current president of Mexico has attacked Donald Trump for talking about stopping those drugs. Stopping illegal immigration. But those same people do not talk about stopping the cartels that drives the traffic of both human smuggling and narcotics. They are scared to death.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. The cartels are really the power in Mexico. You are a big Trump supporter, right?</p>                \n                \r\n\n            \n                <p><b>DOBBS</b>: I'm going to vote for Trump.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. You know, I don't think -- you are a Jersey voter so you can't vote tonight.</p>                \n                \r\n\n            \n                <p><b>DOBBS</b>: I'm a Jersey voter.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But I believe that Trump if he is elected will build the wall. He will have to build the wall. Okay? And he will build it. But Mexico is not going to pay for the wall. They are not. And he may start a trade war on them. He may impose tariffs or back their trucks up to Guatemala. He could do that.</p>                \n                \r\n\n            \n                <p><b>DOBBS: </b>I wouldn't underestimate. I'm not underestimating -- I wouldn't under estimate the possibilities is all I'm saying. Because what I personally believe --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>DOBBS:</b> And this is purely my judgment, I believe what Donald Trump has already done is change the initial bargaining position for the debate and the discussion about what will be done to interdict drugs as well as --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But you just said -- Lou Dobbs just said --</p>                \n                \r\n\n            \n                <p><b>DOBBS</b>: Ahah!</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The cartels control the country.</p>                \n                \r\n\n            \n                <p><b>DOBBS</b>: They control Mexico.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. That's what I'm talking about. So, no politician in Mexico is going to give money to build the wall because there will be a grave the next day.</p>                \n                \r\n\n            \n                <p><b>DOBBS: </b>There are many possibilities.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Many possibilities.</p>                \n                \r\n\n            \n                <p><b>DOBBS:</b> For that money to be concentrated and dedicate to do that wall. And he has enunciated several of them. But most specifically talking about remittances. We're talking about over $50 billion a year.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You can't stop it.</p>                \n                \r\n\n            \n                <p><b>DOBBS</b>: You are such an optimist. You are such -- a man of vision.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm a guy --</p>                \n                \r\n\n            \n                <p><b>DOBBS:</b> You've got to believe in the future.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I believe in the truth. And the truth is, you can't stop the U.S. mail or FedEx or anything else. If you are president, you can't stop it. They will send the money anyway.</p>                \n                \r\n\n            \n                <p><b>DOBBS:</b> If we elect a leader who has the capacity to bring both parties and the House and the Senate together there is no limit to the possibilities for this country. It's what built this country. Leadership and guts and vision. And we have got, it seems to me, a candidate articulating each of those things.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And so you think if Trump gets elected president he is going to unite everybody behind him?</p>                \n                \r\n\n            \n                <p><b>DOBBS:</b> I absolutely do. Without equivocation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, Donald, I hope you are watching. This is -- right here.</p>                \n                \r\n\n            \n                <p><b>DOBBS</b>: Well, I mean, I'm going to vote for him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I know. I know you are a supporter. And we respect that. And listen, Donald Trump is the best political story, by best I mean the most important political story in my lifetime. In my lifetime. The assassination of President Kennedy may be more but it's close. Hey, Lou, thank very much. We appreciate it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Do Americans want to build a border wall?", "description": "'The O'Reilly Factor' examines a new poll on illegal immigration and border security debate", "date": "2016-04-20T12:45:17Z"}