{"vcmId": "d385ed42-80e7-4396-97a8-937f24367dd2", "url": "http://www.foxnews.com/transcript/2015/11/11/bill-oreilly-rise-fascism-on-american-college-campuses.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>A hallmark of fascist societies is the denial of free speech. And now that's happening on some college campuses. At the University of Missouri president, Timothy Wolf and Chancellor, R. Bowen Loftin have both resigned because some students there say they did not do enough about alleged racism. There's no question that unruly students at Mizzou, as it's called, are running wild.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: I've got a job to do. I'm documenting this for a national news organization.</p>                \n                \r\n\n            \n                <p>Yes, I can. This is the First Amendment that protects your right to stand here and protects mine.</p>                \n                \r\n\n            \n                <p>I'm walking forward. I'm walking forward.</p>                \n                \r\n\n            \n                <p>You're pushing me. You're pushing me.</p>                \n                \r\n\n            \n                <p>I'm being pushed.</p>                \n                \r\n\n            \n                <p>You're not doing your job.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE</b>: It's our right to walk forward. I believe it's my right to walk forward.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: I'm media, can I talk to you.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE</b>: No, need to get out. You need to get out.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>No, I don't.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> You need to get out.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> I actually don't.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> All right. Hey, who wants to help me get this reporter out of here? I need some muscle over here.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now that woman, you just saw, is a University of Missouri professor named Melissa Click. How disgraceful is that?</p>                \n                \r\n\n            \n                <p>At Yale, hundreds of students march across campus to protest what they see as racial insensitivity at the Ivy League School. The March of Resilience as the demonstration was called arose after Yale Intercultural Affairs Committee warned students not to wear quote \"racially insensitive Halloween costumes\", unquote.</p>                \n                \r\n\n            \n                <p>A Yale administrator, Erica Christakis who oversees a residence hall as an associate master, objected to that memo saying it interrupted freedom of expression. Her husband, also a Yale employee, then had to defend her from an onslaught of criticism.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> By sending out that e-mail that goes against your position as master. Do you understand that?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> No, I don't agree with that.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> Then why the <b>(EXPLETIVE DELETED) </b>did you accept the position? Why did we <b>(EXPLETIVE DELETED)</b> hired you?</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: I have a different vision than you.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> If that's what you think about being a master, you should step down. It's not about being an intellectual. It is not. Do you understand that? It's about creating a home here. You are not doing that.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, we have seen the rise of intolerance on American campuses for years. Recently the President of the University of Louisville had to apologize for this picture. He and his friends dressed in festive Mexican garb for Halloween. The picture was called racist by some on the Louisville campus. That picture racist?</p>                \n                \r\n\n            \n                <p>So the next time I go into a Mexican restaurant and somebody is wearing a sombrero I can cry racism? That's how absurd the whole thing has become.</p>                \n                \r\n\n            \n                <p>Rush Limbaugh made an interesting point on his radio program saying that for years American college students have been taught that their country is racist, it's a terrible place and now the students are acting out. The nutty college professors have reaped what they have sown. They are no doubt encouraged by groups like Black Lives Matter and other radical concerns.</p>                \n                \r\n\n            \n                <p>Of course, the same thing happened during the Vietnam War. When I was a senior at Marist College I was walking to class one day and was blocked by a radical student who told me no one would be going to class. Ordinarily that would have been a big bonus for me. But because this guy was intruding on my freedom to make a decision, it did not end well for him. I attended the history class, Dr. Peter O'Keefe was glad to see me.</p>                \n                \r\n\n            \n                <p>There comes a point when freedom of speech, expression, movement and thought must be defended. We have reached that point now. Get it, Yale? Get it University of Missouri?</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The rise of fascism on American college campuses", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/10", "date": "2015-11-11T13:28:53Z"}