{"vcmId": "d417701f-ae28-442b-90df-2970d870f53d", "url": "http://www.foxnews.com/transcript/2016/06/01/bill-oreilly-murder-kate-steinle-and-congress.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>New poll from the Associated Press says that Americans do not trust Congress or the major political parties.</p>                \n                \r\n\n            \n                <p>First question, what is your confidence level as far as Congress is concerned? Four percent, that would be four percent. A great deal of confidence. Forty eight percent only some. Forty six percent hardly any. Confidence in the Republican Party eight percent a great deal. Forty percent only some. Fifty one percent hardly any. Confidence in the Democratic Party. Fifteen percent a great deal. Forty one percent only some. Forty three percent hardly any.</p>                \n                \r\n\n            \n                <p>Confidence in the president and executive branch? Fifteen percent a great deal. Fifty percent only some. Thirty three percent hardly any. Finally confidence in the military. Fifty six percent a great deal. Thirty seven percent only some. Just seven percent hardly any. So you can see that the biggest loser in this poll is Congress. Only four percent of we, the people, having a great deal of confidence in it and here's why.</p>                \n                \r\n\n            \n                <p>You may remember last July 32-year-old Kate Steinle was murdered in San Francisco. She was out for a walk with her father when an illegal alien felon convicted in the U.S.A. seven times deported five times shot her in the back. The man Mexican national Juan Francisco Lopez Sanchez had been released from jail by the San Francisco Sheriff's Department. That despite the fact that ICE, Homeland Security, had asked San Francisco authorities to keep Sanchez incarcerated until they could pick him up.</p>                \n                \r\n\n            \n                <p>The Sheriff's Department said no. Backed by the San Francisco board of supervisors, which actually voted not to cooperate with the Feds on illegal alien crime. So, I proposed Kate's law whereby any convicted aggravated felon who defies deportation, that means comes back, could be immediately taken into custody by authorities and then sentenced by a judge to a mandatory five years in a Federal penitentiary. First offense, ten years second.</p>                \n                \r\n\n            \n                <p>That would give law enforcement a powerful tool to sweep dangerous foreign nationals here illegally off the streets of America. Yet, Congress would not pass Kate's law. The despicable Harry Reid blocked it in the Senate. Then Republican Majority Leader Senator Mitch McConnell did not put the proposed law up for a vote. A stand-alone vote. Instead, McConnell attached it to a sanctuary cities bill that he knew would fail. In the House, there was confusion as well. And Kate's law stalled.</p>                \n                \r\n\n            \n                <p>If we, as a country, cannot pass a simple law to protect innocent people like Kate Steinle from harm, from foreign aggravated felons who defy deportation, if Congress cannot do that, it should go out of business. That's how bad the situation is and that's why most Americans have lost confidence in the House and Senate. The Steinle family broken hearted, of course, and on Friday they announced they are suing the Federal government, the city and county of San Francisco and the former sheriff there. They are also suing Sanchez, the alleged trigger man.</p>                \n                \r\n\n            \n                <p>In just a few moments, is it legal will have more on the lawsuit. Summing up, I have been practicing journalism for more than 40 years. I have never seen federal, state, and local authorities act so cowardly. Kate Steinle is not alone. Other Americans have been killed by illegal alien aggravated felons. And Congress does nothing. When it easily could. Or am I wrong on this? And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The murder of Kate Steinle and Congress", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 5/31", "date": "2016-06-01T12:16:54Z"}