{"vcmId": "d4c8a3f4-2830-444e-a2d4-9c2b0ca6dd4d", "url": "http://www.foxnews.com/transcript/2016/08/04/white-house-on-defensive-over-iran-payment.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 3, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Impact Segment\" tonight, the White House on the defensive over allegations it may have paid off vicious Iranians mullahs for the release of Americans. The article in the Wall Street Journal says, $400 million sent to Iran coincided with the January release of four American hostages being held by Iran and there they are. And the White House quickly shot the article down.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOHN KIRBY, STATE DEPARTMENT SPOKESMAN:</b> We don't pay a ransom. We just don't pay ransom. It is our policy. This is not ransom. Anything suggestion that it has anything to do with ransom is absolutely and utterly false. These were two separate processes is run by two separate teams. Now, yes, they were done simultaneously. And so I understand the coincidental nature here, the timing but absolutely had nothing do with ransom. We do not and will not pay ransom.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: With us now, Eric Bolling and Geraldo Rivera. So the thing about this is that in the exact day that the $400 million in Swiss Franks and Dutch, I guess Euros, or whatever they did, they bundled it up, reached Tehran, the exact day that four Americans got out of there.</p>                \n                \r\n\n            \n                <p><b>GERALDO RIVERA, FOX NEWS CORRESPONDENT</b>: Well, I think that if it was a coincidence --</p>                \n                \r\n\n            \n                <p>O'REILLY: How could it be?</p>                \n                \r\n\n            \n                <p><b>RIVERA</b>: Then, you know, it would be cosmically impossible.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>RIVERA</b>: If it was not, as it probably was nice, I think it was amateurish to do it that way. It was not helpful. I interestingly enough, I think, I am not opposed to paying ransom to get our people out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Oh!</p>                \n                \r\n\n            \n                <p><b>RIVERA</b>: I think the U.S. is way too rigid. The way you do it like everybody else, through intermediaries, why have your people sacrificed because of your natural --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Look, that's a debate. If they want to pay ransom they have to debate it and everybody has to know about it and then they have to change the policy. What do you say?</p>                \n                \r\n\n            \n                <p><b>ERIC BOLLING, FOX NEWS CO-HOST, \"THE FIVE\": </b>The worst part of this happened today around noon, so Josh Earnest said to him, quoting him, \"We know that Iran supports terror and Hezbollah and some of this money may be used to support them. Can you imagine a group, the administration knowing that some of the $400 million or $2 billion which eventually they will turn over, is going to support terror?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Of course it is, everybody knows that.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>But if you don't it, who cares -- who cares?</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> It is Iran's money.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It is Iran's -- I'll explain that in a minute but hold it.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> They are killing Americans --</p>                \n                \r\n\n            \n                <p><b>RIVERA:</b> Pay Russia for Russian goods --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Hold on. Wait a minute. Let's -- Bolling, if you don't give them the money, you don't get the nuke deal and you don't get the four Americans back. Okay? So you're the president and you say, blank them. They're not getting anything. So then the nuke thing goes and Netanyahu will bomb them and the war will start and then the four Americans -- will just stay in Tehran. So --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Yes, I'm against that. All of them. I'm in favor of not turning over the money. I'm in favor of trying to use some foreign policy --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> To get these four Americans back.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You know how that --</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Wait a minute.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, but Geraldo -- look, we've been negotiating with the --</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: We didn't need --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We have been negotiating with this government for years and got nowhere. They wanted to be bribe and I believe we did bribe them. Okay? But you're right, it was their money. This is crazy. The Shah made a deal, the Shah, 1979, all right? Made a deal, sent 400 million USA and return for fighters that never got to the Shah because it opposed them. So the money we kept. All right? So is it was their money.</p>                \n                \r\n\n            \n                <p><b>RIVERA</b>: And you have to add the international code of justice and the Hague had an arbitration set up. The arbitration is going against us. We would have had to pay the full amount plus exorbitant interest in the amount of $2 billion. I think this is a good deal.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Four Americans --</p>                \n                \r\n\n            \n                <p><b>RIVERA: </b>You want to tell their family --</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>You want to tell their family --</p>                \n                \r\n\n            \n                <p><b>RIVERA</b>: These four Americans --</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: It is like having a gun battle with the bad guys --</p>                \n                \r\n\n            \n                <p><b>RIVERA</b>: And you buy Saudi oil --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right, Geraldo, the issue is, you guys can make up your own mind whether that deal was worth it. However, administration, telling the truth Geraldo? Once again here we are all three of us --</p>                \n                \r\n\n            \n                <p><b>RIVERA: </b>I think that Democrats and the Obama administration brought this on themselves.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They didn't tell the truth.</p>                \n                \r\n\n            \n                <p><b>RIVERA:</b> All they had to do was wait a week, wait a month, wait three months, here, there --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Tell the truth.</p>                \n                \r\n\n            \n                <p><b>RIVERA</b>: It's been since 1981. Like pay at Christmas time.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p>Just for grins, tell the truth once. Just, you know, I'm tired of it. Both parties do it. Both parties do it. They don't tell us the truth. They didn't tell us the truth. The Wall Street Journal had it nailed down and today both the White House is denying it and they're not telling the truth. Twenty seconds.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> If you're worried about Donald Trump's foreign policy and you are not worried about the Obama administration's foreign policy, you're a fool.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay.</p>                \n                \r\n\n            \n                <p><b>RIVERA</b>: If you're worried about Iran and not worried about Saudi Arabia who financed ISIS, al Qaeda and --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Geraldo, you're wandering into Saudi Arabia. All right.</p>                \n                \r\n\n            \n                <p><b>RIVERA:</b> Iran is strategically our -- could be our ally.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Whoa!</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No, no --</p>                \n                \r\n\n            \n                <p><b>RIVERA</b>: Bolling, don't listen to the conventional wisdom. Enemy, Saudi Arabia, ISIS --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Let Geraldo say to the world that Iran could be our ally. And then you say, okay, goodbye. That's what I'm going to do right now.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Good bye.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And everybody can consider it.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "White House on the defensive over Iran payment", "description": "Did the US pay ransom for hostages? 'The O'Reilly Factor' investigates", "date": "2016-08-04T12:15:33Z"}