{"vcmId": "d5323e04-b715-4f78-b758-8d42ae5f507e", "url": "http://www.foxnews.com/transcript/2014/11/25/us-extends-nuclear-talks-with-iran.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 24, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Hume Zone\" segment tonight. Secretary of Defense Chuck Hagel fired by President Obama. According to a report by our Pentagon correspondent Jennifer Griffin. Also no deal with Iran on their nuke weapon program and now the west is again extending the talks.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JOHN KERRY, SECRETARY OF STATE: </b>We are jointly the P5+1 six nations and Iran extending these talks for seven months with a very specific goal of finishing the political agreement within four months.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Good luck. Joining us from Washington, Brit Hume. So why was Hagel fired? Don't give me this he wasn't fired. He is out of there. They wanted him out of there. Why?</p>                \n                \r\n\n            \n                <p><b>BRIT HUME, FOX SENIOR POLITICAL ANALYST: </b>Well, it doesn't mean he was called in and said you are fired.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, but if they don't want him, he can't continue.</p>                \n                \r\n\n            \n                <p><b>HUME: </b>Well, look, his secretary shift if you will wasn't working. And he was not getting along with the people in the White House whom he felt we're trying to micromanage the Pentagon. I think he had clearly annoyed the President and his team by saying about ISIS, things that the President had not been prepared to say to with that they were threaten like none we've ever seen before and members of his high command with the Pentagon had said, you know, that you can't defeat them without going into Syria. There was talk among those generals of needing possibly ground troops. All things that the President has obviously resisted. So Hagel, who I think was hired because they thought he would be a plant, defense secretary and would be willingly go along with Obama's deeper even than we already have in place. Cuts to the defense budget, turned out to, you know, he got up on behind legs and started to tell the truth at least about ISIS and I think that was it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That was too much.</p>                \n                \r\n\n            \n                <p><b>HUME: </b>That was it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, you know, nobody thought he was going to be a good secretary of defense in the first place. But I sent another book coming. How many books, if I was a pinhead, how many of those can we have? All right. This Iran thing, isn't this a farce? I mean, I hate to be disrespectful. But it's a farce.</p>                \n                \r\n\n            \n                <p><b>HUME: </b>Well, you noticed in Secretary Jerry's remarks there, the one thing he didn't say, was it were extending the deadline here because we're so close. He's talking about finishing the political piece of this agreement in four months. That they've been at this for a long time and at the longer -- every day that it goes on it advantages Iran in this way. A chunk of the sanctions regime was lifted pending these talks. Now, it's -- most of the sanctions remain in place and they clearly have squeezed Iran. But, they get that much relief from those that have been lifted for the time being. And, of course, the longer this goes on, the longer the sanctions stay off. The more revenue Iran collects because of those that have been lifted and the rest of it and, you know, we listen to someone like John Bolton, he will tell you that they are continuing -- there are ways in which they are breaking the agreement and so on.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>HUME: </b>The temporary agreement. So, my sense about this is this isn't going well. The administration is dying to make a deal. And they've extended it because they -- I won't say desperate but they're exceedingly eager to make an agreement.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Exceedingly eager Hume, that's a literation.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> There you go.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Everything you said, I have nothing to disagree with. Everybody knows we are being played for chumps by these people.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> And that's the great worry, you know, that's why in Israel which is the country with the, you know, with the most --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Most on the line.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> Directly by a bad agreement, you know, have this extraordinary anxiety over there about a bad deal. If I were in Israel tonight, I don't know whether I would be relieved that bad deal wasn't reached or more worried that this means that eventually a bad deal will be reached. But I think that's the apprehension about this.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But Iran gets stronger and they can't be happy about that. Brit, thank you. That's the worry.</p>                \n                \r\n\n            \n                <p><b>HUME:</b> You bet.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "US extends nuclear talks with Iran", "description": "Brit Hume on Iran failing to compromise on nuclear weapons issues and the resignation of Defense Secretary Chuck Hagel", "date": "2014-11-25T13:32:11Z"}