{"vcmId": "d710556f-4a63-4058-ad03-0164a5178b58", "url": "http://www.foxnews.com/transcript/2016/05/10/bill-oreilly-justice-obama-and-trump.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Talking Points enjoyed watching the president's speech to the graduating class of Howard University on Saturday. &#160;It was interesting and delivered with energy.</p>                \n                \r\n\n            \n                <p>Mr. Obama's words were important because they addressed the division that we are seeing in America - a divide that has catapulted Donald Trump to the Republican nomination.</p>                \n                \r\n\n            \n                <p>There are four speech points I would like to analyze tonight, beginning with the status of black Americans:</p>                \n                \r\n\n            \n                <p><b>OBAMA: </b>\"In 1983, I was part of fewer than 10 percent of African-Americans who graduated with a bachelor's degree. &#160;Today, you're part of the more than 20 percent who will. &#160;And more than half of blacks say we're better off than our parents were at our age -- and that our kids will be better off, too. (EDIT) America is better. &#160;The world is better. And stay with me now -- race relations are better since I graduated.\"</p>                \n                \r\n\n            \n                <p>The problem is race relations are now on the decline. &#160;The core constituency of Donald Trump is white, working class - primarily men.</p>                \n                \r\n\n            \n                <p>They feel that the federal government no longer speaks for them, that they are the ones getting hammered by a growing nanny state heavy on grievance - only not their grievance.</p>                \n                \r\n\n            \n                <p>The president made a passing reference to middle-aged white guys and how they should be understood. &#160;But at this point words are meaningless.</p>                \n                \r\n\n            \n                <p>The Obama doctrine of income redistribution has made it tougher on the working and middle classes as they watch salaries stagnate and health insurance costs rise under ObamaCare.</p>                \n                \r\n\n            \n                <p>Of course, none of that is the fault of African-Americans. &#160;It is the government who has alienated so many white working folks by basically ignoring them.</p>                \n                \r\n\n            \n                <p>The second point - Mr. Obama made plays into the first one:</p>                \n                \r\n\n            \n                <p><b>OBAMA</b>: \"We've got a justice gap when too many black boys and girls pass through a pipeline from underfunded schools to overcrowded jails. &#160;This is one area where things have gotten worse. &#160;When I was in college, about half a million people in America were behind bars. &#160;Today, there are about 2.2 million. &#160;Black men are about six times likelier to be in prison right now than white men.\"</p>                \n                \r\n\n            \n                <p>So why are there so many more Americans in prison? &#160;Three reasons: father's abandoning their children, a culture that glorifies crude and sometimes criminal behavior, and the illegal narcotics industry - much of it based in poor areas.</p>                \n                \r\n\n            \n                <p>None of those things were mentioned by the president.</p>                \n                \r\n\n            \n                <p>The cold truth is there has been a failure to lead on culture and family issues, and that has led to bad behavior being excused and sometimes even accepted.</p>                \n                \r\n\n            \n                <p>American society has grown so permissive and politically correct that solving poverty is almost impossible now.</p>                \n                \r\n\n            \n                <p>Anyone who raises questions about so-called \"entertainment\" that instructs children to reject civil behavior is immediately attacked in vile ways. &#160;Anyone lamenting the African-American out-of-wedlock birthrate risks being branded a racist.</p>                \n                \r\n\n            \n                <p>I know for a fact that Mr. Obama understands and is appalled by the culture swamp. &#160;Why then isn't he attacking it?</p>                \n                \r\n\n            \n                <p>As for schools, we continue to pour record amounts of money into public education but nothing gets better.</p>                \n                \r\n\n            \n                <p>Why? &#160;Because the system refuses to provide discipline, direction or competition through school vouchers for the poor.</p>                \n                \r\n\n            \n                <p>That's why!</p>                \n                \r\n\n            \n                <p>Third point:</p>                \n                \r\n\n            \n                <p><b>OBAMA:</b> \"We cannot be ignorant of history. (Applause.) We can't meet the world with a sense of entitlement. &#160;We can't walk by a homeless man without asking why a society as wealthy as ours allows that state of affairs to occur. &#160;We can't just lock up a low-level dealer without asking why this boy, barely out of childhood, felt he had no other options.\"</p>                \n                \r\n\n            \n                <p>Right out of the progressive playbook. &#160;No other options but to sell drugs? &#160;Come on.</p>                \n                \r\n\n            \n                <p>What an insult to the millions of young people of all colors working their butts off in fast food joints all across the country, or other entry level jobs - kids trying to build a resume of hard work, not taking the immoral, lazy way out by committing crimes on the street corner.</p>                \n                \r\n\n            \n                <p>As for the homeless, there is usually a reason and many times it's personal self-destruction that no free society can prevent.</p>                \n                \r\n\n            \n                <p>China often isolates people who refuse to be responsible but we in America don't do that, even in cases of acute mental illness.</p>                \n                \r\n\n            \n                <p>Individual rights trump dysfunction in our county, thus the homeless problem.</p>                \n                \r\n\n            \n                <p>Finally the fourth point:</p>                \n                \r\n\n            \n                <p><b>OBAMA</b>: \"It's thanks in large part to the activism of young people like many of you, from Black Twitter to Black Lives Matter, that America's eyes have been opened -- white, black, Democrat, Republican -- to the real problems, for example, in our criminal justice system. &#160;But to bring about structural change, lasting change, awareness is not enough.\"</p>                \n                \r\n\n            \n                <p>Big mistake - and rhetoric that is driving the Trump vote.</p>                \n                \r\n\n            \n                <p>Black Lives Matter is a radical group that has little use for free speech, as both Bernie Sanders and the Clintons have found out:</p>                \n                \r\n\n            \n                <p><b>SANDERS</b>: \"Thank you Seattle for being one of the most progressive cities in the United States of America!\" (Black Lives Matter protesters take the stage)</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>PROTESTER TO SANDERS:</b> \"If you do not listen to her your event will be shut down right now!\"</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON:</b> \"I think we've got somebody saying here -\"</p>                \n                \r\n\n            \n                <p><b>PROTESTER</b>: \"We want you to apologize for mass incarceration.\"</p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON:</b> &#160;\"Ok we'll talk about ...\"</p>                \n                \r\n\n            \n                <p><b>PROTESTER</b>: \"I'm not a super predator Hillary Clinton,\"</p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON:</b> \"Okay fine, we'll talk about it.\"</p>                \n                \r\n\n            \n                <p><b>PROTESTER</b>: \"Will you apologize to black people for mass incarceration?\"</p>                \n                \r\n\n            \n                <p><b>((EDIT))</b></p>                \n                \r\n\n            \n                <p><b>BILL CLINTON: </b>\"You are defending the people who kill the people whose lives you say matter. &#160;Tell the truth. &#160;You are defending the people who cause young people to go out and take guns.\"</p>                \n                \r\n\n            \n                <p>Most Americans are appalled at intrusions like that, not to mention insanity like this:<br> August protests in Minnesota</p>                \n                \r\n\n            \n                <p><b>BLACK LIVES MATTER PROTESTERS:</b> \"Pigs in a blanket! Fry 'em like bacon!\"</p>                \n                \r\n\n            \n                <p>President Obama's support of Black Lives Matter indirectly tells college graduates that radical intrusions are acceptable.</p>                \n                \r\n\n            \n                <p>That, of course, creates an enormous wedge between his supporters and more traditional Americans - again fueling the rise of a candidate like Donald Trump.</p>                \n                \r\n\n            \n                <p>Ironically, earlier in the speech, the president chastised those who disinvite certain people to college campuses, saying all responsible voices deserve to be heard. &#160;So what about the Black Lives Matter shout downs, Mr. President?</p>                \n                \r\n\n            \n                <p>The truth is some reforms need to be made on the justice, racial and social fronts, but the core issues of poverty and injustice are not being addressed effectively because of politics and P.C. out of control.</p>                \n                \r\n\n            \n                <p>Until those in power stop pandering and begin developing tough, fair-to-all policies, the growing divide in America will keep growing.</p>                \n                \r\n\n            \n                <p>Voters who support Trump are sending a powerful message that President Obama and the young Americans who revere him should seriously think about.</p>                \n                \r\n\n            \n                <p>These are the words that truly matter - equal justice for all.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Justice, Obama and Trump", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 5/9", "date": "2016-05-10T12:01:32Z"}