{"vcmId": "d7cea01c-c696-49e8-aecb-e23efc951798", "url": "http://www.foxnews.com/transcript/2016/10/13/mike-pence-on-syria-and-state-campaign.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 12, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Campaign 2016\" segment tonight. New FOX News poll will come out tomorrow. And that will reflect the recent debate and the \"Access Hollywood\" fiasco.</p>                \n                \r\n\n            \n                <p>Joining us now from Salem, Virginia where he is campaigning, the man running with Donald Trump, Governor Mike Pence. So, Governor, have you and Mr. Trump reconciled the serious situation? In your debate, you said USA should immediately establish safe zones that would help refugees but also required troops to do that. Mr. Trump said in his debate he kind of disagrees with that, he concentrate on knocking out ISIS before dealing with the refugees. Where are you guys on Syria right now?</p>                \n                \r\n\n            \n                <p><b>GOV. MIKE PENCE (R-IN), VICE PRESIDENTIAL NOMINEE:</b> Well, you bet. We talked about it the next morning. Frankly, Martha Raddatz just mischaracterized my position. I mean, what I said in the debate was that Donald Trump and my position is that to deal with the crisis in Aleppo where you've got hundreds of thousands of people in harm's way including 100,000 kids that you've got to establish safe zones with the international community.</p>                \n                \r\n\n            \n                <p>That's been Donald Trump's position long standing. I did say that to secure those safe zones that we should be prepared to use military force if necessary to allow the people to evacuate Aleppo and to get to those safe areas. The way she presented it, it was as though she, I think, you know, she conflated that with broader military action.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. Yes. I mean, it was kind of a gotcha.</p>                \n                \r\n\n            \n                <p><b>PENCE: </b>That's not been Donald Trump's position.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't understand, and this is just an aside, why you guys don't do the NATO option and have NATO establish these safe zones rather than the USA carrying the whole thing.</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> Well -- well, I think there's already a framework for international community to come together around safe zones. But what Donald Trump said is, we need to provide the humanitarian, establishment safe zones and then go after ISIS --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. Yes. But everybody knows that.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: -- and focus on destroying ISIS at their source.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. But, you know, as you put dude, kids dying right now, I would like to see a little more urgency on the part of the North Atlantic Treaty Organization. Now, women --</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I talked with Trump last night about women, you're going to lose the election if you can't convince more American women to vote for you. So I asked Trump, is there any strategy to target women. And I'm going to ask you that, as well. In the campaign you have to get more women to vote for you. Is there any strategy to do that right now?</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> Well, I think the strategy is just the message, Bill. I really do believe, I just finished up a rally here in Virginia. And you see the enormous crowds that come out for Donald Trump. There's women and men who are responding to his call --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But nothing specific --</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> We have to stand tall in the world stage.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: But honestly, but more jobs, more opportunity, more school choice, ending the scourge of illegal immigration. I mean, you covered that, you know, more than anybody else.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Here's my --</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: You're hardest on the criminal aliens in our community, it's a concern to women and men in America.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But here's the dilemma. You've been saying this since July and the convention, both of you. And the message is been pretty consistent. You still are way behind in the polls with women and the \"Access Hollywood\" thing didn't help you. So, I am saying, in the last four weeks in the campaign, you'll going to make a special effort to get more women on board? And it seems like you're not, you're just going to have the same message. I'm not saying that's wrong. I'm just saying that, I am just asking to see if you have any breakout on women.</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> Well, I honestly believe that Donald Trump's message is much more than a slogan, Bill. It's the people of this country know that for the last seven and a half years under the leadership of Barack Obama and Hillary Clinton, we've weakened America's place in the world, we retreated from the world's stage. Our economy is struggling. We're walking away from our most cherished constitutional traditions and as I'm campaigning across the country, I see as many women as I do men who are being drawn to that message --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes, but the polling --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>PENCE:</b> And the contrast on ethics between Donald Trump and Hillary Clinton. This avalanche of e-mails Bill is just astounding, even revelations today that have come out that where now John Podesta apparently told a U.S. senator that he agreed that the Iranian deal was the worst since the 1940s.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. That's the gift that keeps on giving to you guys, that hacked e-mail thing. I wanted to ask you about your peer Senator Kaine. When you were debating Kaine and I think you won the debate and I said that here on The Factor.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: Thank you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: What was your measure of Kaine? How did you think he presented himself?</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: Well, you know, honestly, when I got up from the table, I thought we've pretty much gave as good as we got. But, you know, some people thought I won that debate but honestly I thought Donald Trump won the debate. I thought the ability for me to be there and make the case for Donald Trump's message, make the case for the choice in this election is really what carries the day.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So, you're saying that your message is stronger. But Kaine, Kaine's delivery --</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: I think the message was stronger.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Kaine's delivery was not as authoritative maybe than yours. He was a little more, he was trying to basically goad you or bait you into some of these things. I'm sure you knew that. Right?</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> Yes. Well, sure. It's kind of amusing for me to hear him say in the debate a couple of times, we were running an insult-driven campaign at the same time that he was going through a long, obviously memorized laundry list of insults and mischaracterizations of Donald Trump's position. But, you know, for me, that night, my objective was really to draw the contrast between Donald Trump and Hillary Clinton, between really not just two candidates but --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You were ignoring Kaine?</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: I was very humble to be part of it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You were ignoring him?</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: No. It was hard to ignore him after he interrupted me 72 times.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. He beats you by 30. Seventy one-40. You got him 40 times. All right. Now --</p>                \n                \r\n\n            \n                <p><b>PENCE:</b> Yes. I wasn't counting but I tell you, you know, I thought it was a good, vigorous debate and if we came away with people understanding how clear a choice this is --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It is. It is a clear choice.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: -- had the opportunity.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But to be honest and you know I am always am. I mean, seven points behind nationally and tomorrow will tell the tale on the polling this week because the new polls will come out reflecting the \"Access Hollywood\" thing and the debate. So, you're seven down.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: I got to tell you something. I got to tell you something honestly and truly, I -- look. A, the only poll that matters is going to be finished on November 8th. B, there's something going on in America right now. The people that you speak for with such a clarion voice. The people you saw called the folks, the folks have had it. With the direction of this country. They're tired of an America, you know, apologizing to our enemies, abandoning our friends. They're tired of a weak and listless economy. A hundred and fifty six thousand jobs created in September. A one percent growth economy. People know we can do better.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Polls show that, too.</p>                \n                \r\n\n            \n                <p><b>PENCE</b>: I have to tell you. This is a movement of the American people. And I wouldn't be the least bit surprised that what you saw happen in the primaries where Donald Trump ended up over performing and the polling in state after state didn't come around this fall when the American people show up and make their voice be heard and make him the next president.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. We appreciate you coming on. Thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Mike Pence on Syria and the state of the campaign", "description": "Republican vice presidential candidate joins 'The O'Reilly Factor' to discuss foreign policy and election 2016", "date": "2016-10-13T12:35:33Z"}