{"vcmId": "d8016a3b-d8ed-488d-8ed5-064b39a7624d", "url": "http://www.foxnews.com/transcript/2015/08/14/is-planned-parenthood-targeting-certain-neighborhoods.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 13, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Hi. I'm Eric Bolling in for Bill O'Reilly. Thanks for watching us tonight.</p>                \n                \r\n\n            \n                <p>Our top story, one of the early surprises of this political season is the strong campaign run by Dr. Ben Carson. Yesterday a CNN poll showed Carson running a strong second to front-runner Donald Trump in Iowa. And he hasn't been shy about jumping into controversy.</p>                \n                \r\n\n            \n                <p>Take these provocative comments he's made about Planned Parenthood --</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CARSON:</b> Maybe I'm not objective when it comes to Planned Parenthood. But you know, I know who Margaret Sanger is. And I know that she believed in eugenics and that she was not particularly enamored with black people. And one of the reasons that you find most of their clinics in black neighborhoods is so that you can find a way to control that population.</p>                \n                \r\n\n            \n                <p>And I think people should go back and read about Margaret Sanger who founded this place, a woman who Hillary Clinton, by the way, says that she admires.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Joining us now from Manchester, New Hampshire to further explain, Republican presidential candidate Dr. Ben Carson.</p>                \n                \r\n\n            \n                <p>Dr. Carson -- thank you for joining us. Dr. Carson -- do you stand by that comment?</p>                \n                \r\n\n            \n                <p><b>DR. CARSON: </b>Absolutely. No question about it. Anybody can easily find out about Margaret Sanger and what kind of person she was and how she was a strong advocate of eugenics, wrote articles about you eugenics and believed that certain members of the population weakened the population and was not enamored of black people. And it is quite true -- quite true that the majority or plurality of their clinics are in minority neighborhoods.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>And you're saying that it's a direct correlation, in other words, she decided to put Planned Parenthood clinics in African-American communities to control the population of African-Americans in the community?</p>                \n                \r\n\n            \n                <p><b>DR. CARSON:</b> I think it's a very clear direction that she's going in with her philosophy.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> And you say she was developing some eugenics studies, which would mean control of African-Americans in society. Is it that or is it -- you know, let me play devil's advocate a little bit -- that 30 percent of abortions occur among black women whereas the population number is 13 percent, so it's almost triple the number of abortions rate for African- Americans as whites.</p>                \n                \r\n\n            \n                <p><b>DR. CARSON: </b>Well, it brings up a very important issue. And that is do those black lives matter? You know, the number one cause of death for black people is abortion. And I wonder if maybe some people might at some point become concerned about that and ask, why is that happening? And what can be done to alleviate that situation? I think that's really the important question.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Dr. Carson, if you're right and Planned Parenthood does have a mandate to go into black communities to control the black population, what would you do, what would you suggest people do now and if you were president?</p>                \n                \r\n\n            \n                <p><b>DR. CARSON: </b>Well, one of the important things is to educate people. I encourage people to go and read about Margaret Sanger and go and read about the beginnings of this organization so that you know what you're dealing with. You know, one of the ways that they're able to perpetrate the deceit is because people are not informed. The more people are informed, the less likely these kinds of things happen. Some of our founders expressed how important it was to have an informed populace because they could not be manipulated.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> So, we're talking over literally decades over time and the policy is still being implemented in 2015 of literally black population control through Planned Parenthood?</p>                \n                \r\n\n            \n                <p><b>DR. CARSON:</b> Well, what's going on now versus what went on at the beginning, I don't know. Probably a lot of the people in Planned Parenthood themselves don't know about this history. And perhaps if they did, they wouldn't be quite so anxious to be involved with it.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Ok.</p>                \n                \r\n\n            \n                <p>Let's talk a little bit about some of the other things that Planned Parenthood is accused of. They're accused of selling baby parts. Can you talk to us about baby parts or can you talk to us about fetal tissue because I understand that you've worked with fetal tissue in the past.</p>                \n                \r\n\n            \n                <p><b>DR. CARSON:</b> Well, I have not actually worked with fetal tissue. The left has put out information saying that I've done research on fetal tissues because my name appears on an article in which the pathologist compared specimens that I delivered from the operating room to some fetal tissues in an attempt to decide which way the cells were being differentiated.</p>                \n                \r\n\n            \n                <p>My part is to do the operation and supply the tissue. At that point, I move on to the next operation. So to suggest that I'm in the laboratory actually doing the research or retrieving fetal tissue is nothing but propaganda.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> And I think that's an important distinction to make and I'm glad you made it here on The Factor tonight because it's been swirling all day long that Dr. Ben Carson has worked with fetal tissue. He's done studies with fetal tissue. And you're saying what you've done is after a procedure is done, maybe it's to save a mother's life, you may have been in contact with fetal tissue but you had no part in the scientific research of the tissue once it's left the operating room?</p>                \n                \r\n\n            \n                <p><b>DR. CARSON:</b> Correct. And also bear in mind that all pathology departments will have a whole array of tissues, you know, from day one of conception until 99 years old. And if you use the tissue -- if you're comparing or looking for a disease process in elderly people, does that mean you're doing geriatric research on geriatric tissue? No. It means you're looking at your tissue bank and you're making comparisons to derive information.</p>                \n                \r\n\n            \n                <p>And those fetal tissues, by the way, come from a variety of different places -- you know, ectopic pregnancies, spontaneous abortions but just because, you know, they get the fetal tissue does it mean they should throw it out. Of course they don't. That's how science is advanced.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Right. And I think the law -- the reason why the law came involved into Planned Parenthood is because they were accused of profiting from the fetal tissue.</p>                \n                \r\n\n            \n                <p>Dr. Carson, can we turn to politics here a little bit. Donald Trump's rise in the polls, he seems to have a lot of staying power. Your thoughts on the Trump candidacy?</p>                \n                \r\n\n            \n                <p><b>DR. CARSON:</b> Well, I think that he's bringing a lot of energy to the Republican party. He's bringing in people who perhaps would have sat out and just felt disgusted. And in the long run, I think that helps to expand the base.</p>                \n                \r\n\n            \n                <p>You know, Donald Trump is Donald Trump, for other people to try to make him into somebody else is probably a futile endeavor.</p>                \n                \r\n\n            \n                <p><b>BOLLING: </b>Sure. And some would say that the strongest three candidates -- the three strongest candidates over the last week or so have been Trump, Carson and Fiorina -- three people who have never held public office before.</p>                \n                \r\n\n            \n                <p><b>DR. CARSON: </b>Which goes to my point that, you know, to solve problems doesn't necessarily require a lot of political experience. I mean you look at someone like -- let's not name someone but you can figure out who I'm talking about -- was a United States senator, was secretary of state, had been around politics for many, many years and yet did not have the judgment to know that you don't put important information that could jeopardize your country on a personal server. So if all of that political experience doesn't do that for you, maybe that's not what is necessary to solve our problem.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Dr. Carson, I have to go. Just one quick question, if it's Hillary Clinton or Joe Biden, who would you rather run against?</p>                \n                \r\n\n            \n                <p><b>DR. CARSON: </b>I would be delighted to run against either one of them, to be honest with you. It would be an easy distinction.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Are you sure you didn't do politics before? We're going to leave it right there. Dr. Carson, thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Is Planned Parenthood targeting certain neighborhoods?", "description": "Ben Carson on his provocative remarks", "date": "2015-08-14T12:13:10Z"}