{"vcmId": "d9ce1a4e-beb7-4fea-99af-0aec1e6941fb", "url": "http://www.foxnews.com/transcript/2014/10/03/chaos-within-secret-service.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><em>This is a RUSH transcript from \"The O'Reilly Factor,\" October 2, 2014. This copy may not be in its final form and may be updated.</em></p>                \n                \r\n\n            \n                <p><em>Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</em></p>                \n                \r\n\n            \n                <p>O'REILLY: Continuing now with our reporting on the Secret Service. Joining us from Washington Ron Kessler who's latest book, \"The First Family Detail\" is about the Secret Service. And here in New York City, Dan Bongino, former Secret Service agent who guarded President Obama and President Bush the Younger. Also, he has written a book entitled \"Life inside the Bubble.\"</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>Mr. Bongino, begin with you. What the heck is going on here.</p>                \n                \r\n\n            \n                <p>DAN BONGINO, FORMER SECRET SERVICE AGENT: Bill, we've had an insulated group, a small group of managers within the Secret Service who, I feel, have used the agency as their own --</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>-- personal job search service for their secondary careers. That's not to absolve them of the recent failures. And it wasn't the managers that chased the man over the fence.</p>                \n                \r\n\n            \n                <p>But there is a problem here with the White House Staff and the management that you can't just view these things in a vacuum.</p>                \n                \r\n\n            \n                <p>O'REILLY: OK. But you need to explain it a little bit more, so people who are not familiar with it -- you say they're using it as a job search --</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>-- mechanism. What does that mean.</p>                \n                \r\n\n            \n                <p>BONGINO: Well, they work within DHS and with the White House --</p>                \n                \r\n\n            \n                <p>O'REILLY: Department of Homeland Security.</p>                \n                \r\n\n            \n                <p>BONGINO: Right, Department of Homeland Security.</p>                \n                \r\n\n            \n                <p>O'REILLY: Yes.</p>                \n                \r\n\n            \n                <p>BONGINO: And with the White House. They have to almost leverage their networks for their post-Secret Service careers rather than take care of the --</p>                \n                \r\n\n            \n                <p>O'REILLY: So, they're not paying attention to detail.</p>                \n                \r\n\n            \n                <p>BONGINO: Exactly.</p>                \n                \r\n\n            \n                <p>O'REILLY: When you were an agent guarding President Obama and Bush the Younger, was there a morale problem.</p>                \n                \r\n\n            \n                <p>BONGINO: Not when I first got on the Secret Service in 1999. As a matter of fact, the morale was spectacular. The men and women were so proud. You were just waiting for someone to ask you what you did.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>When I left, Bill, it was in the trash can.</p>                \n                \r\n\n            \n                <p>O'REILLY: Why is that.</p>                \n                \r\n\n            \n                <p>BONGINO: Because it had grown -- once the Department of Homeland Security shift from Treasury happened, the Secret5 Service was subjected to this massive new bureaucracy. We used to be a big fish in a small bond in the Treasury.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>Then we were subjected to this new unbelievably large agency that just put their, I feel, their other foot --</p>                \n                \r\n\n            \n                <p>O'REILLY: Do you believe the quality of agents deteriorated. In 2003, the Secret Service transferred from the Department of Treasury, as the agent just mentioned, into Homeland Security. Did the quality of agent go down.</p>                \n                \r\n\n            \n                <p>BONGINO: No. The quality of the agents -- because I was an instructor at our academy as well -- I thought went up. And that's what makes this so paradoxical, how we have such good people in the rank and file that are consistently --</p>                \n                \r\n\n            \n                <p>O'REILLY: So, leadership, you say, is what the problem is.</p>                \n                \r\n\n            \n                <p>BONGINO: They are decimating the agency, Bill.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right. Mr. Kessler, do you agree with that. Do you think that the leadership of the Secret Service is causing these problems.</p>                \n                \r\n\n            \n                <p>RON KESSLER, AUTHOR OF \"THE FIRST FAMILY DETAIL\": Yes, but I would describe it as a culture within the management of basically penalizing agents -- and they are brave and dedicated -- for pointing out problems, deficiencies, even potential threats.</p>                \n                \r\n\n            \n                <p>You saw that happen with the females, uniformed officer who reported gunshots. The supervisor overruled her. And then, later, she said she was afraid to push it because she felt she would be criticized by management.</p>                \n                \r\n\n            \n                <p>O'REILLY: Reported gunshots where though. Tell the audience what happened.</p>                \n                \r\n\n            \n                <p>KESSLER: Gunshots at the White House. They were not detected, in fact, until --</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>-- four days later.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right. This was another incident where somebody took a rifle shot across at the windows. The agent heard it, reported it, and you're saying, Mr. Kessler, that was told to shut up.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>KESSLER: Yes. And, conversely, the incentive is, in order to get ahead and in order to get promoted, you have to go along with the idea that the Secret Service is invincible, you have to suppress --</p>                \n                \r\n\n            \n                <p>O'REILLY: So, no improvements. If you see something that's not quite right, --</p>                \n                \r\n\n            \n                <p>KESSLER: Right.</p>                \n                \r\n\n            \n                <p>O'REILLY: -- you shut up. And that's how you get promoted. All right.</p>                \n                \r\n\n            \n                <p>KESSLER: And really cover up.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right, now, I have a question. The reportage is that there was a female Secret Service agent inside the White House who is overpowered by this jumper. The guy overpowered her.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>Now, that says to me, that should never happen. I mean, if the ladies are qualified to be Secret Service, I'm fine with it.</p>                \n                \r\n\n            \n                <p>But no one-on-one should ever be overpowered. Am I wrong.</p>                \n                \r\n\n            \n                <p>KESSLER: No. And I know you don't do PC. We have PC, the physical fitness standards. Their politically correct physical fitness standards --</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>-- are absurd. They scale for age, for sex. Bill, the bad guys aren't interested in your scale of PC test.</p>                \n                \r\n\n            \n                <p>O'REILLY: No, I know. I mean it's frightening that a Secret Service agent would be overpowered by some guy who jumps over the fence with a beard and a knife.</p>                \n                \r\n\n            \n                <p>BONGINO: Right.</p>                \n                \r\n\n            \n                <p>O'REILLY: I mean, you know, the Secret Service has a gun, all right.</p>                \n                \r\n\n            \n                <p>BONGINO: When you're the last layer of security between a knife and the President --</p>                \n                \r\n\n            \n                <p>O'REILLY: Right. You can't be overpowered.</p>                \n                \r\n\n            \n                <p>BONGINO: Right.</p>                \n                \r\n\n            \n                <p>O'REILLY: So, that bothered me. Mr. Kessler, do you agree that political correctness has eroded the agency's efficiency.</p>                \n                \r\n\n            \n                <p>KESSLER: Yes, absolutely. And the fact that no agent took out the intruder with lethal force is another total debacle. And then, you have the Secret Service Director Juliet Pierson saying that they exercised tremendous restraint.</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>O'REILLY: Why.</p>                \n                \r\n\n            \n                <p>KESSLER: You know, she must think --</p>                \n                \r\n\n            \n                <p>O'REILLY: Yes, why. Why did they exercise restraint, you know. If the guy is --</p>                \n                \r\n\n            \n                <p>KESSLER: Because she -- this is an indication of the --</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>-- arrogance of the Secret Service, that she could issue this statement, she must think we're all fools.</p>                \n                \r\n\n            \n                <p>O'REILLY: Well, she doesn't see -- obviously, she doesn't see the protection of the President and the White House as something that deserves lethal force. Would you have shot this guy.</p>                \n                \r\n\n            \n                <p>BONGINO: No. Absolutely.</p>                \n                \r\n\n            \n                <p>O'REILLY: You would not have shot him.</p>                \n                \r\n\n            \n                <p>BONGINO: Bill, it was an Iraq War vet with a serious psychological --</p>                \n                \r\n\n            \n                <p>O'REILLY: But you don't know that. He's coming at you with a knife on the ground, --</p>                \n                \r\n\n            \n                <p><strong>(BEGIN VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>-- you wouldn't have shot him?</p>                \n                \r\n\n            \n                <p>BONGINO: But the Secret Service agents and the officers there are trained to look for things like printing on garments.</p>                \n                \r\n\n            \n                <p><strong>(END VIDEO CLIP) </strong></p>                \n                \r\n\n            \n                <p>They didn't see it. I have to --</p>                \n                \r\n\n            \n                <p>O'REILLY: You would not have shot him.</p>                \n                \r\n\n            \n                <p>BONGINO: No.</p>                \n                \r\n\n            \n                <p>O'REILLY: But you would have beat him up, I bet.</p>                \n                \r\n\n            \n                <p>(LAUGHTER)</p>                \n                \r\n\n            \n                <p>BONGINO: I'd try.</p>                \n                \r\n\n            \n                <p>KESSLER: Would you wait until he got into the White House and blew up the White House, Dan.</p>                \n                \r\n\n            \n                <p>O'REILLY: No, I would have shot him.</p>                \n                \r\n\n            \n                <p>BONGINO: Ron, you're not trained to look -- homicide --</p>                \n                \r\n\n            \n                <p>O'REILLY: But this is a fascinating question though.</p>                \n                \r\n\n            \n                <p>KESSLER: Dan just changed his mind.</p>                \n                \r\n\n            \n                <p>O'REILLY: Because he could have a suicide vest.</p>                \n                \r\n\n            \n                <p>KESSLER: Dan changed his mind.</p>                \n                \r\n\n            \n                <p>BONGINO: No, I don't change my mind at all. I wouldn't have shot him.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right. We appreciate your honesty.</p>                \n                \r\n\n            \n                <p>KESSLER: Let's look at the bigger picture.</p>                \n                \r\n\n            \n                <p>O'REILLY: I can't. I've got to go. I've got to go. But it's an interesting --</p>                \n                \r\n\n            \n                <p>KESSLER: The bigger picture is Barack Obama should have replaced the directors long time ago.</p>                \n                \r\n\n            \n                <p>O'REILLY: All right. Well, now, he has. Gentlemen, very interesting. Thank you.</p>                \n                \r\n\n            \n                <p><em>Content and Programming Copyright 2012 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2012 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</em></p>                \n                \r\n\n            \n\n            \n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Chaos within the Secret Service", "description": "This is a RUSH transcript from \"The O'Reilly Factor,\" October 2, 2014.", "date": "2014-10-02T04:00:00Z"}