{"vcmId": "da487ca5-0684-47cb-aaa0-3083d925f9c6", "url": "http://www.foxnews.com/transcript/2016/01/12/hillary-clinton-email-investigation-widens.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 11, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Factor Follow-Up Segment\" tonight, Juan Williams has been on The Factor for more 10 years and we value him as a guest, even though we often disagree. But sometimes what Juan says is hard to defend.</p>                \n                \r\n\n            \n                <p>Here he is on Hillary Clinton's e-mail.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JUAN WILLIAMS, FOX NEWS ANALYST: </b>I think the voters really don't care and I think that Jim Comey, the FBI director is beyond reproach with regard to this matter.</p>                \n                \r\n\n            \n                <p><b>LAURA INGRAHAM, FOX NEWS CONTRIBUTOR:</b> You think there would be a legality issue?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> If in fact the person who decides if it's classified or not.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Here now is Juan Williams from Washington; Mary Katharine Ham joins in all the fun -- there she is.</p>                \n                \r\n\n            \n                <p>First of all the Secretary of State doesn't get to decide what's classified particularly when a lot of e-mails that come into a private machine were from other agencies -- Pentagon, things like that. She doesn't get to decide what's classified.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> She does.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Only in the State Department.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: That's the point. So she -- if it's from another agency, you are right. But all the e-mails that she is handling, inside the State Department, there are other people who may have something to say down low, but she is the ultimate decider.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Not down low. She is dealing with the military, she is dealing with other agencies, and she doesn't decide what's classified.</p>                \n                \r\n\n            \n                <p>But here's the deal. It's very simple. Why are you sticking up for her when this is obviously wrong? Obviously a foolish mistake? She is seeking the highest office of the land. 59 percent of Americans don't trust her. Why on earth are you sticking up for her?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> Let's be clear. I'm critical of her over the private server. I'm critical of her over the mixing of business and foundation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Then why are you -- why? Why are you sticking up for her?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Let me just say very clearly, what's important here to understand? She has already apologized for the server. And from my perspective, I think a lot of people who really just don't want Hillary Clinton as the behemoth in this election are looking for any reason to go after her.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's -- that opinion is separate from trying to stick up for her.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS: </b>I'm not sticking up --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes, you are.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: I'm just telling you the truth. I'm telling you my opinion. We disagree.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, no, no.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Ok.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Here it is. Mary Katharine, you can answer this question.</p>                \n                \r\n\n            \n                <p><b>MARY KATHARINE HAM, FOX NEWS ANALYST:</b> All right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Juan Williams goes out of his way to stick up for Hillary Clinton in a situation that is undeniably, undeniably wrong. She shouldn't have done it. Juan just pointed out that she apologized for it ok. Juan admits this is wrong to do. Yet, he still sticks up for her.</p>                \n                \r\n\n            \n                <p>Can you explain it? You know the man. Can you explain it?</p>                \n                \r\n\n            \n                <p><b>HAM</b>: I think it is a fool's errand for me to try to explain Juan.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Wow.</p>                \n                \r\n\n            \n                <p><b>HAM:</b> I'm just about to say that. But look, here's the thing -- apologies aren't enough. And here's the other thing -- it's that this isn't just about people who don't like Hillary Clinton trying to look for something. It's about the FBI looking for something -- that's what we have learned this week.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But don't you guys understand it's more than this. It's about who is going to be the next president.</p>                \n                \r\n\n            \n                <p>Now, look, I don't mind you covering Hillary Clinton's campaign in a fair manner.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't. I am going to cover the woman in a fair manner.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: That's what we want.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: On a day-to-day basis. On a day-to-day basis I'm going to cover what she says in a fair and balanced way, ok? But I'm not going to make excuses for her bad behavior as you do.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: That's not true. That's not fair. I don't make excuses --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes, you do.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: -- because I say to you she is the ultimate decider inside the State Department about what's classified and not classified. That's the truth, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But she knew damn well, only a portion of her e-mails were State Department related. Most of them were outside. Didn't you get the Benghazi stuff? Didn't you get --</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: -- oh, I got.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Didn't you get all that.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: And didn't you get the 17 congressional hearings and the special independent commission and all they came up with the same answer and you don't like the answer because as you said this is all about who is the next president and you are taking sides.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You are trying to label me as an ideologue anti-Clinton person and I'm not.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: No, you are -- as a Clinton person and an ideologically aligned to her and I'm not.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You are an excuser. Go ahead, Mary Katharine.</p>                \n                \r\n\n            \n                <p><b>HAM: </b>These are just facts. Many of the e-mails among these have been shown to be classified. There was this e-mail released that shows that she asked somebody to strip the classified designation from it and now it's expanded to determine whether the Clinton Foundation money combined with her power at state might get into some public corruption issues.</p>                \n                \r\n\n            \n                <p>These are just facts that the FBI is looking into. These are problems for her. And it's not just about disliking her although the American people continue to dislike her more as they find out more about these possible allegations.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. All right.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: This is like dragging, looking for something. This business that you just cited, Mary Katharine, the State Department has said nothing classified.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: It doesn't matter what they say. The FBI will have the final word on it.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: I'm all for it because I think it would settle this argument and be clear to you, Bill O'Reilly, that I'm not taking sides --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I'm looking forward to it.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: -- I'm just telling you so far there is no evidence of wrongdoing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: For everyone who would vote for Hillary Clinton, that includes me, all right, if I'm considering who to vote for. This is the key question. Why would you vote for a woman, all right, who's untrustworthy? Why?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Because -- and I will say this specifically about Democrats for now but it also applies to Independents, they contrast her to the Republican candidates and say I would rather have her than the Republican.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So you would vote for an untrustworthy candidate, and it doesn't matter if it's Hillary Clinton anyway, if you thought that candidate was better in some way than the opposition?</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Yes. In fact, that's very clear from the polls because most Americans at this point have questions about Hillary Clinton's trustworthiness.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. 60 percent.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: But it's also the fact most Americans would vote for her over any of the Republicans.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, that's not exactly true.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: That's true. That's true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The polls go back and forth on that.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> It's been pretty consistent.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Last word -- Mary Katharine.</p>                \n                \r\n\n            \n                <p><b>HAM:</b> And Hillary is not a great candidate on the trail. She relies on inevitabilities to some extent. And so when these things come out and when people start asking questions and they find her more untrustworthy and they find less sympathetic, then they are less likely to vote for her which is why you Bernie creeping up in some of these head to heads with possible Republicans getting closer and closer or them beating her. And so this will play out as we forward. If the FBI starts finding stuff real bad for her.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: That will be true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, obviously it is. But again everybody, when they vote, all responsible people, have to look at the person's character, all right. And then you match it up against policy. But, first, it's the person. And that's what I don't understand. If you want -- if you like Hillary Clinton and you think she is a good person and you think her character is enough to put her in the White House -- fine. You could do that all day long. But don't make excuses for her. Don't.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Isn't it A versus B recommendation, Mr. O'Reilly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: No, it isn't. It's a personal vote. That's what we have in America. It's a personal vote. And I'm not rather anybody. I want the President of the United States, all right, to be an honest person. Call me crazy.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: No, that's fair.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Juan Williams.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: What did they say about Bush for the Democrats? What did the Republicans say about Obama?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And now we're wandering now.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS:</b> Ok. No.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Honesty is important.</p>                \n                \r\n\n            \n                <p><b>WILLIAMS</b>: Yes.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Hillary Clinton email investigation widens", "description": "Juan Williams and Mary Katharine Ham examine the latest on 'The O'Reilly Factor'", "date": "2016-01-12T13:24:57Z"}