{"vcmId": "db89cc17-73c7-48ea-9142-72558eaee354", "url": "http://www.foxnews.com/transcript/2016/07/14/bill-oreilly-trump-versus-hillary-with-bernie-sanders-thrown-in.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Now, that is the subject of this evening's Talking Points memo. As you may know, Senator Sanders endorsed Hillary Clinton yesterday. He was perspiring heavily as he did it. I guess it was hot up there in the live free or die state. Okay, Bernie. The endorsement doesn't really mean very much.</p>                \n                \r\n\n            \n                <p>The Democratic Party has already coalesced behind Secretary Clinton and it's all about voter turnout for her if she gets Barack Obama's type enthusiasm has a very good chance to win. If she does not, Donald Trump could pull an upset. That's because the Democratic Party has veered sharply left thanks to Senator Sanders. Here now his vision for America.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SANDERS:</b> This election is about the leadership we need to pass comprehensive immigration reform and repair a broken criminal justice system. It's about making sure that young people in this country are in good schools or at good jobs, not in jail cells. Secretary Clinton understands that we do not need to have more people in jail than any other country on earth at an expense of $80 billion a year.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So let's break that statement down. Sanders wants amnesty for all illegal aliens presently in the U.S.A. All of them. Amnesty. He also wants quasi open borders. Doesn't really want to stop people from coming in here illegally. FACTOR could not find one, not one specific statement made by Bernie Sanders that dealt with inhibiting illegal immigration. Although he says he wants to prevent it, whatever that means. Sanders supports sanctuary cities and opposes Kate's Law. On the economic front the Senator wants guaranteed jobs for every American. And guaranteed wages. That was apparent when he said this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SANDERS:</b> Hillary Clinton understands that we must fix an economy in America that is rigged and that sends almost all of the new wealth and income to the top one percent. Hillary Clinton understands that if someone in America works 40 hours a week, that person should not be living in poverty.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So if you do work 40 hours you should be guaranteed a wage that would allow you a comfortable life according to Bernie Sanders. That kind of mandate is a violation of the free marketplace, of course. And if the feds start paying mandatory wages, America's economy would collapse. On the crime and punishment front? Sanders wants little punishment. He believes that providing people with jobs is the solution to violent crime. He rejects harsh mandatory punishment for people who kill, rape, or maim.</p>                \n                \r\n\n            \n                <p>He believes the U.S. justice system unfairly targets minorities for prosecution. Now, there is no question that Bernie Sanders is an extremist, but he is upfront about it. He calls himself a socialist, he doesn't shy away from demanding the American people received trillions of dollars in entitlement's including free public education and free healthcare. So, Hillary Clinton has an interesting dilemma. Will she repudiate any of this far left stuff or will she embrace it? She does have a fall back because the media will not define the real radicalism that Sanders wants.</p>                \n                \r\n\n            \n                <p>Instead, treating him like a first cousin to the Colonel Sanders, a benevolent seller of chicken. In other words, the press does not tell us the truth. Shocking. Talking points believes Hillary Clinton is not as radical as Bernie Sanders. But, the Democratic Party is certainly heading in to the world of radicalism. Harry Reid, Nancy Pelosi, even to some extent Barack Obama. All hold views far to the left of mainstream America. So the presidential election in November is about much more than Trump versus Clinton.</p>                \n                \r\n\n            \n                <p>It's about what kind of country we want. America is in trouble. All the polls say the folks know it yet, the Democrats continue to march left ward. Even for those of you who do not like Donald Trump, that has to be a consideration when you cast your ballot in November. And that is &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Trump versus Hillary with Bernie Sanders thrown in", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 7/13", "date": "2016-07-14T12:23:41Z"}