{"vcmId": "db8d6012-0da3-473b-9683-7cbb20e8cde3", "url": "http://www.foxnews.com/transcript/2015/12/17/bill-oreilly-can-anyone-save-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>First a brief recap of last night's debate. Trump dominated the conversation after the debate because of his testy exchanges with Jeb Bush. Those who like Trump going in still like him. Those who find him lacking still find him lacking.</p>                \n                \r\n\n            \n                <p>Jeb Bush was more feisty than usual but with nine folks on the stage his time was limited and he will most likely not see too much benefit. Ben Carson did not score many points and his descent in the polls will likely continue.</p>                \n                \r\n\n            \n                <p>The Cruz-Rubio back and forth was interesting; both men are articulate. Cruz is more conservative. Rubio a bigger threat to Hillary Clinton should he get the nomination.</p>                \n                \r\n\n            \n                <p>Chris Christie scored points on fighting terrorism and that should help his numbers in New Hampshire where is he making his stand. Carly Fiorina, Rand Paul and John Kasich were fine but none of them did enough to move their poll numbers in my opinion.</p>                \n                \r\n\n            \n                <p>After the debate Charles Krauthammer and I had our own back and forth over Trump. Charles believes the man is unqualified to be president and says some of Trump's statements are, quote, nonsensical.</p>                \n                \r\n\n            \n                <p>I see things a bit differently. Donald Trump understands the anger sweeping America today and is tapping into that anger. He is not really concerned that much with policy right now. He is running on emotion. His campaign strategy has been brilliant. But if you take what he says literally, he can be a frightening guy.</p>                \n                \r\n\n            \n                <p>I see many of his statements as over-the-top rhetoric designed to get him votes, not necessarily in stone policy pronouncements. That's my job as an analyst to alert you as to what I believe is going on.</p>                \n                \r\n\n            \n                <p>Dan Rather, God help me, sees it the same way.</p>                \n                \r\n\n            \n                <p><b>DAN RATHER, NEWS ANCHOR:</b> So each time that he says something that strikes in the majority of the population at large as outrageous it's a tactical move to appeal to the more conservative hard right, if you like the phrase, base that heavily influences the outcome of primary caucuses.</p>                \n                \r\n\n            \n                <p>So, I would prefer to see these as tactical moves, but they can be very dangerous. What he said about Muslims and let's don't delve into his motives. But the effect of that is a great advantage for ISIS.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, for the record, I don't think anything Trump or any other politician says helps or hurts ISIS. What could hurt is alienating Muslim nations who might help the U.S.A. defeat these savages and I told that to Mr. Trump last week on this broadcast.</p>                \n                \r\n\n            \n                <p>Finally \"Talking Points\" does not endorse candidates, does not root, does not promote. I am a registered Independent who watches all powerful people and holds them to account.</p>                \n                \r\n\n            \n                <p>Trump has brought politics center stage in the U.S.A. by shear force of personality. And that is a good thing. Whether or not he would be a good president is quite something else. And that is for you to decide.</p>                \n                \r\n\n            \n                <p>And that is &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Can anyone save America?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 12/16", "date": "2015-12-17T13:25:34Z"}