{"vcmId": "dbfe6ed5-ae4f-465e-81de-80b6c31748cd", "url": "http://www.foxnews.com/transcript/2015/03/25/ted-cruz-for-president.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>According to a new Gallup poll, nearly 40 percent of Americans say they are conservative thinkers; 24 percent say they are liberal. But is there any group in the country more maligned than conservatives? Maybe serial killers?</p>                \n                \r\n\n            \n                <p>Enter conservative Senator Ted Cruz from Texas. Yesterday he announced he is running for president. Mr. Cruz wants America to return to traditional conservative tenets -- very clear about that and there is little compromise in his platform. That has angered the left, even some moderate Republicans.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>REP. PETER KING (R), NEW YORK: </b>Now, Ted Cruz may be an intelligent person, but he doesn't carry out an intelligent debate. He oversimplifies, he exaggerates and he basically led the Republican Party over the cliff in the fall of 2013.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Congressman King referring to Senator Cruz's attempt to shut down the government if Obamacare was not repealed.</p>                \n                \r\n\n            \n                <p>In the \"Wall Street Journal\" today the lead editorial compares Ted Cruz to Barack Obama. Both men beginning their presidential quests just having two years in the senate. Both men young, President Obama 45 at the time he started running, Ted Cruz 44. But the comparisons end there.</p>                \n                \r\n\n            \n                <p>However, it's interesting to see how Mr. Cruz's resume is being scrutinized by the media while Barack Obama's inexperience was essentially given a free pass. Here is the \"Washington Post\" editorial from January 18th, 2007, quote, \"No matter what your political leanings are, you are likely to feel at least a twinge of excitement about Illinois Senator Barack Obama's decision to compete for the Democratic presidential nomination.\" The post basing its assessment on Mr. Obama's mixed race citing the historical significance of it.</p>                \n                \r\n\n            \n                <p>But Ted Cruz is part Cuban -- a fact that was immediately brought up.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> I want to see your birth certificate. And you're -- and you're a mixed gentleman, right? You are mixed. I want to know are you talking for the Cuban side or the white side?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, that's nice. Miss Goldberg also referring to the fact that Ted Cruz was born in Canada. Now, that shouldn't be a problem for Cruz. According to the Harvard Law Review which says, \"a person born abroad to a U.S. citizen parent generally considered to be a natural born U.S. citizen.\"</p>                \n                \r\n\n            \n                <p>But facts don't really matter anymore in the country, do they? So expect the Canadian deal to be wrapped around Senator Cruz's neck along with other fabrications.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CHRIS MATTHEWS, MSNBC HOST: </b>Accusing Obama, the president of the United States of being under communist influence because he went to Harvard Law which, of course, is where Ted Cruz went but he wasn't under communist influence. This guy is bad news.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But the record shows that Ted Cruz did not -- did not say President Obama was under communist influence at Harvard. The senator did chronicle the resumes of some professors he considers Marxists and said Mr. Obama might be a good person to lead them. But sarcasm is not fact. But again facts don't really matter anymore.</p>                \n                \r\n\n            \n                <p>\"Talking Points\" believes that conservative Americans are the most maligned mainstream group in the U.S.A. If you don't believe in global warming, you are a loon. If you do believe life begins at conception, you are a religious fanatic. If you want strong action against the jihadists, you are a warmonger. On and on and on.</p>                \n                \r\n\n            \n                <p>If any other minority group in the country was smeared the way conservatives are there would be a Justice Department investigation.</p>                \n                \r\n\n            \n                <p>So, good luck to Ted Cruz. He most likely will not win the nomination, but his entry in the race is a very positive thing if you believe that America should be a vibrant democracy with all sincere views considered.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Ted Cruz for President", "description": "Bill O'Reilly's Talking Points 3/24", "date": "2015-03-25T12:16:50Z"}