{"vcmId": "ddf33a4a-9f17-44d5-84ba-5b79c10a85a1", "url": "http://www.foxnews.com/transcript/2016/02/01/bill-oreilly-iowa-dilemma.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>This coming Monday, we will have a more vivid picture of the republican presidential contest.</p>                \n                \r\n\n            \n                <p>Earlier this week, we reported about a third of Iowa caucus voters could change their minds before they cast their ballots. Right now, Donald Trump remains the front runner according to the Real Clear Politics Average, followed by Ted Cruz, Marco Rubio, and Ben Carson. All the rest of the candidates have no chance in Iowa.</p>                \n                \r\n\n            \n                <p>Now, it's impossible to predict how the Iowa voters will react to Donald Trump not showing up to the debate last night. We simply can't put that into any kind of perspective so we won't even try. Talking Points also cannot predict what will happen on Monday. It's simply too foggy for me.</p>                \n                \r\n\n            \n                <p>On another front, the candidate Rick Santorum is saying that \"I, your humble correspondent, am trying to influence the Iowa vote.\"</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>RICK SANTORUM, FORMER SENATOR:</b> Sort of an outreach for the people of Iowa that you have a media that tries to predetermine the race before the people of Iowa vote. And the reality is that, you know, Bill O'Reilly is playing right now.</p>                \n                \r\n\n            \n                <p>You're looking at a guy who has announced on the last week of May and have not been invited back on \"Fox &amp; Friends\", have never had an interview with Megyn Kelly, have never had an interview with Bill O'Reilly.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, I feel Rick Santorum's pain. He's absolutely correct. We have not had him on \"The Factor\". But there's a reason for that. We're not in the campaigning business here. We don't put politicians on the air simply spout their slogans. That's what political ads are for. We cover the news. And when a politician is in the news, they get on the program. That's why Donald Trump gets so much air time. He's dominating the news cycle by injecting controversy into the political arena. And you know what? That's not fair. Other candidates are being left out like Rick Santorum.</p>                \n                \r\n\n            \n                <p>Honestly, we looked for a reason to put the Senator on, but we couldn't find any. His poll numbers are very low. His campaign strategy is what it was four years ago. There's simply nothing new.</p>                \n                \r\n\n            \n                <p>Again, Rick Santorum is absolutely correct that the lack of media exposure is hurting his campaign. But it's not anything personal against Rick. I like him. He's smart. He's honest. And you could do worse in electing a president.</p>                \n                \r\n\n            \n                <p>Again, just to be crystal clear, \"The Factor's\" mandate is to bring you new information and analysis that is independent and honest. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The Iowa dilemma ", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/29", "date": "2016-02-01T18:36:59Z"}