{"vcmId": "de6ca6e4-78ac-4c63-bdd7-7242439b8b16", "url": "http://www.foxnews.com/transcript/2016/08/29/accusations-bigotry-enter-campaign-2016.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 26, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>ERIC BOLLING, FOX NEWS HOST:</b> Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching this special edition of the O&#8217;Reilly Factor: Election 2016. Let's get straight to our top story. Another round of name-calling and accusations of bigotry between Donald Trump and Hillary Clinton. Last night, Trump doubled down on comments he made earlier this week calling Hillary Clinton a bigot.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL NOMINEE:</b> She is a bigot because you look at what is happening to the inner cities, you look at what is happening to African-Americans and Hispanics in this country, where she talks all the time. She is selling them down the tubes. Because she is not doing anything for those communities, she talks a good game.</p>                \n                \r\n\n            \n                <p><b>ANDERSON COOPER, CNN ANCHOR:</b> Are you saying she has hatred or --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Her policies are bigoted because she knows they are not going to work.</p>                \n                \r\n\n            \n                <p><b>COOPER</b>: You are saying she is personally bigoted.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: She is. Of course she is. Her policies, she comes out with the policies and others that believe like she does also. But she came out with policies over the years. This is over the years, long time. She is totally bigoted.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Meantime Hillary Clinton leveled a scathing attack of her own saying Trump's campaign is built on prejudice and paranoia.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HILLARY CLINTON (D), PRESIDENTIAL NOMINEE: </b>In just this past week, under the guise of outreach to African-Americans, Trump has stood up in front of largely white audiences and described black communities in such insulting and ignorant terms, poverty, rejection, horrible education, no housing, no homes, no ownership. Crime at levels nobody has seen. Right now he said you can walk down the street and get shot. Those are his words. But, when I hear them, I think to myself how sad. Donald Trump misses so much.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Joining us now from Houston, Horace Cooper, a senior fellow at the Conservative Heartland Institute. And from Los Angeles Leo Terrell, an attorney and liberal activist. Leo, I'll start with you. In that sound bite, we played with Anderson Cooper, Trump mentioned her policies six separate times. So, are you saying -- is Hillary Clinton -- are the left saying that Donald Trump is calling Hillary a bigot or her policies a bigot? Bigoted?</p>                \n                \r\n\n            \n                <p><b>LEO TERRELL, CIVIL RIGHTS ATTORNEY</b>: Eric, Donald Trump doesn't know the definition of a term bigot. There is no way in the world you cannot get any of the mainstream republicans, you don't hear any Republicans on Capitol Hill supporting Donald Trump definition of the term bigoted as it applies to Hillary Clinton. It doesn't make sense. It's inexplicable. He is actually without any fact based. Now, on the other hand, that Hillary Clinton speech, Eric, was fact-based.</p>                \n                \r\n\n            \n                <p>Donald Trump attack of a federal judge. His attack against Muslims. His discrimination lawsuit that blacks that filed against him for housing discrimination. There is a factual blueprint of discrimination of Donald Trump against other groups. And let me be very clear to Mr. Trump. I have a house. I live -- I have a good job. I went to a good school. That's wrong.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: All right. You know what? You do. You do.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>Under President Obama and he is a Democrat and Hillary is a Democrat. Black's income under Obama down. Black home ownership down. Black poverty at 20 -- a staggering 26.2 percent. That's the highest it's been in decades under President Obama. That means one in four African-Americans in America are living in poverty. That's the Democrat policy. That could be seen bigoted.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Eric, every African-American in his speech, African-Americans do not worry about being shot when they go home. African-Americans have jobs. He broad every single African-American and it was disingenuous.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: All right. Let me bring Horace. Horace, go ahead. What am I missing here? Am I wrong in anything I have said here?</p>                \n                \r\n\n            \n                <p><b>HORACE COOPER, SENIOR FELLOW AT THE HEARTLAND INSTITUTE</b>: First of all, the very clip you showed Hillary went through a litany of lies. It is true that black Americans are under-housed and they have been on a decline for 10 years. It is true that there is an elevated crime wave that we are experiencing and it's primarily blacks who are suffering as a result. Wages are down. Opportunities for school are down. Absolutely. And it is good that finally someone is standing up and telling the truth. Romney didn't do it. McCain didn't do it. Somebody needed to stand up and explain that the policies, that the left and the progressives have been pushing are bigoted because they don't assume there is any possibility for improvement.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Mr. Cooper, you should be ashamed of yourself. Why don't you answer Eric's question.</p>                \n                \r\n\n            \n                <p><b>COOPER</b>: For telling the truth?</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Is Hillary Clinton a bigot? Is Hillary Clinton a bigot? Answer that question, please.</p>                \n                \r\n\n            \n                <p><b>COOPER: </b>Absolutely.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Gentlemen, gentlemen, please. I offered, I posed the question and I pointed out to you, Leo, that in that sound bite, Trump says her policies. He didn't say she is a bigot. He did once but he says, six separate times --</p>                \n                \r\n\n            \n                <p><b>TERRELL:</b> Oh, no.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: -- her policies can be deemed bigoted.</p>                \n                \r\n\n            \n                <p><b>TERRELL: </b>Respectfully, Eric, Anderson Cooper is asking her personally. Are you referring to her personally? He said yes.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: And then he went on to explain right after that six separate times saying it's her policies.</p>                \n                \r\n\n            \n                <p><b>TERRELL:</b> Eric, Eric, don't you find it odd, don't you find it odd that Paul Ryan, Mitch McConnell no one has attacked Hillary's speech of yesterday. You know why? Because they agree with her.</p>                \n                \r\n\n            \n                <p><b>(TALKING OVER EACH OTHER)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Guys, guys, please, please. Horace, answer me this. School choice, Donald Trump is in favor of school choice. Hillary Clinton is in favor of protecting the teacher's union protecting things as they are. Which would be better for the African-American community?</p>                \n                \r\n\n            \n                <p><b>COOPER</b>: School choice is the number one civil rights movement for blacks in the 21st century. Now, Hillary was an elected official. She was a senator. What bill has she ever introduced that has had any kind of positive impact for blacks? She can talk in a folksy draw. She can sing little folk songs every now and then when she talks to black people. Her policies have never, have never, her husband was a full bright scholar and he said that when he was a governor, he was looking at full bright as one of his mentors.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Excellent.</p>                \n                \r\n\n            \n                <p><b>COOPER:</b> A man who filibustered the civil rights movement.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: That has nothing to do with this topic. This topic is about whether or not Hillary laid out a factual blueprint of Donald Trump's racism. And what about, Mr. Cooper, what about the alt-right group. This extreme white wing group that has been incorporated in Breitbart and run by Steve Bannon.</p>                \n                \r\n\n            \n                <p><b>COOPER: </b>And the nearly $20,000.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Do you accept that?</p>                \n                \r\n\n            \n                <p><b>COOPER:</b> She has not given back from KKK members?</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: All right. You know what?</p>                \n                \r\n\n            \n                <p><b>COOPER</b>: This is the record of this individual.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: You are not going to acknowledge anything of Trump's misgivings. Donald Trump claimed on national TV, he didn't know who David Duke is. Do you really believe that sir you? Do you really believe that? You still won't answer the question.</p>                \n                \r\n\n            \n                <p><b>COOPER: </b>Hillary Clinton was a senator from New York. And, yet, we now see the poverty that blacks are experiencing in New York City and --</p>                \n                \r\n\n            \n                <p><b>TERRELL:</b> You're doing an excellent job.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Guys, I don't have a lot of the time. Let me throw one more out here. Let's talk about crime in law enforcement. Now, Donald Trump has said he is the candidate in favor -- he is the law enforcement candidate in fact he says. Who is most likely to be victims of crime in these inner cities? I will start with you, Leo, is it African-Americans or whites?</p>                \n                \r\n\n            \n                <p><b>TERRELL:</b> I will tell you exactly what it is. I will tell you it depends on the city, it depends on community based. I live in Los Angeles, Eric, and I don't worry about being shot as Donald Trump said. I live in Los Angeles all my life. I don't worry about being shot at all.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: All right, Horace?</p>                \n                \r\n\n            \n                <p><b>COOPER</b>: Okay. All right, see, this is part of the reason why we don't get the truth told. The Center for Disease Control lists homicide as the number two cause of death for black men. It has been an elevated season of criminality and the victims have been overwhelmingly black in our inner cities and Hillary has no solution. None whatsoever.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: I have got to leave. Leo, final thought, go ahead. Final thought.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Mr. Cooper, you should be ashamed of yourself. Mr. Cooper, you should be ashamed of yourself for not being willing to tell the truth.</p>                \n                \r\n\n            \n                <p><b>COOPER</b>: You should be ashamed with yourself for not being --</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> All right. All right.</p>                \n                \r\n\n            \n                <p><b>TERRELL</b>: Because of the fact of what's happening with Donald Trump's comments.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Thank you, guys. Very, very heated debate. Thank you. Thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Accusations of bigotry enter campaign 2016", "description": "Hillary Clinton and Donald Trump criticize each other over race and politics; 'The O'Reilly Factor' analyzes the latest", "date": "2016-08-29T12:07:57Z"}