{"vcmId": "e0745a88-14bf-438a-929d-65f3662c3ea7", "url": "http://www.foxnews.com/transcript/2015/10/08/bill-oreilly-violence-growing-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>With the nation locked in on the Oregon massacre last week, violence is once again a hot topic of conversation. There's no question the U.S.A. is a violent country. Our freedoms allow bad people to create criminal enterprises and also allow madmen opportunities to commit atrocious crimes.</p>                \n                \r\n\n            \n                <p>Tough, smart policing and strict mandatory sentencing drove violent crime down in America after the drug-fueled crack carnage of the 1990s which made cities like New York and Los Angeles exceedingly dangerous places.</p>                \n                \r\n\n            \n                <p>Mayors like Rudy Giuliani and police commissioners like Bill Bratton put together anti-crime strategies that worked. They were based on aggressive community policing and controversial tactics like stop-and- frisk. Because many drug criminals work the minority neighborhoods in big cities, prisons became field with people of color prompting the left to label the anti-crime initiatives as racist.</p>                \n                \r\n\n            \n                <p>Under President Bush the Younger those accusations got nowhere. Under President Obama they have been taken very seriously. Mr. Obama and his first attorney general Eric Holder believed there was a strong racial element in the American criminal justice system. They ignored the fact however that drug dealers have devastated poor neighborhoods and enslaved millions of minority Americans over the years.</p>                \n                \r\n\n            \n                <p>Mr. Obama and Mr. Holder also believe that selling drugs like crack, heroin and meth, not a violent crime. Never mind that folks addicted to those drugs commit the majority of property crimes in America as well as a majority of child abuse. Never mind that drug overdoses kill thousands of Americans every year. Never mind that drug gangs in places like Chicago and Miami are responsible for an incredible amount of violence as you need guns to compete in the street drug trade.</p>                \n                \r\n\n            \n                <p>So now just in time for Halloween the Justice Department is set to release 6,000 inmates from penitentiaries all across the U.S.A., many of them dope dealers. Also Congress is getting ready to change the mandatory sentencing making it easier for pushers and other so-called non-violent criminals to avoid paying the penalty they deserve.</p>                \n                \r\n\n            \n                <p>All of this liberal compassion for criminals is having an effect. Violent crime is rising quickly in many places as more lenient sentencing and anti-police rhetoric kicks in.</p>                \n                \r\n\n            \n                <p>The murder rate from 2014-15 very instructive: in Washington, D.C. up 46 percent; Milwaukee up 68 percent; St. Louis near Ferguson up 51 percent; Baltimore up 54 percent; Denver up 75 percent; Austin, Texas the murder rate is up a whopping 83 percent. Those are facts but President Obama and the left haven't acknowledged them.</p>                \n                \r\n\n            \n                <p>After the mass prison release this month, expect violent crime to rise more. The drug trade is violent on its face and everybody knows it. The myth that peddling hard drugs is a nonviolent act is dangerous and irresponsible. And many of our leaders simply don't care.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Violence growing in America", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 10/7", "date": "2015-10-08T12:12:56Z"}