{"vcmId": "e1726c04-baf2-4124-b124-c60757ea4a56", "url": "http://www.foxnews.com/transcript/2014/10/24/is-president-obama-being-hurt-by-ebola-situation.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 23, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>In \"Back of the Book\" segment tonight, our \"White House Insider\" segment. Let's bring in Ed Henry, Fox News Chief White House Correspondent.</p>                \n                \r\n\n            \n                <p>Now, I've been using you as the \"Breaking News\" conduit tonight. All throughout the program, we've been investigating this possible Ebola case here in New York City.</p>                \n                \r\n\n            \n                <p>We do have the information. And we're careful with this because of the panic quotient in all of this. So, a doctor named Craig Spencer.</p>                \n                \r\n\n            \n                <p>He worked with Doctors Without Borders in Guinea. He came back to the United States. He turned himself in. He has a fever.</p>                \n                \r\n\n            \n                <p>He's in Bellevue Hospital being evaluated for Ebola. That's what we know. We don't know whether he has it. It takes 12 hours to make the diagnosis, so we don't want to go any further than that and have people --</p>                \n                \r\n\n            \n                <p><b>ED HENRY, FOX NEWS CHIEF WHITE HOUSE CORRESPONDENT:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>-- running around screaming. But here's the important situation -- the doctor was not under the 21-day screening deal that the Obama administration just imposed this week.</p>                \n                \r\n\n            \n                <p><b>HENRY: </b>Uh-hmm.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> If the Obama administration had imposed that in the beginning, when it should have, along with the travel ban, all right, for civilians -- not doctors. I mean, you've got to bring the doctors and the medical people --</p>                \n                \r\n\n            \n                <p><b>HENRY: </b>Sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>-- and the military people back -- if that had happened, then Dr. Spencer would not have to come into contact with people, which he did, here in New York.</p>                \n                \r\n\n            \n                <p><b>HENRY: </b>Sure, sure.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So, another mistake -- another mistake, all right -- even if he doesn't have Ebola, it was a mistake to let a doctor who's treating Ebola patients in West Africa come back without a 21-day quarantine.</p>                \n                \r\n\n            \n                <p>Another mistake. And my question to you is -- does President Obama know how badly he's being harmed by all of this Ebola chaos.</p>                \n                \r\n\n            \n                <p><b>HENRY: </b>Now,I don't think they do but I think that what this does show, as you suggest, is that the administration has been, in pushing back on a travel ban from beginning, insisting the existing restrictions they had in place were good enough.</p>                \n                \r\n\n            \n                <p>As you say, this case -- we don't know all the facts yet but, as it plays out, raises questions about why that 21-day quarantine was not put in --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Immediately.</p>                \n                \r\n\n            \n                <p><b>HENRY: </b>-- sooner, as you say, because that would have --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Immediately.</p>                \n                \r\n\n            \n                <p><b>HENRY: </b>-- potentially stopped this from even going any further.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right.</p>                \n                \r\n\n            \n                <p><b>HENRY: </b>Now, the administration is obviously going to argue, \"We're moving to deal with that. We announced that this week.\"</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's too late. It's like the ISIS thing.</p>                \n                \r\n\n            \n                <p><b>HENRY:</b> Why didn't -- right, why didn't it happen a week or two --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It's too late. They're always too late. They never move quick enough in life-death situations.</p>                \n                \r\n\n            \n                <p>I mean, they're too late with ISIS. They're too late with Ebola. And the American people have gotten it now.</p>                \n                \r\n\n            \n                <p>There's no two sides to the story anymore, you know. There used to be but, now, there's not.</p>                \n                \r\n\n            \n                <p><b>HENRY: </b>What's interesting is that Democrat Kay Hagan, senator from North Carolina, --</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>-- one of these pivotal Senate races everyone's talking about in the midterms. She was asked by MSNBC today, --</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>-- \"Has the President shown strong leadership.\" And, in fact, on a series of those, she mentioned Ebola. She mentioned the oil spill from five, six years a go, the BP oil spill, saying what you just said that the President has been behind the curve on a lot of these.</p>                \n                \r\n\n            \n                <p>Interesting because, again, she's a Democratic senator trying to win in North Carolina, which is a difficult states for the President. And so, look, we've known for a long time that Democrats were distancing themselves from the President. But, now, they're going further.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>Now, they're actually attacking his leadership.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Now, tomorrow, when you have your little --</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>-- tete-a-tete -- by the way, that was French -- tete-a-tete --</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>-- all right, with -- what's his name at the --</p>                \n                \r\n\n            \n                <p><b>HENRY: </b>Josh -- Josh Ernst.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, OK.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>Are you going to say, \"Mr. Ernst, will you now finally admit that the administration has been behind --</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p>-- on Ebola,\" particularly if this doctor does have the disease.</p>                \n                \r\n\n            \n                <p><b>HENRY: </b>I will ask him certainly why that 21-day quarantine -- which they're now saying is a good idea, so they're implementing -- wasn't done sooner. Because --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>A month ago.</p>                \n                \r\n\n            \n                <p><b>HENRY: </b>You're right. It's a fair question. Now, I would also note, you just called him \"What's His Name.\"</p>                \n                \r\n\n            \n                <p>Josh Ernst, couple weeks ago, referred to you as a bestselling author from the podium behind me. So, you might want to apologize.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, I do apologize but I'm old and names are escaping me at a frightening rate, --</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>-- Sam.</p>                \n                \r\n\n            \n                <p><b>HENRY: </b>Well, I'm glad you remembered mine.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Oh, I mean Ed. I'm thinking of Sam Donaldson. You remind me of Donaldson because he wore the pocket hanky as well.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>Jonathan -- no? All right, you're going to ask that question tomorrow, you promise?</p>                \n                \r\n\n            \n                <p><b>HENRY: </b>Tough question, Sam Donaldson, yes.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Is President Obama being hurt by the Ebola situation?", "description": "Ed Henry weighs in on the limited travel restrictions imposed by the Obama administration", "date": "2014-10-24T12:13:39Z"}