{"vcmId": "e18ad09f-c805-4a01-bda1-ff2ac3834605", "url": "http://www.foxnews.com/transcript/2015/03/23/more-damaging-reporting-on-hillary-clinton.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 20, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Personal Story Segment\" tonight: Reuters reporting that the Clinton Foundation was not -- not upfront about donations with the Obama administration. Apparently while Hillary Clinton was Secretary of State, the foundation promised to report all foreign donations to the administration but didn't do it. So, if Hillary Clinton doesn't make it to the Presidential nomination because of the e-mails and other stuff, Senator Elizabeth Warren may be next up.</p>                \n                \r\n\n            \n                <p>Here now, former Senator Scott Brown who was defeated by Miss Warren in Massachusetts. Tell me about this woman. Do you respect her?</p>                \n                \r\n\n            \n                <p><b>SCOTT BROWN, FORMER SENATOR OF MASSACHUSETTS:</b> Of course I respect her. I respect the fact that she ran a very spirited campaign; obviously winning in Massachusetts as a Republican tough. But she ran during a presidential, did everything she could to win and ultimately won.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So you weren't mad at her for anything she said about you or she didn't do anything untoward in the campaign?</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>You need to have a thick skin in politics.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know that. But I mean some people at times it gets bitter. Sometimes it's ok. But you seem to be ok with her.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Listen, if you think I'm going to vote for her for president that's not happening.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, politics we know you disagree.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Politics, listen it's -- politics is a blood sport.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>As a person, do you feel that she is an honorable person, Elizabeth Warren?</p>                \n                \r\n\n            \n                <p><b>BROWN:</b> I think she is a good person.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Do you?</p>                \n                \r\n\n            \n                <p><b>BROWN:</b> Yes, I do. I think she is a good person.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. I don't know her. She teaches at Harvard and all that.</p>                \n                \r\n\n            \n                <p><b>BROWN:</b> Listen, she appeals to a very ultra liberal base of the country. She can -- what are her strengths? She can raise money. She has that support of the ultra base. Don't forget she was the creator of the Occupy Movement -- you didn't build it on your own mentality.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Sure. Do you think she is a socialist? Do you think she's a socialist?</p>                \n                \r\n\n            \n                <p><b>BROWN:</b> No, I don't think she is a socialist but her views are so far left of the mainstream America I think it's going to be difficult to run a national campaign. And if you look at the record over the last three years --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>It's all divisive, divisive, divisive. If people want that for another eight years potentially then they should vote for her.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> She's -- I think she is further left than Barack Obama.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>I agree.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. Because I mean she really wants income redistribution in a forced way.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I mean she would try to promote legislation that forces the people to hand over their assets rather than kind of dancing around with the higher --</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Well, you look what's happening now. She is filing a bill on higher education to lower student interest rates. How is she doing that? She is doing it by redistributing the wealth and raising taxes. It's failed then and it's failing now.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Why do people -- I lived in Boston as you know for many years. Why are the people of Massachusetts so crazy left?</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Well, certain blocks are. There are just more registered Democrats than Republicans.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But why? I mean, you know, a guy like you.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Probably the universities and colleges.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. That's number one -- academia.</p>                \n                \r\n\n            \n                <p><b>BROWN:</b> That's number one. Academia is very important. You have very strong unions so you have the union votes and then you have the very large immigrant population that can be influenced pretty dramatically when it comes to elections. They only come out every four years. And they will get them out no matter how they get them out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. Now, if Elizabeth Warren does run for president and she would only run if Hillary Clinton has to withdraw.</p>                \n                \r\n\n            \n                <p><b>BROWN:</b> That's the difference between Republicans and Democrats. They kind of anoint and we kick the crap out of each other for months and months and months --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>-- while they save the money and then --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But the Clinton machine is a different machine than anything the Republicans have.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Yes, absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So if you challenge the Clinton machine.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>You'll get eaten up and spit out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You're right. You are going to get hurt.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And so your future in the Democratic Party is going to be nothing which is why Andrew Cuomo the governor of New York isn't going to challenge because he is waiting. All right.</p>                \n                \r\n\n            \n                <p><b>BROWN:</b> Of course.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He's he not going to go up against her. But if Elizabeth Warren -- it looks like is number two up, she is in the bullpen. So if Hillary gets hammered on the e-mail thing and it gets into the legality of she has to testify under oath. They are going to subpoena the server, all of these things -- do you believe Elizabeth Warren has enough to step in and get that Democratic nomination?</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>I would encourage her to do so because I believe competition is important. I absolutely encourage her.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. But do you believe that she has the machine to do it?</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Not yet.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No?</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>But I think she can certainly raise the money.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Because Martin O'Malley is another far left guy. he's the governor of Maryland.</p>                \n                \r\n\n            \n                <p><b>BROWN:</b> No one knows who he is. He doesn't have the bully pulpit. And Joe Biden, poor Joe Biden --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No. Biden would try though.</p>                \n                \r\n\n            \n                <p><b>BROWN:</b> Poor Joe Biden -- he's not taken seriously. He has been there for eight years.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well look, he's got a very difficult -- he is either going to be a masseuse or he's -- sorry.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>He did the same thing though -- he did the same thing to my wife when I got sworn in.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I gave Miller that joke but he couldn't get it out.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>He did the same thing to my wife.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He did it to your wife.</p>                \n                \r\n\n            \n                <p><b>BROWN:</b> Absolutely. I said \"Mr. Vice president I don't care if you are the vice president but please get your hands off my wife.\"</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Did you really say that?</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Yes, absolutely did. Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Really?</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Yes, she's right outside.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>When did that happen?</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>When I was getting sworn in.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> As senator?</p>                \n                \r\n\n            \n                <p><b>BROWN:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Wow.</p>                \n                \r\n\n            \n                <p><b>BROWN:</b> That's why we chuckled -- chuckled.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That would have been great if you had just put your hand up, taken the oath and then went bang.</p>                \n                \r\n\n            \n                <p>All right. Thanks for coming in -- Senator.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Good old Joe. It's Joe being Joe, Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He's Joe being Joe.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>It's ok. It's Joe.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We love him.</p>                \n                \r\n\n            \n                <p><b>BROWN: </b>Thanks.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "More damaging reporting on Hillary Clinton", "description": "Will Elizabeth Warren be the left's presidential nominee if Hillary Clinton doesn't run?", "date": "2015-03-23T12:37:44Z"}