{"vcmId": "e3754d3d-4490-4dd1-a41a-b0bb00ca2b8b", "url": "http://www.foxnews.com/transcript/2016/11/07/bill-oreilly-tuesday-cannot-come-fast-enough.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Poll buy CBS News says, 82 percent of Americans are disgusted, that is the word they used. Disgusted. With the presidential campaign. Just 13 percent are excited by it. Who are those people? Pretty much everyone I know can't wait until the whole thing is over. Yes, there is a lot at stake. But all the negativity has not been good for the country.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP (R), PRESIDENTIAL NOMINEE:</b> Hillary Clinton has engaged in far-reaching criminal conduct and in an equally far-reaching criminal cover-up, including the destruction of 33,000 emails after receiving, after, after, can you imagine, can you imagine if I did that? Oh, that alone is big problems for which she got away with murder. Honestly, she has no right to be running.</p>                \n                \r\n\n            \n                <p><b>CLINTON</b>: Just a few days ago, Donald Trump was endorsed by the official newspaper of the Ku Klux Klan. They wrote their endorsement under the slogan of his campaign, Make America Great Again. They said it's about preserving white identity and they place their faith and hope in him.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, to be fair, Donald Trump has nothing to do with the Ku Klux Klan and Hillary Clinton has not been charged with anything yet. Now, there is a tradition of nasty presidential campaigns in America going all the way with John Adams versus Thomas Jefferson. But in this hyper computer age where internet smears dominate the discourse, critical mass has now been reached. There's no question both candidates despise each other. And that many Americans are angry about the state of their country. All of that negative emotion can be very destructive.</p>                \n                \r\n\n            \n                <p>Talking Points has tried to cover the campaigns in a fair way and I believe we have succeeded. We do not cheap shot the candidates but we do not shy away from telling you the truth about them. My analysis of the recent Al Smith Dinner here in New York City is a good example of that. For those of you who watch this program, you know what we believe and that is that many far left policies are damaging the country. And that the Democratic nominee Hillary Clinton, is embracing some of those policies. My problem with Mrs. Clinton is twofold.</p>                \n                \r\n\n            \n                <p>She's not candid in her assessment of herself. And, she has veered sharply to the left. If Americans allow her to nominate a Supreme Court justice, things could get very intense for this country. On the other side, Donald Trump, who has been accessible to us, is not experienced in dealing with complicated geopolitical matters. If elected, he would have to rely heavily on advisors and we do not know whether Mr. Trump would listen to them or not. So, at this point, whoever is elected president will enter the office as the most unpopular victor in history.</p>                \n                \r\n\n            \n                <p>There is simply too much bitterness for it to evaporate in a matter of weeks. Talking Points sincerely held beliefs even those that go against my conscience. But we are not seeing that kind of respect in this campaign, are we? Here is a vivid example. Last week the Catholic diocese of Rockwell Center where I live on Long Island issued a very heartfelt letter on abortion. While the bishop did not take a political side, he clearly states that anyone, anyone who would support taking the life of a late term baby for anything other than the life of the mother is participating in a grave injustice.</p>                \n                \r\n\n            \n                <p>The bishop and every other cleric in this country have a perfect right to state that position without being attacked or scorned. Hillary Clinton's position is that any late term abortion should be acceptable if the mother's health is in some kind of jeopardy. But as we all know health could mean anything which is why there are laws against late term abortion. And Mrs. Clinton's position is extreme but has gone relatively unnoticed.</p>                \n                \r\n\n            \n                <p>Finally, we never endorse candidates here. We never tell you for whom to vote. We also understand that this campaign has been awful for the spirit of the nation. There's no question about it. And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Tuesday cannot come fast enough", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 11/4", "date": "2016-11-07T12:54:41Z"}