{"vcmId": "e433dff1-9d77-4151-83fc-9d278a4fcf82", "url": "http://www.foxnews.com/transcript/2015/03/20/gop-2016-israel-and-president-obama.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 19, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Impact segment tonight. Brand new segment -- \"Dana Perino's Top Stories of the Week\" and here she is. Co-host of \"THE FIVE\" Miss Perino. Beckel would never get this. I'd never get Beckel -- \"Beckel's top stories\".</p>                \n                \r\n\n            \n                <p><b>DANA PERINO, FOX NEWS HOST: </b>I am honored to be in the seat where many of my esteemed colleagues have been before.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The seat with two pillows. We're propping her up.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>I'm sure Greg Gutfeld has to have two pillows -- right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Three. Gutfeld got -- he needs to get his chin above the desk.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> Thank you. And now I feel better.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Top story of the week.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Number one has to be Israel. Most importantly to me and I think to Americans and your viewers is the relationship between America and Israel. Arguably our most important international ally, this relationship is on the rocks. And it is because of personal animosity between President Obama and Prime Minister Netanyahu and they need to figure out a way to get behind it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Why should anybody in America care whether Netanyahu and Obama don't like each other? I mean Israel is far away and what does it have to do with somebody in Pittsburgh?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Well, a few things. One, if you believe that America is the leader of the free world. America has been Israel's ally. Traditions, loyalty, peace, in particular the United States has been able to help ensure that Israel's existence can prosper and been its best friend in the region.</p>                \n                \r\n\n            \n                <p>One of the biggest concerns here is that Israel doesn't have many allies in the world. United States has been that ally.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> But from a national security standpoint, the most important issue on the table right now is whether Iran gets a nuclear weapon not just because of what it could do to Israel but they are seeking intercontinental ballistics missiles.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, they already have them.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>That means that weapons that could come over here as well. I just think that we have a serious situation on our hand where President Obama and Netanyahu -- I think they can get beyond it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, they'll have to get beyond it. But remember, President Obama only has a short time left in office. So, if there is a problem with Israel and U.S.A., it's a temporary problem -- I believe.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>However it could get permanent.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I don't think so.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>I'm going to make a prediction though. That deadline that President Obama put on the talk with Iran is March 24th coming up next week.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, it will be extended.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>I have a feeling -- he is going to have to extend it because of the loss that he suffered really by extension in Israel this week.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. I think you are going to be right on that.</p>                \n                \r\n\n            \n                <p>Now, the domestic story that you chose has to do with Dr. Ben Carson -- one of the Republicans who want to be president. Roll the tape.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>HUGH HEWITT, RADIO HOST:</b> Should we have that sort of commitment that if Putin makes a move on the Baltic states we'd go to war?</p>                \n                \r\n\n            \n                <p><b>DR. BEN CARSON, PRESIDENTIAL CANDIDATE:</b> If we have them involved in NATO. We need to convince them to get involved in NATO and strengthen NATO.</p>                \n                \r\n\n            \n                <p><b>HEWITT: </b>Well -- they are in NATO.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So that wasn't good for Dr. Carson.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> It is getting late to make a first impression. Dr. Carson's story is a wonderful one. He has adoring fans all across the country. People have donated and want to invest in his campaign either through money or time. But at this point this in the contest when it's starting to firm up and you know who the candidates are going to be the questions get tougher. And you have to be able to --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But that wasn't a real tough question.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> That's my point on this one I think Dr. Carson, even though I thought he recovered fairly well saying he has been studying, he does need to get involved with the details. Believe me his opponents will be able to answer that question and so will Hillary Clinton.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. You know, it is -- I had Herman Cain almost this time probably a little bit later on the program about a foreign policy and I asked him about Iran and all of that, and he didn't know. And that was the end of Herman. Not to say that THE FACTOR was.</p>                \n                \r\n\n            \n                <p>You are right in the sense that if you want to run for president you have got to command all the facts. That's what happened to Sarah Palin. That's what happened to her. It happened to the governor of Texas. So you can't -- it's unfair. It's unfair because everybody has brain freeze. I have seen you on \"THE FIVE\", right?</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> It's common.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, you are crying. So everybody has brain freeze and I'm going to attribute Dr. Carson to that. I mean you know --</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>You don't have -- there is a difference between I gotcha question.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And it wasn't. Hugh Hewitt didn't ask him a gotcha.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> It's not a gotcha question. If I were to say please name the President of Slovenia, that would be a gotcha question but if you are asking about basic.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>President of Slovenia?</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> You got it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Justin Bieber.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> Just as good as guess as anyone else. But the first primary debate is on Fox News Channel five months from now. And it is getting late.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I didn't even know that. They didn't even tell me. You know that and I don't know it.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> I know things.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I know. You know what? I have just learned from you telling me that? I will not be moderating that debate.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Probably not.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Dana Perino's two top stories. You're going to show up every week here to do this -- right.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> I would be honored to.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Are those cushions ok. Are you comfy?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>But my feet don't touch the floor. So we've got to work on that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. We will try to get you little stirrups.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Ok.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "GOP 2016, Israel and President Obama", "description": "Dana Perino on the latest in the GOP 2016 field and the strained relationship between Israel and President Obama", "date": "2015-03-20T12:19:53Z"}