{"vcmId": "e5051614-ce4c-46b0-b8e6-8d5a717d853b", "url": "http://www.foxnews.com/transcript/2016/10/19/yale-professor-makes-case-for-donald-trump-vote.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 18, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>\"Personal Story\" segment tonight, column in the \"Wall Street Journal\" recently caught my eye. It was written by a Yale Professor David Gelernter who says, who says, he is voting for Trump, even though he is not very happy about it.</p>                \n                \r\n\n            \n                <p>The professor joins us now here in New York City down from New Haven. So, I mean, you came out of the closet. And so I can't imagine at Yale -- what do they say to you? You are voting for Trump. What do they say?</p>                \n                \r\n\n            \n                <p><b>DAVID GELERNTER, PROFESSOR OF COMPUTER SCIENCE, YALE: </b>Well, they are used to it I have been out of this closet. I have been a Republican for a long time.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But it's different with Trump.</p>                \n                \r\n\n            \n                <p><b>GELERNTER</b>: But it's true. It's true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right. Right.</p>                \n                \r\n\n            \n                <p><b>GELERNTER:</b> Even the one percent. Half of one percent of Republicans at Yale are scared to death of Trump so, yes, it's a different thing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, you say it's about 99 percent liberal Democrat at Yale?</p>                \n                \r\n\n            \n                <p><b>GELERNTER</b>: I would say 99. Ninety nine and a half percent. Not just liberal leftist.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Wouldn't they do better up there if they had a few, you know, they always speak about diversity. Get somebody in there. Now, you are not a big Trump fan.</p>                \n                \r\n\n            \n                <p><b>GELERNTER:</b> True.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But you are casting a ballot for him, why?</p>                \n                \r\n\n            \n                <p><b>GELERNTER:</b> I have no choice. My duty as a citizen to look at the big picture. Trump is a bum with respect to his dealings with women. I'm not proud of what he has done. He is not proud of what he has done. But I have a responsibility to look at what kind of president Hillary Clinton would make. And a woman who has been a career liar, who spent her career selling out the United States, making a principle and a practice of doing that, I have no reason to doubt that she is going to continue lying.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. So, your vote is basically that she is worse than he is.</p>                \n                \r\n\n            \n                <p><b>GELERNTER: </b>She is worse than he is. And we need somebody who is not scared to make big changes. Trump is not my pick but --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. But he is not scared.</p>                \n                \r\n\n            \n                <p><b>GELERNTER: </b>He is not scared.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. And Hillary Clinton would pretty much do what Barack Obama has done. Now, Secretary Clinton is a Yale Law school grad.</p>                \n                \r\n\n            \n                <p><b>GELERNTER</b>: Absolutely. Absolutely. Yes. Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Do they like her up at Yale? Are they promoting Hillary Clinton? Do they think she's going to be a good --</p>                \n                \r\n\n            \n                <p><b>GELERNTER: </b>They don't have to promote her. They are madly in love with her. But I will say not to the extent that they love Obama. Obama really rings the bell for them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ahah!</p>                \n                \r\n\n            \n                <p><b>GELERNTER</b>: But the Clintons have been big at Yale since Bill's earlier days, since Bill is a governor in Arkansas. Proud of him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now your peers at Yale, do they ever come up and congratulate you on your courage?</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p>No, I'm serious. Well, they said, look, we may not agree with you Professor, but you are pretty courageous to do what you did, write the journal article and be outspoken.</p>                \n                \r\n\n            \n                <p><b>GELERNTER</b>: I will tell you. To be fair Yale has been fair to me. But it helps that they live in an intellectual ghetto like all major universities. They read the \"New York Times.\" That's it. And for the students, too. The faculty and the students don't have a clue what's going on in the world.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, there is no robust debate up there? There is no Yale factor.</p>                \n                \r\n\n            \n                <p><b>GELERNTER</b>: If I publish in the \"Wall Street Journal\" they have no clue.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They don't even know it?</p>                \n                \r\n\n            \n                <p><b>GELERNTER</b>: They don't even know it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Is it banned?</p>                \n                \r\n\n            \n                <p><b>GELERNTER</b>: If I'm on this show which may be watched all over the country, they have never heard of it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: They have never heard of it because you have the internet.</p>                \n                \r\n\n            \n                <p><b>GELERNTER</b>: There is a rumor.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It will get out on the internet. Right. But then when you go back to Yale, I mean --</p>                \n                \r\n\n            \n                <p><b>GELERNTER</b>: You can't under estimate the incredible parochial mess of Yale, of Harvard.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Is it arrogance? Is it snootiness? Is that what it's based on or are they just unrealistic.</p>                \n                \r\n\n            \n                <p><b>GELERNTER</b>: It's professional arrogance. It is not like these are unpleasant people. They are easy going. They are friendly and so forth. It's a professional arrogance that says our business to be smarter than everybody else.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But they can't say they are smarter than you.</p>                \n                \r\n\n            \n                <p><b>GELERNTER</b>: They don't know anything about me except I'm weird and interesting to Republicans.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Halloween is coming up. And I think I'm going to go trick and treating up at Yale. That will liven the campus up a little bit.</p>                \n                \r\n\n            \n                <p><b>GELERNTER</b>: Consider it an invitation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Professor, thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Yale professor makes case for Donald Trump vote", "description": "David Gelernter joins 'The O'Reilly Factor' to explain his support for the GOP candidate", "date": "2016-10-19T13:27:44Z"}