{"vcmId": "e61286b5-7224-4b2c-8ab1-fa69d4613b6a", "url": "http://www.foxnews.com/transcript/2015/04/16/bill-oreilly-anti-police-movement-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Yesterday, a group called The Stop Mass Incarceration Network suggested that all Americans protest quote, \"the injustice of mass incarceration and police brutality\". In New York City, maybe 400 protesters turned out to block traffic and yell stuff. 42 were arrested, two police officers hurt. In Los Angeles, about 100 protesters turned out. There were 14 arrests in the City of Angels. In Oakland, far left city, only about 100 people showed up. No arrests were made there.</p>                \n                \r\n\n            \n                <p>So you can see the anti-police call was not exactly heeded. The reason is the vast majority of Americans understand that most of the nations 1.2 million law enforcement agents are good people who risk their lives to protect the innocent. But with high tech now capturing dubious incidents, it's easy for cop haters to demonize the entire law enforcement community.</p>                \n                \r\n\n            \n                <p>In North Charleston, South Carolina a police officer was recently caught on tape killing an unarmed black man who was running away from him after a traffic stop. The officer, Michael Slager is charged with murder.</p>                \n                \r\n\n            \n                <p>In Tulsa, Oklahoma a 73-year-old reserve deputy shot and killed a black man who was allegedly trying to sell a firearm. The deputy, Robert Bates has been charged with manslaughter.</p>                \n                \r\n\n            \n                <p>And in San Bernardino, California, 30-year-old Francis Pusok (ph) was beaten by as many as 10 cops after running away from them on horseback. Pusok who is white and has been charged with a variety of low level crimes, the deputies have been put on leave.</p>                \n                \r\n\n            \n                <p>Again with cameras everywhere any police misconduct now becomes a national story. So police training must improve to ensure that deadly force is used only in extreme situations.</p>                \n                \r\n\n            \n                <p>Yes, police face difficult situations every day. But along with arrest authority, comes deep responsibility. The perps are expected to be irresponsible. The cops are expected to be noble and most of them are.</p>                \n                \r\n\n            \n                <p>But to people like \"Miami Herald\" columnist Leonard Pitts, that statement is false. Pitts has made a career out of exploiting grievance whether it's legitimate or not. He recently wrote, quote, \"Bill O'Reilly of Fox News\" -- and he's got the little news in quotes in his column -- \"has already invoked misleading statistics to assure his audience that there doesn't seem to be, as some people would you have believe that police are trying to hunt down young black men and take their lives. In other words, move on, nothing here to see.\"</p>                \n                \r\n\n            \n                <p>The stats Pitts is referring to come from the Centers for Diseases Control and say that three times as many white folks are shot by police as black folks.</p>                \n                \r\n\n            \n                <p>Now, we asked Mr. Pitts to come on the program but he's hiding under his desk because he knows he's misleading his readers. American police are not hunting down black men in order to kill them. That's not happening Leonard. And shame on you for implying it is.</p>                \n                \r\n\n            \n                <p>The overall anti-police movement is basically thematic. It believes that the U.S. justice system is unfairly putting black men in prison for crimes like selling narcotics. Many on the left see nothing wrong with selling heroin, cocaine and meth -- they call it a nonviolent crime that should not be punished harshly.</p>                \n                \r\n\n            \n                <p>Meantime, entire neighborhoods like the south side of Chicago were terrorized by drug gangs. And millions of Americans have been enslaved or even died from using addictive poisons. But the crime is nonviolent.</p>                \n                \r\n\n            \n                <p>Talking Points believes that insane views of the world can poison actual societies. That is what these anti-police people are trying to do.</p>                \n                \r\n\n            \n                <p>Yes, there is police abuse and it must be punished. There's no excuse for it. But no, America is not a place where minority people are targets of organized injustice. Thank God most of us seem to know that.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The anti-police movement in America", "description": "The anti-police movement in America", "date": "2015-04-16T12:21:01Z"}