{"vcmId": "e6237390-2e15-4fe0-a72b-a1d221fef764", "url": "http://www.foxnews.com/transcript/2015/07/31/bill-oreilly-what-happened-to-and-justice-for-all.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Recently two Americans wound up dead after traffic stops. In Texas, 28- year-old Sandra Bland was stopped when she failed to signal while changing lanes. She was taken into custody, where she allegedly committed suicide in her jail cell.</p>                \n                \r\n\n            \n                <p>In Ohio, 43-year-old Samuel Dubose was shot dead by a police officer after being stopped for not having a license plate on the front-end of his car. The Ohio cop has been charged with murder.</p>                \n                \r\n\n            \n                <p>The Texas woman's case being investigated by state authorities.</p>                \n                \r\n\n            \n                <p>Talking Points does not know precisely what happened so further comment will wait until the hard evidence is presented. But the point is that laws, no matter how trivial, matter. And we the people, including law enforcement, are expected to obey the law -- all of the law.</p>                \n                \r\n\n            \n                <p>Enter Congresswoman Nancy Pelosi, who took an oath to uphold the constitution, which includes respecting the laws her own House has passed. But Mrs. Pelosi openly defies federal immigration laws. She supports the anarchy of sanctuary cities, and rejects the proposed case law.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>REP. NANCY PELOSI (D-CA), MINORITY LEADER: </b>Mandatory minimum sentences have not been something I have supported. I support the sanctuary.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now think about that. Think about it. If we disobey the law, we're punished. But Nancy Pelosi doesn't have to obey federal immigration law, and she's a member of Congress? Does that sound like justice to you?</p>                \n                \r\n\n            \n                <p>And what about Planned Parenthood? They receive a half billion dollars every year from the taxpayer. Now we know some of their operations are selling the body parts of aborted babies. There are laws against that -- federal laws.</p>                \n                \r\n\n            \n                <p>Is the FBI investigating Planned Parenthood? Has President Obama and Attorney-General Lynch ordered such an investigation? Not that we know of.</p>                \n                \r\n\n            \n                <p>Today yet another undercover vide video was released. This one showing a Planned Parenthood doctor, Savita Ginde, describing the harvesting of body parts taken from babies. Sometimes more than half way through their pregnancies.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> I don't know if I've ever seen a thymus, but maybe I have. I know I've seen livers. I've seen stomachs. I've seen plenty of neural tissue. Usually you can see the whole brain usually come out.</p>                \n                \r\n\n            \n                <p>You know, when you get to 17 or 18 weeks, because we do some of those, that's when you're doing more of the D&amp;E and you might get larger.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Tissues.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>Well, I know that putting it under the research gives us a little bit of -- a little overhang sort of over the whole thing.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> It makes it look better.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>Yes. And in public, I think it makes a lot more sense for it to be in the research vein than, I'd say, business venture.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> Right. It's how we talk about it.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> It's how we talk about it.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE: </b>\"We don't want to get called on\", you know, selling fetal parts across states.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE:</b> Neither do we.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, if that is not enough to make the Justice Department move and congress to immediately suspend payments to Planned Parenthood -- if that's not enough, then we don't have a justice system in this country any longer.</p>                \n                \r\n\n            \n                <p>The silence from the President and Attorney-General is insulting and dangerous. Are you people in Washington going to respect the law or not? Sanctuary cities, are you serious? They arrogantly disobey the law and get away with it. Trafficking in baby body parts on the taxpayer' dime? What kind of country is this?</p>                \n                \r\n\n            \n                <p>As I said earlier this week, there's a point when Americans have to decide how much corruption they can tolerate. All of us have to signal while changing lanes. Meantime, some politicians only uphold the laws they like. Disgraceful.</p>                \n                \r\n\n            \n                <p>And that's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: What happened to \"and justice for all\"?", "description": "Bill O'Reilly's Talking Points 7/30", "date": "2015-07-31T12:46:07Z"}