{"vcmId": "e8e8c918-2b9c-4f9b-b0db-981daedc853b", "url": "http://www.foxnews.com/transcript/2017/04/12/what-is-status-susan-rice-investigation.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 11, 2017. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p> <b>O'REILLY:</b> FACTOR \"Follow-Up\" segment tonight, what is the status of the Susan Rice investigation. You may remember last week, headlines were made by the former National Security advisor to President Obama when it was discovered that she was involved in NSA wiretap surveillance. Apparently, Miss Rice looked at some of the dispatches and allegedly unmasked some of the Americans involved which is not usually done.</p>                \n                \r\n\n            \n                <p> FOX News correspondent Adam Housley and Malia Zimmerman an investigative reporter for FOXNews.com have been working the story. They join us now from Los Angeles.</p>                \n                \r\n\n            \n                <p> So, Housley, where is the investigation as far as Congress is concerned stand right now?</p>                \n                \r\n\n            \n                <p> <b>ADAM HOUSLEY, FOX NEWS CORRESPONDENT</b>: We've been told Bill that members of the Intelligence Committee say the investigation is expanding right now. They say, they're looking into allegations for other Americans including politicians are possibly unmatched and had their information collected. The files similar to what they did with the Trump team, they're also not going on a record at this point, they say due to the fact this was an ongoing investigation. Also, they have their Easter break.</p>                \n                \r\n\n            \n                <p> Meantime, we've also been told the Senate is looking at doing the same thing and together they both tell me members of both committees that the information they continued to request from the Intelligence Agencies now for over a month has been very little given. They said the FBI is being very difficult. We're told they just want to know about the unmasking, how frequent was this, who is doing it, why were they being unmasked and basically as one said to me, they're going to have to turn everything over or we are not going to authorize the congressionally approved 702 program which allows him to do this in the first place.</p>                \n                \r\n\n            \n                <p> <b>O'REILLY:</b> Okay.</p>                \n                \r\n\n            \n                <p> <b>HOUSLEY:</b> So, this investigation Bill is full-blown.</p>                \n                \r\n\n            \n                <p> <b>O'REILLY:</b> Do we know Malia if the FBI because Comey was dancing around it when he was asked about it. Are they actively investigation the unmasking of Americans caught on taps?</p>                \n                \r\n\n            \n                <p> <b>MALIA ZIMMERMAN, FOXNEWS.COM INVESTIGATIVE REPORTER</b>: You know, there's a big question about the FBI's rule in this, and, you know, there is concerned in the House about just general how the FBI is handling the case. We spoke with some members of the House Intelligence Committee who said, they're very frustrated with the FBI, so I'm not sure how much active role in terms of what the FBI is actually investigating.</p>                \n                \r\n\n            \n                <p> <b>O'REILLY:</b> That don't even know -- do you know Housley if the FBI is involved with this? Are they investigating it or?</p>                \n                \r\n\n            \n                <p> <b>HOUSLEY:</b> You know, it's kind of -- I'm told it's a web, and that there are obviously multiple agencies involved here but they have to go to the FBI. You know, everything from the FISAs, to the reverse targeting. So yes, there is an FBI element here. The FBI, the NSA of course as well as --</p>                \n                \r\n\n            \n                <p> <b>O'REILLY:</b> Yes. But the NSA would be the agency to turn over the logs to the Senate and House Intelligence Committees.</p>                \n                \r\n\n            \n                <p> <b>HOUSLEY:</b> Right.</p>                \n                \r\n\n            \n                <p> <b>O'REILLY: </b>They're the ones that are doing the tapping and they are the ones that allegedly Susan Rice and others asked to see what they had come up with and then asked for Americans to be unmasked. So is it the NSA that's not cooperating with the Congressional Committees, Malia?</p>                \n                \r\n\n            \n                <p> <b>ZIMMERMAN</b>: It's actually both the NSA and the FBI. In fact, we were told that the FBI is much more difficult in terms of getting information. James Comey has not come back to the hill to be interviewed. Of course, he's the FBI director.</p>                \n                \r\n\n            \n                <p> <b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p> <b>ZIMMERMAN: </b>And also 100 questions that they're supposed to have answered haven't been answered and the FBI in their defense says, were preparing the information. We want to make sure it's accurate before we send it. But it's been four weeks though.<br> <b><br> O'REILLY: </b>Okay. Explained the 100 questions, Malia? What are the 100 questions? Who wrote the questions and where did they go?</p>                \n                \r\n\n            \n                <p> <b>ZIMMERMAN</b>: Sure. So, during the open house hearing, which was in March, around March, the third week of March. They had an open hearing on Capitol Hill and it was in the House Intelligence Committee and the House members asked James Comey as well as Admiral Rogers, whose the NSA director 100 questions that they did not answer. They said they couldn't answer it. And so they were supposed to go into closed sessions and actually answer these questions in private and not in front of the media, not in front of the public but that was never done. And James Comey has not come back to the hill. The 100 questions haven't been answered and so, they're still a great mystery in terms of what the answers are.</p>                \n                \r\n\n            \n                <p> <b>O'REILLY:</b> All right. You would think Adam that --</p>                \n                \r\n\n            \n                <p> <b>HOUSLEY</b>: Adding to Malia --</p>                \n                \r\n\n            \n                <p> <b>O'REILLY:</b> Go ahead.</p>                \n                \r\n\n            \n                <p> <b>HOUSLEY:</b> Yes. Adding to Malia. We also have people of both parties questions the FBI's actions here. And they're only getting little bits from.</p>                \n                \r\n\n            \n                <p> <b>O'REILLY:</b> Okay. But you got to get the Attorney General now involved, Jeff Sessions because he is calm his boss and he can say, look, you have to answer this and that and the other thing. But we don't know, the folks don't know much about this. This is why I'm doing this segment, a big deal last week, a lot of partisans stopped in there, and then boom, we don't know anything. So, in your investigation Adam, where are you? What are you looking at?</p>                \n                \r\n\n            \n                <p> <b>HOUSLEY: </b>Well, remember also when this came out, Bill, then you have the Syrian air strikes which of course took over the news cycle and then of course everything now is made political and in our case, you know, with our story, the idea here is to get it right. As you know, that's always been our goal in this. I have been doing this with you actually for five to 15 years.</p>                \n                \r\n\n            \n                <p> So our investigation to go through and get the information that we can get. Remind me, this is delicate information, sensitive information. A lot of it is classified which were not allowed to see. These are individuals that really have nothing to gain but everything to lose who were talking to. And so our number one priority is to get it right. And so far we have --</p>                \n                \r\n\n            \n                <p> <b>O'REILLY:</b> So what are you trying to get right though? What path do you want?</p>                \n                \r\n\n            \n                <p> <b>HOUSLEY: </b>We have the exact same questions at the committees have. I mean, what was being done here? Was this more than just the Trump transition team? Was it more than Susan Rice explained last week earlier in a CBS interview which didn't really seem to match? Was -- were other people caught up in this? You know --</p>                \n                \r\n\n            \n                <p> <b>O'REILLY</b>: Are you making any progress? Are you making any progress, you're getting any stuff?</p>                \n                \r\n\n            \n                <p> <b>HOUSLEY: </b>We're absolutely making progress, but it's because of the sensitive nature of so many classifications.</p>                \n                \r\n\n            \n                <p> <b>O'REILLY:</b> No, you know --</p>                \n                \r\n\n            \n                <p> <b>HOUSLEY:</b> And also the classifications, Bill. It's not like, you know, some stories you can go right after because there's no classified information here.</p>                \n                \r\n\n            \n                <p> <b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p> <b>HOUSLEY:</b> You just have to find people and get the information out of them.</p>                \n                \r\n\n            \n                <p> <b>O'REILLY:</b> Right.<br> <b><br> HOUSLEY</b>: Now, you have to find the people, get the information out of them that you can get in the right and safe and honest and at the same time --<br> <b><br> O'REILLY</b>: It is tough -- Malia, last question.<br> <b><br> HOUSLEY:</b> It is.</p>                \n                \r\n\n            \n                <p> <b>O'REILLY: </b>Do you expect the whistleblower to come forth because that would break the case wide open. Do you expect that to happen?</p>                \n                \r\n\n            \n                <p> <b>ZIMMERMAN</b>: That would. In fact, when we talked with the House Intelligence Committee, they said they're hoping that some of these people who have talked with Adam and I would come forward and mention what they've told us, some of the things that were working on and that we are investigating will often tell the House Intelligence Committee because that would really start to expand its investigation even further.</p>                \n                \r\n\n            \n                <p> <b>O'REILLY:</b> You need some contacts and all of that. So, we'll see.</p>                \n                \r\n\n            \n                <p> <b>ZIMMERMAN:</b> It's difficult though Bill, because they have, you know, they're all in their jobs right now. They'll have jobs in this industry.</p>                \n                \r\n\n            \n                <p> <b>O'REILLY</b>: Yes. But remember, the Trump administration is sympathetic to this investigation.</p>                \n                \r\n\n            \n                <p> <b>HOUSLEY</b>: And that's why they are more interested --</p>                \n                \r\n\n            \n                <p> <b>O'REILLY</b>: Yes. For political reasons of course.</p>                \n                \r\n\n            \n                <p> <b>ZIMMERMAN:</b> Yes. Yes.</p>                \n                \r\n\n            \n                <p> <b>O'REILLY</b>: All right. Keep us posted, guys. We appreciate it.</p>                \n                \r\n\n            \n                <p> <br> <i>Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "What is the status of the Susan Rice investigation?", "description": "'The O'Reilly Factor' examines the surveillance controversy latest ", "date": "2017-04-12T12:47:00Z"}