{"vcmId": "e97413c7-b45e-4228-b17a-480100cb2a2e", "url": "http://www.foxnews.com/transcript/2016/04/08/ted-cruz-on-new-york-primary.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 7, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>Now for the top story tonight, Senator Cruz already on the job, he joins us from Brooklyn. So, am I making any mistakes in my analysis, Senator?</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Well, Bill, you know, I think people across New York and across the country know exactly what New York values means and those are the values of Liberal Democratic politicians who have been hammering this state. You know, I have been campaigning across New York and people are stopping me literally every day and say, I know exactly what you meant, and I'm fed up with what these Liberal Democrats are doing to us, the people of New York. They are the ones suffering for it. And as you noted, Donald Trump has been funding it year after year after year.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But not as a politician. You know, you and I because, you know, because I gave Trump some advice when he comes on here although I guess he is mad at me now. I'm not sure. But I will give you a little advice. Do you know what you should do? Hold a press conference in Penn Station. Hold a press conference in Penn Station. Take a look at what's happened to that place under the uber-liberal Mayor Bill de Blasio. But --</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Uh-hm.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The perception of New Yorkers and almost 10,000 people showed up to hear Trump speak at Bethpage on Long Island.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Perception is, you are a Texas guy, you are a Bible belt guy, you don't understand us up here. You know, that's what is going around.</p>                \n                \r\n\n            \n                <p><b>CRUZ: </b>Let me tell you. Yesterday I was in the Bronx and I had a meeting with Hispanic and African-American pastors who were -- it was a tremendous gathering and it was interesting. It was hosted by a democratic state senator named Reuben Diaz. He is an elected Democrat representing the Bronx and the New York State Senate. And he brought up New York values. He said you know what? I know exactly what you meant by that and he brought up that Andrew Cuomo, the governor said if you are pro-life, if you support traditional marriage, if you believe in the Second Amendment, there is no place for you in New York state. And Senator Diaz, a Democrat, he said I'm a democrat but my Democratic governor said there is no place for me as a pastor. That's the sort of liberal intolerance.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. But Trump doesn't subscribe to any of that.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Of course he does, he funded it.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You can have two lives.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: But no, Bill, Bill --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> He wrote two checks to Hillary Clinton's presidential campaign. He didn't have to do that to build -- to do any real estate. He did that --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Why do you think that you know how to play the game here? Look, I want to tell you this --</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> No, that's not true. I know lots of businessmen who have never given a check to Hillary Clinton.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You are more conservative than Trump.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Bill, it's actually -- Bill, it's actually not a question of being more conservative or not. If you are fed up with the corruption of Washington --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> Donald Trump and Hillary Clinton are flip sides of the same coin. Hillary Clinton has made millions of dollars selling power and access in Washington and Donald Trump has made billions of dollars buying power and access in Washington, buying people like Hillary Clinton.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But he did it as a businessman. He did it as a businessman.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: But he is part of the corruption. He is part of the corruption.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: He has funded open border Democrats for 40 years. And the people of New York are hurting. You know, you want to see what New York values look like? Look at Mayor Bill de Blasio, a Liberal Democrat. That politician right after he got elected one of the first things he did is he tried to shut down charter schools in Harlem. Tried to throw young African-American and Hispanic kids out of schools that were giving them hope because is he so much in hock to the union bosses and teachers.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But you are running against Trump. You're running against Trump. And that's what I want to get back to.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> But Trump is responsible for the policies he supported.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm not buying that. You and Kasich have got to.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: I know. You defend him a lot, Bill. That's your prerogative.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I defend him when -- I defend him on points that I think are valid, but I go after him and that's why he is not on the program because he is mad at me. All right? But --</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: He is terrified to debate. As you know I invited him to debate on your show and --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He doesn't want to do that.</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> And he is terrified to debate.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't know if he is terrified.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Because he doesn't have any real solutions. He doesn't have any real answers.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. You and Kasich have got to keep him under 50 percent. Okay? If you do, then you both pick up some delegates, if you don't, if you don't do, he gets the whole deal. So, he is going to go, he is going to go wild, he's going to do what he's doing, lying Ted. I don't know what he calls Kasich this week but he'll figure out a name. And I'm just wondering what your positive message is to New Yorkers, I mean, what are you selling us? What are you selling us?</p>                \n                \r\n\n            \n                <p><b>CRUZ:</b> So, we just did a rally that had thousands of people standing in line and my positive message, the exact same thing I focused on every day in Wisconsin. And we won a landslide in Wisconsin.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. What is that?</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: It is three things. It is jobs, freedom and security. My number one priority as president is bringing jobs back to America.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Now, in New York --</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: If I'm elected president, we will repeal ObamaCare.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We know all of that. But in New York, specifically, you got a governor who is not going to frack, okay, if you fracked, you would help Upstate New York like crazy. You as president --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>Yes. But you're not going to force Cuomo to frack. You see, I don't know how you are going to bring jobs to New York specifically. I have got 30 seconds.</p>                \n                \r\n\n            \n                <p><b>CRUZ</b>: Let me answer you, Bill. You bring jobs to New York by repealing Obamacare, by passing a flat tax, by abolishing the IRS. By reigning in the ETA and federal regulators. By stopping amnesty and ending sanctuary cities and we will see millions of high paying jobs. We will see wages rising and we'll see young people coming out of school with opportunity and with three, four, five job offers again. That's what this election is about. Jobs and raising wages for working Americans who corrupt Washington has been leading behind.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So if you do the press conference in Penn Station, I will go, I want to see that. Is that place is unbelievable. It's like New Delhi, India. That's what it looks like now.</p>                \n                \r\n\n            \n                <p>All right. Senator, we always appreciate you coming on.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Ted Cruz on the New York primary", "description": "GOP candidate joins 'The O'Reilly Factor' to discuss his campaign ahead of the Empire State contest", "date": "2016-04-08T12:52:46Z"}