{"vcmId": "e99b0c45-c320-43aa-8d8e-8d32c94994d2", "url": "http://www.foxnews.com/transcript/2014/11/19/bill-oreilly-obamacare-controversy-grows.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>As you may know, MIT Professor Dr. Jonathan Gruber had said some very interesting things about the Affordable Healthcare law. Let's run them down. Dr. Gruber says in order to pay for Obamacare you have to impose a new tax on Americans. He also says the Obama administration did not want to admit additional taxation was necessary, so it hid that part of the equation. The doctor opines there was little transparency in the run up to the vote of Obamacare. And then the MIT professor really lit the fuse saying that Americans are generally too stupid to figure out what the Obamacare situation really is. So I'll let you decide on the credibility of the last statement.</p>                \n                \r\n\n            \n                <p>Now \"Talking Points\" applauds Dr. Gruber for telling the truth apart from the stupid stuff. But I also believe he was an active participant in a big con. So, on the one hand he is truthful. On the other hand he is deceptive.</p>                \n                \r\n\n            \n                <p>When Dr. Gruber appeared on &#8216;The Factor&#8217; last year he was honest.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>JONATHAN GRUBER, PH.D., MIT ECONOMICS PROFESSOR: </b>There is no doubt there is large income redistribution in this law, Bill, and you can like it or not. And that's a debate for another day.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, there was also a large distribution of taxpayer money to Dr. Gruber -- about $6 million bucks in consulting fees. So self- interest motivated the doctor to keep quiet when he heard this.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BARACK OBAMA, PRESIDENT OF THE UNITED STATES:</b> No matter how we reform healthcare I intend to keep this promise. If you like your doctor, you will be able to keep your doctor. If you like your healthcare plan, you will be able to keep your healthcare plan.</p>                \n                \r\n\n            \n                <p>Coupled with comprehensive reform this could result in our nation saving over $2 trillion over the next 10 years and that could save families $2,500 in the coming years -- $2,500 per family.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What the President did there with the $2,500 stat was compare the average cost of health insurance now today to what it might have been years from now with no Obamacare. What it might have been. That's called comparing apples to mythology.</p>                \n                \r\n\n            \n                <p>The cold truth is most working Americans are paying more for health insurance under Obamacare while millions of other Americans are getting free health insurance. That's the way quasi-socialistic programs work.</p>                \n                \r\n\n            \n                <p>There is no question this whole Gruber deal has been a major embarrassment for President Obama and the folks are backing away from the Affordable Healthcare law. According to a recent Gallup poll only 37 percent currently like it. If the Republicans manage to elect a president in 2016 Obamacare likely to be repealed. But even before that, \"Talking Points\" believes the Supreme Court will strike down major parts of the law. And part of the reason I believe that is because Dr. Gruber has exposed what some judges might consider to be fraud. Believe me, the Supreme Court is taking notes.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The ObamaCare controversy grows", "description": "Talking Points 11/18", "date": "2014-11-19T13:14:09Z"}