{"vcmId": "ea9e3b86-dd91-4bd1-9fde-f1f44a30c3cc", "url": "http://www.foxnews.com/transcript/2016/06/01/political-chaos-in-california-continues.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" May 31, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Campaign 2016\" segment tonight, the political chaos in California continues. Polling has Bernie Sanders and Hillary Clinton now tied. In their primary competition, the vote will be held a week from today. But even worse, loony protesters continue to disrupt political rallies.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>(SHOUTING)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: Step away right there. Right there.</p>                \n                \r\n\n            \n                <p><b>(SHOUTING) (CROWD BOOING) (CHANTING BERNIE! BERNIE! BERNIE!)</b></p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And those were animal rights activists trying to prevent Senator Sanders from giving his speech.</p>                \n                \r\n\n            \n                <p>Joining us from Austin, Texas, Karl Rove.</p>                \n                \r\n\n            \n                <p>All right, so, Hillary and Bernie tied in California, but we all know that Hillary has it locked down. So does the California vote in the other primaries next Tuesday matter?</p>                \n                \r\n\n            \n                <p><b>KARL ROVE, FOX SENIOR ADVISOR TO PRES. GEORGE W. BUSH</b>: Well, it does. Look, she is 71 delegates away from having a majority of those who are attending the convention in July in Philadelphia. But, and there are 950 delegates to be selected in the primaries next Tuesday and then --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes, so she wins.</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: June 14th. So she wins. But it would be a terrible black eye for her to come out of the biggest, most important delegates to the Democratic National Convention, California, with a loss. Particularly when she was leading by such a margin before.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But what does that matter though? Yes, it's a black eye. It's embarrassment. So what. Does it matter?</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: Well, yes, it does. Because it emboldens Bernie Sanders to go forward to the convention.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: To do what?</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: Well, look, here's my theory. And I wrote about this in the \"Wall Street Journal\" column last week. It's not what -- I used to think, what does Bernie want? I don't think that's the case any longer. I think, what does Bernie want to ask for that he knows he is going to get? I think he wants to create a political movement that lasts well beyond this election in order to draw the Democratic Party further left.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But he has already done that.</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: Well, but he has had great success at it so why not keep at it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> He has already done it and I think he wants to do more of it. That's why he is doing things like endorsing Democrats in contested primaries. That's why he is talking about a platform where he is going to have a bunch of fights set up that he is not going to win so that he can sort of create some resentment and some targets for future campaigns and future --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. What you are saying is in a fairly verbose way is that it really doesn't matter. All of this is just show but there could be images at stake for both Bernie and Hillary. See, for me, I just think it's just boring now. She has got it. I know everybody has to vote. But, it doesn't matter. The fix is in. I think these super delegates are corrupt. I think Bernie Sanders might have beat her without the super delegates. And if I were Bernie Sanders, I would be furious.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Well, and, look, that's one of the demands that I think is he going to make and the Democrats are going to turn him down and that creates resentment.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Whether he wins or loses it doesn't matter whether he wins or loses.</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: Well, it means more if he has won California and gives him more moral authority to make these challenges. They will turn him down all the same.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Moral authority.</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: But over the long haul it will be helpful to his cause.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. I have got to get to this. Glenn Beck has been suspended by Sirius Radio. They are not going to run his radio program for a while. Because he had a conversation with the \"Thriller\" writer, the novelist Brad Thor. And in that conversation Thor talked about a possible assassination. Roll the tape.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BRAD THOR, NOVELIST</b>: With the feckless, spineless congress we have, who will stand in the way of Donald Trump overstepping his constitutional authority as president? If Congress won't remove him from office, what patriot will step up and do that if, if he oversteps his mandate as president, his constitutional granted authority, I should say as president?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, anyway, this is pretty startling. Beck is a pretty big guy. And Beck didn't say it, but he engaged in this hypothetical and now he is off the air at Sirius. What do you say?</p>                \n                \r\n\n            \n                <p><b>KARL ROVE, FOX NEWS CONTRIBUTOR</b>: Well, Thor shouldn't have said it. He is a good man, but he shouldn't have said that that's way over the bounds. That is really reprehensible and Glenn should have, in my opinion, told him so at the time. But I mean, it's a sign of how heated the emotions are in this campaign and I'm sorry to see it happen.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes. You know, both sides, too. We just showed you the crazy animal activists trying to shout down Sanders. And now, you know, I agree Thor is a good guy and he writes really good books. You can't do that. You just can't.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> No.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Because that insights violence in the minds of some crazy people. Believe me, I know about it, right in Killing Reagan with Hinckley. I know how these people get incited. And you have got to be very careful.</p>                \n                \r\n\n            \n                <p>All right. Mr. Rove, we appreciate it very much. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Political chaos in California continues", "description": "Karl Rove joins 'The O'Reilly Factor' to discuss the Hillary Clinton and Bernie Sanders polling in the key primary state", "date": "2016-06-01T12:22:43Z"}