{"vcmId": "eaac8598-d9a5-4922-b024-b5810c8e365b", "url": "http://www.foxnews.com/transcript/2015/06/16/race-and-violent-crime-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 15, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Unresolved Problem Segment\" tonight, violent crime committed by black Americans.</p>                \n                \r\n\n            \n                <p>According to the FBI in 2013, the last stats available African- Americans committed almost 54 percent of all murders in the U.S.A. when race is cited in the police report. As you may know African-Americans account for 13 percent of the population. So you can see the murder stats are way out of proportion.</p>                \n                \r\n\n            \n                <p>Enter the president of the New York Civil Rights Coalition Mike Meyers who blames me and other Fox News anchors for demonizing black Americans. Mr. Meyers writing quote, \"if truth be told crime is an individual act. It's an individual thing. Crime is not a racial group or a skin color. In this regard there is no such thing as the black male much less a black male problem in America any more than there is or once was an Italian male problem or an Irish male problem.\"</p>                \n                \r\n\n            \n                <p>Mr. Meyers is making a fundamental mistake, I believe. There are problems with certain groups. For example, Muslim extremists can only be neutralized by law-abiding Muslims. The jihad is solely embedded in the Muslim community around the world.</p>                \n                \r\n\n            \n                <p>The Italian Mafia was rightly defined as an ethnic problem, so much so that Pope Francis recently excommunicated Italian organized crime members as a group.</p>                \n                \r\n\n            \n                <p>Finally IRA terrorists were only stopped when Irish women demanded the violence cease.</p>                \n                \r\n\n            \n                <p>Those are historical facts.</p>                \n                \r\n\n            \n                <p>With us now is Mike Meyers. You know we love you but you are wrong on this. You have to look at the statistics about people committing antisocial act and find out, all right, where these acts are occurring and why they are occurring.</p>                \n                \r\n\n            \n                <p><b>MICHAEL MEYERS, NEW YORK CIVIL RIGHTS COALITION:</b> Is it my turn now?</p>                \n                \r\n\n            \n                <p>Look, statistics aside, we know that crime has been out-of-control in America. The majority of crimes in America are committed by white people, not black people.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's because of the population base.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>Let me talk.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Population base.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>Let me talk. You have a situation where you and others on Fox News keep talking about black on black violence. The problem with black on black violence is racial rhetoric. Black people are not going after black people because they are black. They are \"killing each other\", quote/unquote, because they live in the same segregated neighborhoods. White people by and large are killing white people. I think that Fox and others they have got to stop the racial agenda.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. I'm not going to disagree that it's a geographical convenient --</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> It's segregation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Segregation --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's segregation by choice.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>No it's not. History speaks --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You live in an integrated neighborhood.</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> Let me speak. Let me speak. Let me speak.</p>                \n                \r\n\n            \n                <p>History speaks that everybody doesn't have a choice of neighborhoods. Blacks by and large have been confined to certain neighborhoods.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They can live where they want.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>They don't and they cannot live where they want.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure they can.</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> If you read and look at the attorney general's report he will tell you about the dual housing market in New York state.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You can't live where you want?</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>Thank goodness I can.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. And so can African-Americans.</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> I can't live where Hillary lives.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, because you are not as economically successful as she is.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>But there are blacks who are economically set --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And they can live up there.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>They can't live in certain residential neighborhood because of prejudice and discrimination.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> It's against the law.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>Of course, it's against the law. So is racial profiling by people like you who still believe in it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I don't believe in racial profiling.</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> You said earlier that quote/unquote any number blacks are killing white police officers --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Six times.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>-- then the police officers should be able to profile.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I said they are going to be a little more wary.</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> That's not the constitution.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It's human nature.</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> You know what Barbara Jordan said, I agree with Barbara Jordan -- the former congressman. She said my faith in the constitution is whole, it's total and complete. Every community in America, not based on their race, every community in America is entitled to equal protection of the law. Every resident is entitled to protection from criminals of any color.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's right.</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> So we in the so-called black community, I don't live in a black community. I don't live in a white community. I live in an American community. I live in New York City. Every community has to be open to everybody.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The only way --</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>And I say I don't care what color you are. Thugs are thugs and we need equal protection of the law from thugs.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And I don't disagree with that.</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> I know you don't.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But human nature dictates --</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>Don't talk about black-on-black violence.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>-- that you're going to be more cautious when you go into a dangerous area than if you go into --</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>So I could be -- if I walk into Italian neighborhood according to you?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Let's get to the crux of the matter. The black crime problem, all right, which exists, all right, is never going to be solved by white people. It has to be solved through peer pressure by other black people. Just as the jihadist will be solved by Muslims.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>That is nonsensical.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, it's true.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>That's not --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>It's true.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>May I? May I answer your point?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Go ahead.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>Look law enforcement has to be effective in every community. You can't have -- no black family is any more effective or less effective than a white family in terms of controlling their children.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's not true. You know that's not true.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>I know it's true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Come on.</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> I know it's true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You're telling me that a prep school high school teacher has the same problem that an inner city black teacher has?</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>I told you earlier that the majority of crimes committed in America are white.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>That's because the population base is so big.</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> Let me tell you something. When you had that black academic who started talking about white males, remember that, as a problem population in America you jumped down her throat and other jumped down her throat. Because she was stereotyping and exaggerating about white people. There is no thing as the white man. There is no such thing as the white man. And there's no such thing as the black male. Just like there's no such thing as the negro.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'll give you the last word in a minute. Organized crime in America was smashed by Robert Kennedy if you remember as attorney general because he targeted Italian crime families and they broke them. Last word.</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> And did every Italian family get consigned to the stigma of being Mafia folks? Of course not.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Nobody is consigning anybody to anything.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>You are portraying black men as society's moral monsters -- quit it, quit it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. I'm not doing that.</p>                \n                \r\n\n            \n                <p><b>MEYERS: </b>Quit it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And I'm going to continue to report the truth, Mr. Meyers. And we appreciate you coming on in.</p>                \n                \r\n\n            \n                <p><b>MEYERS:</b> According to you in the No Spin Zone.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> According to the FBI.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Race and violent crime in America", "description": "Civil Rights leader Michael Meyers on criminality and the African American community", "date": "2015-06-16T12:25:30Z"}