{"vcmId": "eb46d365-25c5-467d-ae90-0ce8ca165dbb", "url": "http://www.foxnews.com/transcript/2015/08/07/trump-and-bush-strengths-and-weaknesses.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 6, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>BILL O'REILLY, FOX NEWS HOST:</b> Hi, I'm Bill O'Reilly reporting from Boston tonight. Thanks for watching us.</p>                \n                \r\n\n            \n                <p>The debate less than an hour away. Ten Republicans slugging it out, trying to get your attention. But who are these guys, really? Some polls show the majority of Americans have no idea what they have done or what they have failed to do.</p>                \n                \r\n\n            \n                <p>So on The Factor tonight, we are going to discuss each of the candidates and evaluate their strengths and weaknesses. We'll have one guest for each man and that guest has no vested interest in helping or hurting the contender. Just the facts.</p>                \n                \r\n\n            \n                <p>We begin with a man who is leading the Republican polls, Donald Trump. With us now here in Boston James Pindell, reporter for \"The Globe\" and knows Mr. Trump very well. How do you know him, by the way?</p>                \n                \r\n\n            \n                <p><b>JAMES PINDELL, \"THE BOSTON GLOBE\": </b>We have been covering him a lot. He has been up here in New Hampshire a lot over the years, as you know, obviously thinking about running for president. This time he has been doing it I have been with him every single trip.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Before he got into politics, did you know him? Did you know what kind of guy he is?</p>                \n                \r\n\n            \n                <p><b>PINDELL:</b> No, but apparently you know him pretty well.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I do. I know him. But, you know, it's your opinion that matters tonight.</p>                \n                \r\n\n            \n                <p>He has surged in the polls, why?</p>                \n                \r\n\n            \n                <p><b>PINDELL:</b> Look, you can dismiss him and people can call him a clown and all of that but you cannot dismiss the message. The message is what is driving this. And his supporters say as you have heard time and time again that they're upset with the Republican Party as much as they are upset with the Democratic Party. He is a giant middle finger to the American political elite and people love that about him.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. So he is trashing the system. But not speaking specifically. Would you agree with that?</p>                \n                \r\n\n            \n                <p><b>PINDELL: </b>Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So when you see him go to New Hampshire and talk to the folks, do the folks care that he is not speaking specifically?</p>                \n                \r\n\n            \n                <p><b>PINDELL:</b> Not yet. But they are going to. And that's why I think this debate matters.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Why do you say that? Why do you say they are going to? If it's not yet, if his general message that these are all pinheads, they are all talk, they don't do anything, but if you elect me, I will, why would he have to get more specific?</p>                \n                \r\n\n            \n                <p><b>PINDELL:</b> We are in the beginning of the introduction phase, which is where we are at in this campaign. And then we are going to get to the more serious phase. That's where Donald Trump is going to have to transition if he wants to remain this frontrunner.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What about the -- and Carly Fiorina who I think won the early debate today pretty decisively. She was relaxed. She was cogent. Right to the point. Looked authoritative. I think by far she won the debate.</p>                \n                \r\n\n            \n                <p>But she went after Trump on saying, look, this is a guy who supported Democrats, who changed his positions on key issues like abortion. Do you think that will matter or is it just right now it's Trump's time, he has tapped into the anti-political feeling, will any of the history matter?</p>                \n                \r\n\n            \n                <p><b>PINDELL:</b> Look. The McCain comment was supposed to matter.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I thought that would hurt him.</p>                \n                \r\n\n            \n                <p><b>PINDELL: </b>The Mexicans comment was supposed to matter. None of these things have been -- Donald Trump has been this anomaly when it comes to their normal political rules. But clearly as we head down to -- we get closer and closer to this campaign as candidates begin attack him. We will be seeing how he handles these attacks.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes. I mean he will handle it like he always handles it. He'll go right back and call them pinheads. I mean he's not going to change that. But it will be interesting to see if the voters even care about the history of it because you know it's going to come up tonight with Miss Fiorina doing that today.</p>                \n                \r\n\n            \n                <p>Everybody watched that early debate. All the candidates did. They saw it. So I expect that to come up.</p>                \n                \r\n\n            \n                <p>Do you feel that Trump is viable through the entire process an opinion question, yes or no?</p>                \n                \r\n\n            \n                <p><b>PINDELL:</b> Maybe.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No. Come on.</p>                \n                \r\n\n            \n                <p><b>PINDELL:</b> No, seriously. I mean it's all up to Donald Trump right now --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well.</p>                \n                \r\n\n            \n                <p><b>PINDELL:</b> -- which is really -- no that's not a well. I mean I'm not sure Jeb Bush controls his destiny. I'm not sure that a lot of these candidates on this stage control their destiny. Right now Donald Trump definitely controls his destiny. Each week that goes by he is constantly going up in the polls and he is probably the only person right now who can take himself out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Mr. Pindell thanks very much. We appreciate it.</p>                \n                \r\n\n            \n                <p>Now let's go to our nation's capital where Ed O'Keefe is standing by. He is covering Jeb Bush for \"The Washington Post\".</p>                \n                \r\n\n            \n                <p>Now so far Governor Bush has not ignited the polls, Mr. O'Keefe, especially with his name recognition, why not?</p>                \n                \r\n\n            \n                <p><b>ED O'KEEFE, \"WASHINGTON POST\": </b>I think he is having some trouble still explaining himself to Republican voters. They are certainly very familiar with his name. He has raised more money than any other Republican in the field. But he's struggling to remind them that back in the day he was the two term conservative governor of Florida. That he is not his brother. And that he, more than any of these other guys in the field, is qualified to be president.</p>                \n                \r\n\n            \n                <p>Part of it is, you know, he prefers this sort of wonky, nuanced approach to campaigning, which is appreciated by people who see him in these small settings in New Hampshire, or Iowa, or elsewhere. But I think there is a difficulty still in transcending that and getting it through television across social media and really making people think maybe this is the guy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: But here's the problem. When you have the whole thing thrown off by Donald Trump's flamboyance, Jeb Bush next to that almost disappears. Look. The governor did a good job in Florida, Governor Bush. There is no doubt he did a good job -- overall.</p>                \n                \r\n\n            \n                <p><b>O'KEEFE:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: If you are conservative maybe you don't like common core. But overall, the state prospered under his domain. He is smart. He knows the system. All of that.</p>                \n                \r\n\n            \n                <p>But Trump blows him away because Jeb Bush doesn't seem to have an essential message to me. Have you picked up an essential message from Mr. Bush?</p>                \n                \r\n\n            \n                <p><b>O'KEEFE:</b> I think that the central message is that he is the steady, the experienced, mature, you know, ready to go guy.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, no, no. That's not what I mean. What is his message for the voter. Vote for me, why?</p>                \n                \r\n\n            \n                <p><b>O'KEEFE:</b> Because is he a conservative who has worked with Democrats who understands that the nation's demographics are changing. They may not be but that is his message right now.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Not going to be enough. The anger is so intense on both sides, both parties are furious and that's what Barack Obama has done. He's polarized the country. That it's not going to be enough vote for me and I will set you free. From what?</p>                \n                \r\n\n            \n                <p>Whereas Trump is running around going, look, I'm going to just blow the whole thing up. Bush is basically saying I'm going to keep it the way it is but I will be smarter. Am I unfair in saying that?</p>                \n                \r\n\n            \n                <p><b>O'KEEFE:</b> No, I think that's absolutely what he is trying to do. And I think he is expecting that at some point Trump is going to self-destruct. The problem is it's gone on a lot longer than I think several anticipated. We'll see how tonight goes. You know, they will be standing right next to each other.</p>                \n                \r\n\n            \n                <p>There had been reports today that Bush had perhaps said some untoward things about Mr. Trump at some point. You wonder if Mr. Trump will use that as an excuse to go after Bush. And certainly all the others on stage want to do it as well. But remember this is a guy that still has --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't know if they want to take up their air time with attacking Trump. But I have never known Jeb Bush and I don't know him that well but I do know him a little bit to be a guy who wants confrontation. He doesn't like confrontation. I don't expect him to go after Trump tonight. I could be wrong and that might be the best thing for him to do is go after Trump. I don't know, it's not his style.</p>                \n                \r\n\n            \n                <p><b>O'KEEFE:</b> It isn't. It isn't. So that's why, you know, standing here tonight will be very interesting. He hasn't stood on a debate stage since October 22nd, 2002. To say that this guy is not familiar with sort of the current rough and tumble of televised politics, he think, is accurate. And it will be very interesting to see how he handles this tonight.</p>                \n                \r\n\n            \n                <p>But look he still has $120 million to his name in various ways. That money will start to get spent in the coming weeks. He will be standing there if Trump implodes and still remains number two, number three in some polling. And they believe that ultimately they can prevail.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. It's a long game with him. But if he doesn't do well tonight or at least hold his own --</p>                \n                \r\n\n            \n                <p><b>O'KEEFE:</b> He's in big trouble.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- it's going to hurt him dramatically in my opinion.</p>                \n                \r\n\n            \n                <p>Ok. Mr. O'Keefe thanks very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Trump And Bush: Strengths and weaknesses", "description": "Analyzing Donald Trump and Jeb Bush’s bid for the Whitehouse", "date": "2015-08-07T12:18:10Z"}