{"vcmId": "ee44c962-21bf-4d8e-8e2f-cad3b6f9bc71", "url": "http://www.foxnews.com/transcript/2016/11/07/sarah-palin-if-trump-wins-america-wins.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 6, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Right now she's being protected by a rigged system. It's a totally rigged system, I've been saying it for a long time. You can't review 650,000 new e-mails in eight days. You can't do it, folks. Hillary Clinton is guilty, she knows it, the FBI knows it, the people know it, and now it's up to the American people to deliver justice at the ballot box on November 8th.</p>                \n                \r\n\n            \n                <p><b>(END VIDEOTAPE)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Donald Trump speaking in Michigan this evening, just wrapped up a few minutes ago and a personal story segment tonight we're pleased to have Sarah Palin, as everybody knows she's the vice president, 2008 and she's also is in Michigan, Detroit where she is working for Trump. Do you have a prediction for us on Tuesday, governor?</p>                \n                \r\n\n            \n                <p><b>SARAH PALIN, FORMER VICE PRESIDENTIAL NOMINEE: </b>Well, if Trump wins, then America wins. And I heard you speaking with guests earlier asking if the Trump momentum had stopped and I'm thinking you are not in Michigan then because they are hot, hot, hot for Trump. And they -- they here desiring so much to be that comeback state, they understand that it is someone from the private sector, who needs to get in there and shrink government and allow industry to really get revved up again and that is what the Michigan folks are looking for.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And the polls say Clinton is up by five but he's given a big shot and remember, I remember interviewing you eight years ago and you wanted to campaign in Michigan but the McCain people said you could not and of course, the state went to Barrack Obama. Do you feel, and are you willing to make a prediction that Trump will carry Michigan this time around?</p>                \n                \r\n\n            \n                <p><b>PALIN</b>: There is no reason why he wouldn't, there are these Reagan democrats here, these blue-collar hard-working Americans and maybe registered democrat but they so want the positive change for their businesses, for that industry to be ushered in and you know, speaking to people all day today, there is so much enthusiasm for that positive change. So hail the polls, like I said before, Bill, polls are only good for strippers and cross country skiers. What matters of course, is two days from now the getting out the vote effort, making sure these Reagan democrats in Michigan.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Are you going to stay --</p>                \n                \r\n\n            \n                <p><b>PALIN: </b>.folks and republicans get out there and cast their votes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Are you going to stay in Michigan to get out the vote there? Is that your assignment?</p>                \n                \r\n\n            \n                <p><b>PALIN:</b> I think my assignment is, I move to another locale tomorrow for a couple of events and I don't know, I don't know all of that inside baseball stuff.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, you got to know where you are going?</p>                \n                \r\n\n            \n                <p><b>PALIN</b>: No, bill, believe it or not, you don't know where you are going sometimes. You just, you go where --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Where they suggest you go, well, all right you are a good soldier for them.</p>                \n                \r\n\n            \n                <p><b>PALIN</b>: .or you go rogue.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now think back two years ago. 48 hours from the vote, did you think you and senator McCain would win?</p>                \n                \r\n\n            \n                <p><b>PALIN:</b> Well, I did because I'm the -- I'm always optimistic but I remember two days out because I was sneaking phone calls out to conservative media markets, to you, to Hannity, because you know, some of the campaign folks were thinking that we need to really concentrate on trying to shore up some -- of a liberal vote, bring it on in and we haven't spoken a whole lot to conservative outlets and I remember sneaking phone calls to you guys from a bus.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I don't really -- I'm trying to think. We had you on a number of times, you know, like this, a straight interview, a play, I don't know whether I -- yes, I think I do remember a phone call, you called me at like 3:00 in the morning or something.</p>                \n                \r\n\n            \n                <p><b>PALIN</b>: Probably.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: To wake me up.</p>                \n                \r\n\n            \n                <p><b>PALIN:</b> Get your butt up and work.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes but this one, with Trump, he's running a little bit ahead of what you guys were running but he's still behind, you know, according to polls. Are you saying you don't believe the polls? You don't think they are accurate and, if so, why?</p>                \n                \r\n\n            \n                <p><b>PALIN</b>: Well, it depends on who the pollster is of course but the connections that the pollster has to --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The average is about 2 percent.</p>                \n                \r\n\n            \n                <p><b>PALIN</b>: No, no, I just don't put a whole lot of faith in polls two days out, so many things change. Historically, we've seen changes take place in a lot of elections at the last minute and I think people are so ready for change that they know to fix the corruption that is so rampant in our federal government, you don't elect those who did the corrupting and we have such a clear choice in this election. Someone who has been part of the problem or someone who is bound and determined to work with us to fix the problem.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Do you know Hillary Clinton well? Have you spoken with her?</p>                \n                \r\n\n            \n                <p><b>PALIN</b>: I have spoken with her husband. I have not spoken with Hillary.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You have never spoken to Hillary Clinton?</p>                \n                \r\n\n            \n                <p><b>PALIN</b>: I think I would remember if I did.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay, the gender gap is going toward her on the female side. The male side overwhelmingly for Donald Trump. Why?</p>                \n                \r\n\n            \n                <p><b>PALIN:</b> Well, I would hope that women aren't buying into that shtick that's going on right now, little bit of that hey, vote for me just because I'm a gal and we've -- we've learned before to not base a vote based on, you know, gender or any kind of difference but really on what that person stands for and no, I think the women of America, they too, are wanting a cleaned up government just as much as the men are. Gender isn't an issue.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, again, the polling doesn't show that if Hillary Clinton doesn't win the -- the women by 55 percent -- do you admire the fact that Hillary Clinton is running for president at all? Do you have any admiration for her?</p>                \n                \r\n\n            \n                <p><b>PALIN</b>: I have admiration for anyone who has that tenacity, that drive to get out there and offer themselves up in the name of service to the American people but no, not when it comes to Hillary specifically, no.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You think she's a corrupt woman?</p>                \n                \r\n\n            \n                <p><b>PALIN</b>: Yes, in a lot of ways, she is.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So you agree with Donald Trump when he says crooked Hillary and she should be in jail and you agree with all of that, that she isn't an honest individual?</p>                \n                \r\n\n            \n                <p><b>PALIN:</b> You know, you know, two days out, Bill, I'm not here to indict Hillary Clinton, she's going to do that herself and I believe that many more things that will come to light, people are going to realize that, no, she shouldn't be our leader.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So you believe that come Election Day, only two days away, that light bulbs are going to go off and Trump's going to win big? Do you think he's going to win big?</p>                \n                \r\n\n            \n                <p><b>PALIN:</b> I think he is and I think America is going to win right along with him; he is going to allow us to make America great again.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right, governor, we appreciate you taking the time. We know you are busy tonight. Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Sarah Palin: If Trump wins, America wins", "description": "Former governor of Alaska joins 'The O'Reilly Factor' to discuss the final days of election 2016", "date": "2016-11-07T20:32:28Z"}