{"vcmId": "efe0a948-b7bd-430c-8ccb-3f3a4e07e9a6", "url": "http://www.foxnews.com/transcript/2015/06/18/investigating-clinton-foundation.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 17, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight, the Clinton Foundation.</p>                \n                \r\n\n            \n                <p>As you may know a book called \"Clinton Cash\" has listed a number of people that could very well be illegal surrounding the charitable enterprise known as the Clinton Foundation. For example Russia has purchased a large uranium mine in the U.S.A. That was ok'd by Hillary Clinton's State Department as well as other agencies.</p>                \n                \r\n\n            \n                <p>But in the process more than $2 million was donated to the Clinton Foundation by a guy who stood to benefit from the uranium sale. Also former president bill Clinton was paid a half million dollars for one speech in Moscow by a Russian bank linked to the deal. And there is more.</p>                \n                \r\n\n            \n                <p>Joining us now from Washington the legendary Watergate reporter Bob Woodward. So, initially, there was some reporting in the \"Washington Post\", \"New York Times\" on the Clinton Foundation but not much lately. How do you see it?</p>                \n                \r\n\n            \n                <p><b>BOB WOODWARD, \"WASHINGTON POST\": </b>Well, first of all, this is a giant story and to do it right, you have to be very systematic. If you go back to the Nixon era, he had a campaign re-election committee and the story was that it had really very little connection to the White House. When you dug into it you found that the re-election committee was taking orders from the White House.</p>                \n                \r\n\n            \n                <p>The question here in the Clinton Foundation in all of these activities, including the speeches, exactly how is it organized? Who decides -- to get that story will take weeks and months.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> How long did it take you and Bernstein, how long did it take you to put the trail together before it really got to be critical mass? How much time?</p>                \n                \r\n\n            \n                <p><b>WOODWARD: </b>Certainly months and then to really fully comprehend what was going on and the extent of the illegality and criminality took a year or even more, up to two years until Nixon's resignation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Do you believe -- there is only really three or four vehicles in this country because television news is certainly not going to do it. There are fine investigative reporters like Brian Ross at ABC. But, by and large, it's a newspaper story. Because it's going to take, as you said, a lot of time to put all of these things together and shift around and sift through the BS and get to the heart of the story.</p>                \n                \r\n\n            \n                <p>Do you believe that newspapers have assigned a team of investigators to do this?</p>                \n                \r\n\n            \n                <p><b>WOODWARD:</b> I do. And --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Do you know in the \"Washington Post\" because I know you have a relationship with them -- have they a team?</p>                \n                \r\n\n            \n                <p><b>WOODWARD: </b>Yes -- certainly. I mean, you know, this week there are serious meetings about it. It's going to be looked at clearly in the \"New York Times\".</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> In the \"Washington Post\" there were serious meetings this week?</p>                \n                \r\n\n            \n                <p><b>WOODWARD: </b>Of course.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. Well, no, no, no, don't give me of course. You know how the medias has changed over the years. We're an ideological media now. We're not -- it isn't the way it was back when you and Bernstein were running around. It's not that way anymore. It's corporate. There is a lot of money involved in this. There is a lot of politics involved with this. You know that. Come on, Bob.</p>                \n                \r\n\n            \n                <p><b>WOODWARD:</b> I tell you, if you were there, there is independent aggressiveness, let's look at in this in detail and I think it's going to happen. Now, the big question and you've raised it, are there illegal transactions here? And that really requires digging.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Here is the rub on that. I don't think the press can get to that because the level is so high, unless you have a deep throat. The guy who spilled it to you and Bernstein. That would have to be somebody who come in.</p>                \n                \r\n\n            \n                <p><b>WOODWARD:</b> Only one of many sources and you keep going.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. But you need a guy from the inside. You need somebody from the inside. But I've called for the FBI to investigate this and the FBI tells us, the bureau, well, we can't say if we are investigating or not.</p>                \n                \r\n\n            \n                <p>Well, guess what? The FBI is investigating the St. Louis cardinals for hacking into the Houston Astros. That's all over the place. They can announce that but they can't tell me they are investigating the Clinton Foundation? What's that.</p>                \n                \r\n\n            \n                <p><b>WOODWARD:</b> Well, we don't know. But the lesson for the media which is your questions and I think it's an important one is you discover what would be called incremental coverage, that you are going to keep going at it. You are going -- I mean one of the questions and let's talk about it in six months or nine months, do we really understand how much money in dollars and cents, not generalities, that the Clintons walked away with or that people in the foundation who work for them, you know.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Shouldn't the FBI be taking the lead? I want the press to investigate it because I want honest government. But the FBI has subpoena powers. You know, they can go in and they get all of this stuff. Whereas you and me and others we can't. We have to rely on other people.</p>                \n                \r\n\n            \n                <p>Last word.</p>                \n                \r\n\n            \n                <p><b>WOODWARD:</b> Sure. But the FBI relies on other people, too. And they need credible evidence that a crime has been committed.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> The FBI?</p>                \n                \r\n\n            \n                <p><b>WOODWARD:</b> Let's step back and be fair minded about this.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I think we should be fair. I think we should be watchdogs and aggressive, too.</p>                \n                \r\n\n            \n                <p><b>WOODWARD: </b>I'm all with you. And what I want to know is what's the net worth? What did the Clintons have in terms of money and assets? You know, there will be a lot of smoke between this and between that. I think it's important to know and I think one of the measures of how successful or unsuccessful the press is in this is getting that answer, not some big number.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We will continue to encourage everybody to try to get that. Bob, thanks very much.</p>                \n                \r\n\n            \n                <p><b>WOODWARD:</b> Thank you.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Investigating the Clinton Foundation ", "description": "Why isn't the American media scrutinizing Hillary Clinton more aggressively?", "date": "2015-06-18T12:35:54Z"}