{"vcmId": "f0be6583-2009-4cfe-a37e-b9cdda1bb0b3", "url": "http://www.foxnews.com/transcript/2014/10/21/new-evidence-in-racially-charged-ferguson-murder-case.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" October 20, 2014. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight, the Ferguson Missouri shooting death of Michael Brown. Front page article in the \"New York Times\" on Saturday says there is compelling evidence that there was a struggle between the 18- year-old and Police Officer Darren Wilson on August 9th. The article quotes anonymous sources but the information seems to be coming from federal people and it says: That Officer Wilson was pinned in his vehicle, struggling with his gun as Mr. Brown apparently grabbed for it. Then, Officer Wilson fired twice inside the car. Striking Mr. Brown in the arm, the second bullet missed. Forensic evidence shows Mr. Brown's blood on the gun, on an interior door of the car, also on Officer Wilson's police uniform.</p>                \n                \r\n\n            \n                <p>Finally, the source in the article says civil rights charges are not likely in the case, that's why we know it's a federal source.</p>                \n                \r\n\n            \n                <p>Now, there was no mention of the other five times Michael Brown was shot. So clearly what happened after the initial struggle in the car is yet to be defined at least in this article. And that, of course is vital to the case. Therefore, no one, no one should be stating any conclusions but they are.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SHARPTON: </b>You are asking me to believe that a young man that was shot and knew he didn't have a gun, ran back at you in toward a gun that already shot him.</p>                \n                \r\n\n            \n                <p><b>JAMILAH NASHEED (D), MISSOURI STATE SENATOR:</b> How you can justify killing and shooting down a man in the middle of the street, execution style -- again, simply because his only crime was walking in the middle of the street?</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And joining us now from Los Angeles, the lawyer for Michael Brown's family Benjamin Crump. First of all, what did you think of the \"New York Times\" article, Mr. Crump?</p>                \n                \r\n\n            \n                <p><b>BENJAMIN CRUMP, ATTORNEY MICHAEL BROWN'S FAMILY: </b>Well Bill as the lead attorney for the family, we still haven't gotten anything official from any of the investigators, nothing from the prosecutor's office so we are looking at this allegation just as you and your audience saw. But even if we are to take steps and this allegation is true as you correctly said Mr. O'Reilly, it doesn't explain the other shots and the fact that Michael Brown Jr., everybody says he was running away from the police officer. And so that's what his family is begging for and asking for, charges to be brought so there can be a trial and it can be transparent so they can see really what happened.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right.</p>                \n                \r\n\n            \n                <p>When you read the article in the \"New York Times\" and this was obviously leaked by a federal official. Could have been the FBI, we can't speculate. It's somebody who has seen this evidence there is no doubt about it that article raises reasonable doubt. That's what it does.</p>                \n                \r\n\n            \n                <p>So it couldn't have been good news for you if you believe an injustice was done and I assume you do -- that article could not have been good news for you.</p>                \n                \r\n\n            \n                <p><b>CRUMP: </b>Well we don't see it as that, Mr. O'Reilly. Because remember from day one his friend Dorian said that the police officer tried to pull him into the car and that he struggled to get away and there was a shot fired and they took off running and so this is very consistent with what his friend said from the very beginning.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok but that would be very rare.</p>                \n                \r\n\n            \n                <p><b>CRUMP: </b>And what we are saying it doesn't matter.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. And I understand that you're going -- that that friend has to be taken -- his testimony has to be looked at. But it's very rare that a police officer actually tries to pull somebody through the window of a car but be that it may.</p>                \n                \r\n\n            \n                <p><b>CRUMP: </b>Well, it's rare that somebody tries to enter into a police car, too.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes but if is he trying and I don't want to try the case on TV. I just want to make this statement.</p>                \n                \r\n\n            \n                <p><b>CRUMP: </b>Yes sir.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>If Mr. Brown is trying to get into the car that's a whole different story than a police officer pulling him into the car.</p>                \n                \r\n\n            \n                <p>Now what do you think when you hear Al Sharpton, and I know you have associated yourself with him and I was surprised to see that by the way, convicting the police officer in the media. That doesn't seem to be fair to me.</p>                \n                \r\n\n            \n                <p><b>CRUMP: </b>Well, I think Reverend Al, as well as many of his supporters, are saying that we don't need this secret proceeding called a grand jury. What we need is a trial that's very transparent and that due process not only for the police officer but Michael Brown Jr.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I think he goes a little bit further than that though. Don't you think he goes a little bit further than that? And by the way the grand jury is our system here. To say we don't need it -- that's a little arrogant. But don't you think Mr. Sharpton and others have gone a little bit further than that? They basically convicted the police officer? You haven't. I haven't heard you do it but they have. And I just -- that makes I think makes all fair minded people a little queasy.</p>                \n                \r\n\n            \n                <p><b>CRUMP: </b>Well, Mr. O'Reilly, I think one thing in reference to the grand jury it's a choice by the prosecutor to take it to a grand jury.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But it's the system.</p>                \n                \r\n\n            \n                <p><b>CRUMP: </b>He could have just brought charges. Because probable cause he can just charge. Prosecutors do it every day especially a lot of people in that community in Ferguson. They don't send to a grand jury he just charges them with a crime.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But in a case like this.</p>                \n                \r\n\n            \n                <p><b>CRUMP:</b> And then they have their day in court.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But let me just defend the prosecutor for a moment. In a case like this, which is that high profile, all right they want to make sure that the evidence is heard by an impartial grand jury. And I think that's a responsible way to go. But you are almost dodging my question. You are a standup guy Mr. Crump. You know I think that.</p>                \n                \r\n\n            \n                <p><b>CRUMP: </b>No I won't dodge your question, Mr. O'Reilly. Yes sir and I enjoy coming on your show.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I'm queasy. And I think millions of others including African- Americans don't like anyone, any American being convicted in the media by people like Al Sharpton.</p>                \n                \r\n\n            \n                <p><b>CRUMP: </b>Well I think it's not just Reverend Sharpton, it's everybody has an opinion. But I think you're right we should have everybody get their due process. The police officer should be innocent until proven guilty. And I think all the supporters have been saying that they want their trial they want it to be transparent.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Not all of them Mr. Crump.</p>                \n                \r\n\n            \n                <p><b>CRUMP: </b>But then you want due process for Michael Brown Jr. as well, Mr. O'Reilly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Certainly we do.</p>                \n                \r\n\n            \n                <p><b>CRUMP:</b> Because we want it to be fair.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Absolutely.</p>                \n                \r\n\n            \n                <p><b>CRUMP: </b>And I know that's what we always talk about.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> You and I are absolutely simpatico on that. We want a fair trial with all the evidence examined and a fair outcome. Mr. Crump, we will talk to you again and we really appreciate you coming on.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2014 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2014 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "New evidence in the racially charged Ferguson murder case", "description": "Darren Wilson’s account of the Michael Brown shooting made public for the first time", "date": "2014-10-21T12:15:46Z"}