{"vcmId": "f1990760-92dc-4623-a9c9-25aa7cc0b639", "url": "http://www.foxnews.com/transcript/2016/02/05/analyzing-coverage-iowa-caucus.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" February 4, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thanks for staying with us, Bill O'Reilly. In the \"Weekdays with Bernie\" segment tonight. As we reported last night, CNN's coverage of the Iowa caucus on Monday ignited a nasty incident where by Ben Carson's campaign may have been hurt.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> We should say that our Chris Moody is breaking this news that Ben Carson is going to go back to Florida, to his home regardless of how he does tonight here in Iowa. He is going to go there for several days and then afterwards he is not going to go to South Carolina. He is not going to go to New Hampshire.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But that was not true. Dr. Carson had events planned in New Hampshire. Despite those facts, a CNN anchor said this yesterday.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BROOKE BALDWIN, CNN ANCHOR:</b> We reported it accurately and here are the facts. Dr. Carson's staff told us that he would return home to Florida to quote-unquote, \"Take a breath from the campaign before resuming his activities on the campaign trail.\" That accurate report was disseminated on television and CNN digital and that was that.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Joining us now from Miami, the purveyor of BernardGoldberg.com Mr. Goldberg. And you say?</p>                \n                \r\n\n            \n                <p><b>BERNIE GOLDBERG, FOX NEWS CONTRIBUTOR:</b> Well, that was a -- smug, I thought on CNN's part. Look, this started out with a mistake that CNN made. As you said yesterday, we all make mistakes and live television is hard. So that's not the problem. The problem is that now CNN is doing what so many journalists so often do and what so many politicians actually also do too often circling the wagons and stonewalling so they don't have to say I made a mistake. And the mistake was that CNN reported as you just played that Dr. Carson was not going to New Hampshire and South Carolina.</p>                \n                \r\n\n            \n                <p>That gave the impression to any reasonable person out there that he was maybe dropping out of the race. CNN, for the record, never said he was dropping out. But they certainly gave that impression. Now, Dana Bash, the reporter is doing live television. Live television is hard. We have ear pieces. She has an ear piece there. This is mine right here. Okay. We have ear pieces. And when something new happens, somebody in the control room whispers in our ear and they tell us what's new. Somebody should have told Dana Bash that her own reporter in the field had just tweet Ben Carson's campaign tells me he plans to stay in the race beyond Iowa no matter what the results are tonight.</p>                \n                \r\n\n            \n                <p>She didn't update that because I'm assuming nobody told her that and somebody should have. So CNN should have said our bad, we should have updated that information in a timely fashion and we didn't. Instead, they circle the wagons and they stonewall and that's the mistake. But what CNN did, Bill, in my view, in my view, what CNN did isn't nearly as bad as what the Cruz campaign did. Because Dr. Carson's campaign announced that he was not dropping out of the race. OK? He was not dropping out. That didn't stop Senator Cruz's national chairman.</p>                \n                \r\n\n            \n                <p>Co-national chairman, Congressman Steve King from sending out his own tweet. And that said Carson looks like he is out. Iowans need to know before they vote. Most will go to Cruz, I hope. Look, what CNN did, I will be generous and say it was an honest mistake. They shouldn't stonewall but they made an honest mistake. That, what the Cruz campaign did doesn't look like an honest mistake it. It looks like a dirty trick.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, Cruz himself says he didn't know anything about it.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: I'm willing to accept that but somebody knew about it. How could you not know -- how could a campaign not know --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, King knew about it. I mean, King knew because King an hour and 20 minutes after the CNN fallacious report. An hour and 20 minutes, and that's a long time. All right, tweeted out what you just said. So, all right. I will accept your explanation. But, you know, it comes a point where if major news organizations in this country are not going to correct their errors and the errors led to this terrible thing, and it is terrible, that we have a decline in journalism. That's what we have. You know that.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>No, I agree. And by the way you called it a terrible thing. I think Donald Trump, who your regular viewers know, I have been critical of many of the things he said and the way he said them. I think Donald Trump is right in this case. I think this terrible mistake might have cost him the election.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Sure.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG:</b> Karl Rove is great with numbers. And last night he correctly said that all you needed was four votes in each of the 1500 precincts to go over to Cruz from Carson or -- yes from Carson to Cruz.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: And that gave the percentage point win.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Donald Trump might have won.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Absolutely. There is no doubt about it?</p>                \n                \r\n\n            \n                <p><b>GOLDBERG: </b>He is he absolutely right in this case.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's why we broke this story big with Dr. Carson at the beginning of the week and we are continuing it. Because we have to stop. This this has to stop, now. And I was distressed about how CNN handled it. Last word real quick.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Well, the part about how they handled it, you said yesterday very correctly that people make mistakes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: Why can't journalists say we should have reported the latest information that he was not dropping out. We didn't. We're sorry.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Now, Goldberg, you know, sometimes I apologize to the audience for putting you on the air in certain weeks. I'm not ashamed.</p>                \n                \r\n\n            \n                <p><b>GOLDBERG</b>: And you don't know how many people I apologize to for being on the program with you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>For being on the program. I know that's a perennial. Bernie Goldberg, everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n\t\t\t\t\t\t\n\n\n\n\n\n\n\n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Analyzing the coverage of the Iowa caucus", "description": "Bernie Goldberg examines the media's reporting of the Cruz and Carson campaigns on 'The O'Reilly Factor'", "date": "2016-02-05T13:21:07Z"}