{"vcmId": "f2711680-dd13-4ecc-8000-88e16313377a", "url": "http://www.foxnews.com/transcript/2015/11/04/analyzing-latest-republican-polling-numbers.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" November 3, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Impact Segment\" tonight. Let's bring in Karl Rove who is here in New York City tonight.</p>                \n                \r\n\n            \n                <p>According to the latest polling only five Republican candidates are above 3 percent. Look at that only five. So, Fiorina, Kasich, Huckabee, Christie and Paul -- they're all below 3. Would you advise them to drop out?</p>                \n                \r\n\n            \n                <p><b>KARL ROVE, FOX NEWS CONTRIBUTOR:</b> Look, entering the campaign is an intense personal decision. Exiting the campaign is an intense personal decision. Actually, I think there are six candidates who are 4.8 percent or above in the Real Clear Politics poll.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's in the NBC poll today.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> But I would say this. There are two groups of people who are at risk here. There are four candidates most at risk -- Lindsey Graham, Bobby Jindal, Rick Santorum, and Pataki.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They are at zero in this poll.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now these below 5. Come on --</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>Yes there are four of them.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Kasich, Christie -- these are fairly big name.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Huckabee, Paul, Kasich and Christie.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All big names.</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>Yes. Now, the question is this. They are looking at their cards and they're saying to themselves do I have enough money to stay alive through the November debate and the December debate and maybe get all the way to Iowa or all the way to New Hampshire? Will I have enough money without going into debt? And can I hope that something will happen in this race that gives me a boost in November, December? And as a result --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So it's a money calculation.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> It's a money calculation and momentum calculation and an inflection --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, obviously they don't have momentum if they are that low. Now are you --</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Wait, let's be careful about this. Let's be careful about this. We have 16 candidates that we started with. We're at 14 today. There has never been a Republican nomination battle going back to 1856 that had this many candidates running for the nomination.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> There's never been a Republican nomination battle that has gotten this much exposure, all right, this early, the American people and if you are still polling at 3 percent, you are in trouble.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Well --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Period. You are in trouble.</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>Well, let's go back four years. At this point Rick Santorum was down in the low single digits and he ended up being the runner-up in the contest by scoring a victory in Iowa and scoring a number of victories thereafter.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But he never really had a chance and everybody knew it.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Well, he came in second.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Now, are you more of a philosophy guy toward Jeb Bush, we're on the verge, his words, of greatness or Trump and somewhat Carson, not so much as Trump, that we have so many problems here that, you know, we are really in desperate trouble?</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>Well, look, I think the better way of describing this is -- I'm a Reagan man who said we have double digit inflation, double digit interest is.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They're coming off Carter.</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>Yes. Coming off of Carter but saying I believe in the city on the shining hill. Look, you cannot win by saying everything is going to hell in a hand basket.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Trump is.</p>                \n                \r\n\n            \n                <p><b>ROVE</b>: Well, but you know, let's see if he wins with that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>He has won so far with it.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Well, he has now fallen behind Ben Carson.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I mean this time four years ago, it was Herman Cain.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> No, no. We have gone through Cain mania. At this point we are in Gingrich 2 to 1.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Whatever.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Butt he point is this. The point is this. I think in a general election, which is what these people ought to be thinking about, the American people want to know that somebody has confidence in America and Americans. And has a vision that is optimistic and positive and inclusive for them which is exactly --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But that's not the period of time we are in. We are in with the Republican base they want an avenger as I said in the \"Talking Points Memo\".</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> I agree with that but --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>They want somebody who comes in and dismantles all of this stuff.</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>Don't disagree with that but you've got a couple with a vision that says I'm going to take this on but I am going to be the first one to deliver that to you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, Trump does that too, though. Trump says, you know, I'm going to have the best people and we're going to make --</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>No, no, no -- you're missing the main point about him. I'm going to make America great again. You don't think he is trying to strike an optimistic note?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, but it's a different kind sell.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> I agree.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>You know it's a different kind of sell.</p>                \n                \r\n\n            \n                <p>ROVE: I agree. I agree with you.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. With Trump it's almost all negative.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And then, now Bush is trying to break out the positive side and he's not getting much traction; 8 percent for the governor is not a good number.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> Yes, we'll look, again, my view is we are relatively early in this process.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No we are not.</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>Yes we are.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No we're not. It's three months before they are going to start voting in Iowa. Come on -- you can't count Christmas. You can't count Thanksgiving. You can't. There's two more Republican debates until the first of the year. We are not early.</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>Yes we are.</p>                \n                \r\n\n            \n                <p>In Iowa they won't start making up their minds until December. They didn't start making up their minds in --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What's the date? November 3rd.</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>Ok, fine.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Come on.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> They've got six weeks -- six weeks to get serious.</p>                \n                \r\n\n            \n                <p>If you think these people are done --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, I don't.</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>If you think these people have made up their minds.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But it's not for the reason that you think.</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>If you think these people have made up their minds and if you think these people are firm in their opinions --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I don't think they have. They get 78 percent are fluid. That's a lot of people are fluid.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> A lot of people -- absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But what you guys in the conventional precincts are all missing it's a different time in history.</p>                \n                \r\n\n            \n                <p><b>ROVE:</b> I'm not missing this.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>The anger level is not going to subside.</p>                \n                \r\n\n            \n                <p><b>ROVE: </b>I get it. I get it. I get that. But that's not going to mean that they are going to make an early decision. It means they're going to make a late decision based on who they think will change --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Whether they get early or late they're still going to be teed off.</p>                \n                \r\n\n            \n                <p>Karl Rove, everybody. There he is.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Analyzing the latest Republican polling numbers", "description": "Only five GOP candidates with numbers above three percent; Karl Rove reacts on 'The O'Reilly Factor'", "date": "2015-11-04T12:55:21Z"}