{"vcmId": "f31d9481-d07d-45b2-a067-565a3377ff14", "url": "http://www.foxnews.com/transcript/2015/08/24/birthright-citizenship-battle.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" August 21, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> In the \"Impact Segment\" tonight, Donald Trump has never had a problem voicing his low opinion of his fellow candidates. But now, even Jeb Bush, who describes himself as the \"joyful tortoise\" in the 2016 GOP field is going into attack mode.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Jeb Bush is a low energy person. For him to get things done is hard. He is very low energy.</p>                \n                \r\n\n            \n                <p>You know what's happening to Jeb's crowd as you know right down the street? They are sleeping. They are sleeping now.</p>                \n                \r\n\n            \n                <p><b>BUSH: </b>Mr. Trump doesn't have a proven conservative record. He was a Democrat longer in the last decade than he was a Republican. He has given more money to Democrats than he's given to Republicans.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> But Trump does have a proven record shaking things up this political season, most recently by calling for an end of automatic citizenship to children born in the U.S.A., to parents who are illegal aliens. Trump's plan has caused a furious debate inside the GOP forcing other presidential hopefuls to declare where they stand on the explosive issue.</p>                \n                \r\n\n            \n                <p>Joining us now in studio with more on the immigration battle Dana Perino, co-host of \"THE FIVE\". So, I think that people like it when candidates come out and take a strong stand, a quick stand and kind of, you know, stake their claim and say this is what I believe. Do you think this is not a good idea for the Republican Party to have Trump take this stand on birth right citizenship?</p>                \n                \r\n\n            \n                <p><b>DANA PERINO, FOX NEWS HOST</b>: Not necessarily. I don't actually think though that there was a lot of thought going into the plan. And I don't think that --</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> You don't think Trump planned this?</p>                \n                \r\n\n            \n                <p><b>PERINO</b>: Possibly. I think there was one -- immigration is not a new issue, right. The Republicans have been struggling on this issue for almost over a decade. Well, I remember very well the debate in 2007 -- President Bush ultimately lost that legislative battle --</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: Right.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Mostly because of Democrats. And I actually think a lot of the problem that we wanted to solve like e-verify, securing the border, more troops, or I'm sorry more ICE agents those things actually could have been solved then. Guest worker program there is the rub.</p>                \n                \r\n\n            \n                <p>This issue of birth right citizenship is different, new, it is angry. I don't think it was well though through. I think there's a --</p>                \n                \r\n\n            \n                <p><b>WATTERS</b>: It's angry.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> It's angry and goes to what you -- feelings. Feelings are important in a presidential race.</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> I'm an emotional person. I can't deny that. I don't know if it's necessarily angry because I know that Senator Harry Reid, I think years back, proposed ending birth right citizenship so I don't think it's that radical and they don't have birth right citizenship in the European countries.</p>                \n                \r\n\n            \n                <p>Is it really that radical to say, listen, let's follow the law and let's wait in line to gain citizenship?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Well, actually, that has been actually proposed. Not on the citizenship part but on whether or not what you do with the 11 million. I do think that the candidates were not prepared for this debate, but you have to be prepared for the unexpected.</p>                \n                \r\n\n            \n                <p>What we are talking about next August, in the lead up, we have no idea what that could be. Nobody was talking about al Qaeda on September 10th, 2001. And we don't know what it is going to be.</p>                \n                \r\n\n            \n                <p>But this issue is actually drawing some of them out. The Republicans, I think, most of them hadn't thought it through. That's why you see a lot of flip flopping and a lot of the people aren't sure and some people just totally taking a pass.</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> Here is who I think Trump is appealing to with the birth right citizenship thing. You have, I think, 400,000 \"anchor baby\" births if I can -- if I'm allowed to use that term -- in the United States each year. And middle class working Americans are getting hammered.</p>                \n                \r\n\n            \n                <p>Trump is saying listen. I want to stick up for American babies. And we can stick up for the foreign babies later. But right now I think for the first time in this country, parents are saying, I don't think my children are going to have as great of a life as I did. And illegal immigration is killing can the worker. It's causing havoc on public schools. There's DUIs, either they're sending money back. They are not investing it here. It's a drain on the system. And he's saying listen, let's get our house in order and then we can worry about the rest of the world.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> If all of that were true, I could understand it.</p>                \n                \r\n\n            \n                <p><b>WATTERS: </b>What's not true about that? What did I say that wasn't true?</p>                \n                \r\n\n            \n                <p><b>Perino:</b> I think people do have a lot of anxiety about the future for their American-born children. One thing is -- I actually think one of thing that makes America great is the value of birth right citizenship. That you can come to America and if you get here, you can become an American citizen. My great grandparents left Italy, a terrible situation. I walk out the other side of the American dream, that's amazing.</p>                \n                \r\n\n            \n                <p>Perspectively, do we need to have a look at the 14th amendment and say, ok, going forward, do we want to do this? But I think what's happened is we are having a debate about uprooting families and sending them back to where? Where -- if they are not American citizens, what citizens are they? Are we just going to have stateless people running all over the world?</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> My theory on this I say we send everybody down to the border. Have the illegal alien families build the border wall. They can build a wall and then the ones that work hard build a wall then they can say those are the good ones, right?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>The thing is I know -- it feels good to say all of that, but then if you are practical and you're thinking wait, none of that is actually true. It's a repulsive fantasy that we are all having but it sounds good and it's fun to talk about. And I actually think there are --</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> I don't know. Listen, I don't know if it's a repulsive fantasy. I'm just thinking this.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> I do.</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> Trump is a master negotiator. He really wants to get this house in order and he is putting a marker down in the sand and saying we have got to freeze this and kind of rhetoric like this freezes the \"anchor baby\" industry. Maybe that can have an effect.</p>                \n                \r\n\n            \n                <p>But I have to go. Dana -- thank you so much for taking the time.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Your mom is not going to be happy.</p>                \n                \r\n\n            \n                <p><b>WATTERS:</b> No, she is not.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Birthright citizenship battle", "description": "Where do the Republican candidates stand on the explosive issue?", "date": "2015-08-24T12:21:58Z"}