{"vcmId": "f572b934-a9ce-456f-a86b-0932346af2a8", "url": "http://www.foxnews.com/transcript/2016/06/20/who-to-blame-for-orlando-terror-attack.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" June 17, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>ERIC BOLLING, FOX NEWS HOST:</b> Hi, I'm Eric Bolling in for Bill O'Reilly. Thanks for watching this special edition of The Factor, \"The War on Terror, The Political Equation.\" Let's get right to our top story. The war of words over who is to blame for the Orlando terror attack, Senator John McCain ratcheted up the fight between Republicans and Democrats while speaking to reporters on Thursday.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>SEN. JOHN MCCAIN (R), ARIZONA</b>: Barack Obama is directly responsible for because when he pulled everybody out of Iraq, al Qaeda went to Syria, became ISIS and, uh, ISIS is what it is today. Thanks to Barack Obama's failures, utter failures by pulling everybody out of Iraq thinking that conflict and just because we leave.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Following outcry about his remarks, Senator McCain released a statement saying that, he quote, \"misspoke\" but the Senator appeared defiant when pressed on the matter later on Thursday.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>MCCAIN</b>: If the president had not pulled everybody out of Iraq, you would have never seen the rise of ISIS, so he bears responsibility.</p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED FEMALE:</b> So I want to be clear --</p>                \n                \r\n\n            \n                <p><b>MCCAIN</b>: You want me to be clear, I'm not backtracking on anything, I'm saying that the President of the United States' actions, actions, were responsible because of the full withdrawal of troops from Iraq which led then to al Qaeda going to Syria which then led to ISIS and our failure to have a strategy to destroy ISIS has led the attacks on the United States of America and Europe.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Meanwhile President Obama insists the U.S. is not letting up its campaign against terrorism.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>PRES. BARACK OBAMA (D), UNITED STATES</b>: We will continue to be relentless against terrorist groups like ISIL and al Qaeda. We are going to destroy them. We are going to disrupt their networks and their financing. And the flow of fighters in and out of war theaters.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Joining us now to analyze from Jacksonville, Florida, Adam Goodman, the Republican communications expert. And from Washington, Nayyera Haq, a former senior director for the Obama White House.</p>                \n                \r\n\n            \n                <p>Miss Haq, let's start with you, your thoughts on John McCain, took a shot directly at President Obama. Seem to do say he misspoke and then doubled down later on in the day on Thursday. Your thoughts?</p>                \n                \r\n\n            \n                <p><b>NAYYERA HAQ, FORMER OBAMA WHITE HOUSE SENIOR DIRECTOR, CABINET AFFAIRS</b>: Wow, I think the person most directly responsible for what happened at Pulse in Orlando frankly is the terrorist. So, let's start with that who had, who is homophobic. Clearly had mental health issues and had easy access to an assault weapon and AR 15. If you want to talk about policy failures. The Iraq is not in a war that Obama started. I highly doubt the American public wants to see ground troops in Iraq, Syria and Afghanistan.</p>                \n                \r\n\n            \n                <p>But if that's what McCain is suggesting, then I think he should propose sending -- he should propose an alternative instead of just blaming Obama for National Security failures. Does he want to see American troops in Syria? Does he want to see American planes in Syria? The Congress has full ability to be able to send troops or air planes over there and that is not something that they have done yet.</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Okay. Let me do this before I throw it to you, Adam. Let's clarify a couple things. First of all, Ms. Haq, thank you for starting with he is a terrorist. I'm not sure about the other things that you listed. But I am sure of one thing, you called the AR 15 an assault weapon which is not.</p>                \n                \r\n\n            \n                <p>Now, Adam, John McCain was taking a direct shot at President Obama. There are a lot who think he was right in that and then there are those who say, hey, wait a minute. We're not sure about Syrian policy, what we should be doing. Maybe McCain's idea of what to do in the Middle East may not be the right answer, either.</p>                \n                \r\n\n            \n                <p><b>ADAM GOODMAN, GOP COMMUNICATIONS STRATEGIST</b>: Eric, let's start with this. John McCain is a true American hero. And he brings a personal perspective to this argument that I think the President frankly doesn't have. As far as the back and forth, the President is the policy and I have just learned from conversations I have had direct whether a federal law enforcement officials for instance, Eric, that going back to the very beginning of the Obama administration, there was a directive to scrub training manuals for the FBI.</p>                \n                \r\n\n            \n                <p>To scrub them of any references to any groups that may be considered offensive in the world of political correctness. And one of those terms was radical Islamic terrorist. If we're not willing to call the threat for what it is, my opinion is, we're doing very little to stop it.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Um-huh. And Ms. Haq, one of the other terms that they were told to scrub I believe was jihadist. Well, do we have a political correctness problem at the FBI, do you think?</p>                \n                \r\n\n            \n                <p><b>HAQ</b>: Absolutely not. I think this is, again a red herring approach. Instead of having substantive conversations about tough issues, is to say you are not using this word. You know, on a conservative side. You are not using radical Islamist on the liberal side. What we should only be talking about gun control. There is a whole bunch of things we need to be talking about but none of that is actually pointing fingers. It's, what are you going to do.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Do you think President Obama actually talked about both? You know, he spent a lot of time talking about gun control right after he met with the victims of the terror.</p>                \n                \r\n\n            \n                <p><b>HAQ</b>: Right. And Eric, the clip you just played was not just about gun control. It was actually about what the current strategy is for fighting ISIS, which is eliminating the networks. Cutting off their finances. And finding them using targeted drone strikes. Now, here's the challenge. If we want to do more, if we want to be able to do more militarily, Congress needs to get involved. That is not something the President can do independently. So, I would like to hear from people like John McCain. What would the alternative be to having more ground troops in Iraq or having more ground troops in Syria?</p>                \n                \r\n\n            \n                <p><b>BOLLING:</b> Adam, honestly, let's eliminate the spin here. What is the alternative? At one point John McCain was questioned as to whether it was the right idea to be with -- remember the Syrian rebels, he took some pictures of the Syrian rebels and people questioned were those same people, did they end up ISIS fighters?</p>                \n                \r\n\n            \n                <p><b>HAQ</b>: Right. I think that's the conversation, Eric, we have to have moving forward. But let me make two points. Number one is, the President, while he was reassuring us recently in the last couple days that ISIS once again was kind of under control and on the run, his own CIA Director Brennan contradict to them saying, there are no routes used by smugglers that are more and more utilize to do bring in people into the West, into the United States that pose threats to us.</p>                \n                \r\n\n            \n                <p>This is a result, Eric, of a foreign policy under President Obama that has been wavering, tentative and tepid. And I think these -- what we saw, unfortunately, here in Orlando and we are very close to it here in Jacksonville the other day is direct result to some degree of a foreign policy that hasn't worked.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Ms. Haq, this terrorist, held up a gun and said Allah Akbar. This terrorist contacted the police and said, I pledge allegiance to ISIS and al Baghdadi the leader. This terrorist had visited Saudi Arabia a couple times. This terrorist studied under Anwar al Awlaki the same radical cleric Imam that the Fort Hood terrorist studied under, and also the San Bernardino terrorist studied under. I mean, why are we constantly pointing fingers at the guns. President Obama has done it, the left has done it. Even the left media has done it.</p>                \n                \r\n\n            \n                <p><b>HAQ</b>: So, I will take that in two parts. The first is, the terrorist network and connection of ISIS and the sad part is, as the Arab coalition and the U.S. support makes gains in the Middle East, ISIS gets desperate and has called for lone wolf attacks.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Are we making gains though? I mean, are we making gains --</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p>I mean, are we making gains? You heard President Obama take credit for gains in the Middle East and then we hear, as Adam points out, Brennan say, maybe not gains.</p>                \n                \r\n\n            \n                <p><b>HAQ</b>: Allow me to finish.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Comey say, maybe we are not making the gains we should. We have the State Department internally saying, maybe we are doing things wrong.</p>                \n                \r\n\n            \n                <p><b>HAQ</b>: I think everyone -- this is gone on far too long with what's happening in Syria. Everyone is frustrated. But there is commonly accepted facts in foreign policy and intelligence circles as you beat back ISIS on the ground in Syria and Iraq, they start to spread to Europe and they start to spread to the United States. So, that's a separate problem.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Is that a gain? Is that a gain Adam? Is that a gain if we are beating, we're pushing them back in Iraq and Syria, yet they are more and more instances of terror right here on the homeland?</p>                \n                \r\n\n            \n                <p><b>GOODMAN:</b> Eric, just ask anybody who lives in Orlando today. The answer to that is no. We don't feel safe. We don't feel secure. We even just had the Homeland Security director say recently that the people coming in, they don't really know enough about them to be able to give us assurances. This is a time where we have to open dialogue and conversation as Americans to get an answer, and the answer is not being unwilling to call this for what it is, Islamic radical terrorism.</p>                \n                \r\n\n            \n                <p><b>HAQ:</b> I think a big part of the answer is that now that it's coming to American homeland, it's not make it easy for people to get AR-15s or any other weapons.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: Oh stop!</p>                \n                \r\n\n            \n                <p><b>HAQ</b>: Absolutely.</p>                \n                \r\n\n            \n                <p><b>BOLLING</b>: We had such a nice segment going. So, another segment and another time. Nayyera, Adam, thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Who's to blame for the Orlando terror attack?", "description": "'The O'Reilly Factor' examines John McCain criticizing President Obama over Florida nightclub shooting", "date": "2016-06-20T12:17:11Z"}