{"vcmId": "f623f788-80f2-4586-af58-baa10a3c3143", "url": "http://www.foxnews.com/transcript/2015/01/30/donald-trump-presidential-politics-and-factor.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 29, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Personal Story Segment\" tonight as we mentioned last night, Sarah Palin did not like the tease I wrote and delivered about the Republican presidential hopefuls. Here it is.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: O'Reilly here. Sarah Palin, Donald Trump, Chris Christie all may run for president on the Republican side. Wow, talk about a reality show. We'll have the inside story.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So, I suggested Governor Palin might want to relax in the tip of the day last night because the tease was harmless. Well, Donald Trump has weighed in tweeting that Mrs. Palin is correct and that The Factor is heading in the wrong direction.</p>                \n                \r\n\n            \n                <p>Mr. Trump joins us on the phone from the Trump National Doral in Miami. Miami, huh?</p>                \n                \r\n\n            \n                <p><b>DONALD TRUMP, BUSINESSMAN</b>: It's nice and warm in Miami. It's beautiful.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You know what -- I shoveled a bunch of snow right against your door up here.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Good.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So what's your beef?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, my beef is that all day long they advertised Trump and Palin and just over and over again and I said I have got to watch this. Not that I don't watch you anyway. And I was waiting and waiting for Trump and I was even waiting for Palin who is actually a very nice woman and a very good woman. And there was nothing about me and nothing about her. But there was nothing about me. So I said to myself, you know, that's sort of truth in advertising words.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You are on deceptive advertising.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: They used deceptive advertising.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: There was something about you. You missed it.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, perhaps I did. If there was it was awfully quick.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Well, let me tell you because you want to be a fair man. I know you, you are a fair guy.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Go ahead.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The segment was about all of the candidates that are thinking about running for the President on the GOP side. We ran them down, all right, and said strength and weaknesses. You were in there and so was Governor Palin. Strengths, presentation, liven things up, straight shooter. Weaknesses: very challenging, and that's exactly the word I used to get an organization in every state up and running in time to compete. That's where you were.</p>                \n                \r\n\n            \n                <p>So, come on. The Factor is heading in the wrong direction. Come on.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: It was very -- it was a very quick little thing. The ads were massive and I expected to have a nice piece. I saw something very briefly but it certainly wasn't what advertised.</p>                \n                \r\n\n            \n                <p>But that's ok.</p>                \n                \r\n\n            \n                <p>Now, as far as heading in the wrong direction, I don't know. I think you have your act together pretty well Bill, don't you?</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. You are going to take that tweet back? Can you take a tweet back? Do you grab it out of the sky?</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: I would never do such a thing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes, don't be a pinhead. Don't tweet. You don't need to tweet. I mean you know, your words are worth more than this cheap cyberspace.</p>                \n                \r\n\n            \n                <p>Let me just separate it. I'm glad you came on because now I know you were saying look, I don't want to be exploited in some stupid television show if I'm not involved. That's a legitimate point. Ok. But Sarah Palin was actually offended that I said wow, this could be a great reality show. And, with you and Christie and Palin --</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: Well, I think you are true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>TRUMP</b>: And I think that's right. You see the kind of record numbers \"The Apprentice\" is doing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: I knew we were going to get to that.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Absolutely. You see the record numbers we got the other night on Miss Universe. But Miss Universe took the evening. So we're very happy about that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I have got to tell it you Donald you and a bathing suit in the contest.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> That wouldn't be for me.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That was a little --</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> That wouldn't be for the public and it wouldn't be for me, that's true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now, look, I don't think you are going to run for president. But, let me say this. I like the fact that you dare. I like the fact that you're not afraid to say what's on your mind. I think we need that in a presidential race.</p>                \n                \r\n\n            \n                <p>So I'm not offended if you don't run, if you do run, but if you decide to run, you have got to know that building an organization that you would have to build is very difficult for a person who has never done it before.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> But how do you know I'm not building it right now, Bill? How would you know that?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Because you are playing golf in Miami, Donald.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I'm not playing golf. I own the club. I'm working with contractors. I'm not doing golf.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Are you telling me you didn't play golf this week?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> I did not play golf this week. That's true.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Not one time from Sunday.</p>                \n                \r\n\n            \n                <p><b>TRUMP: </b>No, not one time. I've been down here for about one day and all I'm doing is fighting with contractors and making the job look beautiful. It's almost finished.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Somebody saw you putting through one of those wind mills in Opelika. That wasn't you.</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> No, no. That wasn't me. That I can guarantee you there. I can guarantee you. I'm a worker. I'm not a player. I'm a worker Bill.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. So watch the tweets. We're glad you came on and we want you to keep telling it like it is. Fair?</p>                \n                \r\n\n            \n                <p><b>TRUMP:</b> Ok man. You have a deal. You have a deal. And you too.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Don't worry about me.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Donald Trump, presidential politics and 'The Factor'", "description": "Donald Trump weighs in on challenging 'The Factor'", "date": "2015-01-30T13:29:28Z"}