{"vcmId": "f71bde96-3036-49bc-a6a4-87a085f2e100", "url": "http://www.foxnews.com/transcript/2015/12/09/trump-doubles-down-on-controversial-muslim-plan.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" December 8, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p>O'<b>REILLY:</b> \"Impact Segment\" tonight.</p>                \n                \r\n\n            \n                <p>Are you a fair-minded person? Are you? If so, what's your opinion about Muslims?</p>                \n                \r\n\n            \n                <p>Joining us now: from St. Petersburg, Florida Jessica Ehrlich Democratic strategist; here in the studio in New York City Andrea Tantaros, co-host of \"OUTNUMBERED\".</p>                \n                \r\n\n            \n                <p>So what pops into your mind when you hear about a Muslim in general or see one on the streets of New York? What?</p>                \n                \r\n\n            \n                <p><b>ANDREA TANTAROS, FOX NEWS HOST</b>: I do have a unique perspective. I mean I'm a first generation American born to an immigrant father.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> From Greece?</p>                \n                \r\n\n            \n                <p><b>TANTAROS: </b>From Greece.</p>                \n                \r\n\n            \n                <p>However, I lived in Paris. And I lived in the 11th Arrondissement. And if you made a right out of my door, it was an all- Muslim neighborhood that did not assimilate. If you made a left, it was all French. The two did not co-mingle.</p>                \n                \r\n\n            \n                <p>And during my time in Paris, and I lived there, I studied there, Bill, I have never told this story. But during my time there, as much sympathy as I had and openness to the culture, I was attacked twice. Once in Nice by a group of Algerian men with my friend Katie; and second time followed by a Muslim man in (inaudible) in Paris.</p>                \n                \r\n\n            \n                <p>It made me completely petrified and I decided I did not want to live there permanently and hence here I am on The Factor and it all worked out.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So your personal experience.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> My personal experience is I think that there is a serious problem in the Muslim community. I think more peaceful Muslims and I do believe they exist. I do not have a fear of Muslims. They need to come out and denounce it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. Does it have to do with Muslim believing that men are superior to women and women can be used by men - which is in the culture, not everywhere? There are secular Muslims who don't believe that obviously. But it's in the culture in many places.</p>                \n                \r\n\n            \n                <p><b>TANTAROS</b>: No question. Muslims do not believe in equal rights and they do not believe in gay rights which is shocking that so many liberals - -</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So does that enter into your thinking?</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> Of course it does especially as a woman. But, Bill, very quickly when I looked at the culture in Paris, it wasn't the older Muslims that were radicalized. They kept to themselves, they kept to their business. They were the ones that immigrated from northern Africa in the 60s.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, sure.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> It's the kids.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Got it.</p>                \n                \r\n\n            \n                <p>Ok, Jessica, what do you say? Same question, you see Muslims in St. Petersburg or you hear about them on the news or whatever what goes through your mind?</p>                \n                \r\n\n            \n                <p><b>JESSICA EHRLICH, DEMOCRATIC STRATEGIST:</b> Well, it's very interesting, actually. Andrea and I have very similar stories in the sense that my dad also was immigrant into the United States coming after World War II from Germany. And I studied in Paris and lived there, also.</p>                \n                \r\n\n            \n                <p>But my experience was actually growing up with one of my best friends in elementary school and my little Episcopalian school in St. Petersburg here was Muslim. And her parents were from India where they were persecuted for being Muslim because it was, you know, very looked down upon and difficult for them to raise their family.</p>                \n                \r\n\n            \n                <p>So he was an engineer and he came here and we spent a lot of time in sort of this group of students who are young kids who are Muslims, who were Jews, who were Christians at my Episcopalian school talking about the Old Testament, talking about how we believed in God. And the real differences were, you know, whether you believed that, you know, Jesus or Muhammad is the son of God and who's a holy man.</p>                \n                \r\n\n            \n                <p>She is now, you know, a neonatalogist saving babies in Philadelphia. And that is what occurs to me. I mean definitely --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. So you don't -- when you see Muslims together or people who don't assimilate because we have them in the United States as well. Who stay to themselves, their own customs, a lot of Muslims believe in Sharia law. What do you think, Jessica, when you see that a lot of American Muslims they like Sharia. How does that go down with you?</p>                \n                \r\n\n            \n                <p><b>EHRLICH:</b> Well, I think anyone who comes to this country, one of the parts of being an immigrant is to learn the language and to assimilate simulate into our culture. And it actually makes being an American a more rich and beautiful thing.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. But if they don't -- it's a matter of the polls show there's high number of American Muslims who want Sharia. Does that disturb you, yes or no?</p>                \n                \r\n\n            \n                <p><b>EHRLICH:</b> Well, yes. You don't get Sharia law when you live in the United States. That's not our system of law.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's the problem -- see. The problem is two-fold. Number one we haven't seen massive demonstrations by Muslims here in the United States against the jihad. And number two when they take the polls, I like to have Sharia -- a significant number of them.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> And they believe that they answer to Allah and they answer to their religion and not the United States government. And the Pew polls Bill, I'm telling you they are troubling. 2007 there is a more recent one but 2007, Bill, if you look at three million Americans -- Muslim-Americans in this country they polled them 8 percent told Pew that suicide bombings were sometimes justified. Some said they were rarely justified.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes, but 8 percent is a low number.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> Hold on, Jessica.</p>                \n                \r\n\n            \n                <p><b>EHRLICH:</b> There's so many rarities in all different religions that are radical.</p>                \n                \r\n\n            \n                <p><b>TANTAROS:</b> Let me finish. 13 percent -- one in seven Americans, Bill, three million people, 13 percent -- that's 400,000 Americans who believe that suicide bombings are sometimes justified -- that is troubling.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. But I submit that 10 percent of every race, every religion are totally out of their minds.</p>                \n                \r\n\n            \n                <p><b>TANTAROS: </b>Not in this way.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Totally crazy and like that.</p>                \n                \r\n\n            \n                <p>All right. Ladies -- thanks very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Trump doubles down on controversial Muslim plan", "description": "How does the United States view Islam? 'The O'Reilly Factor' investigates", "date": "2015-12-09T13:14:21Z"}