{"vcmId": "f76de490-f550-42c0-9975-25c578eb52af", "url": "http://www.foxnews.com/transcript/2016/12/08/bill-oreilly-will-donald-trump-be-able-to-unite-country.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Today, Time Magazine announced that Mr. Trump is the Person of the Year.</p>                \n                \r\n\n            \n                <p>Then they took a swipe at him, saying \"Donald Trump - President of the Divided States of America.\"</p>                \n                \r\n\n            \n                <p>Time, perhaps the most politically correct publication in the country, clearly dislikes Mr. Trump.</p>                \n                \r\n\n            \n                <p>They had to make him the Person of the Year but obviously did not want to do so.</p>                \n                \r\n\n            \n                <p>However, the magazine is correct in saying that the USA is a divided country.</p>                \n                \r\n\n            \n                <p>Mr. Trump claims that happened on President Obama's watch, and he will bring everybody together.</p>                \n                \r\n\n            \n                <p>Talking Points is not sure that is possible.</p>                \n                \r\n\n            \n                <p>To illustrate that point, let's take a look at the nation's largest city - New York.</p>                \n                \r\n\n            \n                <p>In the presidential election, Hillary Clinton received nearly 79% of the vote.</p>                \n                \r\n\n            \n                <p>Donald Trump - 18%.</p>                \n                \r\n\n            \n                <p>The Big Apple rock-steady left.</p>                \n                \r\n\n            \n                <p>You may remember that Trump actually said he might carry New York. &#160;But that was never even remotely possible.</p>                \n                \r\n\n            \n                <p>And here's why:</p>                \n                \r\n\n            \n                <p>Unlike San Francisco, which is steeped in socialist ideology, New York City is basically a welfare state.</p>                \n                \r\n\n            \n                <p>The ethnic breakdown goes like this:</p>                \n                \r\n\n            \n                <p>32% - &#160;white</p>                \n                \r\n\n            \n                <p>29% - Hispanic</p>                \n                \r\n\n            \n                <p>24% - black</p>                \n                \r\n\n            \n                <p>14% - Asian</p>                \n                \r\n\n            \n                <p>You want diversity, come to New York City.</p>                \n                \r\n\n            \n                <p>In addition, 38% of the population here is foreign born; 17% are not citizens.</p>                \n                \r\n\n            \n                <p>So, you are looking at a political situation where millions of New Yorkers are trying to survive in a very tough environment.</p>                \n                \r\n\n            \n                <p>The population of New York City is now about eight-and-a-half million people, and many of them can't make a living.</p>                \n                \r\n\n            \n                <p>So the government must support them.</p>                \n                \r\n\n            \n                <p>Right now New York City is approaching one hundred billion dollars in debt.</p>                \n                \r\n\n            \n                <p>The city cannot possibly pay off that money.</p>                \n                \r\n\n            \n                <p>So it will borrow more and depend on you, wherever you live, to bail it out.</p>                \n                \r\n\n            \n                <p>Twenty percent of New York City residents are now receiving food stamps. &#160;That's 1.7 million people at a cost of 250 million dollars a month - a month!</p>                \n                \r\n\n            \n                <p>Other assistance to residents is more than 100 million dollars a month.</p>                \n                \r\n\n            \n                <p>Five percent of the city's population is on disability.</p>                \n                \r\n\n            \n                <p>Cost? Two-hundred-and-fifty-two million dollars a month.</p>                \n                \r\n\n            \n                <p>Finally, 600,000 New Yorkers are receiving payments for public housing.</p>                \n                \r\n\n            \n                <p>That's 7% of the population.</p>                \n                \r\n\n            \n                <p>So you can see that New York City, the most powerful financial center in the world, is basically a dependency.</p>                \n                \r\n\n            \n                <p>And people receiving disability checks, housing supplements, food stamps and other direct payments are not going to vote for Republicans.</p>                \n                \r\n\n            \n                <p>Ever.</p>                \n                \r\n\n            \n                <p>So, this is a one-party city that will never embrace a guy like Donald Trump.</p>                \n                \r\n\n            \n                <p>This is what America has come to, its largest city is falling apart.</p>                \n                \r\n\n            \n                <p>There is little desire on the part of the liberal city government to lift people out of welfare.</p>                \n                \r\n\n            \n                <p>Liberal politicians actually want dependency.</p>                \n                \r\n\n            \n                <p>For example, if the city were to investigate disability claims, they'd find that many of them are completely bogus</p>                \n                \r\n\n            \n                <p>It's a racket. &#160;Everybody knows it.</p>                \n                \r\n\n            \n                <p>But when 80% of the voters continue to support the far-left vision, nothing is going to change.</p>                \n                \r\n\n            \n                <p>So even though Donald Trump is a hometown guy and believes he can bring America together, the heavy odds are he cannot.</p>                \n                \r\n\n            \n                <p>The welfare system in many places is simply too entrenched.</p>                \n                \r\n\n            \n                <p>And the welfare system is not going to make America great.</p>                \n                \r\n\n            \n                <p>That's \"The Memo\".</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Will Donald Trump be able to unite the country?", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 12/7", "date": "2016-12-08T13:21:52Z"}