{"vcmId": "f8ea873f-8644-409e-9bd7-fec027ba2717", "url": "http://www.foxnews.com/transcript/2016/01/22/mike-huckabee-on-state-his-campaign.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" January 21, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Personal Story Segment\" tonight, the former governor of Arkansas Mike Huckabee won the Iowa caucus back in 2008. This year things have been more difficult for the governor. He joins us now from Iowa.</p>                \n                \r\n\n            \n                <p>So you have given it a good shot, but the Trump/Cruz brawl seems to be overriding everything right now. How do you see that?</p>                \n                \r\n\n            \n                <p><b>MIKE HUCKABEE (R), PRESIDENTIAL CANDIDATE: </b>Well, I will tell you, I'm still finding it out here with Iowa people that the connection is real. And I just think people have forgotten the lesson of Iowa.</p>                \n                \r\n\n            \n                <p>Every four years the media gets it wrong. They got it wrong four years ago, eight years ago. Bill, they have gotten it wrong for 40 years. Jimmy Carter was never supposed to win it back in the 70s.</p>                \n                \r\n\n            \n                <p>The Iowa people will make up their own mind and most of them don't make it up until just before the caucus. I think we're going to see that happening again February 1st.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. And I hope they do. I would like to see some surprises. But you know, Santorum won last time, you won in 2008. It doesn't seem to mean that much in the general vote although certainly we applaud Iowans for having a caucus. We think everybody should be heard. But, Trump --</p>                \n                \r\n\n            \n                <p><b>HUCKABEE</b>: Let me just point out something, bill. Hold on one second. I just want to point out. It wasn't just that either of us won Iowa, we went on to come in second in the nominating process. So I think when people say all you did was win Iowa. No, I came in second to McCain and Santorum came in second to Romney four years ago. So it is a launching pad. It is a good predictor of how well we can do.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Good valid point. But it's different this time because of Trump. And now Trump is in a brawl with Cruz. They are both trying to woo evangelical voters and they are your base. So how do you see this?</p>                \n                \r\n\n            \n                <p><b>HUCKABEE</b>: Have you ever been to a Nascar race and if the from front cars have a collision and both of them wreck? Guess what happens? Somebody comes from behind them and ends up winning the race and get the checkered flag. There's less than two weeks but that's a long period of time in an Iowa election.</p>                \n                \r\n\n            \n                <p>And it could be all the cars in front end up crashing into each other, rolling off the track. People in Iowa say, you know, forget it. These guys are so consumed with each other, is there a candidate who is really talking about us?</p>                \n                \r\n\n            \n                <p>And that's when they are going to say Mike Huckabee has never stopped talking about the working class people who are getting gut punched, whose wages aren't going up. That people who work hard in places like where I am here in this factory in Sioux Center, Iowa, people who stand on their feet all day. And they say there's at least one guy who is not corporately- funded. He is not a big Wall Street cash guy.</p>                \n                \r\n\n            \n                <p>And I think that that's where the shot is and that's why I think there is going to be a surprise February 1st.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. If the two blow up -- those two candidates, you are well-positioned. You have been more critical of Cruz than Trump, correct?</p>                \n                \r\n\n            \n                <p><b>HUCKABEE</b>: I don't know that I have been critical. I have been asked a lot of questions. And I have pointed out that for someone if they are going to say they are consistent they need to be consistent. One of the things that I feel like I brought to this race is that nobody is catching caught me saying different in New York than I say in Sioux Center.</p>                \n                \r\n\n            \n                <p>If I tell somebody something in Marshall Town, Iowa they're going to hear the exact same things in Manhattan. And Bill, that's one of the things you know from the long time I have known you. I don't go and change even my message when I sit down and talk on your show or behind the scenes. I just don't.</p>                \n                \r\n\n            \n                <p>And that's one of the things I think people love about you. You do the same.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: You are a straight-talking guy. Look, you said about Cruz how can you be a rabid Christian if you don't give any money to charity? I mean that's a pretty tough statement.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE</b>: I didn't say that about Cruz. I was asked a question generally. And I said I don't think you can put God last in your budget if you claim that he is first in your life. I was talking about me. Look, the fact is Christian stewardship is something I believe. I believed in it when my wife and I were dirt poor and living in a $40-a-month rent house.</p>                \n                \r\n\n            \n                <p>I believed it when we had a lot more money. But we've always given never less than a tithe of our income to our church for the simple reason that that's how it is supposed to be.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. Did you not say that evangelicals want to know why Cruz gave less than 1 percent of his income to charity in 2006 and 2010? Did you point that out?</p>                \n                \r\n\n            \n                <p><b>HUCKABEE</b>: I don't know that I said that I don't think so. But, look, I believe that everything in our lives is open for inspection. I'm not criticizing some of the candidates.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Do you think that Cruz is --</p>                \n                \r\n\n            \n                <p><b>HUCKABEE: </b>They will have to answer for that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Do you think Cruz is a Christian to be emulated? I mean it seems like you are casting aspersions on him.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE</b>: I'm not going to judge his Christian faith because, look, God is going to judge mine. He is going to judge his.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. But is he being a phony in this area or is he being upfront?</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> I think it's something he needs to answer. What are his parameters of stewardship?</p>                \n                \r\n\n            \n                <p>Bill, look at it, you are one of the most generous people I know. I think of all the contributions you have given to Fisher House, to Wounded Warriors, you give very generously and vigorously. And why do you do that? Because you believe you have a responsibility back to other people. You don't have to. Government doesn't force you to do that.</p>                \n                \r\n\n            \n                <p>You do that because you like to do it. That's why I do it. I think that's why every Christian does it. And anybody, I don't care whether it's me or you or Ted Cruz or Donald Trump -- every one of us I think somebody could ask us what are your priorities. And I will be able to find it out as much by your budget as I will by whatever you say.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So you weren't just picking on Cruz, you were just throwing that out for all the candidates?</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> For all of us. I evaluate myself every day and ask myself what are the priorities in my life?</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Trump is, as you may have heard, I don't know whether you heard the Talking Points Memo but he is under attack by the far left. They are coming after him like crazy, want to shut him down because he is dominating the coverage.</p>                \n                \r\n\n            \n                <p>His domination of the coverage has hurt guys like you. There is no doubt. Because, you know, he is driving the media on television, in particular. Does that anger you, Governor?</p>                \n                \r\n\n            \n                <p><b>HUCKABEE:</b> Well, not at Donald Trump. I admire the guy for being such a master of manipulating the media and having them literally eating out of his hand the whole process. Good for him. I mean any of us who could do that heck we would be doing it. It's made it difficult sometimes to get the more substantive message out. I don't blame Donald Trump for that.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't think you would do it, he is a bomb thrower. He throws bombs. That's not your style. You're not going to do that.</p>                \n                \r\n\n            \n                <p><b>HUCKABEE</b>: No, that's not my style.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Right. But his style as you just pointed out is working. It's sucking the air out of the room and the other candidates are losing face time.</p>                \n                \r\n\n            \n                <p>Governor, we wish you the best. And we appreciate you coming on tonight.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Mike Huckabee on the state of his campaign", "description": "GOP presidential candidate sounds off on the presidential race and the upcoming Iowa caucus on 'The O'Reilly Factor'", "date": "2016-01-22T13:26:46Z"}