{"vcmId": "f93ef81c-3937-4bc9-ac11-a0170d034973", "url": "http://www.foxnews.com/transcript/2015/03/11/bill-oreilly-hillary-clinton-explains.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>In yet another controversy for the Clintons the former secretary of state has been hammered for using a private e-mail account rather than a secure government server while on the job at the State Department. The criticism has become so intense the Democratic Party is worried it could damage Hillary Clinton's presidential chances. The issue is really simple, Mrs. Clinton deleted some e-mail she says were private, but she will not allow the government to validate that by looking at her server.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> The server contains personal communications from my husband and me. And I believe I have met all of my responsibilities. And the server will remain private.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That allows critics of Hillary Clinton to charge cover-up even if she says there's nothing of national importance on the deleted e- mails.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> At the end I chose not to keep my private personal e-mails, e-mails about planning Chelsea's wedding or my mother's funeral arrangements, condolence notes to friends as well as yoga routines, family vacations, the other things you'd typically find in inboxes.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Talking Points\" believes all Americans are entitled to the presumption of innocence including Hillary Clinton. But, but, there is a way for Mrs. Clinton to keep her private correspondence out of the public eye while reassuring the public she did not delete anything that affected our country.</p>                \n                \r\n\n            \n                <p>Hillary Clinton should immediately request that the FBI examine her server with the assurance that all the privately deleted e-mails would remain private. But if Mrs. Clinton made a mistake in her assessment of private versus public e-mails, then the FBI would pass the deleted public ones to the State Department which would release them. Fair? I believe so.</p>                \n                \r\n\n            \n                <p>If the feds do not look at her server, then any public official could do the same thing -- claim private correspondence without scrutiny. At this point it would be grossly unfair to accuse Hillary Clinton of anything other than bad judgment. But it should not, not be up to her or any public official to delete e-mails while on the job.</p>                \n                \r\n\n            \n                <p>Richard Nixon tried a similar tactic with tapes back in the Watergate days. But understand me I'm not comparing Hillary Clinton to Nixon. I'm just saying that we cannot simply accept her word on this one when verification is as easy as analyzing her server in her house. Hillary Clinton, again, should request the FBI come in to do that tonight.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Hillary Clinton explains", "description": "Talking Points 3/10", "date": "2015-03-11T12:09:10Z"}