{"vcmId": "fac23049-0e1b-4adc-936b-886a361c2ee1", "url": "http://www.foxnews.com/transcript/2015/06/16/bill-oreilly-hillary-clinton-for-president.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>On a Saturday, Secretary Clinton announced she would like to you vote for her for president. Gave a 40 minute speech, probably 20 minutes too long in front of a few thousand supporters here in New York City.</p>                \n                \r\n\n            \n                <p>Now a few things about Mrs. Clinton. She is a smart woman and a political creature. Republicans would be foolish to underestimate her. The strategy she is currently employing is to convince Americans the economic system is rigged against the working man and woman. She's hoping to put together a coalition of people who want government to distribute money. That's exactly the same thing President Obama wants.</p>                \n                \r\n\n            \n                <p>Also Hillary Clinton well understands that most Americans now loathe the media and by dodging us, she does not harm herself.</p>                \n                \r\n\n            \n                <p>Talking Points expects Hillary Clinton will continue the economic justice and the \"I don't need the press\" strategy even though she took a few questions today in New Hampshire.</p>                \n                \r\n\n            \n                <p>But if you are a fair minded voter, someone who is looking for the best possible president, you must embrace the obvious. That is President Obama's economic policies have largely failed. Yet, Secretary Clinton is endorsing them. Salaries for working men and women are lower now than when Mr. Obama took office. The fundamental reason is that business is not expanding, therefore, good paying jobs are not being created. In fact, in the first quarter of this your, the economy actually contracted. Nevertheless, Hillary Clinton is running on the promise that she can manage the private sector.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>CLINTON:</b> You see corporations making record profits with CEOs making record pay but your paychecks have barely budged. While many of you are working multiple jobs to make ends meet, you see the top 25 hedge fund managers making more than all of America's kindergarten teachers combined.</p>                \n                \r\n\n            \n                <p>Democracy can't be just for billionaires and corporations -- prosperity and democracy are part of your basic bargain, too.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>As talking points has stated before, the federal government cannot -- cannot regulate the private sector. It would be unconstitutional for any president to try to tell private corporations what they can pay their executives or what kind of salary structure they must have for employees.</p>                \n                \r\n\n            \n                <p>What the feds can do is mandate a minimum wage and congress can pass certain work rules like 40-hour workweeks at standard pay. But As Hillary Clinton well knows no president can regulate capital unfortunate. That's why communists and fascist governments have done away with it.</p>                \n                \r\n\n            \n                <p>As the \"Wall Street Journal\" points out today, Mrs. Clinton's promise of regulating the private sector goes against her husband's policies. In 1997, President Bill Clinton cut taxes on capital gains in order to stimulate the economy. And it worked. As did the Reagan tax cuts in the 1980s.</p>                \n                \r\n\n            \n                <p>The \"Journal\" calls Hillary Clinton's speech, quote, \"false narrative\". But it's more than that. Mrs. Clinton is perpetuating a ruse that the federal government can dictate who earns what in America. It can't.</p>                \n                \r\n\n            \n                <p>And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Hillary Clinton for president", "description": "Bill O'Reilly's Talking Points 6/15", "date": "2015-06-16T12:20:07Z"}