{"vcmId": "facd1910-0fc9-4116-be7b-25b4b52cd63f", "url": "http://www.foxnews.com/transcript/2015/04/20/jeb-bush-problem-and-isis-presence-in-iraq.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" April 16, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Thanks for staying with us, I'm Bill O'Reilly. What are Dana Perino's two most important stories of the week?</p>                \n                \r\n\n            \n                <p>Well, let's bring her in. Co-host of \"THE FIVE\" Ms. Perino.</p>                \n                \r\n\n            \n                <p><b>DANA PERINO, FOX NEWS CO-HOST, \"THE FIVE\":</b> Hi!</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, yesterday, your former boss, George W. Bush, gave a speech in Chicago in front of 7,000 people. Nobody was allowed to take notes. You couldn't record it. I think you couldn't even look at him.</p>                \n                \r\n\n            \n                <p><b>(LAUGHTER)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. But, in that speech, Ms. Dana says there is very important story. What is it and how do you know about the speech if anybody could take reports.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> Well, because there was a report in Politico newspaper because somebody spilled the beans because refreshing honesty broke out on the 2016 campaign trail.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Wow!</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> Like in complete contrast to the fakery of the Hillary Clinton campaign in the past week. George W. Bush is talking about his brother, Jeb Bush who is considering a run for president and he says Jeb definitely has a problem and the problem is me. And he said that he -- Jeb knows this. This Jeb knows that his name ID can, one, it can help him but also it ties him to his brother and his father. And he said that he will not be out on the campaign trail making Jeb defend him all the time. That he is going to be there to support him and advise him but he doesn't intend to be an anchor on the campaign and that Jeb knows that he is going to have to earn people's trust.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. Do you believe that your former boss, feels that his presidency was not successful?</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> No, I don't think that he believes that but I think that he is aware of the perception by some that it was not. Some on the left, certainly.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Everybody on the left.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Certainly there are some on the right and those -- that's one of the hurdles that Jeb will have in the primary.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. So, he is a realistic guy and he knows he was controversial president because of the Iraq war primarily and the recession. Those are the two things that really hurt his presidency. So, he is now not going to participate in Jeb Bush's quest for the presidency?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Well, I think what he said is that his role is not to be an advisor. His role is to be a family member. He is somebody who says I love you and I support you and I will be there to help.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But behind the scenes you have got to figure that this guy --</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> We already know that he has done some fundraising --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Right.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> -- and I think that Jeb bush goes into this eyes wide open knowing that he is different from George W. Bush. But he is going to have to explain to people how.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Well, there are a lot of differences between them. I mean, I know them both. And they are not very similar at all in my opinion, other than they have a legacy of public service from their father.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Well, if Jeb Bush was named Jeff Smith, and he was being defined as the conservative in this race on his record, he wouldn't have any problem at all.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He is not really that conservative.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> I think he is.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He did a very good job in Florida I thought.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> Definitely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Running in that state two terms. Okay. The other story that Ms. Dana has selected as being the most important story of the week is the ISIS offensive in Iraq. You know, people are numb to this now. You know, they don't care about what happens inside Iraq. Only when Americans are beheaded or other people are brutalized.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> That's right.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So why is this important?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Well, I think it is important for two reasons. One, the administration has been trying to suggest that ISIS has been pushed back. And now that is true in some ways, right? So if ISIS maybe has lost 25 percent of its territory but it is making -- it has an offensive right now in a key part of Sunni area, the administration reluctantly and timidly has gone into an air campaign when we are using our air power it is working very well. The ISIS problem is a big one but it is superseded by two others. And that is that we do not have a comprehensive plan to deal with Syria. And we are not able to deal with Iran effectively either. So all three of those things working together against United States interest in that region.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay. But the ISIS offensive per se is, I think, just to show the world that they are not defeated. They are not going to be able to hold the territory against the Iranian militias. Or the United States air campaign. It's not going to be able to hold it. But, you know, again, I don't think Americans really care what happens inside Iraq and Syria. They don't. It's only about are they going to come and hurt us, isn't it?</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>Well, I think that that is right, especially because you don't have Americans who are being beheaded, okay.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Not now. But if they grab one.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> I will tell you, I talked to a pollster who has been doing this for decades, and he said that the number of people who are worried that they, themselves, or that one of their family members will be a victim of a terrorist attack some time in their life is higher than even after 9/11.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Yes.</p>                \n                \r\n\n            \n                <p><b>PERINO:</b> So I do think that it matters -- people have a general anxiety about it. It's the administration's job to deal with it at its root cause.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. And they are not.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>That's the problem.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They are not right now.</p>                \n                \r\n\n            \n                <p><b>PERINO: </b>There is no evidence that they are doing it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Dana Perino, everybody.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Jeb Bush's problem and ISIS' presence in Iraq", "description": "Dana Perino weighs in on the top stories of the week", "date": "2015-04-20T12:17:01Z"}