{"vcmId": "fb0eab6c-3a40-47ed-9d9b-e66020727ffe", "url": "http://www.foxnews.com/transcript/2016/03/24/who-is-responsible-for-isis.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 23, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story\" segment tonight. Who is responsible for ISIS? An upcoming documentary on HBO entitled, only the dead see the war will debut on March 28th.</p>                \n                \r\n\n            \n                <p>With us now is war correspondent Michael Ware wrote and co-directed the film. So, you heard Rudy Giuliani. And I kind of believe this as well. The rise of ISIS, you know, as a serious terror organization began when the U.S. pulled all their troops out and the Maliki government, Shia government started basically persecuting the Sunnis again which had kept the ISIS and al-Qaedas under control in the parts of Iraq that they controlled. Is that wrong?</p>                \n                \r\n\n            \n                <p><b>MICHAEL WARE, WAR CORRESPONDENT:</b> A little bit. A little bit, Bill. That's a truncated history. ISIS actually began in the months straight after the invasion. The first ever attack, the Islamic State carried out was in August 2003 on the Jordanian Embassy. ISIS, in its history, has had or four different names. It's had four different leaders. But it was all started by one man, the Jordanian militant Abu Musab al Zarqawi who the U.S. killed in June 2006.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: He was associated when he was alive and as you said, he was killed with al-Qaeda of Mesopotamia.</p>                \n                \r\n\n            \n                <p><b>WARE:</b> Well, he had such a view of holy war. More barbaric, more monstrous even than Osama bin Laden. So much so that Bin Laden opposed many of his ideas. And he did not join al Qaeda, except for one brief period after 2004 where he agreed to be badged as al Qaeda in Mesopotamia.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So he was the guy --</p>                \n                \r\n\n            \n                <p><b>WARE</b>: He terrified Bin Laden.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So he was the guy that basically started the ISIS movement. But it didn't take on momentum until they had the free fire zone in Iraq because there was no American regulation. He had a corrupt President Maliki. And then the chieftains of the Sunnis said, I'll do what you want.</p>                \n                \r\n\n            \n                <p><b>WARE:</b> You are right about that. We had one moment in history where we were disseminating what we now call the Islamic State. That's when we finally cut the deal with the insurgents.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. This is the surge.</p>                \n                \r\n\n            \n                <p><b>WARE</b>: The tribal of --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> -- the surge.</p>                \n                \r\n\n            \n                <p><b>WARE</b>: And the Bush administration put 107,000 insurgents on the U.S. government payroll. The insurgency stopped almost overnight and they started assassinating the Islamic State.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Right. So it is fair to say that the Obama administration because he wanted to distance itself from the Bush administration did the wrong thing and ISIS prospered. Now, as far as you are concerned, you were actually dealing with this ISIS killer, right?</p>                \n                \r\n\n            \n                <p><b>WARE</b>: I witnessed the --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. I want to run a clip from the documentary, go.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE</b>: We began taking me to secret meetings in the dead of night. That's my breathing as I am doing the filming. It was frightening. I surrendered myself to these guerrillas many of the Americans were hunting and I had found. Not knowing if they were friends or if they were going to kill me.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: So why did you do that? Because you knew that these guys were capable of beheading you, using you for propaganda purposes.</p>                \n                \r\n\n            \n                <p><b>WARE</b>: Well, those guys that we see in that clip are actually insurgents who years later became our allies as we just discussed. But they were the ones who first told me that Zarqawi and the Islamic State were out there. Because the problem was, in the beginning of the Iraq war, after the invasion, we didn't know who was shooting at us or why they were shooting.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> We didn't know. That's for sure.</p>                \n                \r\n\n            \n                <p><b>WARE</b>: So, it was through those sorts of men that you see there, ex-Iraqi military who we eventually made the peace deal with. It is those men there who went out eventually and started killing the Islamic State.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> So, do you yourself feel in jeopardy when you went into all of these precincts.</p>                \n                \r\n\n            \n                <p><b>WARE</b>: Oh, goodness, of course I did.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: OK. But it wasn't as bad then as it is now with these guys now. All right. Let me give you this question, Michael. If you got a call tonight, and after this is on and they will see it, all right. And say, look, you come over here, we want to talk to you, you come over to Syria to Raqqa. Would you go?</p>                \n                \r\n\n            \n                <p><b>WARE</b>: Today, no.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Okay. That's what I'm talking about.</p>                \n                \r\n\n            \n                <p><b>WARE:</b> Today, no. Once upon a time. That's precisely what I did. Let's not forget Raqqa is not the first capital of the Islamic State. The first capital of the Islamic State when it was called the Islamic State was the Iraqi city of Ramadi. And the only way I was able to access that city was by going in with American marines and soldiers who were desperately fighting for their lives.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Last question. I need a quick answer. When you heard President Obama say that ISIS was a jayvee, your reaction?</p>                \n                \r\n\n            \n                <p><b>WARE</b>: That's definitely wrong.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Okay.</p>                \n                \r\n\n            \n                <p><b>WARE:</b> These guys are the top of the line. They are the worst nightmare that we have.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Worst killers on earth. March 28th, HBO, Michael. We appreciate you coming in.</p>                \n                \r\n\n            \n                <p><b>WARE:</b> Thank you, Bill.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Who is responsible for ISIS?", "description": "War correspondent Michael Ware joins 'The O'Reilly Factor' to analyze the origins of the terror group", "date": "2016-03-24T12:31:36Z"}