{"vcmId": "fb14cb03-db5e-4e89-822b-3b22df9de5d2", "url": "http://www.foxnews.com/transcript/2015/02/09/bill-oreilly-is-president-obama-destroying-his-own-legacy.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>It is simply inexplicable that Barack Obama would compare historical injustices by Christians a thousand years ago to the current atrocities being committed by Muslims Jihads today. But that's exactly what the President did yesterday at a prayer breakfast in Washington.</p>                \n                \r\n\n            \n                <p>The reaction predictable, President getting hammered in nearly everywhere, except on a network news programs which shows not to cover the story.</p>                \n                \r\n\n            \n                <p>Well, today, the President's National Security Advisor, Susan Rice, gave a major speech at the Brookings Institution in Washington about the strategy to protect America and the world.</p>                \n                \r\n\n            \n                <p>According to Ms. Rice, the President believes that most threats can be diffused by enlisting partners around the world to join together against the evildoers.</p>                \n                \r\n\n            \n                <p>But Ms. Rice completely avoided any definition of how to stop ISIS, for example, from committing daily atrocities. Instead, she said this.</p>                \n                \r\n\n            \n                <p><b>SUSAN RICE, NATIONAL SECURITY ADVISOR: </b>Well, the dangers we face may be more numerous and varied. They are not of the existential nature we confronted during World War II or during the Cold War.</p>                \n                \r\n\n            \n                <p>We will always act to defend our country and its people, but we aim to avoid sending many thousands of ground forces and to combat in hostile lands.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, that was the most specific thing Ambassador Rice said, that American ground troops would not be confronting the terrorists because the threat they post is \"not existential\", meaning, not an Armageddon type situation.</p>                \n                \r\n\n            \n                <p>To me, Ambassador Rice is diminishing the terror issue. Certainly, ISIS was an existential threat to the Jordanian set on fire, the Americans beheaded and now we hear that Kayla Mueller, an American, was killed. The ISIS savages say by bombing, but, you know, they probably killed her, right?</p>                \n                \r\n\n            \n                <p>Hitler was not an existential threat until 1938. And to flail around while killer groups gain power, as ISIS has, is unwise to say the least. But the Obama administration apparently believes the bombing campaign and other secondary measures will eventually downgrade the ISIS savages.</p>                \n                \r\n\n            \n                <p>Meantime, thousands of people are dying and thousands of people are plotting to come here to kill Americans.</p>                \n                \r\n\n            \n                <p>The rest of the speech was your standard issue, we're doing great, what's the problem?</p>                \n                \r\n\n            \n                <p>It's kind of bizarre though to hear Ambassador Rice referred to climate change as a strategic talking point, but hey, standard issue on the left, right?</p>                \n                \r\n\n            \n                <p>There was mention of universal values and international order, that kind of stuff, which means absolutely nothing.</p>                \n                \r\n\n            \n                <p>Summing up, President Obama believes that ISIS can be degraded without ground confrontation that his policies in Iraq and Afghanistan have made the USA stronger and that Iran will give up the nukes in the face of world pressure.</p>                \n                \r\n\n            \n                <p>That is what Barack Obama believes.</p>                \n                \r\n\n            \n                <p>And that is &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: Is President Obama destroying his own legacy?", "description": "Talking Points 2/6", "date": "2015-02-09T13:29:29Z"}