{"vcmId": "fb6bd16e-5778-49f6-9ad1-436a0f0e60bf", "url": "http://www.foxnews.com/transcript/2015/04/01/hillary-clinton-slipping-in-swing-states.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" March 31, 2015. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> \"Personal Story Segment\" tonight, has Hillary Clinton been damaged by the e-mail situation? Brand new Quinnipiac poll in two key states shows Mrs. Clinton slipping; Florida Jeb Bush beating her 45-42. Pennsylvania, Senator Rand Paul ahead of Hillary Clinton 45-44. That's a blue state. Third poll in Ohio better for Secretary Clinton she beats Rand Paul 46-411. About half the voters polled say they do not see Hillary Clinton as honest or trustworthy.</p>                \n                \r\n\n            \n                <p>With us now here in New York City, Monica Crowley; in Washington, Kirsten powers. So, overall, CBS poll says that Hillary Clinton's numbers are down 12 points since she left secretary of state. So, why do you think that is?</p>                \n                \r\n\n            \n                <p><b>KIRSTEN POWERS, FOX NEWS ANALYST: </b>You are asking me, Bill?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes. Yes, Miss Powers.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Well, I think she has had a variety of scandals with the e- mail scandal and then I think the Benghazi scandal did a little harm, though I think it's probably more the e-mails probably are contributing to that.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Now, is she calculating that, ok, we're just going to admit -- I don't know what the word is, scrub them? Deleted everything? Put the computer under water? Whatever she did? We're just going to admit it and hope the American voter doesn't care. I think that's the calculation, right?</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> I think the calculation is to get everything out now. And Probably, I think that there was some calculation that was made that whatever is in the e-mails is probably more damaging.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes, probably worse than illegally erasing them. You know what, Powers, I agree with you for once.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> Oh my gosh.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> They all sat around the table and said you know what? You have got all this stuff about Benghazi and we said this. Let's just erase it all and then we'll tell everybody we erased it all because it was personal about yoga. And then the American people are so distracted that they won't even remember it when the election comes around. That's what happened.</p>                \n                \r\n\n            \n                <p><b>MONICA CROWLEY, FOX NEWS ANALYST: </b>Well, but the key elements of that is relying on a corrupt mainstream left wing press that will not continue to tell the story the way they would do with a Republican.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Hello. Ok. But that's been in play for 20 years.</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>That's why I'm saying she is making this calculation.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And she is smart to make it.</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>The problem that she has here is this is not the 1990s. This is not the first go around with Clinton scandals, right?</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Yes.</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>The most damaging and problematic scandals are the ones that reinforce a negative pre-existing notion about the person to begin with. That's why I think --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Ok. But look the people who don't like her don't like her.</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>But the reason you are seeing these poll numbers come down where normally she would be able to survive this is because it reinforces this notion that Hillary Clinton is somehow corrupt with something to hide.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. But let's face it, all right. There is nobody going to challenge her on her party. She has no pressure from within.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> You don't know that. Remember, every situation --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I don't know that? Who is it going to somebody?</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>We don't know that. Stranger things have happened. Look what happened to her in 2008. Barack Obama came out of nowhere.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, that wasn't strange.</p>                \n                \r\n\n            \n                <p>Yes. But he is coming out of nowhere with a color advantage, a youth advantage.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> All of that is true.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> A machine advantage. Come on, Martin O'Malley?</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>Her huge disadvantage this time is that with every situation and every candidate there is a tipping point. And the --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Hasn't been reached here.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> -- Clinton fatigue which has already existed with this scandal.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Her poll numbers would be worse.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> I can't do this again. I can't do it.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> No, she slipped. There is no doubt she slipped. But her poll numbers would be worse if the tipping point had been reached. Ok, we all agree --</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>We might not be there yet.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> But do you agree with Powers and myself that the calculation was made that was what on her personal e-mail was worse than --</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>Absolutely.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Ok. So we all agree that this was no accident, that there was no wedding cake or yoga appointment that she wanted to be embarrassed by.</p>                \n                \r\n\n            \n                <p>Now Powers, you are a Democrat rights, registered Democrat?</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>Yes, I am.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Doesn't this shake your faith in the Democratic establishment?</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>I mean look, Hillary Clinton I think.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>No, no. But I mean the old establishment hasn't abandoned her. They are not saying we don't like it so we are going to look at Biden.</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>It doesn't make something wrong with the Democratic establishment that they are not going to abandon her when there is nobody else to choose.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>What about Biden? He is the vice president?</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>I don't think -- But he is not somebody that people feel should be president.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> He didn't erase any e-mail Powers.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> But he doesn't have a following. He didn't have a following when he ran for president before he was vice president. He still doesn't have a following.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>So it's all about winning then. It's not about quality, it's about winning.</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>I think for a lot of people -- I think that for a lot of people it's all about winning but it's also a lot of people do really love Hillary. I think that people don't realize that that she has a real base of support of people who really love her and also people who like her and are willing to overlook some things.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Overlook some things. Last word?</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>I actually -- I disagree with that I think the real reason she is in trouble is that not a lot of people actually like her. They like Bill. They were willing to give Bill the benefit of the doubt because he has this great reservoir of goodwill --</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>That's not true.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> -- because he was charismatic --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> I have to disagree.</p>                \n                \r\n\n            \n                <p><b>POWERS: </b>What about all these people who love her.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> I disagree.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. I have got to go.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>POWERS: </b>She has a big constituency in the Democratic Party.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I have to go. But I do believe a significant number of liberal women like her. Yes.</p>                \n                \r\n\n            \n                <p><b>CROWLEY:</b> Like her? No.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>I think they do. Liberal women.</p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>Liberal women are different.</p>                \n                \r\n\n            \n                <p><b>POWERS:</b> And men -- Democratic men and women.</p>                \n                \r\n\n            \n                <p><b>(CROSSTALK)</b></p>                \n                \r\n\n            \n                <p><b>CROWLEY: </b>-- small constituency and not enough to get her elected.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Hillary Clinton slipping in swing states", "description": "Has the email scandal hurt the former Secretary of State's chances at the White House?", "date": "2015-04-01T12:10:34Z"}