{"vcmId": "fe71b16b-debf-4707-80b0-dd71928e2ea7", "url": "http://www.foxnews.com/transcript/2016/09/19/college-hires-al-qaeda-defector.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p><i>This is a RUSH transcript from \"The O'Reilly Factor,\" September 16, 2016. This copy may not be in its final form and may be updated.<br> Watch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET!</i></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: \"Personal Story\" segment tonight, former al Qaeda recruiter and propagandist now back in the American fold. His name is Jesse Morton, while he worked for al Qaeda, they called him Younes Abdullah Mohammed, born in Pennsylvania. 2010, he fled to Morocco where he was arrested and held in a prison there. He's taken back to the U.S.A. in 2011 pleading guilty to various terror charges. Now, in a stunning turn of events, Mr. Morton is working at the George Washington University Center for Cyber and Homeland Security.</p>                \n                \r\n\n            \n                <p>He joins us now from Washington. First of all, why did you join al Qaeda?</p>                \n                \r\n\n            \n                <p><b>JESSE MORTON, FORMER AL-QAEDA RECRUITER:</b> Well, the process of my radicalization and my entrance into adherence to affinity to al Qaeda's ideology started at very young age. I had a very traumatic upbringing and I think that what that did was it made me open up to alternative ideologies. Thereafter, I identified with Islam after reading the autobiography of Malcolm X and could relate with a lot of his story. So, I was open to radical interpretations from the very beginning. Criminal behavior was also an under pinning element of my youth.</p>                \n                \r\n\n            \n                <p>And during that time, I went to jail and was radicalized by a preacher in jail shortly before 9/11. So by the time 9/11 happened, I had sort of a natural inclination to adopt the world view of the jihadists that gave me an opportunity to express my rage and frustration through a counter cultural movement albeit a violent one. That process continued to unfold and I continued to get deeper and deeper in to the ideology of al Qaeda. And eventually graduated from role to role first as student, then as an adherent and then as propagandist.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>All right. Let me stop you there. Let me stop you there. So, you are in the U.S.A. You didn't go to Pakistan or any of those places. You're here in the United States. And you are working with al Qaeda here, is that correct?</p>                \n                \r\n\n            \n                <p><b>MORTON</b>: Well that is correct. At the time al Qaeda was changing its strategy. They were becoming less a top down hierarchal organization and more decentralized with regard to inspiring others to take up the cause. And they were stressing that individuals everywhere needed to concentrate on propagating the ideology that that was one of the ways that they were going to sustain their movement. And --</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>And where were you doing this physically in the U.S.A.? Where were you?</p>                \n                \r\n\n            \n                <p><b>MORTON:</b> I was in New York City. I started working on behalf of the Salafi Jihadists ideology and propagating in about 2004. I was first with a movement in New York called the Islamic thinker society and then I started my own entity. Revolution Muslim in late 2007. I ran that up until the point of my incarceration in May of 2011.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Were you worried about the FBI and, you know, people coming after you? Was that a -- something that you were worried about here?</p>                \n                \r\n\n            \n                <p><b>MORTON</b>: Well, it was quite obvious that we were certainly under investigation. But we carefully attempted to toe the line between free and illegal speech. And so, we believed that we were in the legal realm of the law. And so, of course we knew we were being monitored but I think that when you are so drunk on an ideology and committed to a cause, the risk associated with activism becomes something that you actually enjoy, believe it or not.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: The cat and mouse came -- then they got you. All right. You went to Morocco, they pick you up there. They bring you back. What did you serve? How much time?</p>                \n                \r\n\n            \n                <p><b>MORTON: </b>Well, originally I was sentenced to 11 and a half years. I was picked up in May of 2011 shortly after Osama bin Laden was killed. But I was afforded the opportunity to cooperate with law enforcement. I had many different variables that contributed to deradicalization and ultimately the judge on the case with the recommendation of the prosecutor released me after three years and nine months.</p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>But he is cooperating with the federal government against the other radical -- Muslim radicals, right?</p>                \n                \r\n\n            \n                <p><b>MORTON:</b> Well, after I determined that, the ideology I had was completely false, there were still factions of the networks that were continuing to reach out to me. On top of that, I had analytical analysis that was able to make a contribution in how we assess risk.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: All right. So, you helped against the Jihad?</p>                \n                \r\n\n            \n                <p><b>MORTON</b>: In many different capacities, yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> All right. So, they cut you some slack. And now what are you doing at George Washington University?</p>                \n                \r\n\n            \n                <p><b>MORTON:</b> Well, upon my release, a lot of statements were coming from politicians like the President from the House and Homeland Security Committee. From different factions of the policy community and counterterrorism community generally about the value of former extremists. And so I decided to attempt to find an avenue by which I could operate as a former in the U.S. -- a program on extremism is doing some of the best work in the field of countering violent extremism and educating the public and policymakers about that. And I found it in ideal home. After a long process, I was hired. And I have been given an enormous opportunity --</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Now you are with the good guys.</p>                \n                \r\n\n            \n                <p><b>MORTON:</b> Absolutely. I mean, my world view has totally changed. Now I think rationally.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Well, this story is Mr. Morton on two levels. Number one, redemption.</p>                \n                \r\n\n            \n                <p><b>MORTON</b>: Yes.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Which we believe in here very much. And number two, now you are a patriot. I hope. I hope you are helping to protect Americans because we need all the protection we can get. Last word?</p>                \n                \r\n\n            \n                <p><b>MORTON: </b>I think at the end of the day you're right. I mean, I was able to realize the value of the American system. I realized now today that it's not just about who they are. It's about who we are.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: That's right.</p>                \n                \r\n\n            \n                <p><b>MORTON:</b> And we have a system of life that is in many ways provable and one can look at it from a factual status and see that the American system, democracy, liberalism, and freedom is a way that liberates everybody.</p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Thank you, Mr. Morton, fascinating story. Good luck to you. Thank you very much.</p>                \n                \r\n\n            \n                <p><i>Content and Programming Copyright 2016 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2016 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.</i></p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "College hires Al Qaeda defector", "description": "Jesse Morton on his experience and new position at George Washington University on 'The O'Reilly Factor'", "date": "2016-09-19T12:50:27Z"}