{"vcmId": "feef8f07-4939-4a78-a4f7-a0df5fbc997e", "url": "http://www.foxnews.com/transcript/2016/01/05/bill-oreilly-biggest-political-story-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>Both political parties are helping Donald Trump dominate the polls. The combined Democrat and Republican establishments just may propel a tough-talking political novice into the White House -- obviously a huge situation.</p>                \n                \r\n\n            \n                <p>On the GOP side, our pal George Will epitomizes what's going on. In a column just before Christmas, Will uses harsh, personal attacks against Trump and then concludes \"If he wins the nomination the Republican Party will be destroyed.\"</p>                \n                \r\n\n            \n                <p>Will fashions himself a Republican intellectual dishing out conservative theory using as many big words as possible. But when it comes to solving problems that drive right-leaning Americans nuts, Will offers little.</p>                \n                \r\n\n            \n                <p>The Factor has analyzed his columns for the past three years and found no proposed solutions to the immigration mess or to the ISIS terror threat. In that, George Will is not alone.</p>                \n                \r\n\n            \n                <p>The Republican establishment in Washington has not dealt effectively with these and other vexing problems causing great anger amongst some GOP voters. Thus, Trump's hard line rhetoric on illegal immigration and the jihad has taken root.</p>                \n                \r\n\n            \n                <p>On the Democratic side, things are even worse. Since President Obama took office in 2009, the party has moved sharply left. In fact, it is almost impossible to be a moderate Democrat anymore with your party supporting anarchy by promoting sanctuary cities and failing to confront ISIS in ways that would crush the savages.</p>                \n                \r\n\n            \n                <p>While Mr. Obama and the Democratic establishment seek to contain the jihadist mass murderers, intelligent people understand evil can never be contained. It must be destroyed. While Democrats embrace a phony war on women in the U.S.A. thousands of innocent women abroad are being raped and tortured by ISIS fanatics for which there is no unacceptable atrocity.</p>                \n                \r\n\n            \n                <p>Therefore, a guy like Trump gains support from voters fed up with the obvious failings of both political parties. It really doesn't matter if his rhetoric is farfetched. Some folks simply wanted confrontational talk -- details are secondary.</p>                \n                \r\n\n            \n                <p>Watchful Americans know the economy is shaky, the jihad is on the march and illegal immigration continues without restraint. The country is in big trouble. The establishment has failed and here comes Donald Trump.</p>                \n                \r\n\n            \n                <p>That's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly: The biggest political story in America", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 1/4", "date": "2016-01-05T13:08:42Z"}