{"vcmId": "fef5e3a8-25b0-41f9-8a43-32b41b72bac3", "url": "http://www.foxnews.com/transcript/2016/04/25/bill-oreilly-death-prince-may-shed-some-light-on-drug-epidemic-in-america.html", "html": "<div class=\"article-text\">\n    \n        \n        \n        \n            \n                <p>The nation mourning the 57- year-old pop star who sold 100 million albums in his career. I never met Prince, but I saw him perform, and he was spectacular. Many reports say he was a nice guy and certainly he deserves the accolades he is getting.</p>                \n                \r\n\n            \n                <p>Out of respect for Prince's family, we will delve into his personal situation but there are reports that he was drug-involved. And that leads us to an epidemic in America that is largely out-of-control, yet, the powerful are running away from it. The essential problem is a combination of prescription pain killers, things like Percocet, which Prince may have been using after an operation and OxyContin. Those legal drugs have addicted millions and now we have a flood of cheap heroin and other opioids sweeping through the nation. The stats are grim.</p>                \n                \r\n\n            \n                <p>In 2014 more than 28,000 Americans died from opioid overdoses, a record level. That led to a 200 percent increase in overdose fatalities since the year 2,000. According to the federal government, from 2013 to 2014, heroin use among Americans rose 51 percent. That is catastrophic in one year. So there is no question the epidemic is underway. And few people understand how severe it is or what to do about it.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>UNIDENTIFIED MALE: </b>I'm boarding a plane in Dallas airport. And my son Ben calls me. And he says dad, Aaron overdosed again. And I said what do you mean? He said Aaron overdosed again. And I automatically was thinking okay, what hospital is he at. Where did they take him? And he says, he didn't make it.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY: </b>Over the years, there have been literally millions of stories like that one. And it's simply stunning that our culture has evolved to a point where the sale and use of hard narcotics is now acceptable. President Obama is leading the way on this, classifying drug dealing, hard drug dealing as a, quote, \"nonviolent crime.\" That's sends a signal to the country that, you know what? It may be illegal to sell drugs but it's not all that bad. And the left is generally supporting the madness.</p>                \n                \r\n\n            \n                <p><b>(BEGIN VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY</b>: Is selling heroin and crack on the street a violent crime?</p>                \n                \r\n\n            \n                <p><b>RUSSELL SIMMONS, MUSIC MOGUL:</b> What I was saying.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> That's an easy question. You can answer that question?</p>                \n                \r\n\n            \n                <p><b>SIMMONS:</b> Sell drugs at the same rate. But 95 percent of the people who are --</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Am I invisible? Are you not hearing me? Are you not hearing me?</p>                \n                \r\n\n            \n                <p><b>SIMMONS:</b> Black versus White. I don't think selling drugs is a violent crime.</p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> Okay. You do not think so.</p>                \n                \r\n\n            \n                <p><b>(END VIDEO CLIP)</b></p>                \n                \r\n\n            \n                <p><b>O'REILLY:</b> And that is the prevailing wisdom on the Left. And on the use side, there is no judgment either. The legalization of pot now favored by the majority of Americans. Although marijuana is not even close to heroin and other hard drugs in a destructive capacity, again, pot acceptance sends a signal. When I grew up in Levittown, a suburb of New York City, heroine and other hard drugs were rare until the Vietnam War came in. Then some vets in my neighborhood returned from Southeast Asia addicted to heroin called horse back then.</p>                \n                \r\n\n            \n                <p>However, anyone who sold hard drugs in the neighborhood was a pariah, an outcast, a vial human being. That person might even be beaten up. And those who use narcotics were also stigmatized at least for a while until the sex, drugs and rock and roll culture kicked in, the if it if it feels good do it philosophy taking route. The damage that acceptance of narcotics brought was enormous. A few of my friends are dead. Others spent time in prison. Today the drug culture running wild in America. And the vicious cartels largely operating out of Mexico are taken full advantage of that.</p>                \n                \r\n\n            \n                <p>Tons of hard drugs come across the Mexican border. Everybody knows that yet, the Democratic Party doesn't want a wall or to militarize the border. And if you are arrested for selling heroin in the U.S.A. or other opioids on the street, chances are, you will not get serious prison time until you are caught five or six times. So you can see the permissive atmosphere surrounding the use of hard drugs is now taking a very serious toll on the country. Pretty much every American knows some family that's been grossly harmed by drug use. It is long past time for powerful people to stop enabling the drug business. The use of pot by children is an atrocity. The addictive capacities of heroin and other pain killers is enormous.</p>                \n                \r\n\n            \n                <p>Once a person becomes drug involved, his or her whole life changes. Negatively. Yet, where are the antidrug crusaders? Where are they? They are mocked by many in the media. They are dismissed on college campuses. They are seen as uncool by many in the culture. Nancy Reagan's message was simple. Just say no. That message today. It doesn't matter if you say yes you are a victim. And the thugs who provide the poison are low level offenders who should not be harshly punished. That's a disgrace. It's shameful. The drug culture is not a positive in any way for this country or for any citizen in it.</p>                \n                \r\n\n            \n                <p>We are reaping what our cowardly leaders have sown, a drug epidemic that cuts across all boundaries. That is the message that should be loud and clear in the media. People selling hard drugs are not nonviolent offenders. They are killing the weak and addicted at a historically high rate. Countries like Singapore have stopped the madness by instituting tough antidrug policies at all levels. But the west will not do that and so the carnage will continue. And that's &#8220;The Memo&#8221;.</p>                \n                \r\n\n            \n\n            \n                \n                    <p><i></i></p>\n                \n                \n\n\n \n\n\t<i></i>\n\n            \n        \n    \n</div>\n\n                          \n                        \n\n\n\n\n\n\n\n\t\t\t\t        \r\n\n\t\t\t\t    ", "title": "Bill O'Reilly:  The death of Prince may shed some light on the drug epidemic in America", "description": "'The O'Reilly Factor': Bill O'Reilly's Talking Points 4/22", "date": "2016-04-25T12:21:04Z"}